[["Blaenau Gwent","Thu, 09 Apr 2015 20:51:53 +0000","Blaenau Gwent – Blaenau Gwent library service ‘one of weakest in Wales,’ claims new report – Wales Online. &#34;The report to councillors highlights the impact spending cuts have had on the library service in the county borough which is battling to reach standards set by the Welsh Government. Senior managers with the council are set to meet with the Welsh Government to discuss the situation and an improvement strategy for the library service. The report by the Aneurin Leisure Trust, which delivers the library service for the council, will go before the authority’s social services and active living scrutiny committee next Thursday.&#34; … &#34;Blaenau Gwent currently maintains five of the nine standards set by the Welsh Government. Those not achieved are linked to financial investment in the service, including purchasing of stock and staffing levels.&#34;","2015/04/subsidy-loss-read-on-get-on.html"],["Dorset","Thu, 09 Apr 2015 20:51:53 +0000","Dorset – Dorset Police recruit volunteers for new contact points following front desk closures – Dorset Echo. &#34;A pilot scheme of the counters will be launched at the Dorchester Library and Learning Centre and at Sherborne Library in June, and an open day will be held on Monday to give potential volunteers more information on the new roles. The contact points are to be handled by Dorset Police volunteers who take on a different role to Counter Service Officers who currently operate enquiry office counter services. The volunteers will provide support and guidance to members of the public who wish to make enquiries or contact Dorset Police.&#34;","2015/04/subsidy-loss-read-on-get-on.html"],["Cambridgeshire","Mon, 06 Apr 2015 20:37:06 +0000","Cambridgeshire – Proposed layout for 3rd floor of Cambridge Central Library - What Do They Know.  Schematic of the change to incorporate Kora business centre.","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Croydon / Lambeth","Mon, 06 Apr 2015 20:37:06 +0000","Croydon / Lambeth – A fair deal for Upper Norwood – SteveRead. &#34;Labour’s Steve Reed has joined forces with Upper Norwood Library campaigners to call for fair funding for Upper Norwood Library despite Government funding cuts that have unfairly hit Croydon and Lambeth.  Both councils are currently consulting on future plans for their library services. – See more at: http://www.steve4croydon.co.uk/a-fair-deal-for-upper-norwood/#sthash.oXZPqy8K.dpuf&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Lincolnshire","Mon, 06 Apr 2015 20:37:06 +0000","Lincolnshire – #WritetoVaizey – Save Lincolnshire Libraries. &#34;This campaign is currently working on points that people can include in their representations to the minister, and will update this page when these are ready, but please do not let this stop you getting your views to the minister ASAP.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Vale of Glamorgan","Mon, 06 Apr 2015 20:37:06 +0000","Vale of Glamorgan – Penarth Library wins Welsh Marketing Excellence award - Penarth Times. &#34;…. a prestigious national award at the Marketing Excellence Awards at the National Library of Wales in Aberystwyth. The awards are funded by the Welsh Government, and recognise the fantastic work being done by staff in museums, archives and libraries across Wales often with very limited resources.&#34; … &#34;Great team efforts by library staff have organised a range of activities for teens such as Quiz and Game Nights over the last year, which have proved to be popular and well attended. The new provision of video games and facilities have undoubtedly helped. There have also been consultations with young people through Penarth Library Teen Advisory Group meetings to keep up to date with their wants and needs.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Bromley","Thu, 09 Apr 2015 20:51:53 +0000","Bromley – Bromley council workers to strike – ITV. &#34;Members of the Unite union who are employed by Bromley council have begun a strike over what they call ‘mass privatisation’. They have accused the council of wanting ‘to privatise everything it does not have a legal duty to provide directly’. But the council says it needs to make £50 million in savings over four years from a net budget of around £200 million … Of those who voted in the ballot, eighty seven per cent opted for strike action. Disruption will continue into the 8th of April, with services affected including libraries and parks.&#34;","2015/04/subsidy-loss-read-on-get-on.html"],["Cambridgeshire","Thu, 09 Apr 2015 20:51:53 +0000","Cambridgeshire – Cambridge Central Library: Petition Rejected - 38 Degrees. &#34;Our petition was delivered to Cambridgeshire County Council’s Democratic Services last Monday. It had 3107 signatures at the time. The petition hand-in had to be done over Easter because the deadline for it to be considered by the General Purpose Committee, which will review the proposal on Tuesday 14 April, was this past Tuesday at 9am.  However, Michelle Rowe, Cambridgeshire County Council’s Democratic Services Manager, has said that the petition can’t be accepted without the full postal addresses (rather than just the postcodes) of the 2,741 signatories who live in Cambridgeshire (Ms Rowe added it was not possible to tell from the petition if the remaining 366 names belong to people who &#34;own a business, work in the area or attend a school or college in the area&#34;, and therefore they would not be considered). It seems that we are being rejected over a technicality, which is particularly worrying in light of the complete lack of transparency (and &#8230;","2015/04/subsidy-loss-read-on-get-on.html"],["Harrow","Thu, 09 Apr 2015 20:51:53 +0000","Harrow – Community called to unite against closure of Harrow libraries – Harrow Times. &#34;There’s not much community spirit in Harrow. Some of the little there is can be found at local libraries. Soon half of them will be closed. If Harrow is not to become totally soulless, completely dismal, and entirely free of inspiration, we must not allow this happen. Talk with your neighbours. Gather signatures. Link up. Write to your MP.&#34;","2015/04/subsidy-loss-read-on-get-on.html"],["Lincolnshire","Mon, 06 Apr 2015 20:37:06 +0000","Lincolnshire – Library opening times extended but residents say it’s ‘not enough’ – Horncastle News. &#34;Lincolnshire County Council – under fire because of its controversial proposals for the future of library services – has unveiled a raft of new opening hours. They will come into effect at seven libraries from next month – with two receiving additional hours, including Horncastle.The town’s library will still be open five days a week, although several people have complained there will only be one late night on a Thursday until 6pm. Heidi Morgan, of Horncastle, said: &#34;I’m a student and have to travel to Lincoln. By the time I get back to town, the library is often closed.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Liverpool","Mon, 06 Apr 2015 20:37:06 +0000","Liverpool – Liverpool libraries will close by 2017 if Tories win election, says Joe Anderson – Liverpool Echo. &#34;The Mayor of Liverpool has claimed that all of the city’s libraries will close by the 2017 if the Conservatives win the General Election. Mayor Joe Anderson told a meeting of the council’s Cabinet committee that if the funding levels for the city stayed the same all discretionary services would have to stop. He said: &#34;If we have the sustained funding levels continued into 2017, and we have got serious problems in 2016, there will be no libraries in 2017, including possibly the Central Library.&#34; He said the funding would mean that only mandatory services would continue&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Merthyr Tydfil","Mon, 06 Apr 2015 20:37:06 +0000","Merthyr Tydfil – Merthyr Tydfil leisure services handed to trust – BBC. &#34;Merthyr Tydfil council handed over the running of leisure and community centres, libraries and cultural sites to the trust on Wednesday. Merthyr Tydfil Leisure Trust, which is supported by a board of 11 trustees, took the reins after a year of public consultation. The trust said the move would &#34;protect the future&#34; of such services.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["North Yorkshire","Mon, 06 Apr 2015 20:37:06 +0000","North Yorkshire – Petition to save library – Northern Echo. &#34;Campaigner Susan Perkins said: &#34;Friends feel that the library is a valuable community asset and resource, and that handing it over to volunteers to run will not only disrupt the continuity and professionalism of the service, but will save very little money when the costs of vetting and training volunteers are taken into consideration. &#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["West Sussex","Mon, 06 Apr 2015 20:37:06 +0000","West Sussex – Midhurst library celebrates successful first year – Midhurst and Petworth Observer. &#34;Tuesday, March 31, marked the first anniversary of Midhurst Library’s reopening in the Grange Leisure Centre .. The library moved from Knockhundred Row to the Grange on March 31, 2014 and over the last twelve months there have been 85,365 visits and 61,947 books, story CDs and DVDs have been borrowed. This is 20,000 more items than at the old library over the same period of time. And some 868 new borrowers have now joined the library since the move to its new home.&#34; … &#34;The library is open seven days a week and is working closely with the Westgate Leisure staff which has been really productive. &#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Croydon","Thu, 09 Apr 2015 20:51:53 +0000","Croydon – Labour MP Steve Reed calls for Labour-run Croydon Council to reverse Upper Norwood library funding cut – Croydon Guardian. &#34;The Labour MP for Croydon North has piled pressure on two Labour-run councils to reverse their decision to slash Upper Norwood library’s funding. Steve Reed issued a joint statement with library campaigners calling for at least the same money per head of population as the equivalent town-centre libraries in Croydon and Lambeth. It comes after Croydon and Lambeth councils, which jointly fund the library, announced plans to cut its yearly budget from £245,000 to £100,000 from next April.&#34; … &#34;&#34;Why should Upper Norwood receive much less funding than other Croydon libraries given that it serves more than 19,000 Croydon residents?&#34; &#34;","2015/04/subsidy-loss-read-on-get-on.html"],["Vale of Glamorgan","Thu, 09 Apr 2015 20:51:53 +0000","Vale of Glamorgan – Vale Council appeals for volunteers to run ‘community managed’ libraries – Penarth Times. &#34;Following consultation with residents and library users the Vale of Glamorgan Council announced in March that it would be seeking to develop community managed libraries in Dinas Powys, Sully, Rhoose, Wenvoe and St Athan&#34; … &#34;Individuals or groups interested in running a community library are now being asked to submit an initial expression of interest by May 18, 2015. &#34;","2015/04/subsidy-loss-read-on-get-on.html"],["Lincolnshire","Mon, 06 Apr 2015 20:37:06 +0000","Lincolnshire – Libraries campaigners seek second judicial review of Lincolnshire cuts – Lincolnite. &#34;A group of campaigners against cuts to Lincolnshire’s library services are seeking a second judicial review, after the county council resubmitted and agreed reduction plans.&#34; … &#34;Campaigner Simon Draper said: &#34;We are currently accepting witness statements from people explaining how they county council’s decision will affect them. These will then be read by the county council’s and our solicitors. &#34;This is literally stage one of about five stages in putting together a pre-action letter, and if the council wants to talk we will happily do that.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Southampton","Mon, 06 Apr 2015 20:37:06 +0000","Southampton – Labour against literacy? – Daily Echo / Letter. &#34;Why else is the city council proposing to close half of the city’s libraries? &#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Middlesborough","Thu, 09 Apr 2015 20:51:53 +0000","Middlesborough – Council to consult on the future of Middlesbrough libraries - Gazette Live. &#34;Middlesbrough Council Executive recommends consultation which could see libraries take on public health and social outreach work … The increasing council focus on improving school readiness for children under five, which is aimed at reducing long-term demand on acute services, could also see hubs offer activities to boost early literacy and social interaction skills. Outreach work to support vulnerable and hard to reach people, and ‘troubled families’ is also part of the plan. This would work alongside a library’s traditional role of lending books, and offering access to computers and the internet. Cllr Thompson said: &#34;The proposal to review libraries and community hubs is necessary to meet the financial demands set by central government. A review of these areas offers the local authority the opportunity to improve and modernise service delivery for communities whilst integrating its work with other core services within Middlesbrough.&#8230;","2015/04/subsidy-loss-read-on-get-on.html"],["Wiltshire","Thu, 09 Apr 2015 20:51:53 +0000","Wiltshire – The Reader South West wins at Wiltshire Public Health Awards – Reader Organisation. &#34;Our Wiltshire shared reading project, running in partnership with Wiltshire Libraries, picked up the prize for improved mental health and wellbeing across the area. Running since January 2014, Library Memory Groups bring the shared reading experience to people living with dementia and memory loss on a weekly basis. With poems and short stories that are read aloud, group members are immersed in a calm and relaxed atmosphere, with the texts being read and digested allowing people to piece together collective personal memories related to the stories and poems, which in turn encourages feelings of wellbeing.&#34;","2015/04/subsidy-loss-read-on-get-on.html"],["Lincolnshire","Mon, 06 Apr 2015 20:37:06 +0000","Lincolnshire – Extended opening hours for Skegness Library – Skegness Standard. &#34;Skegness Library is to open for an extra five hours each week. From June 1, the library will be open 9am-5pm Monday to Friday and 9am-1pm on Saturday.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Newcastle","Mon, 06 Apr 2015 20:37:06 +0000","Newcastle – Decision letter on local inquiry into library provision in Newcastle – Gov.uk. Ed Vaizey again decides not to intervene.","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Richmond","Mon, 06 Apr 2015 20:37:06 +0000","Richmond – Richmond library changes could end book club’s story – Guardian series. &#34;The Young Persons Book Group, which meets at 6.30pm on the second Wednesday of the month, was told on March 11 the library would now close at 7pm. The group asked if Richmond Council could instead close the library 30 minutes earlier on Mondays, to maintain a 30-minute later opening time on Wednesdays … But the council said Richmond library was the only one open past 7pm because a volunteer had agreed to stay for the extra half an hour unpaid, which is no longer feasible. &#34; … &#34;Councillor Meena Bond, cabinet member for libraries, said Wednesday late night opening was changed from 8pm to 7pm three years ago and, as a temporary measure, Richmond was kept open for book groups until 7.30pm.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Staffordshire","Mon, 06 Apr 2015 20:37:06 +0000","Staffordshire – Staffordshire library guru awarded OBE by Prince Charles at Buckingham Palace - Staffordshire Newsletter. Janene Cox: &#34;She also proudly holds the title of trustee for the Reading Agency charity, and has been heavily involved in a range of expert panels and government projects to improve and plan the future of the country’s libraries.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Surrey","Thu, 09 Apr 2015 20:51:53 +0000","Surrey – Save threatened Sure Start centres in Stoneleigh and Ashtead, say parliamentary candidates – This is Local London. &#34;&#34;Given the tough financial climate for the public sector, I can’t criticise one of our councils for taking a difficult decision but I would like them to explore whether there’s an opportunity to turn the Sure Start centres into volunteer-led organisations similar to what Surrey has done with its libraries. &#34;Surrey has been very imaginative in creating community libraries.&#34;&#34;","2015/04/subsidy-loss-read-on-get-on.html"],["Barnet","Mon, 06 Apr 2015 20:37:06 +0000","Barnet – Campaigners march through Barnet to protest over library cuts – Times series. &#34;Under the proposals laid out, libraries could be closed, reduced in size or staffed by volunteers. Polly Napper, from East Finchley Library Users Group, said: &#34;It was really jolly and we had a good turnout. We are hoping to build up to a really decent number. A lot of people said they supported us. &#34;We are doing the marches to keep it on the agenda&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Birmingham","Mon, 06 Apr 2015 20:37:06 +0000","Birmingham – Library of Birmingham cuts weekend opening to six hours – BBC. &#34;The £189m Library of Birmingham, which has been open for less than two years, is to be shut on Sundays. It means the building, housing one million books, will be available for just six hours at weekends, from 11:00 to 17:00 on Saturdays.&#34; … &#34;a mixture of budget cuts and a £1.1bn equal pay claim from female workers has left the council with significant financial problems. Council leader Sir Albert Bore said the legal bill in particular had left the Labour-run council in a &#34;horrendous position financially&#34;.&#34; … &#34;The Library of Birmingham was recently named the only attraction outside London on a list of the UK’s 10 most-visited tourist sites last year.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Cardiff","Mon, 06 Apr 2015 20:37:06 +0000","Cardiff – Cardiff Council slaps warning on payday loan web pages – Wales Online. &#34;Anyone trying to access payday lender websites from council computers in Cardiff will be met with a warning screen. As part of a proposal approved by Cardiff council’s cabinet, users accessing payday websites will first be greeted with a warning page. The so-called &#34;coaching page&#34; will promote agencies who can help those struggling financially including the Money Advice Service, Cardiff and Vale Credit Union and offer advice about alternatives.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Cornwall","Mon, 06 Apr 2015 20:37:06 +0000","Cornwall – More library changes as services in Cornwall could be privatised or merged with Devon – This is the West Country. &#34;Two options have been put forward for the future of Cornwall’s libraries and one stop shops, including selling them off to a private company or a merger to create a regional service. The council is asking for views on how Cornwall’s library and one stop shop services are delivered in the future with a &#34;consultation&#34; on two models for their future. However the authority says that after discussion and comment the final design could be one or more of the models or something else entirely.&#34; … &#34;Transfer or ‘devolve’ the operation of individual libraries/one stop shops to other interested parties e.g. to a town or parish council or community organisation. This is already underway in Falmouth. &#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Leicestershire","Mon, 06 Apr 2015 20:37:06 +0000","Leicestershire – Residents unite with plans to run Hathern Library - Loughborough Echo. &#34;Following the proposal, as part of a cost saving initiative in late 2014 by Leicestershire County Council to transfer the operation of the county’s libraries into community hands, Hathern Community Library Group has been formed out of a series of public meetings facilitated by Hathern Parish Council.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Birmingham","Mon, 06 Apr 2015 20:37:06 +0000","Birmingham – Library of Birmingham: 158 reasons people would volunteer to keep city landmark open longer - Birmingham Mail. &#34;While many supported the idea others argued Birmingham City Council should properly fund the facility and that any volunteer plans, however well intentioned, would help paper over the cracks of budget cuts.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Bury","Mon, 06 Apr 2015 20:37:06 +0000","Bury – David gets ‘sound’ advice on jobs from Bury Library – This is Lancashire. &#34;David Madeley is getting the latest help from Bury Library’s computer centre in his search for work. He has been using the library service’s Universal Skills database to receive advice on how to look for jobs and apply for them online, and on how to put together a CV and covering letter.&#34; … &#34;The Universal Skills database is accessible from all Bury Council’s libraries and from home for library members via http://www.bury.gov.uk/index.aspx?articleid=10069. It covers guidance on Universal Jobmatch and Universal Credits as well as help with basic computer skills. &#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Croydon","Mon, 06 Apr 2015 20:37:06 +0000","Croydon – Letter to the Editor: Library’s wheels falling off – Guardian series. &#34;Croydon introduced self-service terminals about 12 years ago but had to abandon them because of customer resistance – the new (private) regime has resolved this by saying we can no longer choose to be served by a human being. Even Tesco has recently reduced the number of self-service tills because customers do not like them.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Hull","Mon, 06 Apr 2015 20:37:06 +0000","Hull – ‘It must be profitable&#39;: Hull Culture and Leisure company takes over services - Hull Daily Mail. &#34;The chairman of a new, Hull City Council-owned leisure company says it has to be business-like from the start. Hull Culture and Leisure (HCAL) officially comes into operation tomorrow. It will run all the council’s leisure facilities, libraries, museums and parks as well as the City Hall and New Theatre, with the authority acting as the client. About 800 council staff are transferring to work for the new company, which will be governed by a seven-strong board of councillors.&#34; … &#34;For example, we have got four weddings coming up at the Central Library later this year, but I would like to see even more.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Kirklees","Mon, 06 Apr 2015 20:37:06 +0000","Kirklees – Library friends group hands petition to councillor – Spenborough Guardian. &#34;A campaign group fighting for the future of Heckmondwike Library has handed its petition over to the leader of Kirklees Council. Friends of Heckmondwike Library gathered more than 2,300 signatures through meetings and campaigning in the town centre, and passed the petition on to Coun David Sheard (Lab, Heckmondwike).\nCoun Viv Kendrick (Lab, Heckmondwike) said: &#34;I am aware of the petition and I am pleased a lot of people thought it was important enough to take part, but I hope that all of the people involved also responded to the libraries consultation.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Lincolnshire","Sun, 12 Apr 2015 20:17:47 +0000","Lincolnshire – Still time for county avoid massive legal bill – Guardian series. &#34;More cross-party talks have been held this week in a bid to keep a public library in Market Deeping. But the talks were overshadowed by news that Lincolnshire County Council faces the prospect of a second judicial review into its bid to slash £2million from the library service by shoving 30 libraries – including Deeping library – into the hands of volunteers.&#34;","2015/04/the-bottomless-well-the-lack-of-library-standards-in-england.html"],["Swindon","Sun, 12 Apr 2015 20:17:47 +0000","Swindon – Charity shop bid at Liden library in tatters – Swindon Advertiser. &#34;Last month, enterprising Adam Hunt announced a plan to open a charity shop within Liden library to raise money for causes in the community, after being inspired by the success of a similar charity shop and library in Walcot. The 20-year-old had all but finished dotted the is and crossed the ts on the paperwork when he announced his plea for volunteers to help run the project – only to find out the venue he had been told was available was already now occupied by other activities.&#34;","2015/04/the-bottomless-well-the-lack-of-library-standards-in-england.html"],["Birmingham","Mon, 06 Apr 2015 20:37:06 +0000","Birmingham – Shock at Library of Birmingham new opening times: Just six hours at weekends - Birmingham Mail. &#34;The £189 million building will no longer open on Sundays after April 19 when cost-cutting measures are brought in to reduce its hours from 73 a week to just 40. The landmark building will open from 11am until 5pm on Saturdays and its doors will be locked for a full 42 hours straight every week before people are let in again at 11am on Mondays. Steve McCabe, the Labour General Election candidate in Selly Oak, said it was a ridiculous situation which needed addressing.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Flintshire","Mon, 06 Apr 2015 20:37:06 +0000","Flintshire – Community libraries in Flintshire facing transformation – News North Wales. &#34;Library services in Flintshire could be transformed under controversial local authority plans which could see villagers lose their local libraries. Flintshire Council said it is not closing libraries, but the plans could see several towns’ and villages’ repositories shut in favour of moves to centralised ‘library hubs’ elsewhere. Users say such moves will jeopardise their ability to get to the library and compromise their access to books. The proposals could see libraries in Hawarden, Mancot and Queensferry moved to a new hub at Deeside Leisure Centre at a cost of £130,000.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Lincolnshire","Mon, 06 Apr 2015 20:37:06 +0000","Lincolnshire – Judicial review of libraries decision requested – Lincllnshire Council. &#34;Tony McGinty from Lincolnshire County Council, said: &#34;We are very disappointed to receive another challenge. &#34;The council has yet to receive the details, but will be preparing the strongest possible defence once it has done so. &#34;We’ve worked hard to address all the issues raised in the last year’s judicial review, and carried out additional consultation before making a fresh decision. &#34;And importantly, the court ruled our proposed model would meet our legal duties, a finding recently endorsed by the Department for Culture, Media and Sport. &#34;We can’t ignore the fact that by the end of this decade the council’s overall budget will have been almost halved.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Flintshire","Sun, 12 Apr 2015 20:17:47 +0000","Flintshire – A Celebration of Arthurian Studies at Bangor University - Bangor University. &#34;Bangor University can now boast the largest collection of Arthurian books in Wales and the north of England, following an agreement with Flintshire County Council, who have donated a rare and valuable Arthurian Collection to the University’s Library and Archives&#34;","2015/04/the-bottomless-well-the-lack-of-library-standards-in-england.html"],["Liverpool","Mon, 06 Apr 2015 20:37:06 +0000","Liverpool – Big Little Library officially opened by Lord Mayor Cllr Erica Kemp - Liverpool Echo. &#34;The pop-up library was officially unveiled by Lord Mayor Cllr Erica Kemp at an event attended by local dignitaries, community members, schoolchildren and the public of Belle Vale … The idea for the scheme was partly inspired by the ‘Little Libraries’ that are springing up across the UK … Belle Vale Library, as well as many other libraries across Liverpool, faced the prospect of closure and so as part of this campaign, ‘Little Libraries’ will be donated throughout the city.&#34;","2015/04/dont-look-at-the-man-behind-the-curtain.html"],["Barnet","Sun, 12 Apr 2015 20:17:47 +0000","Barnet – A New Library Teen Reading Group by Savita Kalhan - Edge. &#34; think it’s important for kids to have choice when it comes to books. In my local library, the teen section is a very small area, although it’s still used by teens to borrow books. They often study in the library too. More books and more choice would be good though. So I thought why not volunteer to start a Teen Reading Group? It would be no more than an hour of my time once or twice a month, and if it promotes reading amongst teens and introduces them to a wider variety and more diverse books, then I’ll be a very happy person. &#34;","2015/04/the-bottomless-well-the-lack-of-library-standards-in-england.html"],["Lincolnshire","Sun, 12 Apr 2015 20:17:47 +0000","Lincolnshire – Lincolnshire County Council faces second judicial review – BBC. &#34;Maurice Nauta, from Save Lincolnshire Libraries, said they had instructed lawyers to begin the process of a second judicial review and have written a &#34;pre-action&#34; letter to the council. He admitted the legal action could end up costing the taxpayer but blamed that on the council. &#34;We haven’t been able to move the county council,&#34; he said. &#34;It’s not something we want to be doing but we have been backed into a corner.&#34; Tory councillor Nick Worth, executive member for libraries, said: &#34;This is a disgraceful waste of public funds – this is costing a huge amount of money for the taxpayer.&#34;&#34;","2015/04/the-bottomless-well-the-lack-of-library-standards-in-england.html"],["Rutland","Sun, 12 Apr 2015 20:17:47 +0000","Rutland – Library computers get £20,000 upgrade - Rutland and Stamford Mercury. &#34;Rutland County Council will spend £20,000 upgrading IT facilities at libraries in Oakham, Uppingham, Ketton and Ryhall. The council will replace 35 old computers with Intel Core i5 models. The new machines feature touch screen technology to make browsing the internet, searching for work and carrying out research much easier.&#34; … &#34;The money has come from Section 106 funding specifically for libraries, and the computers that are being replaced are more than five years old.&#34;","2015/04/the-bottomless-well-the-lack-of-library-standards-in-england.html"],["Barnet","Sun, 12 Apr 2015 20:17:47 +0000","Barnet – Save Barnet Libraries stages march from Hendon to Childs Hill in protest at Barnet Borough Council’s library cuts - Times series. &#34;An author spoke of how libraries were a &#34;lifeline for many families&#34; during a march through Barnet to oppose cuts to the service. Caroline Green, who writes fiction for teenagers, joined the march yesterday from Hendon to Childs Hill, via Golders Green yesterday, organised by the Save Barnet Libraries group. Barnet Borough Council is planning to make £2.85m cuts to the borough’s libraries, and proposals include closing libraries, reducing them in size or using volunteers to run the service.&#34;","2015/04/the-bottomless-well-the-lack-of-library-standards-in-england.html"],["Worcestershire","Sun, 12 Apr 2015 20:17:47 +0000","Worcestershire – New ‘chapter’ for Stourport Library – Kidderminster Shuttle. &#34;The ‘new chapter’ for the library began on Wednesday, March 25, when it reopened in the Civic Centre in New Street, just off Riverside Meadows, following the move from the County Buildings in Worcester Street … Existing staff and facilities were transferred to the refurbished Civic Centre which is also being shared with the Coroner’s Office and Town Council, as part of a lively community hub. Library services at Stourport include a dedicated ‘teen area’ with its own computers. Opening hours have been extended to include Wednesdays from 9am to 5.30pm&#34;","2015/04/the-bottomless-well-the-lack-of-library-standards-in-england.html"],["North Yorkshire","Sun, 12 Apr 2015 20:17:47 +0000","North Yorkshire – A pint and a paperback are order of the day at pub library – Darlington and Stockton Times. &#34;&#34;It is great that the village still has a library, even though it is small, rather than nothing at all,&#34; he says. But he is adamant that the community library model should not be a replacement for all fully-functioning libraries with trained staff and the range of services they can offer. &#34;Even though the village library in our pub works well, it doesn’t justify the council closing libraries.&#34;","2015/04/the-bottomless-well-the-lack-of-library-standards-in-england.html"],["Barnet","Tue, 14 Apr 2015 20:31:37 +0000","Barnet – Keep Barnet Council services public - 38 Degrees. &#34;I am asking you to stop your outsourcing plans for the following services:\n• Education & Skills and School Meals services • Library Service • Early Years: Children’s Centres • Adult Social Care • Street Scene Services&#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Kent","Tue, 14 Apr 2015 20:31:37 +0000","Kent – Thousands of children receive lessons on online safety – ITV. &#34;Whilst the visits are predominantly in primary schools, they have also taken place at libraries, Scout and Guide groups, shopping centres and mobile police stations.&#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Kirklees","Tue, 14 Apr 2015 20:31:37 +0000","Kirklees – Friends of Heckmondwike library hand over 2,300 strong petition to councillor David Sheard  – Examiner. &#34;Friends of Heckmondwike Library gathered 2,300 signatures and presented them to leader of the council and Heckmondwike councillor David Sheard, in a bid to highlight the number of people opposed to its potential closure. They are among several communities Kirklees-wide which are rallying to save library services in the light of government cuts to Kirklees Council’s budget. Sonja Martin , one of the Friends, said: &#34;We have had a lot of support with the petition from businesses as well as churches and mosques which has been great.&#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Northern Ireland","Tue, 14 Apr 2015 20:31:37 +0000","Northern Ireland – Fears over proposed library cuts – Coleraine Times. &#34;Under new proposals opening hours could be reduced at libraries in Coleraine, Portstewart and Portrush … Councillor William McCandless, who is the Party’s East Londonderry Westminster candidate, said: &#34;Modern libraries are about much more than simply borrowing books. They provide a focal point for many communities, assist people to get online and encourage employability. I believe that these proposed cuts to library opening hours, coming so soon after the recent cuts in early years learning are a bridge too far.&#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Birmingham","Tue, 14 Apr 2015 20:31:37 +0000","Birmingham – Tyburn Community Library/Castle Vale Swimming Pool. Birmingham, UK - New Barn-Raising Webinars. &#34;Like many UK local authorities, Birmingham City Council, has had to make substantial spending cuts. The city’s Castle Vale area has recently seen both the library and swimming pools adopted by social enterprises to keep them open – both ‘firsts’ in the city. A local social enterprise, the Castle Vale Tenants and Residents Alliance, has adopted the library and plays a key role in the non-profit established to manage the pool. Judy Tullett, Head of Enterprise and Development at the Alliance, will reflect on lessons from the two transfers and the business plans being put in place to sustain (and improve) the two assets.  http://castlevale.org.uk&#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Cornwall","Tue, 14 Apr 2015 20:31:37 +0000","Cornwall – Cornwall Council upgrade 22 library branches - Bibliotheca. &#34;Cornwall Council, a long-standing Bibliotheca customer since 2006, will be replacing 43 of its existing Bibliotheca self-service kiosks with latest addition to the company’s smartserve™ range – the smartserve™ 1000. The move comes as Cornwall looks to refresh its self-service facilities across its entire estate, further improving the quality and range of services available to its library users and streamlining day-to-day processes for staff.  &#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Leeds","Tue, 14 Apr 2015 20:31:37 +0000","Leeds – Activities galore in Leeds libraries – Yorkshire Evening Post. &#34;From Frozen to Minecraft, comics to Lego, there’s a host of family-friendly activities taking place in Leeds libraries this week. Once a place where youngsters would be shushed for making a noise, these fun-packed sessions are helping children see that reading can be fun.&#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Wakefield","Tue, 14 Apr 2015 20:31:37 +0000","Wakefield – Upton Library reopens after financial issues – Express series. &#34;The community facility, run by Upton North Elmsall Forum (UNEF), could not meet its running costs after a cheque from Upton Parish Council was delayed. The Waggon Lane library closed on Tuesday, March 31, meaning local youngsters missed a planned Easter activity on April 1. The forum informed families of the cancelled event through Twitter, saying: &#34;Easter event has been cancelled due having to close our doors at short notice over lack of funding. @upton_library.&#34; … &#34;UNEF initially received a share of £100,000 from Wakefield Council but has since been partly funded by grants from Upton and North Elmsall Parish Council. &#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Kent","Tue, 14 Apr 2015 20:31:37 +0000","Kent – Campaigners deliver library petition to County Hall – Kent News. &#34;The message to Kent County Council was clear when campaigners delivered 3,772 signatures as part of their ‘save our public libraries’ petition. Over 3,000 of the signatures were collected face-to-face on paper, between March 3 and April 8, providing a snapshot of the strength of feeling in Margate, Sandwich, Herne Bay, Whitstable, Canterbury and Faversham. In addition, 720 people across Kent signed the e-petition hosted on KCC’s website. The petition was organised to fight plans by KCC to hand over control of public libraries to a trust. Campaigners argue that under trust ownership, smaller libraries may be at risk of closure.&#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Northumberland","Tue, 14 Apr 2015 20:31:37 +0000","Northumberland – Mayor fears for Hexham library’s future - Hexham Courant. &#34;library could be reduced in size, or turfed out of the Queen’s Hall entirely, to accommodate homeless staff from Northumberland County Council, according to town mayor Coun. Terry Robson … Coun. Robson claims the council is holding the Queen’s Hall trustees to ransom with its demands for accommodation there. For the trustees rely on the rental income for the library to help with its running costs.&#34; … &#34;A spokesman for the county council said: &#34;The council’s strategy in Hexham and elsewhere in main towns is to co-locate front facing services, such as libraries, customer information and tourist information, along with the teams which need to be there to deliver them to the public. &#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Leicestershire","Tue, 14 Apr 2015 20:31:37 +0000","Leicestershire – 19 communities on path to take over their libraries from County Hall - Leicester Mercury. &#34;More than half the 36 community libraries under threat because of County Hall spending cuts are on the road to local control. Nineteen community groups have been given the go-ahead to seek transfer agreements so they can open next year. Further work will be done with the remaining communities which need to amend their plans or register an interest in running their library, to encourage more areas to join in. The call to communities to take over the smaller libraries across Leicestershire was made to help the authority balance its books.&#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Lincolnshire","Tue, 14 Apr 2015 20:31:37 +0000","Lincolnshire – Lincolnshire County Council faces second legal battle – Stamford Mercury. &#34;Save Lincolnshire Libraries is gathering witness statements ahead of another possible challenge to Lincolnshire County Council’s decision.&#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Suffolk","Tue, 14 Apr 2015 20:31:37 +0000","Suffolk – Friends of Southwold Library launch third Crime Writers Festival – One Suffolk. &#34;The Friends of Southwold Library are supporting the third ‘Slaughter in Southwold’ crime writers festival in association with Southwold Arts Festival and the Crime Writers Association. The festival takes places on Saturday 20 and Sunday 21 June at Reydon Village Hall and features a range of well-known local and national crime authors giving talks including Nicci French, Simon Brett, Barbara Nadel, Rory Clements, Kate Rhodes, Penny Hancock, Sarah Hilary and Julia Crouch and Margaret Callow. Slaughter in Southwold was launched in 2013 and in 2014 moved from a one day to weekend event. Last year around 100 people enjoyed the events and over £750 of books by the authors were sold&#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["York","Tue, 14 Apr 2015 20:31:37 +0000","York – Archive is a gateway to history – Designing Libraries. &#34;The HLF-funded £2 million project includes a new environmentally controlled repository built on top of a single-storey wing of the central library to house York’s priceless 800 year old archives, second only to London in importance. The public areas of the archive have been refurbished, creating new breakout and relaxation space as well as study areas retaining some of the original wooden furniture. A new timber installation in the family history room (formerly a stack store) creates a mezzanine level, allowing two new group study areas. Facilities in the main archive reading room are now used for family history classes as well as school and volunteer groups.&#34; … &#34;The new archive repository sits on top of a single storey wing of York Explore, the Grade II listed Carnegie central library&#34;","2015/04/party-manifestos-tories-mention-libraries-in-2-or-3-sentences-labour-and-greens-not-at-all.html"],["Denbighshire","Thu, 16 Apr 2015 21:25:15 +0000","Denbighshire – 18 – Kara Orford, Denbighshire Libraries - 23 Librarians. &#34;The inspiring stuff? The things that still make me happy every morning to get out of bed and drive to work? Children’s stock purchasing for the county is one area of my responsibility, as is the programming of community reading groups in the libraries that I manage. We have several reading groups, a Chatterbooks group and a Carnegie Medal focussed reading group that I run at the nearby high school. If ever I am having a bad day, an hour spent with any of those groups will soon turn my mood around and remind me why I love my job. I schedule and lead class visits to the library on a regular basis (a real boost to issues and membership that I spend a lot of my time pursuing) I am also often found visiting school assemblies or classes to promote our service and try to instil that all important love of reading for pleasure.&#34;","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Lambeth","Thu, 16 Apr 2015 21:25:15 +0000","Lambeth – Lambeth library service ranks lowest in independent survey – yet staff costs are the highest - Brixton Buzz. &#34;Independent data suggests that Lambeth’s library service ranks as the lowest compared with other London boroughs, yet the cost of the service for Council Tax payers is the highest. The 2014 report from the Comparative Profile for Public Library Services will make for grim reading for Cllr Jane Edbrooke, the Portfolio Holder who looks after libraries. It should also act as a warning sign for any community group thinking of volunteering to run a Lambeth library, one of the key ideas in Cllr Edbrooke’s current Cultural Consultation.&#34;","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Durham","Thu, 16 Apr 2015 21:25:15 +0000","Durham – Block self-harm websites on council PCs – report – Advertiser. &#34;The study also suggests computers in council-run buildings such as libraries should block access to social chat websites focused on self-harm.&#34;","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Lincolnshire","Thu, 16 Apr 2015 21:25:15 +0000","Lincolnshire – Villains – Save Lincolnshire Libraries. Conservative literature says &#34;one person&#34; objected to library proposals and took council to court: doesn’t mention the 23,000 people who signed the petition which was ignored. Names the Conservative politicians most implicated in the library cuts.","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Trafford","Thu, 16 Apr 2015 21:25:15 +0000","Trafford – Changes to Trafford Library Service – Trafford Council. &#34;Following two periods of public consultation and Trafford Council Executive decision on 25 March 2015 a number of changes will be taking place within Trafford Libraries. Here is an overview of the changes with current target dates; this page will be updated regularly.&#34;: Bowfell will close 27 April, Davyhulme will close 3 May, Woodsend fewer staff but Open+ may maintain hours, Lostock will transfer to college (school library with public access), Coppice will be transferred to BlueSCI mental health and wellbeing group, Timperley will reduce in size and be part of GP surgery, Hale will be sold to private developer who will need to maintain library for two years.","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Enfield","Thu, 16 Apr 2015 21:25:15 +0000","Enfield – Mobile libraries might face axe in round of funding cuts – North London Today. &#34;In the draft library development strategy, officers have summarised findings from the consultation that took place between November last year and February 2015. Now councillors will have to decide where the axe should fall. One of the options detailed in the report involves &#34;bringing to an end the mobile library service and explore providing an expanded, volunteer-led home delivery service for the homebound&#34; … four libraries would remain as &#34;flagship&#34; seven-days-per-week open libraries but &#34;The remaining, smaller libraries would be removed from local authority control and given &#34;community library&#34; status and would be run by groups or volunteers, rather than the council. Officers say that results from the consultation process showed &#34;general support&#34; for &#34;community libraries&#34; and add that they [the officers] should be given the go-ahead to start talks with volunteers and organisations who could take &#8230;","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Lambeth","Thu, 16 Apr 2015 21:25:15 +0000","Lambeth – Big Borrow at Waterloo Library as closure consultation nears end – London SE1. &#34;As soon as the library in Lower Marsh opened on Saturday afternoon there was a queue from the issuing desk back to the front door as residents each borrowed their full quota of 15 books.  Others queued at the self-service machines. Meanwhile books were piled outside on the pavement as protesters shared plans to maintain pressure on Lambeth Council as the consultation period on proposals to shut the library nears its end.  The Friends of Lambeth Libraries is campaigning to keep all the borough’s ten libraries open and staffed by professional salaried librarians.&#34;","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Lincolnshire","Thu, 16 Apr 2015 21:25:15 +0000","Lincolnshire – Save Lincolnshire Libraries campaigners look at bringing fresh legal challenge - Lincolnshire Echo.","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Suffolk","Thu, 16 Apr 2015 21:25:15 +0000","Suffolk – Readers unable to judge a book by its cover with library’s new ‘blind’ book project – Ipswich Star. &#34;Rosehill Library in Ipswich launched the project shortly before Easter, with 15 books wrapped in plain white packaging with only the first line of the story and the genre of book for readers to see. Sarah Watt, 23, a branch assistant at the library came up with the project, and has been thrilled with its progress so far. She said: &#34;People are really enjoying it. Some are not sure about it at first but people would like to take the plunge, and because it’s a library book you can just return it if you don’t like it.&#34;","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Flintshire","Thu, 16 Apr 2015 21:25:15 +0000","Flintshire – Petitions’ bid to save libraries in News North Wales. &#34;Petitions carrying more than 1,000 signatures have been handed into Flintshire Council in a bid to safeguard libraries in Hawarden and Mancot. And following a closed public consultation event on Tuesday night in Hawarden fresh fears have been raised for the future of Flintshire’s famous Record Office. Flintshire Council maintains its stance that the libraries in Hawarden and Mancot, as well as Queensferry, will not be closed but moved to a ‘library hub’ at Deeside Leisure Centre. The move will cost £130,000.&#34;","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Leicestershire","Thu, 16 Apr 2015 21:25:15 +0000","Leicestershire – Library offload plans progress for villages - Hinckley Times. &#34;Villagers in Burbage and Sapcote will be canvassed again as Leicestershire County Council looks to progress cost-cutting plans and offload rural libraries. The two parishes are among a handful where groups either didn’t express an interest, withdrew interest or put forward unacceptable proposals to take on the running of their local library. Across the county 19 community-led alliances could be in the first wave of transferals, including Desford, Groby, Market Bosworth, Newbold Verdon and Stoney Stanton.&#34;","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Birmingham","Sun, 19 Apr 2015 19:20:10 +0000","Birmingham – The Library of Birmingham and the wider issues surrounding funding of public libraries - Libraries and Education. &#34;The Library of Birmingham was one of the UK’s top ten tourist attractions in 2014 – and the only one outside London. This would seem to indicate that the fortunes of the library are on the up, but look a little closer and this is revealed to be far from the case. Despite this popularity, the building is in crisis. Since its opening in September 2013, the Library of Birmingham has become increasingly beleaguered, despite such high visitor numbers. Within six months, it was deemed &#34;unfit for purpose&#34; and &#34;farcical&#34; by seething patrons, who found books inaccessible because staff couldn’t reach them. Fast-forward to the end of 2014 – and a squeeze on council resources meant that the flagship library was facing the threat of slashed opening hours and 100 redundancies.&#34; plus looks at national picture … &#34;we must move away from policies determined by a business case that determines whether&#8230;","2015/04/getting-rid-of-a-member-of-your-team-a-ten-year-olds-view-on-library-cuts.html"],["Leicestershire","Thu, 16 Apr 2015 21:25:15 +0000","Leicestershire – Rothley Community Library - Website. &#34;The council will no longer pay for library staff, so if we do nothing the library will close. But if we work  together, the library can go on doing everything it does now – free book loans to adults and children, computer use, wireless facilities and lots more. We need to show there is local support and a sound business plan. Funding for the premises, insurance etc will continue for the first two years, then will tail off over the next five. &#34;","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Lincolnshire","Thu, 16 Apr 2015 21:25:15 +0000","Lincolnshire – Lincolnshire County Council reveals library procurement plan – Rutland and Stamford Mercury. &#34;The authority is undertaking a competitive procurement process after an approach by Greenwich Leisure Limited – a not-for-profit organisation interested in running local libraries. The contract notice for this procurement will be published today, Thursday, April 16. Lincolnshire County Council officer Tony McGinty said: &#34;Although we potentially face a second legal challenge, we intend to continue working on the procurement of the new-look service.&#34;  see also Lincolnshire heritage sites included in libraries outsourcing contract – Lincolnite.","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Nottingham","Thu, 16 Apr 2015 21:25:15 +0000","Nottingham – Library and housing office in Broxtowe to close ahead of £5m joint service centre redevelopment - Nottingham Post. &#34;A joint service centre is due to open in spring 2017, featuring a new library, improved IT equipment, information desk for council and housing services, meeting rooms and an outdoor area. Stepney Court, a 28-home independent living complex behind Aspley housing office that was built in the 1970s, will also be redeveloped into a similar scheme with 31 upgraded modern flats above the centre. Ahead of demolition work, Strelley Road Library will close on Saturday <18/4> at 1pm and the Nottingham City Homes (NCH) housing office will close on Friday, April 24.&#34; … &#34;A reduced afternoon library service will be available from Monday to Wednesday at nearby Broxtowe Children’s Centre, while there will be a drop-box at the Co-op for returning books. Library groups will be held at the Sheila Russell Centre, in St Martin’s Road, while computer access and after school clubs will be available at the Broxtowe Educ&#8230;","2015/04/lib-dems-and-green-manifesto-mentions-big-cuts-in-enfield-and-trafford.html"],["Blaenau Gwent","Sun, 19 Apr 2015 19:20:10 +0000","Blaenau Gwent – Blaenau Gwent’s libraries struggling to invest in staff and stock – report – South Wales Argus. &#34;Blaenau Gwent council is currently meeting 6.5 of the nine standards. Its libraries are unable to meet the &#34;acquisitions&#34; standard, as they are only acquiring half the amount of stock needed. The authority also does not meet the standard for staffing levels – but only five local authorities in the whole of Wales do.&#34; … &#34;The net expenditure in Blaenau Gwent on public library provision per 1,000 population was £15,971. &#34;","2015/04/getting-rid-of-a-member-of-your-team-a-ten-year-olds-view-on-library-cuts.html"],["Cheshire West and Chester","Tue, 21 Apr 2015 20:12:09 +0000","Cheshire West and Chester – Images of cultural centre’s interior revealed – Re:New. &#34;The latest interior visuals of the new cultural centre have been released, the images depict what visitors can expect when they enter the brand new building, currently being constructed in Chester city centre. Visitors entering the centre from Northgate Street will step into the world-class library, with a bistro and a new 100-seat cinema screen at the heart of the building.  To the west, a new extension will house the main 500/800-seat theatre and its support spaces, whilst a flexible studio theatre and its dedicated bar will sit on the roofline, with panoramic views over the city.&#34;","2015/04/its-your-time-at-least-in-the-us.html"],["Leicestershire","Tue, 21 Apr 2015 20:12:09 +0000","Leicestershire – Library transfers are moving closer - Loughborough Echo.  &#34;Sixteen communities are now in category one, which means they can develop their submissions into formal agreements to transfer libraries to them. These are Anstey, Bottesford, Desford, Fleckney, Glenhills, Groby, Hathern, Kegworth, Leicester Forest East, Market Bosworth, Newbold Verdon, Ratby, Rothley, Sileby, South Wigston and Stoney Stanton. A further three communities – Barrow-upon-Soar, Barwell and Markfield – can reach this stage if they meet minor conditions. Five communities – Castle Donington, Countesthorpe, Great Glen, Kirby Muxloe and Thurmaston – are in category two, which means further work is required to improve the outline business plan, before they can progress.&#34;","2015/04/its-your-time-at-least-in-the-us.html"],["Liverpool","Tue, 21 Apr 2015 20:12:09 +0000","Liverpool – Man detained at library demo outside Liverpool Town Hall – Liverpool Echo. &#34;Masked man holding anarchist flag stopped from entering public meeting by police … Protestors forced their way into Liverpool Town Hall this evening during a council meeting about library cuts. Police were called to the scene where a group of protestors tried to enter the building while the meeting was going on inside. Officers detained a masked man inside Liverpool Town Hall during the demonstration against library cuts but no arrests were made.&#34; … &#34;Before the council meeting members of Liverpool Against the Cuts held a peaceful protest against cuts made to library services. Down the road from the protest at the Town Hall, ‘Love Activists’ are still occupying the Old Bank of England building on Castle Street because they want to turn it into a homeless shelter.&#34;","2015/04/its-your-time-at-least-in-the-us.html"],["Lambeth","Tue, 21 Apr 2015 20:12:09 +0000","Lambeth – Saving Lambeth’s Minet Library – last meeting tonight (20th April) – Brixton Buzz. &#34;Campaigners have since been fighting hard to save the Minet Library, and tonight they are holding their final meeting. A big turn out is expected, with local writers and MP Kate Hoey speaking. Along with three Vassall Ward councillors, Hoey has voiced her opposition to the decision to close the library.&#34;","2015/04/its-your-time-at-least-in-the-us.html"],["Lincolnshire","Tue, 21 Apr 2015 20:12:09 +0000","Lincolnshire – Stop digging a hole over the libraries plea – Spalding Today. &#34;Labour’s shadow executive county council member for libraries, Phil Dilks, says it’s nonsense to draw up an almost copycat plan to the one that saw the council humiliated in court.He said: &#34;When you’re in a hole, it’s best to stop digging. &#34;But Nick Worth, Martin Hill and the rest of the Tories who run Lincolnshire County Council seem bent on taking us even deeper into the mire by pressing ahead regardless with their fag-packet scheme which will decimate more than 30 libraries.&#34;","2015/04/its-your-time-at-least-in-the-us.html"],["Brent","Thu, 23 Apr 2015 19:33:18 +0000","Brent – Preston Road has a library back … 3 years after closing – Preston Library Campaign. Temporary licence granted from mid April until end of July.","2015/04/new-worlds-and-growls.html"],["Bristol","Thu, 23 Apr 2015 19:33:18 +0000","Bristol – Save Wick Road Library – Facebook group. Over 700 likes. See article on the campaign and the need for the library at Saving Wick Road Library - Bristol Post and Save Wick Road Library: Long walks and big hills - Lamplighter. &#34;If Wick Road Library is closed some parts of the Greater Brislington residential area would be 2.5 miles away from the nearest library at Knowle; clearly not within the recommended minimum distance outlined … Our ward really struggles for infrastructure and council support. We have lost these and others, such as the Wicklea Community Centre. Wick Road library remains as the last free, welcoming safe-spaces left for the whole community.&#34;","2015/04/new-worlds-and-growls.html"],["Cornwall","Thu, 23 Apr 2015 19:33:18 +0000","Cornwall – 150 staff left Cornwall Council in March as part of restructuring – West Briton. &#34;It is currently undertaking consultation on how to run its libraries and one stop shop service in future and is considering handing responsibility to parish and town councils or voluntary groups or to a commercial operator.&#34;","2015/04/new-worlds-and-growls.html"],["Coventry","Thu, 23 Apr 2015 19:33:18 +0000","Coventry – General Election 2015: Greens’ Laura Vesty quizzed - Coventry Telegraph. &#34;I would like to see proper investment in the public services that we need. Libraries, community centres, youth services, police stations and crossing patrols are all services that should never be cut.&#34;","2015/04/new-worlds-and-growls.html"],["Devon","Thu, 23 Apr 2015 19:33:18 +0000","Devon – Strong response to new library friends’ group – Exmouth Journal. &#34;The new Friends of Budleigh Salterton Library group was officially launched at a public meeting, and more than 50 people have already signed up. The idea for a friends’ group came out of Devon County Council’s plans to reorganise the county’s library service. Budleigh library supervisor Margaret Hallett told the meeting that a friends’ group could help with organising extra events, could find ways of extending the library’s opening hours, and could raise funds for the library, which in the short term could pay for improvements, such as a drinks or snacks machine and more comfortable chairs&#34;","2015/04/new-worlds-and-growls.html"],["Sheffield","Thu, 23 Apr 2015 19:33:18 +0000","Sheffield – Objection to plans to knock down Sheffield library and rebuild it in new community hub – Sheffield Telegraph. &#34;Plans to knock down a Sheffield library and rebuild it as part of a medical centre have been submitted. The proposals would mean Woodseats Library, on Chesterfield Road, would become part of a medical centre and a pharmacy. Sheffield Council – which is backing the scheme – says it will become a ‘community hub’.The current library is in a poor condition and it is said repairs would be too expensive.&#34; … &#34;The plans have been developed by Woodseats Medical Practice, with the council providing land in return for space for the library in the building. The council says the new library would have the same amount of space as the existing one and retain the same opening hours.&#34;","2015/04/new-worlds-and-growls.html"],["Northumberland","Thu, 23 Apr 2015 19:33:18 +0000","Northumberland – Town Hall extension plans may be revived – Morpeth Herald. &#34;As previously reported, Northumberland County Council is planning a major re-organisation of town centres that could see services such as schools, leisure facilities and libraries relocated and existing buildings sold off or re-modelled.&#34; … &#34;The library, Willows and Beechfield House in Gas House Lane could be used for a riverside development, with library and council information services moving into The Chantry.&#34;","2015/04/new-worlds-and-growls.html"],["Peterborough","Thu, 23 Apr 2015 19:33:18 +0000","Peterborough – Vivacity confirms no compulsory redundancies for Peterborough library staff – Peterborough Today. &#34;Vivacity, which runs the service, says 15 members of staff have accepted voluntary redundancies. The news comes after Peterborough City Council cabinet member Councillor Lucia Serluca, whose portfolio includes libraries, had assured councillors at a scrutiny meeting that any staff taking redundancy would do so voluntarily.&#34;","2015/04/new-worlds-and-growls.html"],["Birmingham","Sun, 26 Apr 2015 20:50:31 +0000","Birmingham – 30 student protesters banned from Library of Birmingham – I am Birmingham. &#34;Anti-cuts protesters who were today protesting against the reduced opening hours at the Library of Birmingham have been reportedly issued with banning orders, preventing them entering the building in future. According to reports from those present, students taking part in a rally and occupation at the library this evening were held in the venue’s lobby, unable to enter or leave, while staff and police are said to have issued around 30 of them with 3-month banning notices. The banning order slips seem to be hand-written and the details of those attending don’t appear to have been collected.&#34; … &#34;Protesters from Birmingham Against the Cuts, TUSC (Trade Unionist and Socialist Coalition), Birmingham Trades Union Council and Friends of the Library of Birmingham were joined by members of the public, college and university students and other library users to rally against the new updated hours for the library, which see opening times slashed b&#8230;","2015/04/when-librarians-should-fear-the-quiet.html"],["Coventry","Sun, 26 Apr 2015 20:50:31 +0000","Coventry – Election hopefuls called on to pledge support for Coventry libraries - Coventry Observer. &#34;Campaigners from ‘Save Coventry Libraries’ have invited candidates to take part in the ‘Library Pledge’ at the Godiva Statue this Saturday (April 25) – promising to never vote for a reduction in Coventry library services.&#34; Greens, Socialists and one Conservative have signed pledge.","2015/04/when-librarians-should-fear-the-quiet.html"],["Birmingham","Sun, 26 Apr 2015 20:50:31 +0000","Birmingham – Trojan Horse One Year On: Headteacher who warned the government five years ago reveals plans to create ‘families’ of schools  – Birmingham Mail. &#34;When it comes to really looking at the life experience of children, it takes a whole city to raise a child,&#34; he said, adding that BEP [Birmingham Education Partnership – Ed.] would lean on the council to boost community facilities such as parks and libraries.&#34;","2015/04/when-librarians-should-fear-the-quiet.html"],["Brent","Sun, 26 Apr 2015 20:50:31 +0000","Brent – Brent Central: Lib Dems, libraries and the Labour tide - Guardian. &#34;Following last year’s borough vote, Labour councillor Samuel Stopp argued that his party’s main opponents had paid a price for what he called &#34;relentless negative propaganda focused on local controversies&#34; for which they offered no solutions and for a general loss of campaigning energy. He cited car parking and library closures. The latter got a lot of publicity back in 2012. Six were shut. Novelist Zadie Smith, who grew up in Brent and whose most recent work is set there and named after its postcodes, joined the opposition to the policy. But in the council chamber, Brent leader Muhammed Butt told the Lib Dems he had &#34;nothing to apologise for.&#34; After all: &#34;These closures were made because of cuts by your government putting us in an impossible situation.&#34; At the time, the Lib Dems had 17 councillors. Two years later, only one survived. Now, Labour is proudly pointing to a big new library building in Willesden. It must be hard to be t&#8230;","2015/04/when-librarians-should-fear-the-quiet.html"],["Croydon/Lambeth","Sun, 26 Apr 2015 20:50:31 +0000","Croydon/Lambeth – Properly fund our Library as a statutory town centre library for Crystal Palace - Change. Petition: &#34;The joint funding of the Upper Norwood Library by both Lambeth and Croydon for more than 100 years is a model of cross-borough co-operation that benefits the entire community of Crystal Palace. Residents in Crystal Palace and Upper Norwood have consistently made clear their support for a properly funded, professionally staffed library in public consultations held by both councils. We want to see the Upper Norwood Joint Library receive at least the same funding per head of population as equivalent town centre libraries in Croydon and Lambeth, and Croydon to meet their commitment to fully match all funding from Lambeth including the endowment fund.&#34;","2015/04/when-librarians-should-fear-the-quiet.html"],["Cardiff","Sun, 26 Apr 2015 20:50:31 +0000","Cardiff – Row breaks out over removal of books from Rhydypennau Library – Wales Online. &#34;The Friends of Rhydypennau group say that up to 1,500 books have been removed from the library and that it is the start of the council trying to reduce provision. They say that by reducing the books will impact on the borrowing figures. The library was one of seven in the city that faced closure during budget cuts earlier this year. Chairwoman of the Friends of Rhydypennau Library group, Madhu Khanna-Davies, said: &#34;To diminish our stock at a time when the long term future of Cardiff’s threatened community libraries is still uncertain left me feeling uneasy and concerned about the negative impact upon the service and the possible reasons behind this decision.&#34;","2015/04/when-librarians-should-fear-the-quiet.html"],["Coventry","Sun, 26 Apr 2015 20:50:31 +0000","Coventry – Library Pledge to be unveiled at Godiva Statue in Coventry city centre - Coventry Telegraph. &#34;The city council announced in February that every library in Coventry will remain open for at least another year. However, there is no guarantee that some libraries won’t close over the next two to three years as the council shaves £65million from its budget following reduced Government funding. Campaign member Vicky Cowell said: &#34;Libraries are so much more than just places where you can find and read books, information and access computers. &#34;They are community hubs, places of warmth and connection where no-one is trying to sell you a product or ideology.&#34;","2015/04/when-librarians-should-fear-the-quiet.html"],["North Yorkshire","Sun, 26 Apr 2015 20:50:31 +0000","North Yorkshire – Our libraries at threat while Government fritters away public finances – UKIP Richmond. &#34;When I see to my horror my local library suffer (or even close) I will remember the wasteful £18 billion a year spent on wind-farms that &#34;don’t go when the wind don’t blow&#34;, the £10 billion a year spent of foreign aid – going to countries developing their own space programme, the £55 billion a year to prop up an undemocratic and recession-hit EU, and the missed opportunities of developing our youth, trading with the high-growth Commonwealth, incentivising scientific education and investing in our rural communities. I do not blame our local councillors at North Yorkshire County Council for coming up with these difficult library proposals, but come May I will no longer be voting Conservative. I just love my community and my country too much. UKIP will take my vote.&#34;","2015/04/when-librarians-should-fear-the-quiet.html"]]