[["Bath and North East Somerset","Tue, 07 Feb 2017 21:10:52 +0000","Bath and North East Somerset – Bath protesters gather outside Moorland Road Library against B&NES Council plans – Bath Chronicle. &#34;Speaking outside the Moorland Road library yesterday, campaigner Claire Crestani said: &#34;We really want to know what the plans are. We haven’t really been told. &#34;It seems the council are the ones making the decisions to cut the libraries before asking us what we want. &#34;This is all cloak and dagger stuff, they are not being transparent. The council are not working with the community.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Birmingham","Tue, 07 Feb 2017 21:10:52 +0000","Birmingham – New plans to save two Birmingham libraries – BBC News. &#34;The new proposal will see staffing reduce from &#34;112 to 99 full-time equivalents,&#34; which is up from the 88 initially proposed. However, Birchfield library will open for 21 hours rather than 35 while the Glebe Farm opening hours will go up from 15 to 21 per week. The Labour-run city council said Sutton Coldfield Library would remain open whilst the authority, the town council, the Library Lobby campaign group and other organisations &#34;work together to see if a long-term sustainable partnership solution can be established&#34;.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Birmingham","Tue, 07 Feb 2017 21:10:52 +0000","Birmingham – Revised library plans set for approval – Birmingham Newsroom. &#34;Revised proposals for the future of Birmingham’s Community Library service have been drawn up following feedback from citizens during a recent 12-week period of public consultation. Initial plans for a three-tiered service (with opening hours and staff support reduced in tiers 2 and 3) were put forward as part of the council’s effort to respond to reduced funding from central government and would have seen the libraries at Aston and Sutton closed – reducing annual expenditure by £1.9million by 2018/19. However, comments and feedback along with potentially up to £150,000 in a one-off funding pledge from Sutton Coldfield Town Council have helped the city council refine its plans all within the reduced finances, the highlights of which are as follows…&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Birmingham","Tue, 07 Feb 2017 21:10:52 +0000","Birmingham – Sutton Coldfield Library handed reprieve as Birmingham City Council announces revised plans – Sutton Coldfield Observer. &#34;Following a 12-week consultation, the authority confirmed Sutton Library at the Red Rose Centre will remain open and it will be ‘business as usual’ in the Red Rose Centre ‘while the city council, town council, the Library Lobby campaign group and other organisations work together to see if a long-term sustainable partnership solution can be established for the service’.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Birmingham","Tue, 07 Feb 2017 21:10:52 +0000","Birmingham – Why two Birmingham libraries have been saved but a third is in the firing line – Birmingham Mail. &#34;Plans to shut Aston Library have now been dropped entirely and Sutton Coldfield Library has been given a stay of execution until the end of August while talks to secure its long term future carry on. &#34; … &#34;Meanwhile the Kents Moat Library off The Meadway in Garretts Green will be closed and services transferred to the nearby Glebe Farm Farm library. More than 2,000 people responded to plans to restructure Birmingham’s library service and cut £1.9 million from the budget during three months of consultation. The threat to Sutton Coldfield Library prompted a 6,500 name petition and, crucial to its preservation, was a pledge of £150,000 funding from the Sutton Coldfield Town Council to keep it afloat.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Brighton and Hove","Tue, 07 Feb 2017 21:10:52 +0000","Brighton and Hove – £700,000 proposal to replace Saltdean Lido library – ITV News. &#34;Saltdean’s historic Lido may receive up to £700,000 of council funding to be used to replace the public library in the building. Work on the £12 million restoration project is already underway with the pools expected to reopen this summer. The proposal is to be submitted to Brighton and Hove City Council on 9th February. The money would be secured by borrowing and included in the council budget for 2018-19. The money would pay for a temporary facility for library services during the demolition as well as an extension providing permanent facilities. The current restoration will see the main pool and children’s pool renovated along with outdoor landscaping and water heating facilities.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Coventry","Tue, 07 Feb 2017 21:10:52 +0000","Coventry – Macmillan Library Information Service – Coventry Libraries. &#34;Information hubs stocked with Macmillan booklets and CDs have been set up at Central, Foleshill, Tile Hill, Bell Green and Willenhall libraries. Training has also been rolled out to some library staff, so they can signpost people to further support.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Darlington","Tue, 07 Feb 2017 21:10:52 +0000","Darlington – Our Crown Street Library: A Key Part of Darlington’s Identity – YouTube. &#34;Our Crown Street Library: A Key Part of Darlington’s Identity is about what makes Darlington’s central public library unique & irreplaceable &#34;: A presentation showing the importance of the library and the reasons against closing it.","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Devon","Tue, 07 Feb 2017 21:10:52 +0000","Devon – Ottery St Mary Library will move to new home this month – View News. &#34;The building, pictured below, has been significantly refurbished through a partnership with Ottery St Mary Town Council, Devon County Council and Libraries Unlimited. The Friends of Ottery Library have also helped to raise funds to contribute towards the new library furniture. The new library will offer improved accessibility, with step-free access for those with reduced mobility and parents or carers bringing children in pushchairs, as well as providing a bigger and more modern space for new facilities.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Dorset","Tue, 07 Feb 2017 21:10:52 +0000","Dorset – AsOne Theatre is bringing family theatre to Dorset libraries this half-term – Dorset Echo. &#34;AsOne Theatre Company will bring The Fisherman’s Daughter; Part II Jess’s Odyssey to Weymouth Library on Wednesday February 15 at 11am, Bridport Library on Thursday February 16 at 11am and Dorchester Library on Friday February 17 at 11am…&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Haringey","Tue, 07 Feb 2017 21:10:52 +0000","Haringey – Lib Dems in bid to stop Labour’s library cuts – Haringey Liberal Democrats. &#34;Lib Dem opposition councillors have criticised the proposals which are due to save the council £150,000 and said they would keep the library services as they are. The opposition councillors insist that the savings can be made by cutting the bill for very senior staff at the council. An initial draft of Haringey Council’s budget, shows that the Labour Cabinet plan to cut library opening hours in the north London borough. Labour has proposed reducing branch library opening hours down from 58 hours to 36 hours per week. The reduced opening hours will also mean that 6 members of Haringey’s library staff are due to lose their jobs. The Lib Dem councillors have said they will oppose and try to reverse the cuts.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Hounslow","Tue, 07 Feb 2017 21:10:52 +0000","Hounslow – West London libraries embark on new chapters as plans revealed for new locations – Get West London. &#34;&#34;Hounslow Library will move earlier than expected later this year&#34;&#34; … &#34;In Hounslow , plans to move the library into the new civic centre direct from its current home have been shelved. Instead it will move in May to the council’s current HQ in Lampton Road and stay there until both are ready to move into the new building&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Kingston","Tue, 07 Feb 2017 21:10:52 +0000","Kingston – Improvement works begin on £500,000 upgrade at Kingston libraries – Guardian series. &#34;Work has begun to transform all of Kingston’s seven libraries as part of a £500,000 upgrade to install self-service technology and create &#34;flexible community spaces&#34;. Improvement works have almost finished on Kingston Library, which is set to reopen on Monday, February 27. Self-service machines will replace the front desk at all seven libraries, which the council said will free up staff to promote &#34;reading, listening and discovery&#34; services. Councillor Andrea Craig, Cabinet Member for heritage, arts and leisure at Kingston Council, said: &#34;This is a hugely exciting project for the borough and the benefits of this investment will be felt for years to come.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Lambeth","Tue, 07 Feb 2017 21:10:52 +0000","Lambeth – Carnegie Library: As Herne Hill councillors remain silent, Green Party Scott Ainslie offers to speak for campaigners – Brixton Buzz. &#34;This proposal is for a facility that nobody needs or wants. Let’s be clear that the people of Lambeth do not want a gym – they want their library back. This is evident from the 316 objections received in comparison with only 5 letters of support. First of all let’s clarify what is actually at stake. According to the plans, the ground floor would remain in D1 use though a significant amount of it would become a ‘flexible community space’ rather than library space, and it’s not at all clear what that ‘community space’ would be used for. When plans for the Carnegie Library were exhibited last year, both the Council and GLL stated that ground floor space could be used by GLL for exercise classes. Bodypumping is hardly compatible with a quiet library space where people read and study&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Lambeth","Tue, 07 Feb 2017 21:10:52 +0000","Lambeth – Library campaigners to protest at Lambeth’s planning meeting tonight – London News Online. &#34;Campaigners fighting to save Carnegie and Minet libraries, will be  urging Lambeth planners tonight, to refuse permission to GLL, the council’s leisure  centre provider to transform the library into a pay-to-use gym.  They say Lambeth council is planning to spend £4million on turning the two libraries they closed in April last year – Carnegie and Minet – &#34;into unwanted and un-needed gyms&#34; and has recommended that planning permission for Carnegie library is granted.  Opposition from residents and library users continues with more than 300 objections  submitted to the plans, say campaigners.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Plymouth","Tue, 07 Feb 2017 21:10:52 +0000","Plymouth – Colour Our Collections – Plymouth Council. &#34;Have fun colouring these in and share the results with us from 1 to 5 February on social media. Include the hashtag #ColourOurCollections or #ColorOurCollections (use the American spelling of colour to view collections from across the world) and tag us @plymlibraries&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Plymouth","Tue, 07 Feb 2017 21:10:52 +0000","Plymouth – Plymouth headteacher ‘gutted’ at library closure plan – Plymouth Herald. &#34;The headteacher of a city school has spoken out about the planned closure of a local library, saying it would come as a huge blow to younger members of a growing community. Estover Library, situated inside Tor Bridge High School, is on a list of ten &#34;under-used&#34; sites earmarked for closure. Plymouth City Council leases the library from the Tor Bridge Academy Trust, but it could close to the public if the plans go through. Tor Bridge principal Liz Dunstan says she was disappointed by the announcement and contacted the council to find out more.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Suffolk","Tue, 07 Feb 2017 21:10:52 +0000","Suffolk – Councillors urged to ‘put communities first’ and vote down library budget cuts – East Anglian Daily Times. &#34;A thousand adults, including a 101-year-old lifelong library user, have added their names to the document ahead of the council budget being debated on Thursday, February 9. Ms Page said: &#34;People are extraordinarily exercised about this matter. &#34;This is a significant number of signatures, collected over eight days in a town of 7,500 voters – not including a large number of younger users. &#34;I’ll be taking this petition to the council and quoting from the more repeatable comments. I hope councillors will put their communities first. If they don’t, their communities should think long and hard about who they elect.&#34; Since 2012, the day-to-day running of 44 libraries has been conducted by independent provident society, Suffolk Libraries, with the county council remaining the main source of funding. Budgets have since been cut by almost a third – and Suffolk Libraries could face a further £230,000 reduction&#8230;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Swindon","Tue, 07 Feb 2017 21:10:52 +0000","Swindon – Proposal to save eight community libraries starts to take shape – Swindon Advertiser. &#34;Expressions of interest had been received from groups considering ways to support one or two libraries but it did not appear that there was any co-ordinated plan to pool knowledge and resources. But now a proposal has been put forward by the newly formed ‘Community Library Trust’ that hopes to bring eight libraries under the same umbrella in a bid to secure their future. The trust was set up in recent months, initially to protect Covingham and then Liden library.&#34; … &#34;With Swindon Borough Council exploring the option of a trust model for the core five council-funded libraries, the opportunity to assist in establishing a parallel trust for the non-funded community libraries is likely to be of interest&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Warrington","Tue, 07 Feb 2017 21:10:52 +0000","Warrington – Councillors to discuss plans for future of libraries – Warrington Guardian. &#34;The agenda for the meeting includes plans for a working group to be set up to look at library services across the town, two experienced staff members to be appointed and a number of capital investment projects. And lending lockers will be trialled for 12 months in Fairfield and Howley and Westy, where there are currently no libraries. Options for Culcheth, Lymm, Burtonwood, Stockton Heath and Padgate libraries are still under discussion and a decision about the future of each of these sites is expected in the summer.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["West Berkshire","Tue, 07 Feb 2017 21:10:52 +0000","West Berkshire – Future of West Berkshire library service to be decided tonight – Newbury Today. &#34;The future of West Berkshire’s library service is set to be decided tonight with councillors expected to vote for a savings package which will see seven of the district’s libraries retain at least one member of staff, with volunteers expected to step in to fill the void. However, a council report suggests further cuts could take place in the future as the cash-strapped local authority struggles to reach its savings target of £690,000. The decision will be taken at a meeting of the full council tonight.&#34; see also Decision due on future of West Berkshire libraries – ITV News. &#34;Discussions have already been held with Parish Councils and Community groups to collectively think of ways to raise £150,000 to keep services open.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Westminster","Tue, 07 Feb 2017 21:10:52 +0000","Westminster – West London libraries embark on new chapters as plans revealed for new locations – Get West London. &#34;A new Marylebone Library could be based at a Grade II listed leisure centre … Plans have been announced for a new Marylebone Library being given an permanent home in the Grade II listed Seymour Leisure Centre&#34; ,,, &#34;Marylebone Library is subject to consultation and planning and will replace the temporary library, currently located on Beaumont Street following the closure of original facility, at the Old Marylebone Town Hall.&#34;","2017/02/wales-e-resources-and-co-located-gymbraries.html"],["Barking and Dagenham","Sun, 05 Feb 2017 20:47:05 +0000","Barking and Dagenham – Barking Learning Centre – Barking and Dagenham Council.  Centre includes job centre, conference centre, citizen’s advice bureau, digilab, a children’s nursery … and a Spa.","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Bath and North East Somerset","Sun, 05 Feb 2017 20:47:05 +0000","Bath and North East Somerset – B&NES Council says ‘no books being sold as part of Bath Central Library relocation’ – Bath Chronicle. &#34;figures from less than two years ago suggest, across the board, 70 per cent of people use the authority’s libraries to borrow or rent books. The council has also denied it is selling books as part of the move from the Podium into Lewis House on Manvers Street.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Bath and North East Somerset","Sun, 05 Feb 2017 20:47:05 +0000","Bath and North East Somerset – Library protesters to gather outside Bath Guildhall and Moorland Road Library – Bath Chronicle. Includes photographs of local protests of a hundred or more people.","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Bath and North East Somerset","Sun, 05 Feb 2017 20:47:05 +0000","Bath and North East Somerset – Local residents invited to give their views on proposals for Bath’s new modern library – Bath Echo. &#34;Council say the joint library and One Stop Shop in Keynsham is already proving the success of the integrated modern library approach. Because of this, they are planning to move Bath Library to a new, modern, refurbished location opposite the new Bath University innovation and study centre on Manvers Street – close to the rail and bus station, and Southgate shopping Centre. The library is not closing, just moving.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Bath and North East Somerset","Sun, 05 Feb 2017 20:47:05 +0000","Bath and North East Somerset – Protesters ‘ashamed of city’ over plans to move Bath Central Library – Bath Chronicle. &#34;Protesters armed with megaphones and banners took to the street outside the Guildhall to air their views against planned changes to the library service in Bath. Described by one protester as an &#34;oasis of peace,&#34; the current library is set to move into the One Stop Shop next year with the city’s other libraries also likely to be affected by changes to the service. Moving the central facility to Manvers Street will cost more than £2 million of the council’s £6 million modern libraries budget, but from 2020 the move will save Bath and North East Somerset Council £800,000 a year, the authority says.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Bradford","Sun, 05 Feb 2017 20:47:05 +0000","Bradford – Bradford Council warned that funding cuts ‘may lead to closure of some organisations’ – Telegraph and Argus. &#34;… deputy Council leader, Councillor Val Slater, said the authority valued the voluntary and community sector but it was facing increasingly difficult decisions and had already had to cut areas such as PCSO funding, economic development, bin collections, mobile libraries and street lighting. &#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Bristol","Sun, 05 Feb 2017 20:47:05 +0000","Bristol – Clifton ‘library of things’ plan proposed – BBC. &#34;Campaigners want to turn the building, in Clifton, Bristol, into a one-stop shop for a host of everyday items. The Friends of Clifton Centre and Library (FOCCAL) told the Bristol Post the project would benefit people with limited space at home. They hope turning the service into a &#34;library of things&#34; will protect it from future cost-cutting measures. Clifton library – which recently had its hours cut – also hosts craft sessions and relaxation classes. &#34; … &#34;Ms O’Rourke said she also hoped people would volunteer to help run writing workshops, craft classes or just organise board game sessions for the elderly or lonely with cheap tea and coffee for sale.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Bury","Sun, 05 Feb 2017 20:47:05 +0000","Bury – Just 2 choices in consultation over libraries as closures loom – Bury Times. &#34;users and community groups raised concerns at a Bury Council cabinet meeting, as councillors passed a motion to cement plans to close the majority of the borough’s libraries. Portfolio holders moved to begin a public consultation period on the proposals for services in Bury. But the public will only be able to have their say on two options — which one member of the public gallery criticised as Hobson’s choice.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Bury","Sun, 05 Feb 2017 20:47:05 +0000","Bury – Public consultation opens on Bury Council’s libraries plan – Bury Times. &#34;… public consultation period on controversial plans to close the majority of libraries in Bury has opened. Residents are invited to have their say on the two options put forward by Bury Council regarding the changes. The options are to substantially reduce the number of library buildings while developing new ways to enhance the overall service, the council says. Under both options, Bury Council proposes to create a ‘core’ team and a ‘community’ team, which would concentrate on developing digital services, information and learning, reader development and working in the community.&#34; [Options are simply on how much to close:, and that down largely  to the survival of one library: &#34;no cuts&#34; is not an option. so it’s debatable if this is an actual consultation – Ed.]","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Cambridgeshire","Sun, 05 Feb 2017 20:47:05 +0000","Cambridgeshire – Council insists there are no plans to close libraries despite rise in use of online services – Hunts Post. &#34;In figures obtained via a Freedom of Information request, The Hunts Post found that between 2013 and 2014, some 166,551 books were loaned from Huntingdon Library. From 2015 to 2016 though, this figure dropped by more than 30,000 books to just 132,709 that year, with picture books the most popular genre to be taken out since 2013 … Despite this, Cambridgeshire County Council, which runs the libraries, says there are no plans to close the buildings and move services totally online. &#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Cambridgeshire","Sun, 05 Feb 2017 20:47:05 +0000","Cambridgeshire – Petition against library spending cuts wins backing of 1,500 residents – Cambridge News. A petition opposing council plans to reduce spending on library books by £325,000 has secured more than 1,500 signatures. Cambridge residents are campaigning to get Cambridgeshire County Council to abandon the cuts to library funding as part of 2017/2018 budget proposals. A full council meeting is due to be held on February 14 where campaigners will challenge the council to reinstate funding for books and newspapers.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Cornwall","Sun, 05 Feb 2017 20:47:05 +0000","Cornwall – Library Data – What Do They Know. Freedom of Information request shows 40% drop in visitor and book issue numbers between 2009/10 and 2014/15, 25% drop in book budget [Not the 45% decline I quoted previously in this post – Ed.].","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Cornwall","Sun, 05 Feb 2017 20:47:05 +0000","Cornwall – Libraries can apply for £1,000 grant – Cornish Times. &#34;With libraries across the county being subjected to funding cuts, RGB Building Supplies is inviting them to apply for £1,000 worth of materials as part of its Well Built Community Fund.  The fund will enable the selected library or learning centre to make improvements they perhaps would not otherwise be able to do. RGB is calling for deserving organisations to get in touch, whatever the need.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Cumbria","Sun, 05 Feb 2017 20:47:05 +0000","Cumbria – Cockermouth Library plans agreed – Times and Star. &#34;Cumbria County Council’s cabinet yesterday agreed to transfer the building to the town council. The existing library staff are  ll leaving, having taken voluntary redundancy, and the town council will move the tourist information centre into the building, with its staff manning both services&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Cumbria","Sun, 05 Feb 2017 20:47:05 +0000","Cumbria – Reshaping the delivery model in Cumbria – Libraries Taskforce. &#34;delivering a library service that is both county-wide yet responsive to local need is challenging. Our solution to this was to reshape Community Services. Back in 2015, we introduced a complete new structure to try to address the practicalities of running a county-wide library and archive service with over 60 library service points (including libraries, library links and book drops) and 4 archive centres within the need to maintain an overall county service.&#34; … &#34;we have created a much more flexible integrated service that not only reflects the county in which we work, but also is really shaped around the communities in which we operate. This hopefully is a strong platform for us to continue to deliver our services from well into the future.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Darlington","Sun, 05 Feb 2017 20:47:05 +0000","Darlington – Library trustees accused of conflict of interest – Northern Echo. &#34;If Darlington Borough Council’s contentious plans to cut and alter the town’s library services are approved, the historic Grade II building will close and some of its resources will be moved to the Dolphin Centre. Following such a decision, the potential fate of the building and what would happen to any proceeds if it is sold, would lie in the hands of trustees – recently identified as members of the council’s own cabinet.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Gateshead","Sun, 05 Feb 2017 20:47:05 +0000","Gateshead – Undercover art project hits the shelves across Gateshead Libraries – Chronicle Live. &#34;A newly-launched project is inviting bookworms on a treasure hunt to uncover some unique artworks hidden on the pages of random books. The novel idea – the first of its kind – has seen eight artists enlisted to create &#34;fore-edge&#34; works. These are books which have been individually decorated so that the outside edge of their pages – which face the back of the bookshelf – form a picture when the book is closed. But the images are covered by gold gilt and only appear – apparently from nowhere – when the book is fanned. Anton Hecht is the artist who came up with the idea, and he is promising an &#34;amazing experience&#34; for visitors to the library in Prince Consort Road.&#34; … &#34;In addition to the eight fore-edge works, three &#34;augmented reality&#34; books can be animated and the title of one of these is given away as Robinson Crusoe.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Haringey","Sun, 05 Feb 2017 20:47:05 +0000","Haringey – Library campaigners in Haringey slam council’s ‘invalid’ consultation – Ham and High. &#34;Library campaigners met outside Muswell Hill Library on Saturday fearing the opening hours across the borough’s libraries will be slashed. They said papers for the public consultation which began on December 19 only arrived in libraries on in the second week of January before a final deadline on January 22. Proposals within Haringey’s budget included slashing opening times from 57 hours to 36 at the library in Queens Avenue. Janet Shapiro, speaking on behalf of the Hornsey Pensioners Action Group (HPAG), said: &#34;I have found out that most libraries did not get the forms for a paper response in December, and most ran out of forms. The consultation is invalidated by this.&#34;. Council says &#34;&#34;While the consultation is promoted heavily online with the vast majority of responses received that way, paper copies of the consultation were available in libraries and as soon as we were aware of one library running out of consultation&#8230;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Herefordshire","Sun, 05 Feb 2017 20:47:05 +0000","Herefordshire – Hereford Library re-opens after long closure – Ledbury Reporter. &#34;The building was closed after asbestos was found on the site during maintenance work in September 2015, but modifications have taken place to modernise the library for its users. There is a suite of new PCs available to use for free and the ceiling has been raised with new lighting. WISH (Wellbeing Information and Signposting for Herefordshire) will also operate from the main library as a shared facility to make the most of the building.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Kirklees","Sun, 05 Feb 2017 20:47:05 +0000","Kirklees – Spare libraries from latest Kirklees cuts plea – Huddersfield Daily Examiner. &#34;Despite a hard fought campaign by book lovers, Kirklees Council slashed the libraries budget from £5.7m to £3.9m in 2016/17. It closed just two of its 26 branches last year but ceased funding a further 14, handing them over to community groups and volunteers to run. But libraries that were saved only a year ago could now be at threat again.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Kirklees","Sun, 05 Feb 2017 20:47:05 +0000","Kirklees – We will work together to cope with library cuts, says Kirklees volunteer – Huddersfield Daily Examiner. &#34;Clr Graham Turner, cabinet member for resources, stressed that all 24 Kirklees libraries continued to be supported by the council with staff and back-office services.&#34; … &#34;Chris Martin, chairman of the Friends of Heckmondwike Library, said: &#34;We are very disappointed to hear the proposal for further huge cuts to the budget for libraries when the library service is still recovering from recent cuts and reorganisation.&#34;&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Leeds","Sun, 05 Feb 2017 20:47:05 +0000","Leeds – Mum’s support for libraries – Yorkshire Evening Post. &#34;Featuring in the latest chapter of the campaign is mum-of-three Kim Wood, who discovered her local library after moving to Leeds seven years ago. With her husband working long hours, and feeling isolated, Kim decided to seek out her nearest library, Oakwood. It has proved to be a real lifeline for her and her three daughters: Sophie, eight; Chloe, six; and Phoebe, four.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Leicester","Sun, 05 Feb 2017 20:47:05 +0000","Leicester – Leicester: libraries fightback – Socialist Party. &#34;But people are fighting back to save our libraries. In late 2016 a vibrant community campaign stopped the threatened closure of the city’s second busiest library, and evidently the taste of victory has inspired others to fight back. Following a recent 100-stong protest, later in the week around 150 people packed a community centre to stop the imminent closure of another local library.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Manchester","Sun, 05 Feb 2017 20:47:05 +0000","Manchester – The Homeless Library exhibition launches at Central Library – Manchester Council. &#34;‘The Homeless Library’, curated by artist Lois Blackburn and poet Philip Davenport of the arts organisation arthur+martha, opened in Central Library’s Archives+ Centre and the Wolfson Reading Room on Tuesday 31 January.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Manchester","Sun, 05 Feb 2017 20:47:05 +0000","Manchester – Live owls are coming to Manchester Central Library this weekend – Manchester Evening News. &#34;They’ll be delivering letters to their handlers once an hour – just like Hedwig did for Harry – at the library’s special event, A Harry Potter Celebration. And the squad chosen to emulate Hedwig’s spellbinding skills is expected to include everything from a White Faced Owl to the grand European Eagle Owl&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Manchester","Sun, 05 Feb 2017 20:47:05 +0000","Manchester – Manchester’s history of Homelessness visited through art – That’s Manchester.","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Norfolk","Sun, 05 Feb 2017 20:47:05 +0000","Norfolk – Top 10 most borrowed books from Norfolk’s libraries revealed – Eastern Daily Press. &#34;In total, Norfolk County Council’s libraries issued more than five million items in 2015/16. While the vast majority of these items were books, e-books, e-audio books, e-magazines, DVDs, CDs and console games are included within that total.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Oldham","Sun, 05 Feb 2017 20:47:05 +0000","Oldham – Library eventwill see Kojey getting loud – Oldham Evening Chronicle. &#34;Kojey Radical (pictured), nominated for two MOBOs last year including best newcomer, will be booking into the venue as part of the Get it Loud in Libraries tour on February 25.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Plymouth","Sun, 05 Feb 2017 20:47:05 +0000","Plymouth – £1.3m plan to knock down library and build an even bigger one – Plymouth Herald. &#34;A popular city library could be rebuilt, sold to a developer and leased back to the council in an ambitious £1.3million overhaul project. If the plan is approved, St Budeaux library…&#34;.  Current building is in a poor condition but is still one of the seven best used and so will not be one of those closes in current round of cuts.","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Plymouth","Sun, 05 Feb 2017 20:47:05 +0000","Plymouth – Could Plymouth’s libraries be saved and handed over to the public? – Plymouth Herald. &#34;Oliver Colvile, Conservative MP for Sutton and Devonport, says he has reservations about the council’s proposal to close ten &#34;under-used&#34; libraries and invest in new technology for the remaining seven.&#34;. Possibility of workforce taking over libraries.","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Plymouth","Sun, 05 Feb 2017 20:47:05 +0000","Plymouth – ‘If the library closes I will be sad’ – Plymouth lad’s emotional plea to council – Plymouth Herald. &#34;The 13-year-old, who cannot be named, is taken to Stoke library once a week where he learns to read and interact with others. He has written a letter to Plymouth City Council about proposals to close the library along with nine others which the authority says are &#34;under-used&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Plymouth","Sun, 05 Feb 2017 20:47:05 +0000","Plymouth – ‘You’re making a terrible mistake&#39;: Latest consultation on council library plans – Plymouth Herald. &#34;More ebooks are borrowed each year than printed books from 10 of our libraries and costs per visit vary from 93 pence to £28.26 so you can see there’s quite a large disparity there to the cost of running our service. We also have thinly spread staff and issues with lone working isolated staff who have to open buildings to cover the hours and some areas not benefiting from services at all.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Sheffield","Sun, 05 Feb 2017 20:47:05 +0000","Sheffield – New library opens – Sheffield Telegraph. &#34;Tinsley Library, hosted by Tinsley Forum in Bawtry Road, becomes the 16th in Sheffield to be run by the community.The 16 libraries were taken out of local authority control in 2014, in an attempt to save £650,000 a year. Tinsley Library closed last year after Sheffield Council’s lease on the previous building expired. The new library will initially open three days a week.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Swindon","Sun, 05 Feb 2017 20:47:05 +0000","Swindon – Libraries are essential – Swindon Advertiser / Letters. &#34;Will we ever beat the evils of isolation, illiteracy, inequality and ignorance? Not if we neglect to defend the town’s library service which was established to combat such horrors. Swindon seems to emulate the example of other authorities that have been noticed by the Minister (Adver 27/01) but whose library services, nevertheless, continue to suffer a relentless demolition. This begs the question as to whether his visit will do no more than postpone a little the day when public libraries, accessible to everyone, are for us no more than a memory. It may still not be too late to challenge the defeatism, philistinism or political jiggery pokery that typify every assault on public library provision.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Walsall","Sun, 05 Feb 2017 20:47:05 +0000","Walsall – Labour council axes nine libraries and blames social care funding pressure – Birmingham Mail. &#34;Over the last 12 months, they have doubled their numbers who use the library. If this well runs library shuts it will see a part of the heart ripped out of Beechdale. Again we see Beechdale in the heart of cuts and funding losses one of the most needed and deprived ward in the borough and it appears that we are to be attacked with loss and closures again.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Walsall","Sun, 05 Feb 2017 20:47:05 +0000","Walsall – Petition to stop multi-million pound library closing – Express and Star. &#34;Pelsall Councillor Gary Perry says ‘it beggars belief’ that the library, which was opened five years ago by Prince Edward, is one of nine in Walsall earmarked for closure under revised cuts by the council. Furious residents in Pelsall have launched a staunch defence of the library, with hundreds signing a petition. As well as being a fairly new library which was opened at vast expense to the council, Pelsall residents also argue that the library’s visitor figures are the highest in the borough apart from the main library in the town centre.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Walsall","Sun, 05 Feb 2017 20:47:05 +0000","Walsall – Pheasey Library axing punishes children and families in Great Barr, says livid councillor – Great Barr Observer. &#34;Children and families, according to Pheasey councillor Christopher Towe, were the biggest losers on Tuesday (January 31) after Walsall Council announced it is to axe Pheasey Library. The &#34;devastating&#34; news comes after council bosses declared draft budget proposals, with the Collingwood Drive-based library among nine that will officially cease from use on June 30, subject to cabinet approval. And Cllr Towe fumed: &#34;I am devastated for the people who value the facility and for those volunteers who have help build it back to a five-day-a-week library.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Walsall","Sun, 05 Feb 2017 20:47:05 +0000","Walsall – Walsall library closures represent sad sign of the times – it’s PlayStations over books – Great Barr Observer / Letters. &#34;… the key here is are libraries used enough on a daily, weekly or monthly basis for the council to keep paying the bills to run them? The majority of children nowadays, especially those of a primary school and early secondary school age, would rather play a game on an iPad or a Kindle than quietly sit and read a book. It’s a sign of the times we’re in – a digital age where the term ‘playing’ means playing on the PlayStation rather than out having a kick about up the park. It’s sad but it’s reality.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Warrington","Sun, 05 Feb 2017 20:47:05 +0000","Warrington – Send us your #LoveMyLibrary selfies to prove you use your library – Warrington Guardian. &#34;National Libraries Day takes place on Saturday and we’re calling on readers to mark the occasion by taking a selfie in one of the town’s libraries. &#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["West Berkshire","Sun, 05 Feb 2017 20:47:05 +0000","West Berkshire – Confusion over parish funding for West Berkshire libraries – Newbury Today. &#34;West Berkshire Council has asked town and parish councils to pay a combined £150,000 to help to keep them open. However, with less than two weeks until the district council makes a decision on the future of its libraries, it has been forced to admit it is unlikely to reach that target. This is because it has been hit with the news that some parishes may not have the legal power to make a financial contribution, following advice issued by The Berkshire Association of Local Councils (BALC). Under the Local Government Act, local authorities – which include parish councils – may only spend money on what they believe will bring direct benefits to their area or to all or some residents. A parish may not incur expenditure, however, unless the direct benefit will be commensurate with the expenditure to be incurred.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Wigan","Sun, 05 Feb 2017 20:47:05 +0000","Wigan – Library consultation draws to a close – Wigan Today. &#34;Council bosses have earmarked making £1.4m worth of savings from its library budget but have vowed not to close any of its current sitesInstead, the town hall is proposing back-office changes – such as the merging of Life Centre and library staff – as a potential cost-saving measure. The transfer of sites to community groups will also be a consideration, officers have previously said&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Worcestershire","Sun, 05 Feb 2017 20:47:05 +0000","Worcestershire – Carers libraries roadshow coming to Bromsgrove – Evesham Journal. &#34;Worcestershire Integrated Carers Hub will hold the roadshow at Bromsgrove Library on Wednesday, February 8, from 9.30am until noon. The event will consist of informal information drop-in sessions for carers to receive information and guidance about support in their caring role.&#34;","2017/02/waterstones-recovery-hints-at-what-libraries-should-do.html"],["Birmingham","Sun, 12 Feb 2017 19:21:26 +0000","Birmingham – Reduced opening hours at Frankley Library confirmed – Bromsgrove Advertiser. Frankley &#34; library has avoided the axe under council plans designed to slash running costs, but has had its reduced opening hours confirmed. As reported by the Advertiser last year, Birmingham City Council drew up plans to close some of the city’s 37 libraries to make savings of £1.9 million per year. Following a 12-week public consultation, Frankley Library has not been closed but has had its opening hours reduced from 22.5 a week to 21, becoming a ‘Tier 2′ library.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Bury","Sun, 12 Feb 2017 19:21:26 +0000","Bury – Public consultation opens on Bury Council’s libraries plan – Bury Times. &#34;Residents are invited to have their say on the two options put forward by Bury Council regarding the changes. The options are to substantially reduce the number of library buildings while developing new ways to enhance the overall service, the council says. Under both options, Bury Council proposes to create a ‘core’ team and a ‘community’ team, which would concentrate on developing digital services, information and learning, reader development and working in the community.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Bury","Sun, 12 Feb 2017 19:21:26 +0000","Bury – Tottington Library closure could put an end to fundraising knitting group – Bury Times. &#34;The library’s ‘Knit and Natter’ group, which meets on Mondays from 2pm to 4pm, raised £300 for Bury Hospice recently. But with the announcement that the library in Market Street will close as part of Bury Council’s shake-up of library services across the borough, members fear they will be left with nowhere to go.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Cambridgeshire","Sun, 12 Feb 2017 19:21:26 +0000","Cambridgeshire – Cambridge Central Library to close for a week as facilities are revamped – Cambridge News. &#34;Cambridge Centre Library is to have a new layout on its first floor – with a new area for young people, and an extension of the children’s library. But it will have to close for a week in March while the improvement work is carried out, Cambridgeshire County Council officials say. The library is the fourth busiest in the country for issuing items, with 700,000 visitors passing through its doors every year&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Darlington","Sun, 12 Feb 2017 19:21:26 +0000","Darlington – Darlington Labour are combining brutal library closures with sky high senior salaries and tax rises – Conservative Way Forward. &#34;One place the money hasn’t been spent is front line services like libraries. Recent data consistently rank Darlington near the very bottom of over 130 local authorities in spending per resident on library services. In 2014/15, 111th out of 132. The previous year Darlington was 126th and the year before that 131st.  Worse, Labour now plan to close the town’s main library and move the books into a leisure centre and a multi storey car park. For the last twelve months, they have been in a heated battle with local residents over these proposals. Until September, they were complacent and refused to listen to local groups and petitions against the decision. But behind the scenes, I engaged with a number of local groups and found a top public law barrister to judicially review the decision. The council delayed their closure as soon as their weak legal position became clear. They now face challenges&#8230;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Darlington","Sun, 12 Feb 2017 19:21:26 +0000","Darlington – Government asked to intervene in Darlington Borough Council’s contentious library plans – Northern Echo. &#34;Darlington-born Conservative politician Peter Cuthbertson has written to the Secretary of State for Culture, Media and Sport requesting a call in of the long-opposed proposals. If approved later this month, Darlington Borough Council’s plans would see the town’s mobile library closed, Cockerton Library handed to volunteers to run and Crown Street Library closed, with the majority of its resources moved to the nearby Dolphin Centre.&#34; … &#34;Mr Cuthbertson, currently councillor for Westminster, said Darlington Borough Council consistently ranked below over 100 local authorities in spending per resident on library services and among the highest in its spend on executive salary. &#34; … &#34;A decisive vote on the future of Darlington’s library services will take place at a meeting of the council on Tuesday, February 28. &#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Devon","Sun, 12 Feb 2017 19:21:26 +0000","Devon – Sidmouth Library -3D printing workshop for children – Fablab Devon. &#34;Fun and exciting workshop for children age 8-16. Learn how to create a keyring using 3D design software then personalise it by adding your name. when you are finished send your design over to the 3D printer to be printed.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Dorset","Sun, 12 Feb 2017 19:21:26 +0000","Dorset – Job Centre, library and day care centre could all be provided from one building – Bournemouth Echo. &#34;It could lead to one public building providing a range of services previously provided by a job centre, library, health body and children’s or day care centre. The Dorset Community Offer for Living and Learning comes amid a massive reduction in government funding for public bodies and a drive for organisations to work together to protect services and find new ways to deliver them.&#34;. Government gives £100k for trial in Blandford, Wareham, Ferndown, Weymouth, Portland and Beaminster. .","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Edinburgh","Sun, 12 Feb 2017 19:21:26 +0000","Edinburgh – Library cutbacks: Council urged to drop plans to reduce library hours – Edinburgh Evening News. &#34;Under the cost-cutting plans, all Edinburgh’s public libraries would be closed on Monday and Wednesday mornings and on Tuesday, Thursday and Friday evenings, and only open on Saturdays from 10am to 2pm.The mobile library service also faces cutbacks when the changes come into effect in April. But council chiefs said unlike some local authorities, they had avoided closing any library completely. The council – which meets tomorrow to set the 2017/18 budget – will have £10 million more than expected to spend next year following the deal between the Greens and the SNP to pass the Scottish Government budget at Holyrood last week. And Edinburgh’s Green councillors say some of that money should be used to reverse the proposed library cuts. &#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Essex","Sun, 12 Feb 2017 19:21:26 +0000","Essex – Children of imprisoned fathers in HMP/YOI Chelmsford benefit from unique library initiative – East Anglia Daily Times. &#34;Red Lion Books in High Street, Colchester, has teamed up with Essex Libraries to donate 500 ex-World Book Day books from its stock for fathers to give their children to encourage reading as part of Family Library Time sessions at HMP/YOI Chelmsford. The sessions offer children the opportunity to visit their fathers and develop their reading skills at the same time. Anne Brown, Essex County Council’s cabinet member responsible for libraries, said: &#34;The sessions offer a less daunting way for children to visit their fathers in prison, away from the large visiting hall.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Essex","Sun, 12 Feb 2017 19:21:26 +0000","Essex – Could you spare 18 hours to help children to read? – Echo Series. Libraries &#34;are once again looking for volunteers aged 14 and above to help children keep reading in the summer holidays during the Summer Reading Challenge. Volunteers will help library staff sign children up to the challenge and talk to children about their books,. Ann Holland, Southend councillor responsible for culture, tourism and the economy, said: &#34;Last year we had 70 fantastic volunteers completing 18, 16.5 hours in six libraries, helping staff deliver another hugely-successful Summer Reading Challenge.&#34; … &#34;Volunteers should be able to commit to a minimum of 18 hours from Saturday, July 22 to Saturday, September 2. &#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Fife","Sun, 12 Feb 2017 19:21:26 +0000","Fife – Fife author shortlisted for literary award – Courier. James Oswald: &#34;He also felt grateful to the public library staff who have supported him, believing they provide an irreplaceable service and benefit to communities across the UK. &#34;I am thrilled to have been nominated for this year’s CWA Dagger in the Library Award. &#34;Unlike other Daggers, this is picked by librarians themselves, and is for a body of work.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Kirklees","Sun, 12 Feb 2017 19:21:26 +0000","Kirklees – £1.6m to be cut from libraries? – Spenborough Guardian. &#34;But after £1.8m was chopped in a previous round of cuts to this service, 16 libraries became volunteer-led and eight suffered reduced hours.Chairwoman of the Friends of Cleckheaton Library, Kay Quantrill, said: &#34;I am deeply concerned that the library service, which is only just recovering from the last significant cut to budget, is again taking a disproportionate hit.&#34;She added: &#34;We have recently, in North Kirklees, lost two museums, and it is a very real fear that if this budget is approved, we will lose libraries as well. Chairman of the Friends of Heckmondwike Library, Chris Martin, said the libraries are still &#34;struggling and regrouping&#34; from previous cuts.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Kirklees","Sun, 12 Feb 2017 19:21:26 +0000","Kirklees – Latest budget cuts to Kirklees: new threat to our library – Friends of Marsden Library. &#34;The Library Service is faced with another reduction in its budget for 2018/19, from £3.9 million to £2.238 million. Help us make representations to the Council at its meeting on 15 February – use the information here to write to or email our Colne Valley Ward Councillors.  Tell them what the Library means to you. These cuts are of such a scale and will leave such a small budget remaining for the whole Library estate that it is difficult to envisage how a service like Marsden Library will continue to be resourced by the Council. Our Library is located in Marsden Mechanics which is subject to an Asset Transfer which should be concluded by the end of this financial year.  From this point forward the Council will no longer pay rent or service charges – making big savings in terms of the provision of the Library Service in Marsden.  We have already seen staffing reduced and the hours cut from 30 hours to 20 hours per week….&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Lambeth","Sun, 12 Feb 2017 19:21:26 +0000","Lambeth – Carnegie library planning go‑ahead– Brixton Blog. &#34;Lambeth council’s planning committee last night backed an application to excavate the basement of the Carnegie library in Herne Hill so that it can be used as a gym run by the council’s leisure provider GLL. Other changes to the building the committee agreed include a new entrance and a reduction in size of the library’s garden. The committee imposed a &#34;specific use condition&#34; on the ground floor to say that its only use must be as a library and &#34;community space&#34;. Campaigners have said that community use of the ground floor, which used to house the regular library, could involve &#34;high impact&#34; exercising and other activities likely to distract from any use as a library.&#34; … &#34;The meeting took place under the eyes of a dozen security officers in high-visibility jackets and three or four police officers. Access was strictly controlled &#34;for health and safety reasons&#34; and bags were searched&#34;.  Green councillor points out &#34;there ha&#8230;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Lancashire","Sun, 12 Feb 2017 19:21:26 +0000","Lancashire – Council tax rise approved – Blackpool Gazette. &#34;Tory councillor Michael Green failed in a bid to persuade the ruling Labour group to reinstate library and bus services affected by cuts when he introduced his party’s alternative budget… The Tory proposals included spending £2.2m on reopening closed libraries, providing £1m in subsidies to retain existing subsidised bus routes and fund more bus services and £1m to provide employment opportunities for young people. Other proposals in the rejected £14m package included cutting the number of vacant posts continuing a subsidy for the Knott End ferry. But his proposals were rebuffed with Liberal Democrat Coun David Whipp saying: &#34;I’ve never seen such extreme Tory fantasy financing.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Leicestershire","Sun, 12 Feb 2017 19:21:26 +0000","Leicestershire – Community library in Quorn opens – Loughborough Echo. &#34;Leicestershire’s latest community partnership library will open today (Wednesday, February 8) at Rawlins Academy campus, when the county council hands over the keys to a local group. Coun Olwen Jones, from the Quorn group, said: &#34;It’s been two years in the planning, but we are delighted that Quorn Community Library opens today (Wednesday), staffed by our fantastic team of local volunteers who care passionately that Quorn deserves to keep its village library. &#34;We would like to thank Rawlins Academy for enabling the library to move to larger premises on campus, and we look forward to being able to offer a programme of events for all ages in the new facility.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Lincolnshire","Sun, 12 Feb 2017 19:21:26 +0000","Lincolnshire – Double celebration for Deeping Library – Rutland and Stamford Mercury. &#34;Deeping Library celebrated its first birthday last week and to mark the occasion, a cake in the shape of books was created by Lilli’s Tea Rooms in Market Deeping.&#34; … &#34;The library co-coordinator, Louisa Crowson, added her pride in being appointed to the role and thanked all those who volunteered to enable the services to run so well.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Lincolnshire","Sun, 12 Feb 2017 19:21:26 +0000","Lincolnshire – Holbeach Library prepped for new chapter in fresh location – Spalding Voice. &#34;Staff and volunteers are busy making final preparations for the reopening of Holbeach Library in a new location on Monday.(Feb 13) The facility, now being run by non-profit organisation Greenwich Leisure Ltd, is part of a £1.2million project by Lincolnshire Co-op to create a community hub at its Fleet Street site. An open plan area also houses a pharmacy and Post Office – both of which will also open on Monday after switching from their current High Street locations.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Newcastle","Sun, 12 Feb 2017 19:21:26 +0000","Newcastle – The neglect of our libraries is a sign that we are failing as a society – Chronicle. &#34;The value of libraries – which are places of learning, discovery, even refuge for some – is impossible to quantify, and we are carelessly throwing them away. Given my belief that libraries are among the greatest achievements of our society, we seem to be failing here in a fairly major way.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["North East Lincolnshire","Sun, 12 Feb 2017 19:21:26 +0000","North East Lincolnshire – More than 3,000 people sign petition to save Cleethorpes Library – Grimsby Telegraph. Library will close and be co-located with tourist information centre.  Council &#34;surprised&#34; by strength of reaction to move as library &#34;will not close&#34;.","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Plymouth","Sun, 12 Feb 2017 19:21:26 +0000","Plymouth – Library closure would ‘devastate’ North Prospect – Herald. &#34;This Saturday, a group of around 20 people turned up at The Beacon in North Prospect to discuss the future of their library inside of the hub which was only built three years ago. Proposed plans to knock down St Budeaux library and spend £1.3million on constructing a larger building in the same spot were met with passionate opposite in the room, with residents questioning why The Beacon and North Prospect Library hadn’t been considered for the same use without needing to spend the phenomenal sum.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Plymouth","Sun, 12 Feb 2017 19:21:26 +0000","Plymouth – Plymouth may owe the Government money if it closes Efford library – Plymouth Herald. &#34;Efford library opened in December 2007, funded by a share of £1.9million from the Building Communities Initiative, part of the South West Regional Development Agency.&#34; The allocated money for 2007 to 2010 was £976,336, which covered road improvements, neighbourhood regeneration and other initiatives. Efford was chosen for the project due to its high levels of social deprivation, crime, unemployment and poor health. &#34; The Royal Marine pub was demolished and replaced with a new building containing residential housing, a new church and new library. Plymouth City Council has now earmarked the library for closure, and there are fears some of the money might have to be given back.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Somerset","Sun, 12 Feb 2017 19:21:26 +0000","Somerset – Bridgwater Library to hold 3D Design and Print Competition – Bridgwater Mercury. &#34;Bridgwater Library is holding a 3D Design and Print competition, launching on Saturday to help provide young people and schools with an opportunity to find out more about 3D printing and design. At the event they can see the 3D printers in action, try out the 3D design software, try out fun tech gadgets and join free workshops happening throughout the day.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Stockton","Sun, 12 Feb 2017 19:21:26 +0000","Stockton – Egglescliffe Library is for sale and set to close at end of March – Northern Echo. &#34;Egglescliffe Library has been put up for sale and it will close as a lending facility at the end of March. &#34;For Sale&#34; signs have now been put up on the library and it is hoped that a buyer will be found soon.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Suffolk","Sun, 12 Feb 2017 19:21:26 +0000","Suffolk – More Conservative cuts for Suffolk’s JAMs – Caroline Page (Lib Dem Councillor). &#34;Amongst the many cuts to this year’s budget,  Suffolk Conservatives proposed a further £230,000 cut to the library service budget . Concerning because since they became IPSs,  our libraries have been well used – and used  for so many purposes –  by readers, reading groups, writing groups, clubs; for old, for young, for retired, employed, unemployed and first job seekers; for AGMs, poetry readings, play performances,  and the ever-popular  reading challenge. I hold my monthly surgery  in Woodbridge Library because it is such a community hub…..&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Swansea","Sun, 12 Feb 2017 19:21:26 +0000","Swansea – Pre-council election row over future of Brynhyfryd Library in Swansea – South Wales Evening Post. Lib Dems accuse Labour of wanting to close Brynhyfyrd Library after May election; Labout accuses Lib Dems of scaremongering. &#34;It follows rumours, they claim, that the conclusions of a review of library services are being kept secret until after the council elections. &#34;The report reputedly suggests the closure of three libraries, including Brynhyfryd, even though that building was refurbished at great expense a few years ago,&#34; said the newsletter&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Telford and Wrekin","Sun, 12 Feb 2017 19:21:26 +0000","Telford and Wrekin – A place free of judgement: New book about this innovative project to be launched with knowledge sharing event –  Arts Connect. &#34;During 2016, Blast Theory and acclaimed author Tony White worked with young people in libraries in Telford and Wrekin, Worcestershire and Staffordshire to reimagine libraries, storytelling and their place in the world. On 29 October 2016, over the course of nine hours from 3pm to midnight, the young people took control of their local libraries, and performed live to a worldwide audience via an interactive live stream. This book is a result of that process.&#34;. Tuesday 21st February.","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Torfaen","Sun, 12 Feb 2017 19:21:26 +0000","Torfaen – Torfaen library services win reprieve – Unison. &#34;Concerted lobbying efforts by UNISON Torfaen County branch have removed the threat of reduced library services across the region this year. Torfaen County Borough councillors were so impressed by the trade union’s campaign and strength of public feeling they reversed a proposed £240,000 cut in the local libraries budget, which would have made fifteen people redundant.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Walsall","Sun, 12 Feb 2017 19:21:26 +0000","Walsall – Walsall library closures: Pelsall protest meeting is packed out as Aldridge gets good news – Express and Star. &#34;Pelsall Library, which was opened five years ago by Prince Edward, is one of nine in the borough earmarked for closure under cuts planned by Walsall Council chiefs.&#34; … &#34;I don’t think I have ever been to a public meeting that has gathered as much support as this. Borrowing books may have reduced but the library is more than a book and that is the message we need to get across.&#34; Residents packed out a public meeting held at Pelsall Village Centre about under-threat Pelsall Library. Chairman for the meeting councillor Marco Longhi stands next to councillor Oliver Bennett The letter, devised by the three ward councillors, suggests that Pelsall Library should be given the same status as district libraries or Streetly Library which now has a ‘hub status’ and is community led. It will be handed to councillors with the petition at a meeting on February 25.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Warrington","Sun, 12 Feb 2017 19:21:26 +0000","Warrington – ‘Doing nothing is not an option’ says councillor responsible for libraries – Warrington Guardian. &#34;Councillor Tony Higgins, executive board member for leisure, community and culture who is responsible for changes to the library service, said he is ‘pleased’ with LiveWire’s recommendations in a report based on the results of a public consultation. He said the council cannot ignore residents’ feelings about the closure of libraries and therefore, if the executive board members agree, LiveWire’s original plans will not go ahead. But he added: &#34;Doing nothing is not an option and we must be realistic about securing a sustainable future for our libraries within the limited resources that we have.&#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["West Berkshire","Sun, 12 Feb 2017 19:21:26 +0000","West Berkshire – West Berkshire library staff face redundancy as cuts package approved – Newbury Today. £580k cut confirmed: paid staffing budget to be halved.","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Wigan","Sun, 12 Feb 2017 19:21:26 +0000","Wigan – Councillor Mark Aldred shelves MP Chris Green’s claims about the future of Atherton Library – Leigh Journal. &#34;After a consultation closed at the weekend seeking residents’ views on how to make the current library service more efficient and effective as Wigan Council looks to make savings of £1.4 million over the next year due to government cuts, MP Chris Green said on his website that ‘it seems we are about to lose’ Atherton Library. &#34;","2017/02/political-games-not-standing-still-and-waving-placards.html"],["Cornwall","Tue, 14 Feb 2017 21:32:28 +0000","Cornwall – Bodmin’s new library now open for business – Cornwall Reports. &#34;Bodmin’s new library has opened, offering a six-day-a-week service. The library re-located from its Victorian-era building in the town centre to the Cornwall Council offices at Chy Trevail, on the former St Lawrence’s hospital site. The new library is open Monday-Friday 8.30am- 5pm, and on Saturdays 10am-1pm. The move has allowed for investment in facilities and books, but some people have complained that the new library cannot easily be reached on foot – and that Chy Trevail lacks adequate car parking. The future of the old library building is uncertain, but now seems likely to be sold.&#34;","2017/02/libraries-offer-futures-and-the-big-issue-is-for-the-future-of-libraries.html"],["Devon","Tue, 14 Feb 2017 21:32:28 +0000","Devon – Going back, when you’ve never been there before: A day on the floor at Exeter Library – Emily J Macaulay.  Exeter Library manager describes her busy day on the front line. &#34;This day didn’t include any challenging interactions, but that was just luck. On an almost daily basis staff will face a difficult situation. Often these are exacerbated by alcohol/drugs but sadly sometimes are people that focus on their &#34;right&#34; to a library service and forget staff are doing their best in the context of wider constraints (such as us not being able to hold a copy of every book in the library, or having an infinite number of PCs).&#34;","2017/02/libraries-offer-futures-and-the-big-issue-is-for-the-future-of-libraries.html"],["Lambeth","Tue, 14 Feb 2017 21:32:28 +0000","Lambeth – Reports round up: activists protest at Labour assault on libraries – Socialist Worker. &#34;More than 100 library campaigners packed a council planning committee meeting in Lambeth, south London, last Tuesday. After sneaking in through the back door to avoid protesters, Labour councillors voted to turn Carnegie Library into a gym at a cost of £3 million. More than 300 objections were filed against the plan. This is part of the Labour council’s attack on the borough’s library service.,,&#34;","2017/02/libraries-offer-futures-and-the-big-issue-is-for-the-future-of-libraries.html"],["Lancashire","Tue, 14 Feb 2017 21:32:28 +0000","Lancashire – Scrutiny called in over book rumours – Lancashire Post. &#34;Despite the County Council insisting books have been put back into the general library system, Coun Barrie Yates has asked the scrutiny committee to look into the matter, after hearing rumours books from Bamber Bridge Library have been destroyed.His worry has been heightened after a Labour County Councillor advocated the cheapest way of dealing with stock was to &#34;get rid&#34;. Labour Councillor Ron Shewan said books would be destroyed by the atmosphere if they were left on shelves in unheated buildings.&#34;","2017/02/libraries-offer-futures-and-the-big-issue-is-for-the-future-of-libraries.html"],["North Yorkshire","Tue, 14 Feb 2017 21:32:28 +0000","North Yorkshire – Library in need of more help – Advertiser. &#34;… countdown has begun for the launch of Helmsley community library, which from April 1 will be run entirely by volunteers. And the steering group behind the project has now putting an urgent call out for extra pairs of helping hands. People in the town are being asked if they can spare a couple of hours – whether it’s weekly, fortnightly or monthly – to help staff the library. Training is provided.. The library will remain open 16.5 hours a week, and will continue to offer a wide range of services and facilities.&#34;","2017/02/libraries-offer-futures-and-the-big-issue-is-for-the-future-of-libraries.html"],["Swansea","Tue, 14 Feb 2017 21:32:28 +0000","Swansea – Staff and residents assured that Brynhyfryd Library in Swansea is not closing – South Wales Evening Post. Council confirms library is safe, pointing out number of feeder schools using it.","2017/02/libraries-offer-futures-and-the-big-issue-is-for-the-future-of-libraries.html"],["Warrington","Tue, 14 Feb 2017 21:32:28 +0000","Warrington – Group considers future of Warrington libraries – Cheshire Today.  &#34;A Working Group with responsibility for defining a new libraries and community learning strategy for Warrington, and for considering future options for library service provision, is to be considered by councillors. The move comes as a result of significant public feedback during the council’s recent consultation on the future of the library service. The consultation, which was run by Livewire on behalf of the council, generated significant community response.&#34; [Translation: poorly managed consultation and proposals met with massive angry public response – Ed.]. … &#34;&#34;At this stage I am pleased to confirm that, subject to the agreement of the executive board, the original proposals will not go ahead in full, but a number of suggestions that were put forward during the consultation process will be explored as part of the next stage of the review.&#34;","2017/02/libraries-offer-futures-and-the-big-issue-is-for-the-future-of-libraries.html"],["Warrington","Tue, 14 Feb 2017 21:32:28 +0000","Warrington – Library campaigners cautiously welcome new plans – Warrington Guardian. &#34;The protestors cautiously welcomed the report and plans for a working group to have a ‘fresh look’ at the town’s libraries. They also welcomed the appointment of a board member and senior strategic lead with experience working in libraries. Dina Kingsnorth-Baird, from the group, said: &#34;When the plans to decimate our libraries came out last year, we called on the council to bin the proposals and start again, and this week they appear to be doing just that. They are also taking very long overdue steps to improve LiveWire’s understanding of libraries. In itself, this is a victory for the people of the town who made their voices heard.&#34;","2017/02/libraries-offer-futures-and-the-big-issue-is-for-the-future-of-libraries.html"],["Bath and North East Somerset","Thu, 16 Feb 2017 21:47:46 +0000","Bath and North East Somerset – Bath and North East Somerset Council will consult over Bath Central Library move – Bath Chronicle. &#34;The local authority has said the suggestion of a Bath Central Library move to Manvers Street was a done deal was &#34;premature&#34;. Last week, Bath and North East Somerset Council received a letter from the campaign group Save Bath Library which threatened legal action. At the budget meeting on Tuesday (February 14) the council said this was &#34;premature&#34; and behind the scenes legal advisers had already responded to the campaigners.&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Bath and North East Somerset","Thu, 16 Feb 2017 21:47:46 +0000","Bath and North East Somerset – Director Ken Loach joins hundreds in Bath library move plan protest – BBC News. &#34;Hundreds of protesters, including film director Ken Loach, gathered in Bath to demonstrate against plans to move the city’s central library. Bath and North East Somerset Council is considering the move in an attempt to save £800,000 a year. However, campaigners say the new base would be smaller and not meet demand. Mr Loach said the library was a &#34;big feature in the centre of Bath&#34; and putting it somewhere &#34;less accessible&#34; was a &#34;bad sign&#34;. &#34;The library is very well-used… [and] really expresses something of the community of the city which is hard to find now,&#34; the Bath-based film director said.&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Bath and North East Somerset","Thu, 16 Feb 2017 21:47:46 +0000","Bath and North East Somerset – Hundreds protest in defence of Bath’s library service outside B&NES budget meeting – Bath Chronicle. &#34;A large group of protesters gathered outside the Guildhall last night (February 14) as city councillors voted on the 2017/18 budget. Detailed within Bath and North East Somerset Council‘s three year plans are savings to scrap its £5,000 arts grant and moving library facilities to save £800,000 a year in the long term. Protester Cath Senior, a teacher from Bath, said: &#34;We don’t support any of the cuts. I don’t support the library moving into a smaller place that is less accessible to a lot of people in Bath. I’m opposing these cuts to the arts and the park and ride proposal on Bathampton Meadows&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Bath and North East Somerset","Thu, 16 Feb 2017 21:47:46 +0000","Bath and North East Somerset – Waterloo Road’s new Surgery, Library and Children’s Centre – Journal. &#34;Plans have been unveiled this week for Radstock’s new GP surgery – which will also contain the town’s Library and Children’s Centre. Designs for the health and community development, which will sit on the green site next to Waterloo Road’s Council-owned car park, will be unveiled at a public exhibition on Thursday, 2nd March. The new centre is set to include a GP surgery, pharmacy, the library, health visitors, Children’s Centre and community kitchen.&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Blackpool","Thu, 16 Feb 2017 21:47:46 +0000","Blackpool – Library jobs under threat to save cash – Blackpool Gazette. &#34;The 50 staff working across the town’s eight libraries were called into meetings last week as part of a consultation process.Blackpool Council said it could not say how many jobs might be at risk. It said the restructuring was part of overall savings of £18.7m from this year’s budget, which includes making 80 people redundant with another 70 contracts to end.  Coun Gillian Campbell, deputy leader of Blackpool Council, said: &#34;We are hugely proud of having kept the six libraries that we inherited in 2011 open, and on having re-opened two libraries that the Conservatives wanted to close&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Cornwall","Thu, 16 Feb 2017 21:47:46 +0000","Cornwall – Council to revisit library plans – Bude and Stratton Post. &#34;Camelford Town Council is set to revisit their initial plans regarding the takeover of the town library after the Town Trust raised objection to part of the proposals. At the recent meeting of the town council, mayor Rob Rotchell said he had a conversation with representatives of the Town Trust, who own the town hall/library building, about the council’s ideas of how the library would look when they take over the running of the facility from Cornwall Council…&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Cornwall","Thu, 16 Feb 2017 21:47:46 +0000","Cornwall – Library Data – What Do They Know. Use of Cornish Studies Library have changed from 30712 visitors 2011-12 to 28,579 2015-16.","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Guernsey","Thu, 16 Feb 2017 21:47:46 +0000","Guernsey – Crowd funding appeal to transform Guernsey children’s library – ITV News. &#34;Islanders are being asked to give money to help refurbish Guernsey’s children’s library. £120,000 is needed to transform two rooms at Guille-Allès. A crowd funding appeal has been launched online to help raise the funds.&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Kirklees","Thu, 16 Feb 2017 21:47:46 +0000","Kirklees – Libraries are vital and need to be protected – Spenborough Guardian / Letters. &#34;I am more than unhappy about the proposed cuts to Kirklees libraries outlined recently. The cuts, if approved, allows only £2.2million for all our local libraries.This is not enough money for a service that provides so much to local communities. &#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Lancashire","Thu, 16 Feb 2017 21:47:46 +0000","Lancashire – Report into possible new public sector model for Lancashire published – Lancashire County Council. &#34;The report, produced for the council by professional services firm PwC, suggests how services could work together more efficiently, focusing on individuals and the neighbourhoods they live in, while tackling the financial challenges facing the sector&#34;. No mention of libraries. In the full report, it is stated that the surviving libraries and registrars will be retained by the ouncil &#34;as they are best delivered at county level&#34;.","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Manchester","Thu, 16 Feb 2017 21:47:46 +0000","Manchester – Arcadia Library and Leisure Centre celebrates first birthday with big bash – Manchester City Council. &#34;Levenshulme’s Arcadia Library and Leisure Centre is celebrating its first birthday with a free fun-filled afternoon of crafts, games and exercise for people of all ages.&#34; … &#34;At the library, residents can get creative with Manchester artist Miriam Wild, play bingo, make badges, or have their face painted – and much more.  Visitors will also be able to try out an exercise bike, or have their photos taken in front of a green screen, allowing them to pose as ‘Olympic champions’ in a range of sports…&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Manchester","Thu, 16 Feb 2017 21:47:46 +0000","Manchester – Author and illustrator Nick Sharratt urges dads to play a bigger role in their children’s reading – Manchester Evening News. &#34;Dads are being urged to play a bigger role in their children’s reading – especially if they have a son. Award-winning illustrator and author Nick Sharratt is backing the campaign which comes as research shows fathers have an important impact on their children’s reading behaviours and attitudes, particularly among boys. Nick is supporting a new competition, part of the Read Manchester campaign from Manchester City Council and the National Literacy Trust, calling on dads to share selfies as they read with their children…&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["North Somerset","Thu, 16 Feb 2017 21:47:46 +0000","North Somerset – North Somerset Council spending £800k in cash-saving bid after libraries review – Mercury. &#34;North Somerset Council will spend more than £800,000 on libraries and children’s centres in a bid to save money in the long term following a review of its services.&#34;… &#34;A further £175,000 will be spent on implementing self-service facilities, while £30,000 has been set aside to enhance IT infrastructure. The council hopes the initial investment will save hundreds of thousands of pounds in the coming years due to reduced overheads, with savings of £500,000 forecast by 2019.&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Plymouth","Thu, 16 Feb 2017 21:47:46 +0000","Plymouth – Angry community turns out in force to fight library closure plan – Plymouth Herald. &#34;Angry library users accused council bosses of &#34;ripping the heart out of the community&#34; – Peverall Library users shout &#34;rubbish&#34; and &#34;we don’t believe you&#34; at council officials. &#34;Cllr Glenn Jordan (below), Conservative cabinet member for culture, admitted: &#34;If we close this building the service is not going to be as good. Whatever replaces this would not be as good because it won’t be permanent.&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Plymouth","Thu, 16 Feb 2017 21:47:46 +0000","Plymouth – Comedy writer Armando Iannucci backs Plymouth library campaign – Plymouth Herald. &#34;An award-winning comedy writer and director has lent his support to a campaign to save Plymouth’s libraries. Armando Iannucci, the brains behind The Thick of It, In The Loop and Veep, re-tweeted a message from Plymouth resident Fiona MacLachlan regarding the council’s plan to shut North Prospect library.&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Staffordshire","Thu, 16 Feb 2017 21:47:46 +0000","Staffordshire – Green Party accuses Lichfield MP of insulting thousands who signed library petition – Lichfield Live. Thousands sign petition against library move but Michael Fabricant MP praises it: &#34;Lichfield’s Conservative MP Michael Fabricant said the move was a &#34;win-win&#34; and criticised the way the some elements of the local branch of the Green Party – which led a petition against the move – distributed what he says was incorrect details about the future plans for The Friary site&#34; … &#34;&#34;It is a model for imaginative thinking and I was pleased to raise it in Parliament. Credit where credit is due.&#34;&#34;.  However, Greens say &#34;&#34;The petition was calling for the people of Lichfield to be consulted on the future of their much-loved library. Instead, nearly all of the councillors who spoke completely ignored the content of the petition, and just talked up the move to St Mary’s and what a wonderful idea it was.&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Suffolk","Thu, 16 Feb 2017 21:47:46 +0000","Suffolk – All Suffolk libraries safe for now – but struggling with more spending cuts – East Anglian Daily Times. &#34;ll Suffolk’s 44 libraries should be able to stay open despite a cut in support from the county council, senior staff have said. &#34; But £200k cut still confirmed. &#34;Ms Wheeler said that while the grant cut was challenging, the staff would be working out how to make it work for users. She said: &#34;Now the final decision has been made we will be reviewing how best to run the library service for less money next year and creating a sustainable future for the county’s library service.&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Warrington","Thu, 16 Feb 2017 21:47:46 +0000","Warrington – Focus turns to working group as LiveWire’s library plans approved by councillors – Warrington Guardian. &#34;Livewire’s plans for the future of libraries have been unanimously approved by councillors at an executive board meeting. Following a public consultation last year on proposals to shut nine libraries, the company prepared a report based on residents’ responses, which included scrapping plans to move central library to Golden Square and creating a working group to look at the issue afresh before reporting back in November. And council leader, Cllr Terry O’Neill defended LiveWire’s handling of the process.&#34;.  Group will meet to work out how to keep libraries open with drastically reduced funding.","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["West Berkshire","Thu, 16 Feb 2017 21:47:46 +0000","West Berkshire – West Berkshire to axe half its library staff – BookSeller. &#34;West Berkshire Council has voted to axe almost half of its library staff, with volunteers expected to fill the vacancies, Newbury Today has reported. In a bid to help the council save £580,000 a year, the cuts will see seven of the districts nine libraries manned by a single staff member, who will be supported by volunteers….&#34;","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["West Sussex","Thu, 16 Feb 2017 21:47:46 +0000","West Sussex – Laughter workshops at West Sussex libraries – Chichester Observer. Various workshops and events for health and wellbeing week.","2017/02/the-public-can-be-such-banes-to-council-plans.html"],["Brent","Sun, 19 Feb 2017 19:29:07 +0000","Brent – Kensal Rise newsletter – Kensal Rise Library. Author event with Alan Johnson MP, report on refurbishment, £40k still needed but &#34;The library’s refurbishment is only possible due to our remarkable achievement of raising £160,000 before the deadlines we set ourselves in 2016. All the hard work has paid off and we are grateful for the success of our application for £75,000 to Power To Change and our other awards from the Foyle Foundation, The Garfield Weston Foundation and Brent Council, plus sponsorship from Daniels Estate Agents, an anonymous bequest of £10,000, revenue from our ever popular events – and not least, the generous support of the community.&#34;","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["Buckinghamshire","Sun, 19 Feb 2017 19:29:07 +0000","Buckinghamshire – Our 10 Year Story – Little Chalfont Community Library. &#34; 2006 Buckinghamshire County Council announced the proposed closure of a number of branch libraries, including Little Chalfont.  This was massively opposed by the residents of Little Chalfont who convinced the council that it could be kept open and run by the community at no cost to the Council. The library has now been run as a charity, raising its own funding and staffed entirely by volunteers (the only person who gets paid is the window cleaner) for 10 years. It has gone from strength to strength and by clicking the tabs below, you can see the progress we have made. Of course, none of this could have happened without the continued and generous support from readers, local businesses, council grants and residents. Little Chalfont has much to thank you for.\n​When you’ve taken your stroll down memory lane, don’t forget to check out our vital statistics.&#34;","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["Coventry","Sun, 19 Feb 2017 19:29:07 +0000","Coventry – Coventry libraries to stay open another year as £2.4m council cuts announced – Coventry Telegraph. &#34;Plans to close libraries have been stalled for another year as Coventry City Council announces £2.4m worth of cuts to services that help the city’s most vulnerable. While libraries have been saved for now, funding for youth services and dozens of full-time jobs will be axed if proposals for youth services, children’s centres and libraries are approved on March 7. Around 85 jobs, mostly in children’s centres, are likely to go – but council bosses have pledged to help affected staff by offering early retirement, voluntary redundancy or training options. After the closure of Arena Park library and its relocation to Holbrooks Community Centre, the council has given its reassurance that no other libraries will close for the next 12 months.&#34;","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["Devon","Sun, 19 Feb 2017 19:29:07 +0000","Devon – Date set for sneak preview of new East Devon library – Exeter Express and Echo. &#34;While some communities have lost the libraries, Ottery St Mary is bucking the trend by opening one in the town, and residents are being invited to enjoy a sneak preview inside it. What was previously the NatWest Bank building in the centre of the town has been turned into the first library to be opened by Libraries Unlimited. The new staff and community-owned social enterprise was established last spring with the support of Devon County Council. Its doors will briefly open on Friday, February 24, between 4.30pm and 6pm, for a first-look at its transformation. It will then officially open for business the following day from 10am.&#34;","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["Dudley","Sun, 19 Feb 2017 19:29:07 +0000","Dudley – Exciting times for library mutual – Dudley Council. &#34;Following a competitive process, Greenwich Leisure Limited (GLL) has been chosen as the preferred partner to bring their expertise to Dudley libraries and archives and run our mutual over the next five years. GLL is a charitable social enterprise which is committed to working on behalf of the whole community.  As an employee led mutual it involves staff in decisions about its services.  It has been running leisure and library services since 1993 and currently manages libraries in Wandsworth and Lincolnshire as well as Greenwich Council’s library services. &#34;","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["Haringey","Sun, 19 Feb 2017 19:29:07 +0000","Haringey – Average household council tax bills in Haringey set to rise by £39 – Enfield Gazette and Advertiser. &#34;&#34;We’ve listened closely to what local people have told us, which is why our proposals include a commitment to maintaining current opening hours at our libraries and investment in further library improvements, alongside funding for roads, pavements and leisure,&#34; he added.&#34; £2million investment in libraries, shelving an earlier suggestion to reduce opening hours.","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["Lancashire","Sun, 19 Feb 2017 19:29:07 +0000","Lancashire – Aussie trio bring ‘aural treat’ to latest library music session – Visitor. &#34;Stewart Parsons, from Get It Loud in Libraries (GILIL), said: &#34;Loud In Libraries is delighted to have booked such a hot band for its spiritual home – Lancaster Library. &#34;Only a few remaining tickets are left on sale and the city’s music lovers are in for an aural treat.&#34;&#34;","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["Lewisham","Sun, 19 Feb 2017 19:29:07 +0000","Lewisham – This man is saving London’s ailing libraries from closure – Big Issue. &#34;The Big Issue Group’s social investment arm, helped Eco Communities access finance to transform libraries, cherished public resources, in deprived parts of south London. &#34;Eco Communities is actually run out of my local library in Crofton Park,&#34; says Daniel Wilson-Dodd, head of lending at Big Issue Invest. &#34;The library is helping more people to access knowledge and opportun-ities, as well as a good cup of coffee. It’s also used by lots of different people, from the very young to the very old, across a range of socio-economic backgrounds. It’s great to see the impact of our investment in person.&#34;&#34; … &#34;p and down the UK, social enterprises like Eco Communities have proved themselves shrewd and flexible operators, finding new revenue streams by opening up library spaces to a wider range of outside partners, from housing associations to Citizens Advice bureaus to further education providers.&#34;","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["Liverpool","Sun, 19 Feb 2017 19:29:07 +0000","Liverpool – Budget 2017: 300 jobs to go, 5% council tax rise and libraries under threat – Liverpool Echo. Four libraries under threat for 2019. £1.6m cut proposed for 2018/19. Volunteers may be involved.","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["North Somerset","Sun, 19 Feb 2017 19:29:07 +0000","North Somerset – Nailsea library and college could be sold if services move to Scotch Horn – North Somerset Times.","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["North Yorkshire","Sun, 19 Feb 2017 19:29:07 +0000","North Yorkshire – Town’s cash gift to help library rescue group – Northern Echo. &#34;Town council is handing over £4,000 of taxpayers money to help save the community’s threatened library. Bedale town councillors agreed unanimously to contribute the money requested by volunteers setting up the new community library. They are taking over the running of the library after funding for staff was scrapped by North Yorkshire county council in the face of massive budget cuts. Neighbouring parish councils are also giving money, Aiskew and Leeming Bar £2,000 and Crakehall £500, with further amounts from other villages.&#34;","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["Northamptonshire","Sun, 19 Feb 2017 19:29:07 +0000","Northamptonshire – ‘Work in libraries’ Northamptonshire council staff told – BBC. &#34;Staff at a county council have been told to work either in a library or from home because work to their new headquarters has been delayed. Northamptonshire County Council’s current HQ has been sold. Workers, including social workers, must move out by the end of March but cannot move into the new Angel Square complex in Northampton until a month later. Unison said it was concerned there could be confidentiality issues with staff updating files in libraries.&#34;","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["South Tyneside","Sun, 19 Feb 2017 19:29:07 +0000","South Tyneside – The Word welcomes 88,000 visitors in first two months – Shields Gazette. &#34;The Word – National Centre for the Written Word – welcomed 88,000 visitors in its first two months of operation. Meanwhile, the centre’s website attracted almost 40,000 visits, and 867 new readers joined the library since October – an increase of nearly 400% compared to the same period in the old Central Library.More than 50,000 people have now visited the Ridley Scott exhibition, which was endorsed by the man himself. Sir Ridley said he was ‘proud and humbled’ to be honoured with the exhibition in his home &#34; [Included here as I think I missed this December article at the time – Ed.]","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["Oxfordshire","Sun, 19 Feb 2017 19:29:07 +0000","Oxfordshire – Heralding the Past column by Jackie Smith: A history of Abingdon’s libraries – Oxford Mail.","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["Warrington","Sun, 19 Feb 2017 19:29:07 +0000","Warrington – Trust is lost – Warrington Guardian / Letters. &#34;new report into libraries appears to propose a collection of ad hoc arrangements cobbled together in the face of the public outrage at LiveWire’s closure programme. Let’s not be gulled into believing that the brief details are anything other than the usual soothing noises about possibilities here and there. It’s typical of LiveWire to peddle such stuff in its hurry to distract from its own inability to manage our library service, which is disintegrating before our eyes. Our councillors should treat the cause not the symptoms&#34;","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"],["Wolverhampton","Sun, 19 Feb 2017 19:29:07 +0000","Wolverhampton – Wolverhampton libraries: Bilston could move from 145-year-old home in major shake-up – Express and Star. &#34;A major shake-up of libraries in Wolverhampton has been unveiled with one facing a move from its 145-year-old home and businesses being invited in to four others.&#34; … &#34;The city council has launched a review over its 16 libraries. Bilston library could be relocated from its Grade II listed home in Mount Pleasant to Bilston Town Hall under one proposal put forward. Central library in Wolverhampton will remain with improvements planned inside the building. Other ideas include relocating Low Hill library to Low Hill Community Hub and East Park to an unknown location.&#34;","2017/02/the-good-the-bad-and-the-good-or-bad-haringey-coventry-dudley-liverpool-and-wolverhampton.html"]]