[["Bradford","Sun, 01 Nov 2015 19:26:54 +0000","Bradford – Library set to close and users to be sent elsewhere as lease expires – Telegraph and Argus. &#34;Girlington Library in The Willow Street will close its doors on Thursday at 5.30pm as it lease expires at the end of this year. The space was leased by Bradford Council and it will not be renewed at its current location. People have now been asked to instead use Manningham Library, Carlisle Road, which is less than a mile away, and City Library in Centenary Square. But Bradford Council has held talks with representatives from Girlington Community Centre, Girlington Road, and Toller ward councillors since March this year about transferring the library to its site.&#34;","2015/11/theres-one-mobile-technology-not-doing-so-well.html"],["Dudley","Sun, 01 Nov 2015 19:26:54 +0000","Dudley – &#34;We’re not going to close any library&#34;, Dudley Council cabinet member pledges – Stourbridge News. &#34;Councillor Rachel Harris, the cabinet member responsible for libraries and archives, outlined the authority’s plan to hive off the borough libraries, archives and adult learning service into a new employee-led mutual organisation as its battles against a continued reduction in funding from central government. Cllr Harris told the meeting the plan to have council employees set up a new organisation, separate to the local authority, to deliver the service was vital to avoid library closures while achieving a 33 per cent saving from 2017/18 onwards.&#34;","2015/11/theres-one-mobile-technology-not-doing-so-well.html"],["Hampshire","Sun, 01 Nov 2015 19:26:54 +0000","Hampshire – Uncertain future for libraries in new Hampshire County Council review – Hampshire Chronicle. &#34;A report on reviewing the libraries says that the mobile service, which costs £360,000 a year, could be axed and replaced &#34;with modern alternatives&#34; from 2017. It says that the service costs £360,000 a year and is used by just 2,230 people with demand declining and the vehicles coming to the end of their lives.&#34;","2015/11/theres-one-mobile-technology-not-doing-so-well.html"],["Hertfordshire","Sun, 01 Nov 2015 19:26:54 +0000","Hertfordshire – Hertfordshire becomes the latest council to cut mobile libraries – Independent.  &#34;They marked the occasion with a bittersweet party on the village green. Steve, driver and custodian of the mobile library, was treated to home-made cake and sloe gin by the villagers of Bury Green, Hertfordshire. After choosing from among hundreds of books, children ran around the green while the grown-ups chatted, as they had done every time the mobile library visited – but would do no more. Because on 30 October, faced with central government funding cuts, Hertfordshire County Council closed its mobile library service.&#34; … &#34;At £14 per visit, she said, the mobile library service was relatively expensive. It did not take advantage of &#34;technological advances&#34;.&#34;","2015/11/theres-one-mobile-technology-not-doing-so-well.html"],["Cambridgeshire","Sun, 01 Nov 2015 19:26:54 +0000","Cambridgeshire – MP criticises &#34;cruel and colossal&#34; £120m cuts to County Council – Varsity. &#34;Whilst plans are not finalised, likely targets for savings will be ending the mobile library service and removing funding for school crossing patrols. It is anticipated that the biggest cut, of approximately £10m, will be to the council’s care budget.&#34;","2015/11/theres-one-mobile-technology-not-doing-so-well.html"],["Kirklees","Sun, 01 Nov 2015 19:26:54 +0000","Kirklees – Cabinet made to rethink libraries call – Dewsbury Reporter. &#34;Kirklees Council’s Cabinet has been told to reconsider its decision on the future of libraries in the area. The local authority’s Scrutiny Committee made the call following an intervention by the Liberal Democrat group, who tabled a number of objections to the decision.&#34; … &#34;Although 24 of Kirklees’ 26 libraries will be kept open to the relief of campaign groups, Lib Dem councillors have expressed concern about the impact reduced working hours and increased need for volunteers could have on their long-term futures. Some libraries will become completely staffed by unpaid community volunteers to keep them open.&#34;","2015/11/theres-one-mobile-technology-not-doing-so-well.html"],["Halton","Sun, 01 Nov 2015 19:26:54 +0000","Halton – Talking books service which helps Runcorn and Widnes residents could be withdrawn  – Liverpool Echo. &#34;Halton Council’s executive board have been recommended to approve the phased withdrawal of subscriptions to the service, offered by the Royal National Institute For The Blind (RNIB). A report published prior to the meeting on Thursday, November 5, said that the service’s withdrawal will save £20,000 and contribute to an overall saving of £50,000 to the council’s vision rehabilitation services.&#34;","2015/11/theres-one-mobile-technology-not-doing-so-well.html"],["Lincolnshire","Sun, 01 Nov 2015 19:26:54 +0000","Lincolnshire – New volunteer-run library all set to open in a few days – Sleaford Standard. &#34;The volunteer-run facility will be permanently situated in the Community Rooms in St Andrew’s Street. Previously, the village just had mobile library services. As previously reported, parish councillors successfully bid for a share of funding offered by Lincolnshire County Council in its plan to reshape the library service – giving up smaller libraries to be run by volunteers.&#34;","2015/11/theres-one-mobile-technology-not-doing-so-well.html"],["Walsall","Sun, 01 Nov 2015 19:26:54 +0000","Walsall – Hundreds of jobs to go at Walsall Council, leader warns – Express and Star. &#34;As part of the proposed cuts, seven out of 16 libraries and the mobile library service would shut, with the loss of 13 jobs, as part of plans to save £328,854 next year and £159,058 the year after. Walsall’s decision-making cabinet voted through the financial plan at the meeting on Wednesday night.&#34;","2015/11/theres-one-mobile-technology-not-doing-so-well.html"],["Barnet","Thu, 05 Nov 2015 21:27:08 +0000","Barnet – Second public consultation launched into cuts to Barnet’s libraries – Times Series. &#34;A second public consultation into the future of Barnet’s library service has been launched. Councillors last month voted to keep libraries open, but reduced in size, with 46 per cent of staff axed and four run by volunteers. Opening hours will also be increased through the use of technology and unstaffed hours, but staffed hours will be cut.&#34; … &#34;A final decision will be made in the spring.&#34;","2015/11/libraries-unlimited.html"],["Devon","Thu, 05 Nov 2015 21:27:08 +0000","Devon – Devon libraries to be outsourced to private company owned by staff – Public Sector Executive. &#34;Devon County Council is set to approve the creation of a new private organisation next week (11 November) to run its libraries, to ensure the service remains economically viable. The council’s cabinet will look into final plans for the library service, first agreed by councillors in March, to assess whether services should begin from April 2016. The new company would be a public services mutual, for which the county council would still be responsible. The delivery of services would be commissioned from the new organisation – which will be owned by library staff and the community and managed by a chief executive and board of trustees.&#34; … &#34;Plans to ensure the organisation will remain cost-effective were partly based on similar successful models across the country.&#34;","2015/11/libraries-unlimited.html"],["Stirling","Thu, 05 Nov 2015 21:27:08 +0000","Stirling – Behind the Scenes at the Library: Stirling – Scottish Book Trust. &#34;This month we quiz Stirling Library Service. The service covers a large geographical area both urban and rural and with a population of over 91,000. They have 15 libraries, 2 mobile libraries and 1 unmanned self-issue library and hold an annual Book Festival, ‘Off the Page‘, in May each year plus lots of other events throughout the year. From digital printing to David Tennant, the Stirling service has it all! Read on to discover more…&#34;","2015/11/libraries-unlimited.html"],["Fife","Sun, 08 Nov 2015 21:21:00 +0000","Fife – Communities refuse to close book on library fight – Courier. &#34;campaigners across the kingdom yesterday made sure their voices were heard loud and clear before the deadline. Scottish Liberal Democrat leader Willie Rennie, Mid Scotland and Fife MSP Tricia Marwick and North East Fife MP Stephen Gethins all met young library users in Lundin Links to hear more about the impact any closure will have on the community. Mr Rennie said: &#34;The clear and powerful support exhibited locally must mean that the Trust and the council should change their plans to close the Lundin Links Library. The library matters to the local community – that must count for something.&#34; Mrs Marwick added: &#34;Lundin Links is a great example of a well-run and well-used library and does not meet the criteria listed by Fife Cultural Trust for closure so I would urge both the Trust and Fife Council to think again.&#34;&#34;","2015/11/its-code-green-for-everyone.html"],["Manchester","Sun, 08 Nov 2015 21:21:00 +0000","Manchester – Halle anniversary honoured by Manchester musical institutions at Central Library – Manchester City Council. &#34;A display case has been dedicated to some of Halle’s many letters and ledgers, in honour of the 120th anniversary of the great conductor and pianist’s death on 25 October 1895. &#34;","2015/11/its-code-green-for-everyone.html"],["Brent","Thu, 05 Nov 2015 21:27:08 +0000","Brent – 2nd Annual Mark Twain Lecture – Save Kensal Rise Library (website and press release). &#34;After a five-year battle, residents and campaigners have secured the future of Britain’s most contested public library. The good news is, Kensal Rise Library will re-open next year and most of the ground floor is set aside for community use, rent-free in perpetuity. It will be run by and for the community. Margaret Bailey Chair of the Friends said: &#34;… the Friends of Kensal Rise Library are delighted to announce that they will be hosting a fundraising evening with Melvyn Bragg on Sunday 8 November.  He will be talking about his newly published historical novel, Now is the Time.&#34; see also Kensal Rise library to host fundraiser with Melvyn Bragg – BooKSeller.","2015/11/libraries-unlimited.html"],["Hampshire","Thu, 05 Nov 2015 21:27:08 +0000","Hampshire – Hampshire Library Service consultation – Hampshire County Council. &#34;Hampshire County Council is seeking residents’ views on how Hampshire’s Library Service can be transformed and modernised to meet the changing needs of people in the 21st century. This public consultation invites feedback on proposals set out in the draft Library Strategy which looks to develop a sustainable and vibrant Library Service for people who live, work and study in Hampshire. &#34;","2015/11/libraries-unlimited.html"],["Cambridgeshire","Thu, 05 Nov 2015 21:27:08 +0000","Cambridgeshire – Gritting and mobile libraries are ‘lines in the sand’ for county council’s ‘colossal and cruel’ cuts – Cambridge News. &#34;These two services in particular were highlighted as causes of concern by councillors at Shire Hall as the next phase of austerity got underway yesterday.&#34;","2015/11/libraries-unlimited.html"],["Cornwall","Thu, 05 Nov 2015 21:27:08 +0000","Cornwall – Library services to be devolved in Cornwall – BBC. &#34;Plans to devolve the running of many Cornish libraries have been approved to help save the council £1.8m a year. The running of dozens of libraries and one-stop shops will be handed over to community groups and town councils. Closures cannot be ruled out for libraries which do not have arrangements, Cornwall Council said. Campaigners said the move would lead to a fragmented service with varying levels of staff expertise.&#34; see also Cornwall’s Library Shake-Up – Pirate FM. &#34;Cabinet has approved the three recommendations in the report and the additional Communities Policy Advisory Committee’s recommendation: 1.    Option 1 (Model A – Progress the devolution of the local Library and/or One Stop Shop service, as set out in this report, to those organisations that have expressed an interest) be approved as the primary option to implement. 2.    Option 4 (One Public Estate Job Centre Plus opportunities) is explored in more detail and progressed where possible (alongsi&#8230;","2015/11/libraries-unlimited.html"],["Lewisham","Sun, 08 Nov 2015 21:21:00 +0000","Lewisham – We Must Protect Lewisham’s Library Service – Our Hither Green. &#34;It was with dismay that I read about the proposed plans by Lewisham Council to turn four branch libraries into ‘community led’ libraries. I am vehemently opposed to these plans and I believe that it is crucial that these continue to flourish as public libraries in our borough of Lewisham. I manage a public library in west London with a team of 11 staff and around 8 volunteers. We adore our volunteers, they support us in our activities and enhance our library service – this includes under 5’s singing sessions, homework clubs and our annual reading challenge for kids. However, they cannot be expected to run a library service. The council’s attitude to this is ‘well why not ask volunteers to run the libraries’. There are many good reasons why this is bad for the residents of Lewisham.&#34;","2015/11/its-code-green-for-everyone.html"],["Norfolk","Sun, 08 Nov 2015 21:21:00 +0000","Norfolk – Libraries, museums, arts, records and registration services – Norfolk County Council. £920 spent on technology to allow unstaffed libraries to be open, Millennium Library to be reduced by 2 hours opening per day, £300,000 per year reduction in bookfund (from £1.353m), 1 mobile out of 8 to be lost,","2015/11/its-code-green-for-everyone.html"],["Portsmouth","Sun, 08 Nov 2015 21:21:00 +0000","Portsmouth – Library move may be key to improving North End – Portsmouth News. &#34;Cllr Jones said: ‘We are really keen to try and draw up the business in North End and make sure we have an increased footfall. ‘I’m giving consideration to the library. It’s a very popular library. We really want to expand the IT offering there. ‘So we are looking to see whether we could move the library and create a community hub in the middle of North End and then redevelop the existing site, potentially for residential units.&#34;","2015/11/its-code-green-for-everyone.html"],["Rhondda Cynon Taf","Sun, 08 Nov 2015 21:21:00 +0000","Rhondda Cynon Taf – Medium Term Service Planning: Service Change Proposals – Rhondda Cynon Taf Council. £327k cut: Reduction in number of librarians, branch library opening hours reduced to 31.5 hours per week, single staffing introduced at 5 libraries (Hirwaun, Ferndale, Pontyclun, Mountain Ash, Rhydyfelin), 25% cut to bookfund, 1 out of 4 mobile libraries to be lost, magazines/newspapers reduced, part-time Community Learning Worker lost.","2015/11/its-code-green-for-everyone.html"],["Cambridgeshire","Thu, 05 Nov 2015 21:27:08 +0000","Cambridgeshire – Have your say on ways Cambridgeshire libraries can make money – and stave off the threat of cuts – Cambridge News. &#34;Residents are being urged to help shape income generation ideas for Cambridgeshire libraries by taking part in a public workshop this weekend. Cambridgeshire County Council members and officers will host a workshop to explore and develop income generation ideas for libraries on Saturday, from 11am to 1pm in the conference room on the third floor at Cambridge Central Library.&#34;","2015/11/libraries-unlimited.html"],["Walsall","Thu, 05 Nov 2015 21:27:08 +0000","Walsall – Walsall library staff face axe as council cuts loom – Express and Star. &#34;New technology including self-service machines and a new smart card entry system is planned, meaning less staff will be needed. Walsall Council is looking to axe seven libraries and the mobile library service, along with 13 jobs, as part of plans to save £328,854 next year and £159,058 the year after. And it has now emerged that around £300,000 could be invested into some of the remaining nine libraries to bring in a new management system, allowing visitors to use them when they are unstaffed.&#34;","2015/11/libraries-unlimited.html"],["Devon","Thu, 05 Nov 2015 21:27:08 +0000","Devon – New private Devon library service to get green light – Western Morning News. &#34;The creation of a new mutual organisation to run Devon’s libraries could be given the green light next week. Devon County Council’s Cabinet will consider final plans to establish a new ‘public service mutual’, which will run the library service from next April.&#34; … &#34;The new organisation’s name will be Libraries Unlimited South West, but will continue to operate in Devon as Devon Libraries.&#34; … &#34;The new organisation will form as a company limited by guarantee with charitable status.&#34; … &#34;Julie Dent, chairman of Devon Partnership NHS Trust since March 2013, has been named as chairman of the board&#34;","2015/11/libraries-unlimited.html"],["Carmarthenshire","Sun, 08 Nov 2015 21:21:00 +0000","Carmarthenshire – Libraries break their silence to embrace future -Llanelli Star. &#34;Llanelli Library is the busiest in Wales – with 601,182 books taken out in 2014. According to Women’s Weekly magazine research, the Vaughan Street library is the fourth highest in terms of book loans across the UK. Elsewhere in Wales, Cardiff Central Library made 581, 779 loans in 2014. At the top of the charts is Norfolk and Norwich Millennium Library which issues 1.1 million books a year.&#34; … &#34;Llanelli Star research revealed Eric Carle’s Very Hungry Caterpillar was the most popular book at Llanelli Library, having been loaned 203 times in a year.&#34;","2015/11/its-code-green-for-everyone.html"],["Vale of Glamorgan","Sun, 08 Nov 2015 21:21:00 +0000","Vale of Glamorgan – Save Rhoose Library – Facebook. &#34;The verdict on our case for a judicial review has now been delivered. Unfortunately the judge did not find in our favour. However this is not the end of the story because she has also given us the right to take the case straight to a higher court. Without getting too much into the legal technicalities, the judge ruled that the council did not make a final decision about the library at their meeting in March 2015. Although she found mistakes in their approach (for example the…y didn’t fully consider the effect on elderly and young people) because, in her opinion, they hadn’t yet made a final decision, they still have the ability to put that right. Our legal team has successfully argued that her judgment didn’t take account of some of the arguments made in the hearing. Rather than make another judgment based on the whole of our argument she has given us the right to take this case straight to the Court of Appeal. This is a very unusual situation. So unusual that our solicitor has &#8230;","2015/11/its-code-green-for-everyone.html"],["Hull","Thu, 05 Nov 2015 21:27:08 +0000","Hull – Halloween @Hull Central Library – Storify. Excellent series of zombie related tweets and then videos show how Twitter can bring a library social media account alive.","2015/11/libraries-unlimited.html"],["Lincolnshire","Thu, 05 Nov 2015 21:27:08 +0000","Lincolnshire – No horror show as Crowland hub opens for all – Spalding Today. &#34;Crowland Community Hub chairman Paul Bywater spoke of the many hurdles the steering group had faced over the two years they have fought to save the library building and make it a true facility for the community. He said: &#34;We now want to build on working really well with Crowland Cares and other groups and raising money.&#34;&#34; … &#34;Recently the hub opened a charity shop in the town, Toggs ‘n’ Cloggs, selling clothes to help raise funds to meet the cost of operating the hub. &#34;","2015/11/libraries-unlimited.html"],["Southampton","Thu, 05 Nov 2015 21:27:08 +0000","Southampton – Southampton library closures ‘breach human rights’ of children to education – Southern Daily Echo. &#34;The city council will cease running the five buildings and mobile service next year but council chiefs say they believe groups will come forward to take them on. However campaigners have now called on Secretary of State for Culture, Media and Sport John Whittingdale to intervene, saying the council is breaching its duty to residents by not running the libraries.&#34;","2015/11/libraries-unlimited.html"],["Devon","Sun, 08 Nov 2015 21:21:00 +0000","Devon – Devon Libraries to be privately-owned by library staff – BookSeller. &#34;The company’s official name will be Libraries Unlimited South West but will operate as Devon Libraries. It will legally be a &#34;company limited by guarantee with charitable status&#34;, optimising commercial and charitable benefits – including up to 80% relief on business rates. The council believes the new model will work in a more &#34;dynamic and entrepreneurial&#34; way as the company will be able to apply for grants and funds outside the council’s reach.&#34;","2015/11/its-code-green-for-everyone.html"],["Stockport","Thu, 05 Nov 2015 21:27:08 +0000","Stockport – Plans to ensure the organisation will remain cost-effective were partly based on similar successful models across the country. – Manchester Evening News. &#34;A trial of Scandinavian-style self-service technology has been launched at Bramhall library to see if it helps with extended, unmanned opening hours. The system could be rolled out at 14 other sites in Stockport . Labour asked the borough’s ruling Lib Dem group to offer assurances that the ‘open library’ technology won’t be used to cut staff. But executive member Shan Alexander said she could give no guarantees.&#34;","2015/11/libraries-unlimited.html"],["Manchester","Sun, 08 Nov 2015 21:21:00 +0000","Manchester – Manchester Central Library receives Archive Service Accreditation – Manchester City Council. &#34;An accredited archive service must provide a high level of service to their users, preserve their collections in line with national standards and are robust, sustainable services which plan and deliver ongoing improvement. The National Archive’s accreditation panel noted and praised the transformational nature of change at Manchester Central Library in recent years, specifically in the areas of developing a mass audience able to benefit from the service’s offer, the cultivation of many very positive and effective partnerships and the considerable improvements to long term preservation.&#34;","2015/11/its-code-green-for-everyone.html"],["Suffolk","Thu, 05 Nov 2015 21:27:08 +0000","Suffolk – Major redevelopment could see Needham Market’s library and internet cafe move to middle school – East Anglian Daily Times. &#34;An ambitious vision to relocate a town’s library and create a museum as part of a major redevelopment of a redundant middle school site have been announced&#34; … &#34;Discussions are underway between three groups in Needham Market – the library, internet cafe and museum group – to create a &#34;community hub&#34; at the town’s old middle school. The school shut in the summer as part of a major overhaul of education in Suffolk. Now education bosses at Suffolk County Council have passed the site to its property department as future uses for the land are considered.&#34;","2015/11/libraries-unlimited.html"],["Glasgow","Sun, 08 Nov 2015 21:21:00 +0000","Glasgow – 50 jobs facing axe as Glasgow Life cuts £2.4m – Evening Times. &#34;Staff who work in the communities, libraries and learning teams were called to a briefing in Glasgow city centre to be told the news. &#34; … &#34;Officials said 51 management and supervisory posts would be cut. However, all job losses will be achieved through early retirement or voluntary redundancy.&#34; … &#34;The new structure will see the city’s libraries, learning and community teams into a single unit. &#34; … &#34;The organisation has around 2800 staff with 750 working across libraries, learning and communities. &#34;","2015/11/its-code-green-for-everyone.html"],["Manchester","Sun, 08 Nov 2015 21:21:00 +0000","Manchester – Four year old Noah wins Summer Reading Challenge – Manchester City Council. &#34;Keen reader Noah, aged four, was entered into a prize draw, after successfully completing the challenge by reading six books over the school holiday period. Noah – the youngest ever Summer Reading Challenge prize draw winner – was delighted to win a £100 toy store voucher and a copy of the Guinness World Records book.&#34;","2015/11/its-code-green-for-everyone.html"],["Manchester","Sun, 08 Nov 2015 21:21:00 +0000","Manchester – Manchester start-up hopefuls to take part in nationwide event  – Manchester Evening News. &#34;Manchester entrepreneurs will join hundreds of start-up hopefuls taking part in an event that will be beamed across the UK during Global Entrepreneurship Week later this month. Manchester Central Library in St Peter’s Square, will be one of five venues that will screen the day-long biggest ever StartUp Saturday event on November 21. Small business network Enterprise Nation has teamed up with the British Library to host the live performance at the British Library in London, while candidates in Exeter, Newcastle, Manchester, Barnsley and Leeds will be able to see the live event on the big screen.&#34;","2015/11/its-code-green-for-everyone.html"],["Manchester","Sun, 08 Nov 2015 21:21:00 +0000","Manchester – Simply Singing Flash Mob Manchester Central Library – YouTube. The Simply Singing choir sing &#34;the Rose&#34; to a whole bunch of surprised but delighted library visitors.","2015/11/its-code-green-for-everyone.html"],["Shropshire","Sun, 08 Nov 2015 21:21:00 +0000","Shropshire – Group fears impact of axe on Shropshire’s libraries – Shropshire Star. &#34;&#34;Our libraries are a public asset, not a liability to be disposed of or privatised via a commissioning policy. Driven by qualified management and staff they are multi-use hubs and meeting places offering the key to learning for all ages.&#34; &#34;They provide a cost-effective, value for money service for both Shropshire Council and visitors alike.&#34; The Friends of Bridgnorth Library has urged Shropshire Council’s cabinet to &#34;urgently re-think&#34; the proposal and to openly consult with the public to ensure the long-term future and provision of the service.&#34;","2015/11/its-code-green-for-everyone.html"],["Lambeth","Sun, 08 Nov 2015 21:21:00 +0000","Lambeth – Protestors to march through Brixton in bid to save Lambeth libraries and ‘scary monsters’ – SW Londoner. &#34;The protest, organised by Save Lambeth Libraries, will start at 10.30am in Windrush Square, and protestors will march at 11am to Tate South Library where Cabinet member Cllr Jane Edbrooke will hold a surgery. Hundreds of adults and children are expected to attend with a petition to save Lambeth libraries on change.org having already amassed more than 2,500 signatures.&#34;","2015/11/its-code-green-for-everyone.html"],["Brent","Tue, 10 Nov 2015 20:59:19 +0000","Brent – Lord Melvyn Bragg gives talk at Kensal Green church to raise funds for library campaigners – Brent and Kilburn Times. &#34;The library, in Bathurst Gardens, was opened by Mark Twain in 1900 and donated to All Souls College in Oxford who in turn donated it to Brent Council who handed it back. FKRL had their library listed as an Asset of Community Value (ACV) in 2012, before it was sold by All Souls College to a private developer.&#34;","2015/11/librarylab-open-and-melvyn-bragg.html"],["Neath Port Talbot","Tue, 10 Nov 2015 20:59:19 +0000","Neath Port Talbot – SOS issued over cuts to public services in Neath Port Talbot – South Wales Evening Post. &#34;Trade union Unison has said it will continue to fight against cuts to services, job losses and outsourcing, just weeks after it was revealed that more libraries in Neath Port Talbot are facing closure.&#34;","2015/11/librarylab-open-and-melvyn-bragg.html"],["Ceredigion","Tue, 10 Nov 2015 20:59:19 +0000","Ceredigion – Libraries under threat in major shake-up – Cambrian News. &#34;Three options are due to be put before council Cabinet members today, as part of a planned public consultation before a Cabinet decision. All three proposals include the closure of Llandysul library, but it appears Aberystwyth’s library is safe&#34;","2015/11/librarylab-open-and-melvyn-bragg.html"],["Hertfordshire","Tue, 10 Nov 2015 20:59:19 +0000","Hertfordshire – New chapter for Chorleywood Library… – Hertfordshire.com. &#34;From Monday 9 November, Chorleywood Library will be one of the first libraries in the county to open its doors with volunteers at the helm. More than 100 people have expressed interest in volunteering at the new Community Library, where 60 volunteers have already been trained. The Community Libraries scheme is part of Hertfordshire County Council’s Inspiring Libraries strategy, which aims to deliver a modern service while keeping all 46 library buildings open.&#34;","2015/11/librarylab-open-and-melvyn-bragg.html"],["Lambeth","Tue, 10 Nov 2015 20:59:19 +0000","Lambeth – Hundreds march to save libraries – South London Press. &#34;Campaigners say changes are part of a plan to reduce spending on cultural services by £4million in the next three years. More than 600 campaigners gathered in front of Brixton Library at 10.30am on Saturday, to hear speeches before marching through Stockwell to the Tate South Library in Oval. Laura Swaffield, chairwoman of The Library Campaign, said: &#34;There is no market research and no basic feasibility study for what they want to do. It’s a completely daft plan.&#34;&#34;","2015/11/librarylab-open-and-melvyn-bragg.html"],["Cornwall","Tue, 10 Nov 2015 20:59:19 +0000","Cornwall – &#34;Golden opportunity&#34; on the table to run library services, says council – Western Morning News. &#34;Communities in Cornwall could be running the library services on their own doorstep within months after being offered a &#34;golden opportunity&#34; to take control despite &#34;Draconian cuts.&#34; The futures of up to 27 libraries and one-stop-shops across the whole of the county are up for grabs in a deal aimed at saving £1.8million.&#34; … &#34;Geoff Brown, Cabinet Member for Communities said community groups had enthusiastically embraced the challenge.&#34; … &#34;He also thanks staff working in the libraries during a period which he said they understood was full of uncertainties&#34;","2015/11/librarylab-open-and-melvyn-bragg.html"],["Fife","Tue, 10 Nov 2015 20:59:19 +0000","Fife – Support for Lundin Links library campaigners – Fife Today. &#34;North East Fife MP Stephen Gethins, Willie Rennie, Mid Scotland and Fife MSP and Scottish Liberal Democrats leader, Tricia Marwick, MSP for Mid Fife and Glenrothes, and local councillor David Alexander, met with young library users to hear more about the impact any closure might have on the community, with Fife Council due to announce its decision on December 8.&#34;","2015/11/librarylab-open-and-melvyn-bragg.html"],["Rhondda Cynon Taf","Tue, 10 Nov 2015 20:59:19 +0000","Rhondda Cynon Taf – Library staff could face redundancy in the latest round of RCT council cuts – Wales Online. &#34;Further details about Rhondda Cynon Taf council’s latest £1.1m cuts have been revealed – with 15 staff members facing redundancy in the library service alone. The council’s cabinet members met on Tuesday afternoon over five new groups of cuts – affecting libraries, youth services, bus routes, day nurseries and customer care&#34; … &#34;For libraries, Tuesday’s meeting revealed 20 staff posts could be affected by a loss of pay, while 15 staff could potentially be at the threat of redundancy. Single-staff libraries could be introduced in Hirwaun , Ferndale, Mountain Ash , Pontyclun and Rhydyfelin, while mobile libraries will be reduced from four to three. Spending on magazines and newspapers bought by the libraries could also be reduced, and branch libraries could be reduced to 31.5 hours per week, per library.&#34;","2015/11/librarylab-open-and-melvyn-bragg.html"],["Glasgow","Tue, 10 Nov 2015 20:59:19 +0000","Glasgow – Fifty jobs may go as Glasgow libraries cut £2.4m – BookSeller. &#34;More than 50 jobs may be lost at Glasgow’s libraries after £2.4m worth of cuts have to be made. The Evening Times has reported that the leaders of Glasgow Life, the organisation that manages Glasgow libraries on behalf of Glasgow City Council, have said that consultation with workers and trade unions has started. Altogether 51 management and supervisory posts are set to be cut, although all job losses will be achieved through early retirement or voluntary redundancy, officials have said. Glasgow Life, which needs to save up to £2.4m by 2018, is working to avoid compulsory redundancies, with bosses stressing there will be &#34;no impact on frontline services and no closures planned.&#34;&#34;","2015/11/librarylab-open-and-melvyn-bragg.html"],["Lambeth","Tue, 10 Nov 2015 20:59:19 +0000","Lambeth – Lambeth Council Scrutiny response shows setting up of book-ish gyms will take £1m of funding away from other Lambeth leisure services – Brixton Buzz. &#34;Greenwich Leisure Ltd (GLL) has agreed to a £1m reduction in the management costs for leisure centres in Lambeth to allow the book-ish gyms to open in three libraries in the borough. Brixton Buzz has had access to the answers prepared by the Council ahead of the Scrutiny meeting that takes place at the Lilian Baylis School on Tuesday evening.&#34; … &#34;The papers that Brixton Buzz has seen show that it is a classic case of robbing Peter to pay Paul as part of the re-shuffling of finance within the borough.&#34;","2015/11/librarylab-open-and-melvyn-bragg.html"],["Lambeth","Tue, 10 Nov 2015 20:59:19 +0000","Lambeth – Lambeth library campaigner pens open letter to Cllr Jane Edbrooke addressing her bonkers book-ish gyms – Brixton Buzz. &#34;A Lambeth library campaigner has written an impassioned plea to Cllr Jane Edbrooke about the planned library changes ahead of the Lambeth Council Scrutiny Committee that will be considering the book-ish gyms on Tuesday evening. Robert Gibson, a Friend of Lambeth Libraries & Upper Norwood Library Campaign, has worked tirelessly to help protect Upper Norwood Library. He has had to balance the joint management between a Lambeth Labour Council, and a Conservative Croydon Council. He now finds that his work has been utterly betrayed back in Lambeth with the absolute U-turn following the sham of a Cultural Consultation.&#34;","2015/11/librarylab-open-and-melvyn-bragg.html"],["Vale of Glamorgan","Tue, 10 Nov 2015 20:59:19 +0000","Vale of Glamorgan – Tilley Judgement – High Court of Justice. Full judgement on the Rhoose Library case.","2015/11/librarylab-open-and-melvyn-bragg.html"],["Birmingham","Sun, 15 Nov 2015 19:18:16 +0000","Birmingham – Paris Attacks: Library of Birmingham to be turned red, white and blue from 7pm – Birmingham Mail. &#34;Responding to a question on Twitter about the move, Mr Rogers said: &#34;It’s being sorted as we speak by @cllrholbrook and colleagues at @LibraryofBham #ViveLaFrance #ViveLaParis.&#34; Vigils were due to be held in Trafalgar Square as people in the city came together to mourn those killed and injured in the Paris attacks.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Herefordshire","Sun, 15 Nov 2015 19:18:16 +0000","Herefordshire – Work at Hereford library, including asbestos removal, to cost £1 million – Hereford Times. &#34;cost of removing asbestos and carrying out a backlog of maintenance work at Hereford library will cost £1 million. The Broad Street building has been closed since September when traces of asbestos were discovered&#34; … &#34;The council says the £1 million is outlined in its capital programme with members set to consider if there is an opportunity to use that funding to work with the community on an improved library. Members will also be asked if it wants to hold discussions with representatives of the Hereford Library Users Group &#34;to see if their ambitions for a modern library with a range of other facilities could be realised if there was a wider fundraising campaign&#34;.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Lambeth","Sun, 15 Nov 2015 19:18:16 +0000","Lambeth – Under threat: Carnegie Library to host public meeting, Mon 16 Nov, 6.30pm  – Brixton Buzz. &#34;The event will feature a presentation on the current threats to the Carnegie and all of Lambeth’s libraries and detail an outline of proposals for a suitable alternative.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Lincolnshire","Sun, 15 Nov 2015 19:18:16 +0000","Lincolnshire – Lincolnshire library volunteers open new reading and development centre – Lincolnshire Echo. &#34;The volunteers who stepped in to save Burgh le Marsh’s library are celebrating after officially opening it as a new Reading and Development Centre.&#34; … &#34;Volunteer and secretary Sam Allison, aged 25 and from Foundry Mews in Burgh le Marsh, said it was a huge win for the community, but there were a few final hurdles. &#34;The county council granted it in September and then Burgh Library closed as the library, then we got the go-ahead to move forward. &#34;The library is not called the library any more. As volunteers we can’t use ‘library’ in any statement or name.&#34; … &#34;The volunteers also cannot access personal details due to data protection, so visitors must ring main library services using the centre’s private phone to renew books.&#34;\n\nNottinghamshire – Video: Have your say in how Retford area libraries are run – Retford Times. &#34;Council bosses are launching a new cultural organisation called Inspire to m&#8230;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Blackpool","Sun, 15 Nov 2015 19:18:16 +0000","Blackpool – Blackpool Council reveals plans to cut 250 jobs – BBC. &#34;The Labour-led council is cutting 200 workforce jobs and ending 50 contract posts – it has axed 700 jobs over the past two years.&#34; … &#34;The council is working on the basis it will have to save £20m even though it will not know how much money it will receive from the government until after the Comprehensive Spending Review announcement on 25 November. The final budget decision will take place at a full council meeting on 25 February. It has pledged to keep all eight local libraries, its SureStart Centres, street cleaning and school crossing patrols.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Lancashire","Sun, 15 Nov 2015 19:18:16 +0000","Lancashire – Massive cuts to services by Lancashire County Council – In the Bay. &#34;Lancashire residents are bracing themselves for £66 million worth of cuts to services in the county including buses, highways and libraries. &#34; … &#34;Total library cuts rising to £4.1m and museums and cultural services losing £1.3m from budgets in 2016/17. &#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Brighton and Hove","Sun, 15 Nov 2015 19:18:16 +0000","Brighton and Hove – Privatisation could lead us to a dystopian future – Brighton and Hove Independent. &#34;In our own city, a private finance initiative deal on Jubilee Library has incurred massive costs up to 2028, effectively subsidising the private sector and stymying our ability to support our libraries today.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Staffordshire","Sun, 15 Nov 2015 19:18:16 +0000","Staffordshire – 3D printer brings power of creation to Stafford Library – Express and Star. &#34;Among the various tablets and touchscreen tables at the new £1 million Stafford Library are two Makerbot Replicators. Using one of the £2,500 machines we brought our usually flat Express & Star masthead to life in less than one hour.&#34; … &#34;The library already display’s around a dozen stunning creations. Mr Warren said: &#34;From day one the interest in this has been very high. People are just intrigued about it, they have heard about it but have not had the chance to use it until now. &#34;I must admit I wasn’t sure about it. I thought it was a bit of a fad. But having seen what it is capable of I think this is just the start.&#34;&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Cornwall","Sun, 15 Nov 2015 19:18:16 +0000","Cornwall – Cornwall Councillors to update South East Cornwall residents on libraries and one stop shops review – Cornish Guardian. &#34;Councillors will update on a review into library and one stop shop services in South East Cornwall at a meeting on November 26.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Coventry","Sun, 15 Nov 2015 19:18:16 +0000","Coventry – Revealed: £5m council cuts plan to close public toilets but save libraries – Coventry Telegraph. &#34;the authority is set to abandon its ‘City Centre First’ strategy which would have seen it close every one of more than 100 council-run service centres in the city – including libraries and community centres – and replace them with five regional hubs&#34; … &#34;Revised plans include scrapping the city’s mobile library service, saving £85,000 a year, and all libraries outside the city centre would close on Wednesdays. The city centre library will also close an hour earlier on weekdays.&#34; … &#34;Arena library, in Holbrooks, will move to a new location, saving a whopping £300,000 a year for the council while Willenhall Library will also move to a new location, saving £46,000 a year. There would also be a £100,000 reduction in the council’s annual spend on books and DVDs – taking the figure to £558,000″","2015/11/so-who-was-speaking-up-for-libraries.html"],["Croydon","Sun, 15 Nov 2015 19:18:16 +0000","Croydon – Library campaigners plea for Green candidate’s support over budget concerns – Croydon Advertiser. &#34;Supporters of Upper Norwood library flocked to meet Green Party mayoral candidate Sian Berry on Friday to express their concerns over the library’s future, including the importance of facilities for new parents. Last month, the library – jointly run by Croydon and Lambeth councils – was told its budget could be halved.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["East Riding of Yorkshire","Sun, 15 Nov 2015 19:18:16 +0000","East Riding of Yorkshire – Letter: Libraries may close in the East Riding Council area – Beverley Guardian. &#34;received my first letter headed The Review and the Consultation Period of the East Riding Yorkshire Council Libraries on 16 September. I decided to ring my union – Unison – about the letter received by all library staff on the review of the libraries, which is looking to make savings overall in the council, a saving of £74 million. Unison weren’t too sure why the window was so big between the first consultation letter from 29 September to 21 December. I told them it was to gather the views both from the staff, library users and non-library users. I asked Unison: &#34;I would like to know where I stand as a member of staff.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Fife","Sun, 15 Nov 2015 19:18:16 +0000","Fife – Kinghorn children consulted on library closures – Fife Today. &#34;Youngsters who use the closure threatened Kinghorn library have been asked their views on Fife Cultural Trust’s proposals. Questionnaires specifically designed for children were distributed by Kinghorn councillor Susan Leslie, who realised young library users had not really been included in the consultation process.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Hampshire","Sun, 15 Nov 2015 19:18:16 +0000","Hampshire – Four local libraries under threat of closure as part of council plans to save £1.7m – Basingstoke Gazette. &#34;Mobile library services could be scrapped altogether under the proposals. The council plans to reduce the number of Tier 3 static libraries, which include Overton, Whitchurch, South Ham and Odiham. In its consultation document it states that some may close, while others could transfer to be run by local community groups, which could save from £25,000 to more than £50,000 a year per library.&#34; … &#34;In some Tier 3 libraries that are single staffed, the council is looking to pilot an ‘open library’ approach whereby the library would be unstaffed some of the time but remain open to allow customers to issue or return books using the self-service systems&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Lewisham","Sun, 15 Nov 2015 19:18:16 +0000","Lewisham – Library Consultation – Forest Hill Society Response – Forest Hill Society. &#34;Lewisham Council are consulting over plans to downgrade Forest Hill library, together with Torridon Road, and Manor House libraries to community libraries. You can read and respond to the full proposals here.  The Forest Hill Society is opposed to these changes and you can read our full response here.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Wandsworth","Sun, 15 Nov 2015 19:18:16 +0000","Wandsworth – Allbrook House and Roehampton Library will not be listed as regeneration moves a step closer – This is Local London. &#34;Regeneration work on a Roehampton estate will go ahead, after the Secretary of State refused an application to protect a block of flats. Wandsworth Council intended to work on Allbrook House and Roehampton Library, as part of the Alton area regeneration, but this was delayed because of an application to have the buildings listed for architectural or historic interest. A report by Historic England says the house and library has &#34;poorly resolved urban context&#34; and internally, is dark and unpleasant.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Lewisham","Sun, 15 Nov 2015 19:18:16 +0000","Lewisham – Leading poet calls on town hall to rethink Library plans – South London Press. &#34;Chrissie Gittins, Lewisham’s first honorary writer in residence has spoken of her devastation at plays by council officers to turn Forest Hill, Manor House and Torridon Libraries into community run ventures. If the plans go ahead it would leave just Lewisham, Downham and Deptford Lounge as the only council-run libraries.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Somerset","Sun, 15 Nov 2015 19:18:16 +0000","Somerset – Somerset County Council applies immediate budget freeze – BBC. &#34;The temporary budget freeze affects non-statutory services such as libraries and roads maintenance.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Southampton","Sun, 15 Nov 2015 19:18:16 +0000","Southampton – Library staff ‘feel backed into corner’ – Daily Echo. &#34;With the proposed closure of five Southampton libraries, volunteers have been asked to step in and run the service with very little funding. Despite the city council still being in talks with a number of voluntary groups regarding the planned community libraries, one group believes volunteers will not get the proper support needed to run the service efficiently. Members of the Friends of Cobbett Road Library group believe volunteer groups in libraries are already and would not be able to keep to the high quality of service of professionals employed by the council.&#34; … &#34;The friends group has called for the secretary of state for culture, media and sport John Wittingdale to intervene, saying the council is breaching its duty to residents by not running the libraries.&#34;","2015/11/so-who-was-speaking-up-for-libraries.html"],["Bournemouth","Tue, 17 Nov 2015 21:35:42 +0000","Bournemouth – New location denounced as &#34;death warrant&#34; for library – Daily Echo. &#34;Residents, school children and library supporters at Ensbury Park have rallied to get as many signatures as possible to stop plans to move the services to the Bournemouth Learning Centre at Slades Farm Road&#34; … &#34;&#34;We’re all just doing our bit,&#34; he said. &#34;The council want to move it to Slades Farm; it’s quite remote. There’s no public transport and a lot of older people wouldn’t go there.&#34;&#34; … &#34;The move from the 420 sq ft corner-plot in the heart of the community would be reduced to a 240 sq ft room at the new site,&#34; see also Library move &#34;not the answer&#34; – Bournemouth Echo. &#34;Ensbury Park library is successful because of its ‘high street’ location. Moving it to a ‘hidden’ location – i.e. a room in a shared education building away from residential areas, shops, bus routes and not within walking distance – will simply make the service given by the existing library impossible. &#34;","2015/11/lancashire-go-for-the-record-40-branches-may-be-lost.html"],["Coventry","Tue, 17 Nov 2015 21:35:42 +0000","Coventry – Reaction: Coventry library campaigners hit out at £5m cuts plan – Coventry Telegraph. &#34;Coun David Kershaw, the council’s cabinet member for education, said he believed the cuts would allow all 17 of the city’s libraries to remain open. However, he said there would be changes to the way libraries operate, including more partnership working and increased technology use. Mary Courtney, from the Save Coventry Libraries Campaign, said there were concerns over reduced opening times and a smaller books budget.&#34;","2015/11/lancashire-go-for-the-record-40-branches-may-be-lost.html"],["Devon","Tue, 17 Nov 2015 21:35:42 +0000","Devon – Privately-run Devon libraries plan passed – BookSeller. &#34;The future of 50 Devon libraries was secured last week after council members passed plans to set up a new private organisation owned by staff that will run the library services, Western Morning News has reported. The move to create Libraries Unlimited South West is set to save the authority a future £1.5m in addition to the £3m that has already been saved from its library service budget over the past three years.&#34;","2015/11/lancashire-go-for-the-record-40-branches-may-be-lost.html"],["Herefordshire","Tue, 17 Nov 2015 21:35:42 +0000","Herefordshire – Options for Hereford Library to be debated – Ross Gazette. &#34;This £1 million investment is outlined in the capital programme for the council, however Cabinet will consider if there is an opportunity to use that funding to work with the community on an improved library. It is proposed to hold discussions with representatives of the Hereford Library Users Group to see if their ambitions for a modern library with a range of other facilities could be realised if there was a wider fundraising campaign. &#34;","2015/11/lancashire-go-for-the-record-40-branches-may-be-lost.html"],["Lincolnshire","Tue, 17 Nov 2015 21:35:42 +0000","Lincolnshire – Grantham Journal letter: Please be aware of library cuts – Grantham Journal. &#34;Council Leader Martin Hill should not use local newspapers to mislead taxpayers. The first challenge in July 2014 was lost by LCC, because they had not carried out the public consultation correctly, and were ordered by the Judge to carry out a second consultation last October. The second legal challenge was won by them in July this year. Coun Hill has not informed taxpayers how much their failed legal case cost, nor have the public been informed how much the original consultation exercise cost, which was carried out by Sheffield Hallam University in 2013. The County Council has its own in-house legal department, so why did Couns Hill and Worth get it wrong from the beginning?&#34;","2015/11/lancashire-go-for-the-record-40-branches-may-be-lost.html"],["Denbighshire","Tue, 17 Nov 2015 21:35:42 +0000","Denbighshire – Rhyl library sign change causes concern – News North Wales. &#34;Denbighshire Council has removed signs for the library and replaced them with signage for the building which now includes a One Stop Shop, omitting the word ‘library’. A spokesman for Denbighshire Council said: &#34;Just calling it a library doesn’t reflect the new service. &#34; … Local AM says &#34;&#34;Having recently seen the newly completed library which now accommodates the One Stop Shop, I do feel that the sign should reflect both the library and its new addition rather than focus just on the One Stop Shop.&#34; &#34;","2015/11/lancashire-go-for-the-record-40-branches-may-be-lost.html"],["Greenwich","Tue, 17 Nov 2015 21:35:42 +0000","Greenwich – Proposals to axe a mobile library has opened fears over the loss of services for communities away from town centres – South London Press. &#34;The council has agreed to launch a formal consultation on the future of future of Royal Greenwich’s Library Outreach Service. The service includes the mobile library which stops at 18 locations, six primary schools and 27 nurseries and the home visiting service which calls on the housebound and 33 residential homes.&#34; … &#34;The council is highlighted that the mobile service costs £126,000 a year and this is set to rise next March as a new updated vehicle will be required with a price tag of £160,000″ … &#34;It is being proposed to axe the mobile library and &#34;enhance&#34; the service to vulnerable housebound users by providing them with tablets to allow them to view and choose items from the borough’s full library catalogues. The tablet computers would be purchased by Greenwich Leisure Limited which has the contract to run the borough’s libraries up to 2026.&#34;","2015/11/lancashire-go-for-the-record-40-branches-may-be-lost.html"],["Kirklees","Tue, 17 Nov 2015 21:35:42 +0000","Kirklees – Clarity needed on libraries – Dewsbury Reporter. &#34;Senior Kirklees councillors have been asked to make some parts of its library plan clearer. Kirklees Cabinet will consider a report next week by a scrutiny committee that recommended the council make a clearer definition of &#34;town libraries&#34; and &#34;community libraries&#34; in its overhaul of the service, which will include reduced opening hours and around 100 job cuts.&#34;","2015/11/lancashire-go-for-the-record-40-branches-may-be-lost.html"],["Lambeth","Tue, 17 Nov 2015 21:35:42 +0000","Lambeth – &#34;I beg you not to railroad through these proposals&#34; – News from Crystal Palace. &#34;Tate South Lambeth on South Lambeth Road, Oval is the only library to be nominated for an Accessible Britain Challenge Award in the whole of Britain.  &#34;This is one of the libraries you propose to turn into a gym&#34; Christina Burnett, who heads Vauxhall CIC, a local community interest company, told the meeting. &#34;All our work would stop in 2016. &#34;I beg you not to railroad through these proposals. &#34;They will destroy pioneering and cost-effective work in the community.&#34;&#34;","2015/11/lancashire-go-for-the-record-40-branches-may-be-lost.html"],["Leicestershire","Tue, 17 Nov 2015 21:35:42 +0000","Leicestershire – Campaigners call for Barwell library closure rethink – Nuneaton News. &#34;The group of Liberal Democrat supporters are opposed to moves by cash-strapped Leicestershire County Council to shut the facility in Barwell. The local authority is currently consulting with residents on plans to close the library and instead replace it with an occasional mobile provision. The campaign group, which includes local councillors, says it isn’t good enough and is hoping the Tory administration at County Hall will withdraw the threat and instead continue to fund it and staff it with professional librarians.&#34;","2015/11/lancashire-go-for-the-record-40-branches-may-be-lost.html"],["Lancashire","Tue, 17 Nov 2015 21:35:42 +0000","Lancashire – Huge cuts to Lancashire County Council services announced – Burnley Express. &#34;Hundreds of public sector workers will lose their jobs, rural bus services will cease to exist and libraries and museums will close under county council plans to tackle its multi-million pound funding gap.&#34; …&#34;Reducing the county council’s library network from 74 libraries to 34, to save £7m&#34; see also Lancashire County Council plans job cuts and library closures – BBC.","2015/11/lancashire-go-for-the-record-40-branches-may-be-lost.html"],["Devon","Tue, 24 Nov 2015 21:08:54 +0000","Devon – LARCs are ascending – Tiverton Gazette. Library and Resource Centre Supporters (LARCs) have secured Neil Parrish MP as their patron. Volunteers are looking to raise funds for the library.","2015/11/testing-times.html"],["Hertfordshire","Tue, 24 Nov 2015 21:08:54 +0000","Hertfordshire – Hertfordshire’s first village run library opens in local Pub – Red Lion Weston (press release). Friday 27th November 2015, Hertfordshire’s first volunteer run village library officially opens today in the Red Lion Pub in Weston. Local Weston resident Sarah Bacon gathered support for a new village library after sensing the huge loss that the community would experience following the county-wide closure of the Hertfordshire mobile library service. Commenting on why she wanted to start this service Sarah Bacon said &#34;Quite simply, this was a great opportunity to improve access to books for the whole community&#34;. Villagers have donated a whopping 2000 books to stock the new library and this will be topped up with a generous donation by Hertfordshire County Council from the disbanded mobile libraries. Steve Birch, owner of the Red Lion, provided a separate room for the new library and set about refurbishing it with generous financial support from County Councillor Tony Hunter, District Councillor Steve Jarvis and the l&#8230;","2015/11/testing-times.html"],["Lewisham","Tue, 24 Nov 2015 21:08:54 +0000","Lewisham – Five years into austerity, Britain prepares for more cuts  – Money Market UK. &#34;After laying off nearly half its staff over the last five years, scaling back street cleaning and relying on volunteers to work at some of its libraries, the London borough of Lewisham is getting ready for what could be much more painful spending cuts.&#34;","2015/11/testing-times.html"],["Lincolnshire","Tue, 17 Nov 2015 21:35:42 +0000","Lincolnshire – London organisation could run county’s libraries including Grantham – Grantham Journal. &#34;A London organisation called Greenwich Leisure Limited (GLL) is being recommended to run Grantham library and other major libraries in the county. On December 1, Lincolnshire County Council’s Executive will be asked to take a decision on the future of Lincolnshire’s library services&#34; … &#34;It received six applications, with GLL, Vision and Vivacity being shortlisted. Now, having evaluated the organisations’ final bids, officers are recommending that library services be outsourced to GLL.&#34; … &#34;In the meantime, we continue to work with local groups to get the new community hubs up and running. Eighteen have already opened their doors to the public, with a further 16 on the way.&#34;  see also Remaining 15 Lincolnshire libraries likely to be outsourced – Lincolnite.","2015/11/lancashire-go-for-the-record-40-branches-may-be-lost.html"],["Lincolnshire","Tue, 24 Nov 2015 21:08:54 +0000","Lincolnshire – &#34;Utter disregard for the people of Lincolnshire’s concerns…&#34; – Save Lincolnshire Libraries. &#34;Response by Lincolnshire political figures to the news (November 2015) that county council officers have recommended the Greenwich Leisure Limited (GLL) should be awarded the contract to take over Lincolnshire’s Library Service. &#34; … &#34;So good luck to the selected provider, you have some brilliant professional library staff remaining and some plucky and community focussed volunteers (God bless them) to lead out of the darkness and I sincerely hope you can do it, but the fact you have to do it, is the disgrace","2015/11/testing-times.html"],["Suffolk","Tue, 24 Nov 2015 21:08:54 +0000","Suffolk – Celebrate Newmarket and support the library with 2016 calendar – Cambridge News. &#34;The 2016 calendar has been organised by the Friends of Newmarket Library and shows images of some of the town’s most iconic areas. Rachel Wood, chair of the Friends of Newmarket Library, said: &#34;Our Newmarket Calendar is designed to promote the many different aspects of our fantastic town, as well as raising funds for our library.&#34;","2015/11/testing-times.html"],["Bristol","Sun, 22 Nov 2015 19:32:31 +0000","Bristol – Bristol libraries opening hours to be cut – BBC. &#34;Originally seven libraries were threatened with closure, but following a number of protests elected mayor George Ferguson said he would look again at the proposals. People were asked to choose between two different ways of distributing the opening hours throughout the week and questioned whether they wanted the libraries to be open at the weekend. The council said there was an &#34;overwhelming desire&#34; for branch libraries to be open on Saturday, but added only the Central Library would be open on a Sunday.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Lambeth","Sun, 22 Nov 2015 19:32:31 +0000","Lambeth – Lambeth libraries workers stage unofficial walkout in protest at council cuts – Socialist Worker. &#34;There is no library service in Lambeth today, Wednesday. Staff at all ten libraries across the south London borough have walked out unofficially in protest at the Labour-run council’s cuts plan. &#34;We’ve had enough,&#34; library worker and Unison union member Beatrice told Socialist Worker. &#34;Cuts would go through before we would have time to ballot for industrial action, so we walked. &#34;The council is not listening to us. People expect their taxes to fund services but they are cutting a vital resource.&#34; see also Library staff in walk-out as shelves are stripped of books – Inside Croydon. &#34;Council staff in Lambeth libraries walked out today in protest at plans to close five of that borough’s 10 public libraries, turning some of them into &#34;bookish gyms&#34;, and threatening the future of Upper Norwood Library, which has been run jointly by Croydon Council for more than a century.&#34; see also Lambeth lib&#8230;","2015/11/scotland-edinburgh-and-lambeth.html"],["Lancashire","Sun, 22 Nov 2015 19:32:31 +0000","Lancashire – Decimated: Savage £262m cuts will close half of Lancashire’s libraries – Lancashire Telegraph. &#34;Council leader Jenny Mein has promised the smaller libraries in areas of greatest deprivation such as Central and North Burnley, Nelson and Brierfield, Hyndburn East, Bacup and Colne would be protected if possible along with six mobile units, Unison branch secretary Elaine Cotterell said: &#34;Our cultural services are to be decimated with the proposed closure of 40 libraries and five museums. By 2018, 200 posts in libraries will be lost. &#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Carlisle","Sun, 22 Nov 2015 19:32:31 +0000","Carlisle – Carlisle Library and Prism Arts launch exciting new exhibition – Cumbria Crack. &#34;The Seven Stories exhibition has been created by three local schools and four community groups, including stroke survivors, disabled adults, and people with mental health issues. The artwork is inspired by the library’s wonderful collection of books. From history and travel to ornithology, each group or school has looked to different genres of books for inspiration, creating an exciting library of artwork cascading from the ceiling.  ​To complement the exhibition, the schools, St Bede’s, Longtown and Pennine Way Primaries, have produced a series of short stories and poems.&#34;.  Funded by Arts Council England.","2015/11/scotland-edinburgh-and-lambeth.html"],["Dudley","Sun, 22 Nov 2015 19:32:31 +0000","Dudley – Consultation launched over changes to Dudley libraries, archives and adult learning – Stourbridge News. &#34;Under the new proposal, the services would be run together as a not-for-profit mutual which council chiefs say would be more sustainable, ensure lower running costs, access to new funding and income streams and offer chance to expand the services provided in line with community interest. &#34; … &#34;The authority says the proposed Community Benefit Society model, which would be run by professional staff – with community, employee and council involvement at board level, would ensure all libraries, library links and Dudley’s archive service remain open, albeit with reduced staff time and increased customer self-service. &#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Kirklees","Sun, 22 Nov 2015 19:32:31 +0000","Kirklees – Kirklees libraries plan to go ahead after probe orders only minor changes – Huddersfield Daily Examiner. &#34;The results of the scrutiny probe were sent back to senior councillors on the cabinet. They suggested just minor changes to the opening hours at Birstall and Mirfield. The cabinet approved the revised plan, set to save £1.8m, despite more complaints from protesters and councillors. One campaigner urged the council to use its reserves to keep the status quo. But leader of the council, Clr David Sheard, said: &#34;What would you do when we run out of reserves?&#34;.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Lincolnshire","Sun, 22 Nov 2015 19:32:31 +0000","Lincolnshire – Council bosses reveal top pick to run Lincolnshire libraries – Lincolnshire Echo. &#34;County council officers have revealed which company they would recommend take over Lincolnshire‘s library services. Officials believe Greenwich Leisure Limited (GLL) should be awarded the contract. On December 1, the council’s Executive will be asked to take a decision on the future of Lincolnshire’s library services.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Powys","Sun, 22 Nov 2015 19:32:31 +0000","Powys – Library Service supporting #LoveDigital – Powys Council. &#34;Powys County Council’s Library Service is supporting #LoveDigital Week, which will run from 21-28 November. The campaign brings together all the fantastic digital library services that are available from Welsh libraries. &#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Vale of Glamorgan","Sun, 22 Nov 2015 19:32:31 +0000","Vale of Glamorgan – Library fight goes to Court of Appeal – Barry Gem. &#34;Residents of Rhoose have been told they can appeal after losing the first round of their legal fight against the Vale Council heard in the Court of Appeal.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Cornwall","Sun, 22 Nov 2015 19:32:31 +0000","Cornwall – Launceston Library and One Stop Shop could be combined with adult education to save the services – Cornish Guardian. &#34;&#34;In Launceston, Cornwall Council owns the freehold for the library but the adult education centre is rented at a cost of almost £30,000 per year. It’s used for the equivalent of three-and-a-half days per week, mostly in the evenings, so it would be possible to move the service into the library building without any negative consequences for either – safeguarding the future of both.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Edinburgh","Sun, 22 Nov 2015 19:32:31 +0000","Edinburgh – Services cut as Edinburgh seeks £70m saving – Edinburgh News. &#34;The latest batch of proposals – which will save almost £70 million – also includes withdrawing the night noise team, stopping repair and maintenance of stair lighting in tenements and carrying out a review of libraries.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Lancashire","Sun, 22 Nov 2015 19:32:31 +0000","Lancashire – Join battle to save libraries from the axe – Accrington Observer. &#34;That has left our libraries in Accrington, Oswaldtwistle, Rishton, Great Harwood and Clayton-le-Moors all threatened with closure – with council bosses saying they would keep just one open in Hyndburn to meet its statutory obligations.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Lancashire","Sun, 22 Nov 2015 19:32:31 +0000","Lancashire – Valley united behind our campaign to save facilities – Rossendale Free Press. &#34;Community groups from across the Valley have come together and thrown their support behind the Free Press campaign to save our libraries.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Dudley","Sun, 22 Nov 2015 19:32:31 +0000","Dudley – Dudley Council cuts: Volunteers to run libraries – Express and Star. &#34;A not for profit organisation will be set up next year to save Dudley Council £200,000 a year, it has been revealed. It will involve members of the public taking over the management of the sites. Council chiefs have already announced that opening hours of libraries and the archives service will be slashed as the authority looks to save £20m over three years. The new Community Benefit Society model has been agreed in principle by the council’s cabinet.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Lambeth","Sun, 22 Nov 2015 19:32:31 +0000","Lambeth – £80,000 library appeal launched – How you can help write the next chapter in its history – News from Crystal Palace. &#34;Upper Norwood Library Trust – which will take over the running of the Westow Hill building in April next year – have launched an appeal for funds. The library has funding of £60,000 each from Croydon and Lambeth councils over the next two financial years. &#34;About £80,000 at a minimum would make our current business plan viable&#34; say the trust&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Lambeth","Sun, 22 Nov 2015 19:32:31 +0000","Lambeth – Waterloo Library staff stage walkout over closure plans – London SE1. Sign says &#34;The Library will be closed today as staff have walked out to try and stop our libraries closing forever&#34; … &#34;&#34;I understand the frustrations of those working at our libraries, but this unofficial industrial action is unhelpful and counter-productive,&#34; said Cllr Jane Edbrooke, cabinet member for neighbourhoods.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Fife","Sun, 22 Nov 2015 19:32:31 +0000","Fife – Glenrothes councillors fail to agree with library campaigners – Fife Today. &#34;There were heated exchanges at Wednesday’s Glenrothes area committee when it was asked to agree that the four closures – part of 16 proposed by Fife Cultural Trust (FCT) across the region as part of £800,000 of budget savings being demanded by Fife council – were disproportionate for the town.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Nottinghamshire","Sun, 22 Nov 2015 19:32:31 +0000","Nottinghamshire – Arnold Library ‘officially’ re-opened after £300K refurb – Nottingham Post. &#34;Arnold Library has been ‘officially’ re-opened after a £300,000 refurbishment. Saturday’s ceremony came three months after the Front Street library’s facilities were active again following the revamp, which closed the service since January. The library now boasts £40,000 worth of new books, a gift shop, small cafe and a study section. The building has also benefited from new windows, solar panels and LED lighting throughout. Arnold is the latest library to be redeveloped by Nottinghamshire County Council, which is &#34;modernising&#34; its library service. In the last couple of years, Nottinghamshire County Council has been renovating libraries including Newark, Bingham and Stapleford.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Shropshire","Sun, 22 Nov 2015 19:32:31 +0000","Shropshire – Ellesmere Library will move in to community centre – Shropshire Star. &#34;At a special meeting of Ellesmere Town Council, members voted unanimously in favour of moving the library into the Meres Day Centre, where it would be run by another organisation. The council was responding to a consultation run by Shropshire Council, which asked people to choose between three options for the future of the library – either move to the nearby Meres Day Centre, stay in its current location in Victoria Street but reduce opening hours, or suggest a viable third option that will also save the council £8,830 per year.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Herefordshire","Sun, 22 Nov 2015 19:32:31 +0000","Herefordshire – Campaigners against Ross-on-Wye library closure collect 7,639 signatures – Hereford Times. &#34;Members of the Ross Library Development Group went to Herefordshire Council offices in Plough Lane today to give the petition of 7,639 signatures to council leader, Tony Johnson. The signatures were collected in the streets of Ross and online following the announcement that the council were looking at the possibility of closing the library in Cantilupe Road, as well as Belmont and Leominster.&#34; … &#34;Cllr Johnson said there would be debate in full council. The petition needed 7,000 signatures to prompt a debate. He said: &#34;We are trying to take 45 percent out of our budget. We can’t do that by turning the lights off early but we do appreciate how valuable the libraries are to people. We have also been looking at rural transport, which is the glue that holds a society like ours together.&#34;&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Lambeth","Sun, 22 Nov 2015 19:32:31 +0000","Lambeth – Fury over Lambeth libraries vote – Brixton Blog. &#34;Library campaigners launched a bitter attack on Lambeth Labour councillors yesterday as a full meeting of the council backed plans to turn some libraries into gyms in co-operation with its leisure services provider GLL. On the same day, library staff in Brixton joined a strike by workers across Lambeth to protest at cuts to services. They said they could not put off action as books were already being removed from shelves. The changes, which are part of a plan by Lambeth council to reduce spending on cultural services by £4 million in the next three years, will see an estimated 25% cut in the workforce.&#34; … &#34;There were angry interruptions too as Labour group leader Lib Peck addressed the protesters directly to explain the council’s position. She said the libraries most affected by the changes were those with fewer users and said that services in other larger and more-used libraries had been maintained.&#34; … &#34;Labour councillors applauded her speech as protester&#8230;","2015/11/scotland-edinburgh-and-lambeth.html"],["Lambeth","Sun, 22 Nov 2015 19:32:31 +0000","Lambeth – Opinion: Lambeth Libraries: So much for having a co-operative council – News From Chrystal Palace. &#34;When Lambeth council became a co-operative council it was likened to the hugely successful store chain John Lewis which is, effectively, owned by its own staff. Unfortunately, unlike John Lewis, the people running Lambeth council don’t know what they are doing. Their finances are, clearly, in an absolute mess.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Hertfordshire","Sun, 22 Nov 2015 19:32:31 +0000","Hertfordshire – Community group remains hopeful over fight against move of Buntingford library – Mercury. &#34;A community group fighting against the move of Buntingford’s library feels more positive about its future after a display of sympathy for their case.&#34; … &#34;David Woollcombe, a co-founder of the group, yesterday presented a petition that had received more than 1,300 signatures in favour of keeping the library, and calling for Hertfordshire County Council to cancel plans to relocate it to the fire station site.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Lincolnshire","Sun, 22 Nov 2015 19:32:31 +0000","Lincolnshire – ‘What a waste to go full circle on county libraries’ – Spalding Today. &#34;In April this year, the council started looking for an outside group to run the service and GLL along with Vision and Vivacity were short-listed from six who applied. On Tuesday the council announced its executive will be asked to award the contract to GLL. County council Labour group leader John Hough told the Spalding Guardian: &#34;Conversion on the road to Damascus one always welcomes, but it has been at a cost. We are talking hundreds of thousands of pounds.&#34; Labour’s shadow spokesman on libraries, Coun Phil Dilks from Deeping St James, said GLL originally offered to run the whole service within the reduced budget and without cutting jobs or opening hours&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["Sheffield","Sun, 22 Nov 2015 19:32:31 +0000","Sheffield – Library with ‘sense of place’ thrives – Star. &#34;… all these services are being run not by paid council staff but by a band of 100-plus volunteers, determined to keep their library open after the council decided that it could no longer afford to run the city’s library network. &#34;The library closed on the Saturday at the end of one shift, and opened again run by volunteers on the Monday so it never actually closed, despite what some people think,&#34; explains volunteer co-ordinator Clare Attrill.&#34; … &#34;Between them the volunteers have a range of expertise, and all get stuck into whatever needs doing – working behind the counter, sorting the books, cleaning, running groups, even gardening. And inbetween these jobs, they’ve created a 2016 calendar featuring archive photos and pictures by local artists and schoolchildren.&#34;","2015/11/scotland-edinburgh-and-lambeth.html"],["East Sussex","Tue, 24 Nov 2015 21:08:54 +0000","East Sussex – ‘Transparent’ artwork unveiled at Newhaven Library – Sussex Express. &#34;The final creative touch has been added to Newhaven’s newly refurbished library with the installation of specially commissioned artwork. Artist Zaneta Belasicova worked with the community to create the piece for the rear window of the High Street library after being chosen by a panel of volunteers, including library users.&#34; … &#34;The Newhaven artwork was part of the Transparent art project, funded by the Arts Council England and East Sussex County Council.&#34;","2015/11/testing-times.html"],["Wirral","Tue, 24 Nov 2015 21:08:54 +0000","Wirral – Advertising in One Stop Shops and libraries – Wirral Council. &#34;From less than £2 a day, you can advertise your business to thousands of visitors to Wirral’s One Stop shops and libraries. You have a choice of 4 areas across Wirral. Wirral West, Wirral South, Birkenhead and Wallasey. Each area contains up to 7 screens situated within Wirral Council Libraries and One Stop Shops. You can advertise for 3, 6 or 12 months in one area or a mix of up to 4 areas. Promote your company name, logo and website, highlight a particular service or product or the location of your premises.&#34;","2015/11/testing-times.html"],["Edinburgh","Tue, 24 Nov 2015 21:08:54 +0000","Edinburgh – Craigmillar named among first Reading Communities – Edinburgh Reporter. &#34;Set up by the Scottish Book Trust, special &#34;reading champions&#34; will lead the country’s four Reading Communities and will be tasked with delivering innovative projects with local communities to encourage interest in books from all ages. Claire Askew, a poet, writer and creative writing teacher, has been appointed as Craigmillar’s champion and will take up her post in March next year. Claire said: &#34;I am so pleased to have been selected and I’m especially pleased that I’ll get to work alongside the brilliant team at Craigmillar Library – I can’t wait to get started!&#34;","2015/11/testing-times.html"],["Lancashire","Tue, 24 Nov 2015 21:08:54 +0000","Lancashire – Sign our petition to save Hyndburn’s libraries – Accrington Observer. &#34;Your library needs you! That is the battle cry from the Accrington Observer this week as we launch our campaign to save our libraries from the axe. Libraries across Hyndburn and Rossendale could be shut down as part of severe cuts being proposed by council chiefs.&#34; … &#34;LCC says one library in each of its 12 district council areas would meet its statutory obligations. We say that libraries play a vital role in our communities, from giving people young and old access to books, acting as a community hub and providing community spaces for local groups.&#34;","2015/11/testing-times.html"],["Greenwich","Tue, 24 Nov 2015 21:08:54 +0000","Greenwich – Balham Library is borough’s cultural favourite – GLL (press release). &#34;Balham Library has won Best Local Culture in the Balham neighbourhood in Time Out’s 2015 LoveLondonAwards. The town centre Balham Library is a perennial favourite, drawing in large numbers of visitors throughout the week with a 5% increase in visitors over last year. Residents can choose from story times and baby rhyme times for the kids, homework clubs, beginners’ and advanced English conversation groups, a monthly creative writing workshop, a Golden Years Reading Group and a monthly Urdu reading group.  &#34;","2015/11/testing-times.html"],["Lancashire","Tue, 24 Nov 2015 21:08:54 +0000","Lancashire – Headteacher’s alternative plan to deal with government cuts – Lancashire Evening Post. &#34;A retired Lancashire headmaster, horrified that some 40 libraries and at least five museums could be closed due to lack of funds, is calling on the county council to sell off some of its most precious, but unseen archives&#34; … &#34;He said the suggestion as prompted by a recent lecture in Lancaster City Museum on 74 treasures from the archives: &#34;One we were told was worth $6,000,000 (£4m)in the American market. &#34;Rather than close our libraries and museums, why does Lancashire County Council not sell assets such as this and others, especially ones nobody ever sees or knows about?&#34; see also Lancaster and Morecambe children’s centres, libraries & day care centres hit list – Lancaster Guardian.","2015/11/testing-times.html"],["Newcastle","Tue, 24 Nov 2015 21:08:54 +0000","Newcastle – Save the library, lose the pool: Newcastle finds self-help has its limits as cuts bite – Guardian. &#34;Since March 2013, the Blakelaw neighbourhood centre has been run as a not-for-profit local partnership, raising money and rising to the challenges presented by austerity. When the library that extends off the foyer was threatened with closure, the partnership took over its funding. About six months after Newcastle city council cut all money for youth services, the partnership appointed a full-time youth worker. For all Stockdale’s collectivist passions, if you believe wonders can result from the enforced retreat of the state, what happens here might hint at a positive case study – but scratch the surface and it is a lot more complicated.&#34;","2015/11/testing-times.html"],["Northamptonshire","Tue, 24 Nov 2015 21:08:54 +0000","Northamptonshire – Thieves attempt ‘unsuccessful’ burglary at Northampton Central Library – Northampton Chronicle. &#34;A police spokesman said thieves &#34;unsuccessfully attempted&#34; to steal items from inside the library between 3.45am and 4.30am on Friday, November 20. &#34;","2015/11/testing-times.html"],["Anglesey","Thu, 26 Nov 2015 21:37:31 +0000","Anglesey – Anglesey’s Market Hall revamp poised for go-ahead – Daily Post. &#34;Council planners are expected to approve proposals to transform what was once described as &#34;Wales’s most dilapidated civic building&#34; into a library. Earlier this year, Anglesey Council announced a bid to slap a Compulsory Purchase Order (CPO) on Holyhead’s Market Hall following concerns over its poor condition and the potential for it to collapse unless action was taken.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Hampshire","Thu, 26 Nov 2015 21:37:31 +0000","Hampshire – Hampshire County Council accused of holding ‘phony’ consultation into cuts to library service – News. &#34;‘I don’t think people realise what’s going on. ‘This is supposed to be a consultation, but I think it’s a phony one. ‘One of the problems with the consultation document is it uses fancy words like &#34;transformation&#34; and &#34;vibrant&#34;, but you have got to get to page 15 of the document before you get buried in the small print the word &#34;closures&#34;. ‘Very few parish councils around the county seem to know about it at all, and I don’t think it has been widely publicised.’&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Lincolnshire","Thu, 26 Nov 2015 21:37:31 +0000","Lincolnshire – Councillors make recommendation on who should run Lincolnshire library service – Horncastle News. &#34;Executive member for libraries Nick Worth (Con) said: &#34;All the finalists submitted good bids, but officers believe our best option is to outsource our library services to GLL. We’ve worked hard to get the best possible deal, and are confident that GLL can provide both significant savings and improved performance. &#34;I’m sure the executive will give this matter careful consideration, and take the decision that is in the best interests of taxpayers.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Hampshire","Sun, 29 Nov 2015 17:13:28 +0000","Hampshire – Shock as town’s library could close – Salisbury Journal. &#34;More than 5,700 comments have been left after three weeks of consultation on plans to split libraries into four tiers based on use.&#34; .. &#34;The council has targeted the mobile library service because it is used by an ageing population of 2,230 people – one per cent of Hampshire’s library users. &#34; [NB. article claims book fund would be cut entirely by 2020: this looks like an error – see council strategy paper for true story – Ed.]","2015/11/record-breakers-not-record-breaking.html"],["Worcestershire","Sun, 29 Nov 2015 17:13:28 +0000","Worcestershire – All-new Bromsgrove Library set to open doors tomorrow – Bromsgrove Standard. &#34;The new premises on Stourbridge Road, the former Parkside School site, will open at 9am, about a month behind schedule, thanks to a £6.9million joint enterprise project between Worcestershire County Council and Bromsgrove District Council. The new library will include an online service for free e-books, e-magazines and reference sources like Britannica and the OED. The site will also be used for the Bromsgrove Customer Service Centre, the Registration Service and the JobCentre Plus office.&#34;","2015/11/record-breakers-not-record-breaking.html"],["Barnet","Thu, 26 Nov 2015 21:37:31 +0000","Barnet – Council leader defends approach to outsourcing as union warns 92% of jobs at risk of being farmed out – Times series. &#34;Barnet Unison says 92 per cent of the current council workforce – the equivalent of 1,540 full time posts – face the likelihood of being outsourced. This includes jobs in school catering, the library service, street cleaning and family services.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Cheshire West and Chester","Thu, 26 Nov 2015 21:37:31 +0000","Cheshire West and Chester – Cheshire West and Chester named runner-up at Annual Fairtrade Campaign Award – Cheshire DEC. &#34;We decided to focus on libraries as we knew that there was a significant footfall. We knew that we would reach people who might not otherwise be involved in Fairtrade, or indeed know about it. We got agreement from all 24 libraries in Cheshire West and Chester to put up a display about Fairtrade during February half-term holiday and Fairtrade Fortnight; so a total of three weeks in all. A display like this A1 mounted board was put up in each library. We wanted there to be a new and creative element to the project, so we asked local artist Bee to design a Fairtrade market scene that could be reproduced and used for a colouring competition. The result was a fabulous A4 outline picture for all the libraries to have copies of. In addition to the display and colouring competition, we also provided each library with a fantastic story book; ‘The Banana That Refused To Turn Yellow’, by Rod Brocklehurst. We did this as &#8230;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Isle of Man","Thu, 26 Nov 2015 21:37:31 +0000","Isle of Man – Changes on the cards as library prepares for move – IOM Today. &#34;Revised opening hours may prove a bonus to customers of Douglas’s Henry Bloom Noble Library after its move to new premises in the old Top Shop building, next door to the Co-op on Duke Street. New opening hours have been guided by use patterns which show the library is little used after 5.30pm possibly because people at work visit the library during their lunch hour.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Lambeth","Thu, 26 Nov 2015 21:37:31 +0000","Lambeth – Library consultation ‘fake’ charge campaigners – Brixton Buzz. &#34;Lambeth library campaigners today accused the council of mounting another &#34;fake&#34; consultation and called on respondents to mount a &#34;write in&#34; campaign to thwart it. Edith Holtham, chair of the Friends of Tate South Lambeth Library (TSL) in Stockwell, said the exercise – launched on the day that a judge ruled the council’s Cressingham Gardens consultation unlawful – makes it &#34;almost impossible&#34; for residents to say what they want for the library.&#34; … &#34;Edith Holtham said the questionnaire did not ask the &#34;fundamental&#34; question: &#34;Which of the two libraries do you think should be the town centre library?&#34;.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Lincolnshire","Thu, 26 Nov 2015 21:37:31 +0000","Lincolnshire – Fears for community hub after ‘£10k bill’ – Horncastle News. &#34;Lincolnshire County Council has been accused of &#34;murdering&#34; library services after a community hub surviving on a ‘shoestring’ claims it was slapped with a £10,000 business rates bill. The bill was allegedly handed to Wragby Community Hub – and volunteers who run the facility say its future is now uncertain.&#34; … &#34;LCC county libraries manager Gary Porter said: &#34;The library service used to contribute approximately £8,000 per year to the running costs of the building, which covered our share of the utility bills and business rates. &#34;But we have negotiated this down to £4,000 per year for the new group, which can be easily covered by the £5,167 grant they receive from the council each year.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Manchester","Thu, 26 Nov 2015 21:37:31 +0000","Manchester – Manchester Central Library to be the home of a Google ‘Digital Garage’ – Manchester Evening News. &#34;The pop-up, part of a multi-million pound investment, will employ four experts who will provide one-to-one mentoring support six days a week, and a trainer delivering digital masterclasses. Google is inviting local businesses, start-ups, and anyone interested in a ‘digital tune-up’ to pop in and learn skills needed to grow their business or career.&#34; … &#34;Google bosses said the Digital Garage – the third of its kind – will host bespoke training events for charities, computer science education sessions for local students and teachers, and a range of other events.&#34; … &#34;The Digital Garage is the result of a partnership between Google, Manchester Central Library, Tony Lloyd, Interim Mayor of Greater Manchester, Manchester City Council and Manchester inward investment agency MIDAS.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Edinburgh","Sun, 29 Nov 2015 17:13:28 +0000","Edinburgh – Unions in warnings over Edinburgh council cuts – National. &#34;In the latest report to the city’s finance and resources committee, a whole swathe of cuts – some 73 proposals in all – were revealed. They include reductions in school crossing attendants at lunchtimes, closing down the night noise team, reviewing the future of libraries, and cutting the funding for community policing.&#34;","2015/11/record-breakers-not-record-breaking.html"],["Lambeth","Sun, 29 Nov 2015 17:13:28 +0000","Lambeth – Lambeth Council Cabinet to consider minor tinkerings for bonkers book-ish gyms – Brixton Buzz. &#34;If this all sounds like it is simply procedure and policy, then that is because it is. The many passionate library campaigners around Lambeth still face a considerable struggle if they want to avoid the folly of library-lites.&#34; … &#34;But at least it did show that an element of internal dissent is starting to appear publicly for the first time within the Labour group. &#34;","2015/11/record-breakers-not-record-breaking.html"],["Lancashire","Sun, 29 Nov 2015 17:13:28 +0000","Lancashire – Cuts programme gets green light – but fight to save our libraries goes on  – Accrington Observer. &#34;The fight to save our local services goes on as the county council has approved plans to devastate the county’s libraries. At a meeting of the cabinet, members voted to approve cost cutting proposals, including axing the number of libraries from 74 to 34 to save £7 million, ending the funding for museums and reducing the Highways budget by £2.8 million.&#34;","2015/11/record-breakers-not-record-breaking.html"],["Neath Port Talbot","Sun, 29 Nov 2015 17:13:28 +0000","Neath Port Talbot – Appeal for help over Skewen library closure plans – South Wales Evening Post. &#34;Skewen and Baglan libraries, along with the mobile library service, are facing closure in a bid to save £80,000.&#34;","2015/11/record-breakers-not-record-breaking.html"],["Brighton and Hove","Thu, 26 Nov 2015 21:37:31 +0000","Brighton and Hove – Two Brighton libraries introduce out-of-hours service – BBC. &#34;The trial allows people who have signed up for a special card to use Portslade and Woodingdean libraries. A phone line to a security company will be available in case of emergency and library staff can be contacted via a dedicated helpline. Brighton and Hove City Council said staffing will not be reduced.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Cardiff","Thu, 26 Nov 2015 21:37:31 +0000","Cardiff – Cardiff’s first community partnership hub set to open its doors in Rumney and provide several services under one roof  – Wales Online. &#34;Set up with Communities First, the hub will provide a range of council and partner agency services including library services, advice and benefit services, computers and free telephones, a children’s area, a community room and interview room. The building has been refurbished and redecorated.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Birmingham","Sun, 29 Nov 2015 17:13:28 +0000","Birmingham – Call for moratorium on Central Library demolition – Birmingham Post. &#34;In a letter to this week’s Birmingham Post , a group of signatories have urged the city council and property developer Argent to call a moratorium on the £500 million Paradise development so a fresh application can be lodged to consider the former library for listed status&#34;","2015/11/record-breakers-not-record-breaking.html"],["Coventry","Thu, 26 Nov 2015 21:37:31 +0000","Coventry – Coventry Council set to ponder cuts to city libraries – Coventry Observer. &#34;Plans to close two of the Coventry’s libraries, cut the mobile library services and close public toilets are set to be approved by councillors today (November 26). At a Cabinet meeting, councillors are expected to approve the proposals in a bid to save £1.2 million a year from April 2016 and a further £3.8 million a year from 2017. Plans would see the establishment of a new Connecting Communities programme, which would bring council services together under one roof in a reduced number of locations in communities and neighbourhoods.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Lancashire","Thu, 26 Nov 2015 21:37:31 +0000","Lancashire – Rossendale Scribbler: Volunteers may be needed to save our libraries and museum – Rossendale Free Press. &#34;it is noticeable that as the county council shrinks rapidly, there’s relatively little talk of reducing the number of senior managers at the county council – a very small number of roles are identified – and no talk at all about reducing the number of county councillors on the council&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Lincolnshire","Sun, 29 Nov 2015 17:13:28 +0000","Lincolnshire – Rural areas treated poorly – Spalding Today / Letters. &#34;Libraries and local rubbish recycling points will be just the tip of a very big iceberg. There will be knock-on effects for our district council, too.&#34;","2015/11/record-breakers-not-record-breaking.html"],["Poole","Sun, 29 Nov 2015 17:13:28 +0000","Poole – Councillor can’t use library to meet residents – because it’s not technically in her ward – Dorset Echo. Senior council officer cancelled councillor surgery [ – Ed.] &#34;&#34;I believe I should be using Hamworthy Library, it’s not called Hamworthy East Library,&#34; she said. &#34;They shouldn’t have got funding from a deprivation area (Turlin Moor) if they are basically saying a councillor from that area is not allowed to use it. That’s wrong in so many ways.&#34; &#34;","2015/11/record-breakers-not-record-breaking.html"],["Fife","Thu, 26 Nov 2015 21:37:31 +0000","Fife – Councillors express concerns over plans to close libraries in Fife – Courier. &#34;Town representatives have agreed to include a public petition against the closure of Kinghorn Library as part of a representation to the council’s executive committee.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Manchester","Thu, 26 Nov 2015 21:37:31 +0000","Manchester – Ten of Manchester’s hotpots for freelancing and co-working – Time Out Manchester. &#34;Originally constructed back in the 1930s, the grade II-listed Manchester Central Library closed in 2010 for a four-year renovation project, eventually reopening to unsurprising fanfare as Mancuions welcomed back not only an iconic building, but also a great space for the studious. The building has nooks and crannies to work in throughout, but if you’re in need of getting down to some serious stuff, make a beeline for the grand 300-seat Reading Room on the first floor, which functions as the library’s slightly more formal study and working area. &#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Coventry","Sun, 29 Nov 2015 17:13:28 +0000","Coventry – £5m council plan for cuts to libraries, toilets and jobs approved for consultation  – Coventry Telegraph. &#34;Plans for £5million of council cuts which would axe 35 jobs, close public toilets and shut down the city’s mobile library have been approved for public consultation.&#34; … &#34;New plans would keep all libraries open, albeit during reduced hours and with some moving to alternative locations&#34;","2015/11/record-breakers-not-record-breaking.html"],["Hampshire","Thu, 26 Nov 2015 21:37:31 +0000","Hampshire – Nearly 6,000 respond to cost-cutting library plans in early weeks of Hampshire consultation – Hampshire Chronicle. &#34;The mobile service and some lesser-used libraries could shut as part of a major review by Hampshire County Council as it bids to save £1.7 million. More than 5,700 comments have been left after three weeks of consultation on plans to split libraries into four tiers based on use. Some tier three libraries, which include Bishop’s Waltham, Alresford and Fair Oak, may close or become volunteer-run.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Brighton and Hove","Sun, 29 Nov 2015 17:13:28 +0000","Brighton and Hove – New plans would keep all libraries open, albeit during reduced hours and with some moving to alternative location – Argus. &#34;Significant reductions in Westdene and Hollingbury libraries as a proposal to merge them into a classroom and children’s centre respectively is designed to save £309,000. A proposal to move Hove Library into a newly-built expansion of Hove Museum in 2017/18 will save £330,000. Expanding of the Libraries Extra scheme, which allows facilities to remain open for later but without staff, is hoped to save £375,000 by April 2017.  External consultants will be employed by the council to look into savings in the Jubilee Library PFI contract, which currently costs £2.4 million a year in council and Government funding.&#34;","2015/11/record-breakers-not-record-breaking.html"],["Lambeth","Thu, 26 Nov 2015 21:37:31 +0000","Lambeth – Gym-Trification: Lambeth’s dodgy scheme to turn libraries into books parodied in Private Eye – Brixton Buzz. &#34;The cartoon documents how Cllr Edbrooke pushed through the hugely controversial scheme and how the deal to run the book/gyms was dished out to Greenwich Leisure Ltd with no consultation or tendering process. &#34;They just gave the deal to GLL in secret,&#34; says the cartoon character.&#34; … &#34;Despite the appalling weather, a huge march by over 600 Lambeth library campaigners took place at the beginning of the month, and on the 18th, all of the libraries in the borough were closed as staff walked out in protest at the proposals.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Suffolk","Sun, 29 Nov 2015 17:13:28 +0000","Suffolk – Suffolk libraries facing major funding cuts – EADT. &#34;Suffolk’s libraries are facing budget cuts of more than 11% over the next two years – but their chairman has pledged that no branches will be closed.&#34; … &#34;Suffolk Libraries chairman Tony Brown told a meeting of the county’s scrutiny committee looking at potential budget cuts that the service had not agreed to cuts of £350,000 over each of the next two years.&#34; … &#34;&#34;We do not expect to have to make any major changes in the coming year. We had already planned to deliver the final part of the 30% efficiency savings which are set out in our original contract. &#34;","2015/11/record-breakers-not-record-breaking.html"],["Lancashire","Thu, 26 Nov 2015 21:37:31 +0000","Lancashire – Barbarians both burn and balance the books – LEP. &#34;Still, think of the savings. And forget the loss. A personal loss to those who use libraries; a wider loss, of positive civilising resource, to all those who don’t. In 2009, defending US libraries from purge, author Ray Bradbury said: &#34;Libraries raised me.&#34; Wise words. They raised me too. But they have raised us all. Sadly barbarians are not only at the gate. They’re on our side of it.&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Nottinghamshire","Thu, 26 Nov 2015 21:37:31 +0000","Nottinghamshire – Nottinghamshire Libraries prepare to host Forest legend – Chad. &#34;Nottingham Forest legend John McGovern – the man who captained the football club to win the European Cup twice – is preparing for two talks at Nottinghamshire County Council’s libraries.&#34; … &#34;His talks about his life and career will be fascinating and these events are further examples of the exciting and varied programme of around 7,000 events we host in our libraries each year – offering something for everyone&#34;","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"],["Staffordshire","Thu, 26 Nov 2015 21:37:31 +0000","Staffordshire – Stafford Library – Public Libraries News. An in-depth look at the new Stafford library, with large numbers of pictures [produced by myself in a visit this week – Ed.]","2015/11/budget-cuts-will-continue-but-ace-and-the-task-force-protected.html"]]