[["Cardiff","Fri, 01 May 2015 12:57:09 +0000","Cardiff – Please preserve our treasured libraries – Wales Online / Letters. &#34;Our libraries have not been saved, and are still under threat. Hundreds protested for publicly funded public libraries, not more time for the council to find &#34;alternatives&#34;, especially when these alternatives are the same ones the people of Cardiff have already rejected, including replacing trained staff with volunteers, and ‘partnerships’ – a euphemism for privatisation. Major cuts to Cardiff Central Library are going ahead, including losing another floor and hundreds of books to make the library a ‘SuperHub’ when a busy advice centre is moved into the building. Running down the central library can only mean seriously undermining the cultural and educational reputation of the capital city of Wales.&#34;","2015/05/alan-gibbons-private-eye-calls-ed-vaizey-out-on-figures-the-scl-and-obama-cares.html"],["Harrow","Fri, 01 May 2015 12:57:09 +0000","Harrow – Campaigners ‘confident’ they can run North Harrow Library as success – Harrow Times. &#34;In North Harrow, campaigners set up a steering group to work on the offer and have now submitted their initial application. Kamal Shah, chairman of the North Harrow Community Partnership and lead petitioner, said: &#34;We set up a steering group for the North Harrow Library and the group has been working hard to create our business plan. &#34;This has now been submitted and we hope the council will accept our application and allow us to run the library as a Community Library. &#34;It would be hard work but we’re pretty confident we can run the library as a success.&#34;","2015/05/alan-gibbons-private-eye-calls-ed-vaizey-out-on-figures-the-scl-and-obama-cares.html"],["Hertfordshire","Fri, 01 May 2015 12:57:09 +0000","Hertfordshire – Free computer lessons at libraries inspire couple to ‘Spring Online’ – Hertfordshire Council. &#34;Many people from across Hertfordshire enjoyed free computer taster sessions at Hertfordshire Libraries last week as part of Spring Online Week.\nSpring Online Week (20 – 26 April) is a national campaign to enable thousands of people, often older people, to try out using computers, tablets and the internet, many for the first time. Hertfordshire County Council’s Libraries service offered free computer taster sessions to anyone who wanted help to get online&#34;","2015/05/alan-gibbons-private-eye-calls-ed-vaizey-out-on-figures-the-scl-and-obama-cares.html"],["Kirklees","Fri, 01 May 2015 12:57:09 +0000","Kirklees – Under-threat library set to hold its first literature festival – Telegraph and Argus. &#34;Author of Chocolat, Joanne Harris will be among known literary names at the three-day event starting on Thursday, May 7 encouraging people to pick up a book and enjoy a good read. The festival will be a mix of workshops, talks and children’s activities and most of the events will be at the library. Campaigners bidding to save it from closing have gathered 3,700 signatures on a petition. The Grade II-listed building in Whitcliffe Road is under threat as Kirklees Council needs to reduce its £5.75 million library services budget by £3.2m by 2018.&#34;","2015/05/alan-gibbons-private-eye-calls-ed-vaizey-out-on-figures-the-scl-and-obama-cares.html"],["Lincolnshire","Fri, 01 May 2015 12:57:09 +0000","Lincolnshire – All the reasons you should intervene, Dear Secretary of State – Save Lincolnshire Libraries. &#34;Former Head of Lincolnshire Libraries, Maurice Nauta, a leading figure in the Save Lincolnshire Libraries campaign, has responded to the Secretary of State for Culture who, by means of a letter to Councillor Hill dated 26th March, notified that a ‘provisional’ decision not to intervene has been taken. (Read more on this here: #WritetoVaizey) Because the decision is provisional, intervention from the Secretary of State has not yet been ruled out. Maurice, as the complainant, was therefore asked to respond with further evidence to support his claim that the Secretary of State should intervene. The additional information, which is – to the best of his knowledge – accurate and compelling, is set out in a formal letter that was delivered to the Secretary of State at the Department of Culture, Media and Sport on the 23rd of April. …&#34;","2015/05/alan-gibbons-private-eye-calls-ed-vaizey-out-on-figures-the-scl-and-obama-cares.html"],["Thurrock","Fri, 01 May 2015 12:57:09 +0000","Thurrock – Fast-track fears about library volunteers - Times series. &#34;A number of &#34;advice&#34; sessions have been set up for borough libraries in May, for those seeking work experience and volunteer opportunities over the summer. Campaigners fear the ball is now rolling to replace experienced staff with volunteers. Julie Sorrell-Wilde, who led the Save Our Thurrock Libraries group, said: &#34;This is so wrong.&#34; She added: &#34;We should save the librarians jobs, and make sure they’re not used in any way to train volunteers and then dumped. That would be terrible.&#34;&#34;","2015/05/alan-gibbons-private-eye-calls-ed-vaizey-out-on-figures-the-scl-and-obama-cares.html"],["Lincolnshire","Fri, 01 May 2015 12:57:09 +0000","Lincolnshire – Lincolnshire library campaigners urge minister to intervene – BookSeller. &#34;Library campaigners in Lincolnshire are continuing their fight against council cuts, submitting new evidence to the secretary of state urging them to intervene in the council’s decision. In March, libraries minister Ed Vaizey stated that he was not minded to intervene in Lincolnshire’s cuts, which will see the council turn over 40 of its libraries to volunteers or else see them close, while only 15 libraries remain open and council run. The cuts had already been rejected by the High Court who declared the moves &#34;flawed&#34;, but the council reapproved the decision and pushed ahead. Although Vaziey made a provisional decision not to intervene, he encouraged further submissions of evidence. Maurice Nauta, a former head of Lincolnshire libraries and part of the Save Lincolnshire Libraries campaign, has sent a detailed 14-page document to the minister, outlining the scope of the cuts. In the document, Nauta identifies 10 libraries in areas of&#8230;","2015/05/alan-gibbons-private-eye-calls-ed-vaizey-out-on-figures-the-scl-and-obama-cares.html"],["Surrey","Fri, 01 May 2015 12:57:09 +0000","Surrey – Lingfield library to lose paid staff in May? - East Grinstead Courier. &#34;Villager say they are furious that Lingfield Library could be losing its experienced paid staff to other offices as early as May 1 – despite earlier reassurances they would be kept on for far longer. As part of a cost-saving drive, Surrey County Council is looking to increasingly rely on volunteers to run libraries in the region on a day-to-day basis.&#34;","2015/05/alan-gibbons-private-eye-calls-ed-vaizey-out-on-figures-the-scl-and-obama-cares.html"],["St Helens","Fri, 01 May 2015 12:57:09 +0000","St Helens – Library jobs cut by almost a quarter – St Helens Star. Members of library staff were cut across different levels, including one management post, saving £71,918; two team librarians, saving £63,541; 17 library assistants, saving £186,112, and a member of staff from the bibliographic services unit.&#34;","2015/05/alan-gibbons-private-eye-calls-ed-vaizey-out-on-figures-the-scl-and-obama-cares.html"],["Cambridgeshire","Mon, 04 May 2015 19:00:24 +0000","Cambridgeshire – Cambridge Central Library plans to be discussed at public meeting – Cambridge News. &#34;Cambridge residents are invited to a public meeting to learn more about the proposed changes to Central Library including the development of an enterprise centre. Senior county council officers will present details and answer questions about the proposed changes at the meeting on Wednesday, May 6. The Library Review consultation period has been extended to May 10 in order to give residents more time to comment on proposals set out in a strategy for the future of the service.&#34;","2015/05/ed-vaizey-agrees-to-defend-his-record-if-hes-around-long-enough.html"],["Cardiff","Mon, 04 May 2015 19:00:24 +0000","Cardiff – Cardiff library campaigners fear future being damaged by ‘behind the scenes process of service reduction’ – Wales Online. &#34;Campaigners fighting to save Cardiff’s libraries will present a letter outlining their concerns about the future of libraries in the city. They say reports that books are being removed from branch libraries, staff being let go and facilities being reduced is damaging their future. Several branch libraries faced closure during budget proposals for this year. At the last minute, they were saved but Cardiff council said they still intended to find community groups willing to take over the running of the libraries. But in the letter, signed by Rhydypennau and Rumney library campaigners and Cardiff People’s Assembly, concerns are raised that the council are &#34;engaged in a behind the scenes process of library reduction by attrition&#34;.&#34;","2015/05/ed-vaizey-agrees-to-defend-his-record-if-hes-around-long-enough.html"],["Shropshire","Mon, 04 May 2015 19:00:24 +0000","Shropshire – Church Stretton Library campaigners to take legal action – Ludlow Advertiser. &#34;Campaigners against the Shropshire Council decision to move the library out of Church Stretton town centre are to take legal action in a bid to get a review. At a packed public meeting the Church Stretton Library Support Group asked the community whether or not it would back legal action against the council to challenge its library decision. After a full explanation of what would be involved in this legal action and a detailed question and answer session the 140 people in the hall were asked to vote and the result was unanimous in favour of taking legal action against Shropshire Council.&#34;","2015/05/ed-vaizey-agrees-to-defend-his-record-if-hes-around-long-enough.html"],["Barnet","Sun, 10 May 2015 19:42:57 +0000","Barnet – The last leg of the Save Barnet Libraries March (or Campaigning can be Cathartic) - Stop the privatisation of public libraries. Alan &#34;attended and spoke at the last leg of the Save Barnet Libraries March. 100’s of us walked about 7 miles via 4 libraries and myself and Alan Gibbons (Author and Library Campaigner) gave what I hope were inspiring and rebel rousing speeches especially after the recent horrific election result&#34;","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["Hertfordshire","Sun, 10 May 2015 19:42:57 +0000","Hertfordshire – Inspiring libraries: developing outreach services - Hertfordshire Council. Increase in volunteers delivering books to houses and more online: entire mobile library service (seven mobile libraries) to be withdrawn. Petition against ending of mobiles here.","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["Cardiff","Sun, 10 May 2015 19:42:57 +0000","Cardiff – Cardiff’s central library to go digital with 3D printer - Wales Online. &#34;It will bring a hub for council information and services, enhanced digital facilities including a digital lounge, a creative suite and a 3D printer as well as an area geared towards young people. The grant is part of a £2.7m investment by the Welsh Government in museums, archives and libraries across Wales.&#34;","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["North Yorkshire","Sun, 10 May 2015 19:42:57 +0000","North Yorkshire – Tourist information centre to get new home in town’s library – Darlington and Stockton Times. Richmond: &#34;The town’s Tourist Information Centre (TIC) has been hit with problems in the last year after being unable to find a suitable premises – but town councillor Stuart Parsons came up with a plan to use the library, in Queen’s Road, as a new base. &#34; … &#34;He said although some original volunteers from the TIC were joining the new team in the library, more assistance was always needed.&#34;","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["Staffordshire","Sun, 10 May 2015 19:42:57 +0000","Staffordshire – Bids open for groups to take on Barton Library - Burton Mail. &#34;People will have the chance to put in applications to support the operation at the Dunstall Road site, after Staffordshire County Council decided it would no longer provide staff for the library. So far, there have been no expressions of interest from the community.&#34;","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["Gwynedd","Sun, 10 May 2015 19:42:57 +0000","Gwynedd – Contract award : Public Consultation on Gwynedd Council’s Library and Information Service Strategy - Sell2Wales. &#34;An invitation is extended to a consultative company with the expertise to undertake a Public Consultation on Gwynedd Council’s Library and Information Service Strategy.&#34;.  Strategy won by SianShakespear. [via Ken Chad / LIS-PUB-LIBS]","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["Northamptonshire","Sun, 10 May 2015 19:42:57 +0000","Northamptonshire – A moat, a meadow and a multi use community building – Grimwood Associated (press release).  &#34;The new community building, The Forum, at the heart of Towcester, Northamptonshire is now open and home to South Northants Council offices and Northamptonshire’s County Council’s Library Plus and Registrar (registration office for births, deaths, marriages and civil partnerships.  It will also be a hub for community groups, residents, visitors and tourists. The Forum is part of a wider regeneration project which is ideally located overlooking a beautiful rural location.&#34;","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["Gwynedd","Sun, 10 May 2015 19:42:57 +0000","Gwynedd – Library to get £250,000 boost – Cambrian News. &#34;Porthmadog library is to receive a £250,000 funding boost in the latest round of Welsh Government grant funding. The funding will be used to modernise the library and deliver a more sustainable community hub with extended library opening hours. Porthmadog library is one of seven throughout Wales to share £1m to modernise their facilities.&#34;","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["Manchester","Sun, 10 May 2015 19:42:57 +0000","Manchester – Response to claims homeless people have been banned from Central Library - Manchester Council. &#34;The Guardian newspaper’s claim that we are banning homeless people from entering Central Library is blatantly untrue. We have never enforced a general ban on homeless people from entering the library. Instead, we have been forced to ban members of the protest group which has camped outside on St Peter’s Square after they stormed the library on two occasions with the intention of occupying the building. These incidents, which came several weeks after similar scenes at Manchester Town Hall, caused great distress to children and families, as well as other library users, while members of staff were injured and two protesters arrested … We have also invited the protesters to engage with us as we create a new strategy for tackling homelessness, but disappointingly, they have told us they don’t want to do so.&#34; see also Statement on Manchester City Council – Voices for the Library. &#34;Voices for the Library are appalled by re&#8230;","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["Lincolnshire","Sun, 10 May 2015 19:42:57 +0000","Lincolnshire – Government may face legal action over library cuts – Spalding and South Holland Voice. &#34;Save Lincolnshire Libraries group has already announced it is looking a taking further legal action against Lincolnshire County Council, which plans to slash opening hours and close some libraries in a bid to save money.  But this week the group said it is now &#34;considering its options&#34; against the Department for Culture, Media and Sport, after it accepted a complaint by a campaigner but declined to launch an inquiry into the county council’s actions.&#34;","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["North Yorkshire","Sun, 10 May 2015 19:42:57 +0000","North Yorkshire – Thousands protest over library cuts – Darlington and Stockton Times. &#34;Campaigners have made a last-ditch bid to save their library, handing over petition with more than 2,300 signatures to North Yorkshire County Council . Bedale library is one of 20 across the county that could be axed as the authority carries out the biggest review in the service’s history.&#34; … &#34;Susan Perkins, a member of Friends of Bedale Library, said they had been overwhelmed by the numbers of people wanting to sign the petition. &#34;","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["Manchester","Sun, 10 May 2015 19:42:57 +0000","Manchester – Manchester council bans homeless people from using library – Guardian. &#34;Homeless people in Manchester have been banned from entering the city’s main public library or using the library toilets after they set up a protest camp outside. The city council said the ban came after protesters attempted to storm the central library and occupy the premises on Tuesday, distressing children and families. But protesters said they were being treated as &#34;second-class citizens&#34; and &#34;members of the underclass&#34; and accused Manchester city council of social cleansing.&#34;","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["North Yorkshire","Sun, 10 May 2015 19:42:57 +0000","North Yorkshire – Richmond tourist information centre moves into library – Times. &#34;There have been several meetings to progress our vision for the building and its many assets during the past months,&#34; she said. &#34;In order to avoid re-inventing the wheel, as it were, we also invited County Councillor David Jeffels to our last meeting, to tell us how the people in his area of Great Ayton successfully created their own community hub.&#34;&#34;","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["Staffordshire","Sun, 10 May 2015 19:42:57 +0000","Staffordshire – Community groups urged to submit bids to take over libraries – Sentinel. Numerous libraries offered to volunteers as alternative option to closing: bids open from May 11 to July 31.","2015/05/five-more-years-new-boss-same-as-the-old-boss.html"],["Barnet","Tue, 12 May 2015 20:41:21 +0000","Barnet – Campaigners take to the streets for final march opposing library cuts in Barnet – Times Series. &#34;Dozens of people joined the procession as it made its way from South Friern Library to North Finchley Library, via East Finchley and Church End, on Saturday. &#34; … &#34;Campaign group Save Barnet Libraries has staged a series of marches throughout the borough during the past few weeks, to highlight its fierce opposition to the cuts. Polly Napper, of East Finchley Library Users Group, said about 200 people joined the march, along with local political parties and trade unions.&#34;","2015/05/literally-taking-the-cake-ed-vaizey-continues-under-new-boss-john-whittingdale.html"],["Cardiff","Tue, 12 May 2015 20:41:21 +0000","Cardiff – Grade II listed Roath Library set to be closed, just weeks after being saved by Cardiff councillors - Wales Online. &#34;The bill to repair the library is so high that it is being recommended that it should be sold and £40,000 reinvested in the community … The threat to Roath Library’s future comes just weeks after it was &#34;saved&#34; when a proposal to withdraw funding from seven city libraries was ditched at the council’s budget meeting in February … The recommendation is for the existing library to be closed and sold. The first £40,000 of the money made would go towards library provision for the area.&#34; … &#34;The proposal also says the roles of full time branch librarian, a senior library assistant and library assistant should be replaced with a neighbourhood development librarian, who would be paid £33,000.&#34;","2015/05/literally-taking-the-cake-ed-vaizey-continues-under-new-boss-john-whittingdale.html"],["Shropshire","Tue, 12 May 2015 20:41:21 +0000","Shropshire – Shropshire libraries could link up with GP surgeries in drive to cut costs – Shropshire Star. &#34;Libraries could be run alongside GP surgeries as Shropshire Council looks to make a 30 per cent cut in funding.&#34; … &#34;Mr Sandbach, speaking during a meeting of Shropshire Council’s health and well-being board, said Pontesbury Library was one that could benefit from the health hub plan.&#34;","2015/05/literally-taking-the-cake-ed-vaizey-continues-under-new-boss-john-whittingdale.html"],["Cornwall","Tue, 12 May 2015 20:41:21 +0000","Cornwall – Library and one stop shop review consultation – Cornwall Council. &#34;We have to make savings of £1.8 million from the existing £4 million library and one stop shop service budget. The Council has committed to provide a comprehensive and efficient service that is accessible to all who wish to use it and not to reduce the number of branch libraries. To achieve the savings we need to review how the service is delivered in the future and want to work with communities, voluntary sector, town and parish councils, and other organisations to find the best solution – as a whole service or for individual library branches.&#34;","2015/05/literally-taking-the-cake-ed-vaizey-continues-under-new-boss-john-whittingdale.html"],["Renfrewshire","Tue, 12 May 2015 20:41:21 +0000","Renfrewshire – Library wins Development of the Year award – Designing Libraries. &#34; creates a new model for the delivery of community services with the public library, theatre, marriage suite, conference room and café sitting alongside staff from the council’s housing and social services departments, AdviceWorks, Police Scotland and MacMillan Cancer Support. In this respect it is an extraordinary building inside and out.&#34;","2015/05/literally-taking-the-cake-ed-vaizey-continues-under-new-boss-john-whittingdale.html"],["Birmingham","Sun, 17 May 2015 20:59:45 +0000","Birmingham – Police called as Library of Birmingham protesters stage sit in - Birmingham Mail. &#34;Students refuse to leave the Library of Birmingham at closing time in protest at cuts in opening hours and staff redundancies … Friday night, and demanded to speak with council management. Eventually two police officers were called to negotiate with the group and they left at 6.30pm. The protesters were angry at the cut in opening times from 73 hours per week to just 40, with the flagship building closed all day on Sundays and in the evenings. Protester Zoe Salnitro said: &#34;The library should be open until 8pm on Fridays. We have students and residents who want to use it, who want to study. The people of this city need it to be open.&#34;","2015/05/calm-ish.html"],["Cardiff","Sun, 17 May 2015 20:59:45 +0000","Cardiff – Report on future of Roath library withdrawn – to allow more time to discuss ‘sell-off’ papers - Wales Online. &#34;A report which suggests closing and selling off the Grade II listed Roath library has been pulled. The report, about the future of the building, was due to be heard on Thursday at Cardiff council’s Economy Scrutiny Committee.&#34; … &#34; &#34;further time to consider the issues and to allow for dialogue with local members&#34;.&#34;","2015/05/calm-ish.html"],["Bradford","Sun, 17 May 2015 20:59:45 +0000","Bradford – Social and health care workers could become mobile librarians, claims Keighley-district councillor – Keighley News. &#34;Andrew Mallinson suggests that health care workers who visit the elderly and disabled in their own homes could take along a selection of books. &#34; … &#34;Cllr Mallinson, who represents Craven ward on Bradford Council, made the comments after housebound Silsden pensioner Ailene Wade complained about the current state of the library service. &#34;","2015/05/calm-ish.html"],["Kent","Sun, 17 May 2015 20:59:45 +0000","Kent – What will happen to our libraries? – Maidstone and Medway News. &#34;…  libraries will be passed on to a charitable trust despite protest from users. The &#34;Facing the Challenge&#34; Transformation Programme will go before a cabinet committee meeting on Wednesday May 20. The council says that its proposal will engage more customers in the future, expand the roles library buildings play in their communities, and focus on what customers want from their local library. But, a petition, which has been signed by almost 4,000 unhappy users, demanded that the libraries of Kent remained, &#34;free and open to all with current levels of accessibility and opening hours maintained or improved, run by professional librarians and appropriately remunerated staff – with volunteers providing additional support, and democratically accountable to elected councillors&#34;.&#34; see also Kent split over sweeping changes to county libraries – Canterbury Times and KCC committed to using charitable trust for library service, but can’t ‘move ahead’ y&#8230;","2015/05/calm-ish.html"],["Brent","Sun, 17 May 2015 20:59:45 +0000","Brent – Brent Library Visits Top Two Million and Loans Top One Million - James Powney’s Blog. &#34;The General Election has inspired gloom in many, not least in the library sector.  I thought I would take another look at Brent’s library numbers, which are actually rather cheering.  I think people in some other parts of the country might take a look at Brent and see how public libraries have improved here despite massive cutbacks … Annual visit numbers have gone up by 40% by the end of 31 March 2015, topping two million .. Many people find these numbers counter intuitive because in 2011 Brent decided to close half its libraries, and significantly reduce the overall budget.&#34;","2015/05/calm-ish.html"],["Trafford","Sun, 17 May 2015 20:59:45 +0000","Trafford – Community comes together to develop library plans for Hale – Messenger. &#34;The cost of the scheme would be covered by redeveloping the site of the current 49-year-old library on Leigh Road – six houses, a shop and office with two flats above would be built there. Council chiefs are due to make a decision on the proposal by the end of the month, after cash-strapped Trafford Council announced plans to develop the Leigh Road site and invited bids for it.&#34;","2015/05/calm-ish.html"],["Hartlepool","Sun, 17 May 2015 20:59:45 +0000","Hartlepool – Have your say on the future of Hartlepool’s libraries – Hartlepool Mail. &#34;Since 2013, the library service budget has been reduced by almost 16 per cent, but the savings haven’t had a direct impact on the library opening hours or the branch library network. But now the service is having to find savings from 2016, and bosses say this cannot be achieved without reviewing the whole service, including front-line operations.&#34;","2015/05/calm-ish.html"],["Hertfordshire","Sun, 17 May 2015 20:59:45 +0000","Hertfordshire – Mobile library faces the axe but council says service will still be available to all – Hemel Today. &#34;The mobile library service, which travels to rural areas without a local library, costs around £14 per customer visit to run and a consultation, held in 2013, revealed that 77 per cent of users also visited another library. Councillor Frances Button, who oversees libraries, said: &#34;It’s vital that we continue to ensure that people who can’t get out and about can still use our library service. I believe that a new approach will offer a better service to the people who need our help while also making better use of taxpayers’ money.&#34;&#34;","2015/05/calm-ish.html"],["Lambeth","Sun, 17 May 2015 20:59:45 +0000","Lambeth – Cllr Edbrooke admits that Council Cultural Consultation has been ’emotive’ as plans are put in place to publish findings – Brixton Buzz. &#34;With the Great Lambeth Cultural Consultation now over, we await with interest to see if Cllr Jane Edbrooke is actually listening to the views being put forward by residents that took the time to respond to the three month feedback session. The Cabinet Member for Neighbourhoods is due to publish in July the findings on pretty much everything that can be given a ‘cultural’ tag within the borough: libraries, leisure, parks, entertainemnt – all the things that make Brixton such a great place to live. Anyone wanting an early insight into what Cllr Edbrooke is planning might want to get down to the Town Hall on Wednesday evening&#34;","2015/05/calm-ish.html"],["Vale of Glamorgan","Sun, 17 May 2015 20:59:45 +0000","Vale of Glamorgan – Library campaigners ready to throw book at Council – Barry and District News. &#34;campaigning to save Rhoose library from closure are to take legal action against the Vale Council. The Save Rhoose Library campaign group believes there are significant flaws in the way the council has conducted consultation over the future of the library and are poised to challenge the authority in court.&#34; see also ‘Libraries are a necessity to the community&#39;: Campaigners set to take their fight to save Rhoose Library to court - Wales Online.","2015/05/calm-ish.html"],["Sandwell","Sun, 17 May 2015 20:59:45 +0000","Sandwell – Sandwell libraries will be run by more volunteers amid council cuts – Express and Star. Libraries to remain open but be hollowed out: &#34;Bosses are now continuing with a review of staffing levels and looking other ways to save money. Plans will be drawn up by the council and then a second consultation is due to take place with staff, community groups and library users. The council says it council needs to save £700,000 from the library budget over the next two years.&#34;","2015/05/calm-ish.html"],["Birmingham","Tue, 19 May 2015 19:42:29 +0000","Birmingham – Birmingham library users stage sit-ins – BookSeller. &#34;Police were called in one instance to help disperse the protestors who refused to leave the building on Friday evening (15th May). Around 30 students refused to leave at the library’s new designated closing time of 5pm, demanding to speak to council management, according to a report in the Birmingham Mail. After police were called, two officers were able to negotiate with the group, who left at 6.30pm. A rally was then held outside.&#34;","2015/05/the-most-beautiful-library-view-in-the-world.html"],["Brent","Tue, 19 May 2015 19:42:29 +0000","Brent – Wembley Library in Top Ten UK Libraries – James Powney’s Blog. &#34;Libraries? Following on from my previous post on the annual library numbers, it is worth pointing out that Wembley Library is almost certainly now in the top ten public libraries nationally, as predicted.  The most recent annual figures for Wembley Library are 1,169,735 visits and 177,640 loans for the year ending 31 March 2015. &#34;","2015/05/the-most-beautiful-library-view-in-the-world.html"],["Harrow","Tue, 19 May 2015 19:42:29 +0000","Harrow – New library to be built in Harrow town centre despite council closing four others – Harrow Times. &#34; new library will be built in Harrow town centre under proposals confirmed today by Harrow Council. The announcement, which comes just a day after it rejected the community business plan to save Bob Lawrence Library in Edgware, is part of the council’s library strategy to modernise the library service across the borough … Other improvements include the introduction of a LEGO studio for children from primary to secondary school age, and extended library opening hours. As part of the reorganisation to provide these new facilities, four of the borough’s libraries will be closing from June 13, including Hatch End, North Harrow and Rayners Lane.","2015/05/the-most-beautiful-library-view-in-the-world.html"],["Thurrock","Tue, 19 May 2015 19:42:29 +0000","Thurrock – Animal hospital coming to Corringham Library in half term – Your Thurrock. &#34;Corringham & Fobbing Community Forum are bringing the &#34;South Essex Wildlife Hospital &#34; to Corringham Library in the Half Term Holidays … The wildlife hospital will be talking to the children about real life rescues – the hospital and how it works – and bringing along&#34;","2015/05/the-most-beautiful-library-view-in-the-world.html"],["Edinburgh","Thu, 21 May 2015 20:23:17 +0000","Edinburgh – 125 years of Edinburgh Libraries – Tales of one city. &#34;Book now for Future Libraries – the next 125 years  – a panel discussion with National Librarian John Scally, the Scottish Book Trust’s Philippa Cochrane, Professor Hazel Hall of Napier University and Duncan Wright, Librarian at Stewart’s Melville College.&#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["Flintshire","Tue, 19 May 2015 19:42:29 +0000","Flintshire – Deeside Leisure Centre library shake-up agreed - BBC. &#34;Three libraries will shut in Flintshire when a central hub opens at Deeside Leisure Centre. Libraries at Hawarden, Mancot and Queensferry will be closed under the plans agreed by the council’s cabinet committee on Tuesday&#34;","2015/05/the-most-beautiful-library-view-in-the-world.html"],["Bristol","Thu, 21 May 2015 20:23:17 +0000","Bristol – Library battle Children march to save facility – Bristol Post. &#34;The Save Wick Road Library Campaign Group has arranged a walk for next Tuesday, May 26, to highlight the difficulty people in Brislington will have if their local library shuts. Wick Road library is one of seven – along with Clifton, Eastville, Marksbury Road in Bedminster, Redland, Sea Mills and Westbury – that could potentially close next year. Campaign organiser Val Cobbin, 41, of Brislington, said: &#34;People in this area love Wick Road Library, and it’s always busy with children and with older people.&#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["Lincolnshire","Thu, 21 May 2015 20:23:17 +0000","Lincolnshire – Six organisations are bidding to run Lincolnshire’s library services – Lincolnshire Echo. &#34;The authority has received initial applications from: Compass Point Business Services; Greenwich Leisure Limited; Leisure in the Community; Lincs Inspire; Vision; Vivacity. Councillor Nick Worth, Executive Member for Libraries, said: &#34;Although we’re facing a second legal challenge, we believe we took the right decision and took it lawfully, so we intend to push on with our plans. &#34;The way in which our libraries are used has changed and it’s important they adapt with the times.&#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["Shropshire","Thu, 21 May 2015 20:23:17 +0000","Shropshire – Shropshire libraries funding to be slashed by £1.3m – Shropshire Star. &#34;While the council has pledged to keep libraries in towns as council-run facilities, it says it cannot sustain the funding for smaller libraries. Consultation is under way to look at how the buildings and the book lending service can survive and, as one council chief claimed at a meeting, even improve. Almost 50 people attended a public meeting in Gobowen to look at how its library could continue despite council funding cuts. Similar consultation are to be held in towns across the county, from Broseley to Pontesbury and Ellesmere.&#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["South Ayrshire","Thu, 21 May 2015 20:23:17 +0000","South Ayrshire – South Ayrshire Council prepare to swing £12.5 million axe on public services - Daily Record. &#34;All libraries could close, two swimming pools jettisoned and seven schools are at risk, we can exclusively reveal. In a shocking cull of vital services, green bins may only be emptied once a month. Desperate South Ayrshire Council has been forced into a slash and burn policy to make savings of £12.5 million.&#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["Hertfordshire","Sun, 24 May 2015 20:58:06 +0000","Hertfordshire – Library marks 50 years on Hitchin town centre site with events showcasing wider history – Cornet. &#34;These are changing times for Hertfordshire’s libraries, with a wide-ranging restructure under way which will introduce a new three-tier structure and emphasise the place of each book base at the centre of its community. &#34; A look at the history and changes in the public library over the last half century.","2015/05/the-south-west-has-all-the-best-library-views.html"],["Harrow","Tue, 19 May 2015 19:42:29 +0000","Harrow – ‘I got the letter and my heart sank’ – Campaigners heartbroken after Harrow Council reject business plan for community-run Bob Lawrence Library in Edgware – Harrow Times. &#34;A community group is &#34;heartbroken&#34; after Harrow Borough Council rejected its business plan to save a library. The Friends of Bob Lawrence Library group have been campaigning to save the library, in Mollison Way, Edgware, since Harrow Borough Council announced plans close it as part of budget cuts. The campaigners were invited to submit their own business plan to allow the library to remain open as a community-run venture, but group members say they feel devastated after being told their application had been rejected.&#34;","2015/05/the-most-beautiful-library-view-in-the-world.html"],["North East Lincolnshire","Tue, 19 May 2015 19:42:29 +0000","North East Lincolnshire – Still no opening date as negotiations continue on future of library - Grimsby Telegraph. Scartho Library: &#34;As reported, the St Giles’ Avenue centre closed late last year and had been due to be taken over by a team from Grimsby-based charity Foresight on Monday, January 5. However, five-and-half months after the planned opening day, the Foresight volunteers are no nearer to moving in, as legal wrangling between the charity and North East Lincolnshire Council (NELC) continue.&#34;","2015/05/the-most-beautiful-library-view-in-the-world.html"],["Oxfordshire","Tue, 19 May 2015 19:42:29 +0000","Oxfordshire – Residents’ group takes council reins - Herald. &#34;&#34;We want to look after our youth clubs and libraries, and this requires help from the parish council. We can raise a precept and use that money wisely … &#34;I think we achieved rather more than we expected. I am aware of the challenges that face us, such as the voluntary library. My reason for standing was to make sure more money was put back into the community. It looks possible, but it could take a while to sort out.&#34;","2015/05/the-most-beautiful-library-view-in-the-world.html"],["Milton Keynes","Tue, 19 May 2015 19:42:29 +0000","Milton Keynes – Stony Stratford set to celebrate 40th birthday just four years after threatened closure… - MK Web. &#34;Get ready with confetti and party poppers because Stony Stratford Library is set to celebrate turning 40 at the start of June and this comes just a matter of years after the premises looked set for closure. Back in 2011 residents of the area rented out 60,000 from the library as threats of closure loomed over the service. But four years on from that and Emma Carrick, Area Team Leader for the Library say she is looking forward to celebrating the services 40th anniversary.&#34;","2015/05/the-most-beautiful-library-view-in-the-world.html"],["Bristol","Thu, 21 May 2015 20:23:17 +0000","Bristol – Save our ‘life saver’ libraries – Socialist Party. &#34;Protecting libraries is an important part of Trade Unionist and Socialist Coalition (TUSC) campaigning. In Bristol, the independent mayor plans to close seven. Scandalously these cuts were fronted by the Green assistant mayor. Saving libraries and other services requires principled, consistent opposition to the cuts – in actions, not just words. Local people will fight for this and we will stand with them. Sean R spoke to the Socialist about how vital the library service has been to him.&#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["Flintshire","Thu, 21 May 2015 20:23:17 +0000","Flintshire – Deeside leisure centre ‘Hub’ library gets the green light, Hawarden, Queensferry and Mancot to close – Deeside. &#34;Queensferry, Mancot and Hawarden libraries are set to close following agreement at today’s Flintshire County Council cabinet meeting. In return, a new £130,000 ‘hub’ library within Deeside leisure centre will open early next year.&#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["Staffordshire","Thu, 21 May 2015 20:23:17 +0000","Staffordshire – Penkridge Library campaigners urge villagers to have their say on opening hours - Staffordshire Newsletter. &#34;Claire geoghegan, from the group, told Penkridge Parish Council: &#34;We are concerned about what this consultation will mean for the library. &#34;We have concerns as to whether it could result in a reduction in hours. If we want longer hours we would have to staff the extra hours ourselves. &#34;We have also been led to believe to consultation will be over the summer months, which minimises people being aware of it. &#34;We are writing to the county council to put our concerns formally and we hope the parish council will support us on that.&#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["Trafford","Tue, 19 May 2015 19:42:29 +0000","Trafford – Plan unveiled to create 6,000 sq ft library and community centre on site of Hale bowling pavilion - Altrincham Today. &#34;The proposal, which has been jointly put forward by the newly formed Hale Community Trust and Altrincham-based Hillcrest Homes, is the first significant tender since Trafford Council invited bids for the redevelopment of the site. It would involve the library facility moving to a new library and community centre on Ashley Road, replacing The Cottage pavilion and toilets overlooking the 100-year-old bowling green used by Hale Bowling Club.&#34;","2015/05/the-most-beautiful-library-view-in-the-world.html"],["Devon","Sun, 24 May 2015 20:58:06 +0000","Devon – Chair of a new Libraries Mutual for Devon – Devon council. &#34;We are looking for an experienced Chair to provide independent, ambitious and informed leadership at the critical stage in the organisation’s development. The Chair will have an important role in the launch of the new organisation; acting as its public face and raising its profile across Devon&#34;","2015/05/the-south-west-has-all-the-best-library-views.html"],["Bromley","Thu, 21 May 2015 20:23:17 +0000","Bromley – Community groups are being invited to submit proposals to manage some of Bromley’s libraries as the service undergoes budget cuts – News Shopper. &#34;Residents were asked their views about handing over management of some libraries to external providers in a public consultation which ran until February this year. &#34; … &#34;Under the plans, local volunteer or community groups would manage the community libraries of Burnt Ash, Hayes, Mottingham, Shortlands, Southborough and St Paul’s Cray. Bromley’s remaining libraries and the core library service would be subject to full ‘market testing’, which could see management outsourced.&#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["South Lanarkshire","Thu, 21 May 2015 20:23:17 +0000","South Lanarkshire – Library campaigners in East Kilbride call it a day after talks with council officials reach a stalemate – Daily Record. &#34;A campaign to save Calderwood Library, which got the backing of film star John Hannah, has been shelved. Those battling to save the facility say they have hit a brick wall with the council and South Lanarkshire Leisure & Culture (SLLC) after the library was earmarked for closure under budget cuts.&#34; … &#34;&#34;There has been, at no point, any firm commitment from SLLC or from the council that funding could be found. Rather the opposite in fact as it was made clear that the vision for East Kilbride was to have a main hub library (EK Central) and only two branch libraries (St Leonards and Greenhills) going forward, with further potential savings coming down the line for SLLC in the coming years. All discussions with SLLC have hit this same vital issue – funding.&#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["Gwynedd","Thu, 21 May 2015 20:23:17 +0000","Gwynedd – Libraries under ‘serious threat’ – Cambrian News. &#34;Local library services will face &#34;fundamental changes&#34; as the current level of service is &#34;no longer sustainable&#34;, a councillor said. Gwynedd libraries will have at least 25 per cent less money to maintain current operations and so the council is holding a public consultation over the coming months for local people to have their say on which aspects of the library service that they value the most.&#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["Harrow","Thu, 21 May 2015 20:23:17 +0000","Harrow – Library shake-up after Harrow Council reorganisation – Get West London. &#34;Harrow is set to receive a new library under proposals confirmed this week. The library, with state-of-the-art facilities and self-service technologies is part of a new Harrow Council strategy to increase the range of facilities that the libraries in the borough have to offer. Other libraries in Harrow will be refurbished, ensuring they meet the needs of library-goers for years to come, as part of proposals put in place on Wednesday (May 20). Improvements include LEGO studios for children, from primary to secondary school age, as well as extended library opening hours, something highly requested by residents. But, four of the borough’s libraries will be closing from June 13 as part of the new strategy put in place.&#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["Hertfordshire","Thu, 21 May 2015 20:23:17 +0000","Hertfordshire – Mobile library to be axed in £2.5m savings plan - Watford Observer. &#34;The county’s &#34;expensive&#34; mobile library is being axed with a council looking to expand its home delivery service and save £2.5m a year. Hertfordshire County Council will put the brakes on the mobile library, which it says costs three times as much as a trip to a library.&#34;&#34; … &#34;The authority said the mobile library cost £14 per customer visit. &#34;","2015/05/south-ayrshire-bromley-and-a-herts-attack.html"],["Birmingham","Sun, 24 May 2015 20:58:06 +0000","Birmingham – Demonstrate for the Library of Birmingham (and the wider library service) Saturday 13 June - Birmingham Against the Cuts. &#34;The Friends of the Library of Birmingham has decided to call a demonstration on Saturday June 13th. It will be to oppose the drastic cuts to the LoB in terms of its opening hours, staff cuts and restrictions on the services it has been offering. It will assemble at the Waterstones book shop at the bottom of New Street at 12 noon and then march up New Street for a rally at the Council House at 1pm.&#34;","2015/05/the-south-west-has-all-the-best-library-views.html"],["Staffordshire","Sun, 24 May 2015 20:58:06 +0000","Staffordshire – £350k cuts planned to mobile libraries in Stoke Sentinel. &#34;Staffordshire County Council published proposals for a nine-week consultation yesterday after figures revealed less than one per cent of the county’s population borrowed an item from the travelling vehicles in the year ending April 2014. The proposals, which the council says will ‘focus on prioritising a service for those who need it most’ will be examined by a cross-party committee on June 1. If the plan goes ahead the two large travelling libraries will be reduced to one and the six mobile vehicles could be reduced to two.&#34;","2015/05/the-south-west-has-all-the-best-library-views.html"],["Cornwall","Sun, 24 May 2015 20:58:06 +0000","Cornwall – Still time to have your say on Cornish libraries consultation - Western Morning News. &#34;Cornwall Council launched a consultation after it was announced that library hours would be cut and the mobile services abandoned as it looked to save some £1.3 million next year.&#34;","2015/05/the-south-west-has-all-the-best-library-views.html"],["Lancashire","Sun, 24 May 2015 20:58:06 +0000","Lancashire – Library books prescribed for dementia – Lancaster Guardian. &#34;Events have been organised in libraries and museums to mark Dementia Awareness Week, which runs until Saturday May 23 and will include dementia friends’ sessions, a memory festival, and café and coffee mornings. &#34;","2015/05/the-south-west-has-all-the-best-library-views.html"],["Newcastle","Sun, 24 May 2015 20:58:06 +0000","Newcastle – Volunteers save Fawdon Library – ITV. &#34;Volunteers have saved the library, based at Fawdon Community Centre, after it faced closure due to cutbacks in the council’s budgets. The library will reopen on Tuesday 26 May as a volunteer-run service. The volunteers have formed a collective called Friends of Fawdon Community Library, and will keep the facility open five days a week, Monday to Friday.&#34; Fawdon Community Library website.","2015/05/the-south-west-has-all-the-best-library-views.html"],["Shropshire","Sun, 24 May 2015 20:58:06 +0000","Shropshire – Shropshire libraries funding to be slashed by £1.3m – Shropshire Star. &#34;Consultation is under way to look at how the buildings and the book lending service can survive and, as one council chief claimed at a meeting, even improve. Almost 50 people attended a public meeting in Gobowen to look at how its library could continue despite council funding cuts.&#34; … &#34;Services will look different but they will continue and will often be better.&#34;","2015/05/the-south-west-has-all-the-best-library-views.html"],["North Yorkshire","Sun, 24 May 2015 20:58:06 +0000","North Yorkshire – Costs could outweigh savings on library plan, claim campaigners – Northern Echo. &#34;Campaigners fighting proposals to turn a library into a volunteer-run centre claim it could potentially lose the local authority more money than it would save. &#34; … &#34;&#34;This is an unconscionable waste of local resources. North Yorkshire County Council’s abnegation of responsibility in trying to force local people to run a community library is unfair and unsustainable.&#34; The campaigners have also looked at the terms of the agreement drawn up in 2005 between Broadacres and the county council, which granted the council a 999-year lease of the library space. And they claim the council could potentially end up having to pay &#34;substantial&#34; compensation to Broadacres on terminating the lease.&#34;","2015/05/the-south-west-has-all-the-best-library-views.html"],["Vale of Glamorgan","Sun, 24 May 2015 20:58:06 +0000","Vale of Glamorgan – &#34;Delighted&#34; council call Vale library progress &#34;a success&#34; so far – Barry and District News. &#34;first step towards the creation of community libraries in Rhoose, Sully, St Athan and Wenvoe has been called &#34;a success&#34; by the Vale council. The council have also announced new opening times for Barry library. The Vale of Glamorgan council has revealed that expressions of interest have been submitted for each of the closure threatened libraries. This step is required to keep Rhoose, Sully, Dinas Powys, St Athan and Wenvoe libraries open following the Vale of Glamorgan Council’s library strategy being agreed earlier this year.&#34;","2015/05/the-south-west-has-all-the-best-library-views.html"],["Barnet","Sun, 31 May 2015 20:09:22 +0000","Barnet – Why we are striking from a Library worker – Barnet Unison. &#34;Library Workers are taking strike action to defend their jobs and the Library Service.  Barnet Council plan to privatise our Lib&#34;raries, or to hand them over to a &#34;mutual&#34;, or in some cases have them run by &#34;Community groups&#34;.   Some Libraries may be closed, and most will be reduced to 540 square feet in size.  Libraries will be unstaffed for two thirds of their opening hours, with under- 16 year olds being denied access without an adult during these times.  Even when Libraries are staffed, numbers will be reduced by as much as one third of their present levels.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Shropshire","Sun, 31 May 2015 20:09:22 +0000","Shropshire – New chapter for village library – Advertiser. &#34;At a public consultation event in Gobowen last Tuesday, residents proposed including everything from police surgeries, a post office, craft and community groups, and a coffee shop in the facility based off St Martins Road&#34; … &#34;Kate Garner, locality commissioning manager for Shropshire Council, added that the authority has been successful in securing a £520,000 Transformation Challenge Award which will benefit six libraries across Shropshire, and develop services in many more.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Birmingham","Sun, 31 May 2015 20:09:22 +0000","Birmingham – Meeting Over Future Of Library Of Birmingham – Heart. &#34;It’s been suggested that more of the space could be rented out to firms or services that people need to use, or Europe’s largest public library could be sponsored, just like the city’s arenas are venues are&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Gwynedd","Sun, 31 May 2015 20:09:22 +0000","Gwynedd – Porthmadog library relocation plan takes a step forward - Daily Post. &#34;Plans to close a Gwynedd library and move it to a leisure centre almost half a mile away are moving closer. Gwynedd Council’s cabinet will meet in Caernarfon on Tuesday to discuss a decision supporting the relocation of Porthmadog Library from Chapel Street to Glaslyn Leisure Centre, on Stryd Y Llan. The plan is to sell the library for an estimated £80,000 with capital receipts from its sale going towards the relocation costs – the leisure centre would be adapted. Relocation costs are expected to be around the £388, 359 mark. The move would be partly funded with a £258,659 Welsh Government grant and a Gwynedd Council contribution of £129,700, which would come from the sale of the current library.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Staffordshire","Sun, 31 May 2015 20:09:22 +0000","Staffordshire – Staffordshire library staff go digital help people get online - Staffordshire Newsletter. &#34;From October last year to March 2015, 245 workers signed up for a national e-learning programme designed to improve their digital skills and digital confidence.  The training was designed in part to help prepare staff for the extra demand anticipated as the Government’s Universal Credit scheme is rolled out across the country. Most people will be expected to make their claims for Universal Credit online.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Trafford","Sun, 31 May 2015 20:09:22 +0000","Trafford – Hale Community Trust sees bid for Hale Library succeed - Trafford Council. &#34;An ambitious bid by Hale Community Trust, a group of active local residents, working with Hillcrest Homes, to build a new library, public toilets and pavilion building, has been given the go ahead by Trafford Council. Following careful consideration of the three shortlisted bids and the views of local people, the Executive Member leading on the project,Councillor Alex Williams, approved the bid today, Thursday 28 May 2015. The bid involves the purchase of the current library site, for a material capital sum (which will be available to support the Council’s capital programme), together with the purchase of the freehold of the pavilion building off Ashley Road. Once these have been finalised, the building work would begin, funded through the redevelopment of the existing library site, subject to appropriate planning permission. A community charity trust would run the toilets, pavilion and other community assets.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Bristol","Sun, 31 May 2015 20:09:22 +0000","Bristol – Protesters march to keep Wick Road Library open - Bristol Post. &#34;Protesters marched uphill to show their support for a Brislington library, which they fear could be closed. More than 150 people made their way from Wick Road to Knowle Library to highlight the difficulties they would have if they lost the community hub.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Dundee","Sun, 31 May 2015 20:09:22 +0000","Dundee – Scotland’s busiest library is first to offer dementia service – STV Dundee. &#34;Dundee’s Central Library has become the country’s first public library to provide a Dementia Information Service. The library, the busiest in Scotland, now offers an area specifically built to meet the needs of people living with the disease, of which there are more than 2,700 in Dundee. Having received £10,000 in funding from the Scottish Library and Information Council, the library’s new service allows users access relevant information, alongside a programme of reminiscence and reading related activities.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Kent","Sun, 31 May 2015 20:09:22 +0000","Kent – Kent County Council plans to sign libraries over to volunteers in limbo over legal issues -News Shopper. &#34;authority officials have announced plans cannot got ahead until the registration of births, deaths and marriage services are included in the package. &#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Vale of Glamorgan","Sun, 31 May 2015 20:09:22 +0000","Vale of Glamorgan – &#34;Delighted&#34; council call Vale library progress &#34;a success&#34; so far – Barry and District News. Changes in opening hours. &#34;The Vale of Glamorgan council will now work with each community group to help them develop a detailed business case. This will be the basis on which the final decision on transferring each library will be taken. &#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Devon","Sun, 31 May 2015 20:09:22 +0000","Devon – No increased opening hours for the library – View from Online. Support for Axminster Library group &#34;has established that Axminster makes up two per cent of the Devon population, but DCC is only spending 0.8 per cent of its library budget on its facility in Axminster. DCC has not disputed the pressure group’s findings, but has refused to increase opening hours in Axminster.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Flintshire","Sun, 31 May 2015 20:09:22 +0000","Flintshire – Members call-in plan for shake-up of Flintshire’s libraries – Leader. &#34;Despite strong public opposition, Hawarden, Mancot and Queensferry libraries are due to be closed with services moved to a new hub at Deeside Leisure Centre … More than 1,000 people signed petitions to save the libraries. Flintshire councillors Adele Davies-Cooke, Alison Halford, Dave Mackie and Glenys Diskin have added their names to a call-in by Cllr Clive Carver, which was submitted on Wednesday. As a result, the cabinet decision will be looked at again by the organisational change overview and scrutiny committee at a meeting on June 8 at 1.30pm at County Hall.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["West Sussex","Sun, 31 May 2015 20:09:22 +0000","West Sussex – New online tool for job seekers available at West Sussex libraries – Worthing Herald. &#34;Vacancies on MyWorkSearch are updated daily and searches can be tailored by geographical area, job title, or salary range. The online service also includes an easy-to-use CV builder that West Sussex County Council hopes will increase people’s chances of finding employment as well as eLearning tools to boost confidence in job searching.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Leicestershire","Sun, 31 May 2015 20:09:22 +0000","Leicestershire – Community groups set to run libraries in Leicestershire – BBC. &#34;A total of 21 community groups are set to take over the running of some of Leicestershire County Council’s libraries. Castle Donington, Barrow, Countesthorpe, and Markfield are the latest bids to be approved. Barrow is expected to become the first community-managed venue, taking over from the council in July. The authority hopes communities will run up to 36 libraries while it retains responsibility for 16 of the busiest.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Lincolnshire","Sun, 31 May 2015 20:09:22 +0000","Lincolnshire – Six organisations make pitch to run Lincolnshire’s library service - Lincolnshire Echo. Brief summary of the six includes (1) Compass Point Business Services (private company with experience in councils), (2) GLL Greenwich Leisure Limited (non-profit already running public libraries elsewhere), (3) LITC Leisure in the Community (non–profit running some council services), (4) Lincs Inspire (non-profit running Lesiure and Libraries already for NE Lincs, (5) Vision (non-profit running Lesiure and Libraries in Redbridge, Vivacity (non-profit running Lesiure and Libraries in Peterborough).","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["North Yorkshire","Sun, 31 May 2015 20:09:22 +0000","North Yorkshire – Meeting to discuss Stokesley Library’s future – Gazette Live. &#34;A meeting to discuss the future of an under-threat library is due to take place. Representatives from North Yorkshire County Council will be among those at an extraordinary parish council meeting at Stokesley Town Hall on Tuesday night for a public meeting. There they will discuss the future of Stokesley Library. As reported, the county council want the facility run as a &#34;community-managed&#34; model to save cash. But a petition against the plans gathered 1,685 signatures in the hope the strength of feeling would make the authority change its mind.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Newcastle","Sun, 31 May 2015 20:09:22 +0000","Newcastle – Volunteers save Fawdon Library – ITV. &#34;Volunteers have saved the library, based at Fawdon Community Centre, after it faced closure due to cutbacks in the council’s budgets. The library will reopen on Tuesday 26 May as a volunteer-run service. The volunteers have formed a collective called Friends of Fawdon Community Library, and will keep the facility open five days a week, Monday to Friday.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"],["Wiltshire","Sun, 31 May 2015 20:09:22 +0000","Wiltshire – Wiltshire Council consults on cuts to mobile library service – This is Wiltshire. &#34;A consultation is currently underway which proposes 49 stops be withdrawn reducing the number from 267 to 218 in the county. The frequency of the visits may also change to fortnightly or monthly instead of weekly and If the changes do go ahead they will come into effect on October 26. The stops proposing to be closed are those which Wiltshire Council says have less than three customers and are fewer than 2.5 miles away from a branch library.&#34; … &#34;Anne Hale, 80, of Swan Drive, who is disabled, said: &#34;I’m horrified. For people like me it’s very beneficial. When I go to the main library it’s very difficult to find a car parking space and when I’ve got one I have to walk and go up the stairs.&#34;","2015/05/cilips-and-lincolnshire-one-full-week-of-public-libraries-news.html"]]