[["Blackpool","Tue, 01 Nov 2016 21:47:10 +0000","Blackpool – Resort libraries aid week of enterprise – Blackpool Gazette. &#34;Get Started in conjunction with Blackpool Libraries are providing an opportunity for start-ups to explore their business idea online using the library facilities, as part of Global Entrepreneurship Week, which runs from Monday, November 14 to Sunday, November 20.Held in libraries across the town, potential business owners can research their ideas and explore their potential during drop-in sessions&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["Cambridgeshire","Tue, 01 Nov 2016 21:47:10 +0000","Cambridgeshire – Village shows its support for new community library – Hunts Post. &#34;As a part of the Vision for Brampton scheme, a new library committee has been formed to open up a hub in the village. Committee chairman, Jackie Woodward said: &#34;We are in very early days at the moment, we have just started our appeal in the village for donations of books that we hope will then go into the library.&#34; Since starting the appeal three weeks ago the committee has already been given more than 200 books ranging from children’s stories to classic novels.&#34; … &#34;Once the appeal ends the library committee will sort out all the books that have been collected before the potential opening of the library in 2017. &#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["Cumbria","Tue, 01 Nov 2016 21:47:10 +0000","Cumbria – Opening hours cut at north Cumbrian libraries – News and Star. &#34;Opening hours at two of north Cumbria’s libraries will be cut due to a lack of demand at certain times. Carlisle’s library, in The Lanes shopping centre, will be open one hour less on both Tuesdays and Saturdays. The reduction in opening hours will also affect Longtown’s library, which is set to lose a total of four hours over the course of a week. The decision to change opening hours was made by Cumbria County Council’s Carlisle local committee. It was rubber-stamped at a meeting in the city.&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["Devon","Tue, 01 Nov 2016 21:47:10 +0000","Devon – Seaton Library friends group appeals for more help – Midweek Herald. &#34;Dubbed FoSeL for short, the organisation is a band of volunteers which supports the library by fundraising for extras and helping out at events like the recent Summer Reading Challenge. Thanks to the efforts of FoSeL members and the generosity of the local community, Seaton library now runs a Lego  club for children of primary school age between 11.30am and 12.30pm, every Saturday morning at the library. The club is very popular and there is no need to book – ‘just pop in and let your imagination take flight,’ say the organisers.&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["East Riding of Yorkshire","Tue, 01 Nov 2016 21:47:10 +0000","East Riding of Yorkshire – Both Bridlington Libraries To Stay Open – Yorkshire Coast Radio. &#34;Following responses received after two rounds of public consultation on the future of the services, which included a specific proposal in the second stage of consultation, the Cabinet agreed three recommendations: Retaining a library or multi service centre in every town and larger village in the East Riding but with reduced opening hours; Retaining a mobile library service across the East Riding but with a reduced level of service; Retaining both libraries in Bridlington, but reducing the opening hours. These changes will save the council around £1.2 million, from the combined library and customer service budgets, which will be achieved without closing a single library or multi-service centre or ceasing to provide the mobile library service.&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["East Riding of Yorkshire","Tue, 01 Nov 2016 21:47:10 +0000","East Riding of Yorkshire – Library cuts will hit ‘most marginalised’ hardest – Yorkshire Post. &#34;East Riding Council’s Cabinet have agreed to £1.2m cuts which will see libraries reduce their opening hours by 25 per cent and the mobile library service withdrawn from over 50 rural villages altogether.&#34; … &#34;The cuts, which will come in next year, will see the library at the Multi Service Centre in Brough reduce its hours from 49 to 26, while Driffield and Hessle will each lose nine hours. &#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["Lancashire","Tue, 01 Nov 2016 21:47:10 +0000","Lancashire – Council budgets feel the squeeze – but their top executives still take home healthy pay packets, including one who earns more than Theresa May – Lancashire Evening Post. &#34;Yet in Lancashire, where libraries, children’s centres and rural buses have all been drastically affected, it would seem the top officers scratching around looking for savings are themselves immune from the economies. In 2012/13 there were 90 town hall staff across the county earning more than £50,000 each. Three years on, despite austerity, that figure is still 90.&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["Lancashire","Tue, 01 Nov 2016 21:47:10 +0000","Lancashire – Final chapter for East Lancashire libraries just days away – Lancashire Telegraph. &#34;The first closures will take place in the Ribble Valley, with Spring Wood children’s centre in Abbey Road shutting on Friday at noon followed by the adjacent Whalley library at noon on Saturday. Residents are now being urged to use Great Harwood and Clitheroe libraries and children’s centres as they are now the nearest facilities. Ribble Valley Councillor, Ged Mirfin, was one of the leaders of the Save Whalley Library Campaign. He said: &#34;It’s incredibly short sighted, questions have to be asked as to why this is being done now.&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["Liverpool","Tue, 01 Nov 2016 21:47:10 +0000","Liverpool – The Magnetic North, Frank Cottrell-Boyce: Liverpool Central Library – Get Into This. &#34;We queued up to have our hands marked with a library stamp as we entered the superbly refurbished Central Library. Would we get fined for not bringing our arms back in time? We wandered down to where the recital was due to take place, a small stage set up in a round room with children’s picture books at hand in racks and ranks of library computers curving around a balcony. ‘Where’s the bar?’ and ‘Can we get a drink?’ seemed to be a common refrain but this wasn’t a normal gig and it didn’t matter. The strongest thing on offer – in fact the only thing on offer – was coffee. After that initial shock; like being transported back to a Sunday in Wales in the 1960’s when strict Methodism held sway, everybody seemed quite relaxed about having a double espresso. After all, we were there for something special. And different.&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["Manchester","Tue, 01 Nov 2016 21:47:10 +0000","Manchester – Another Oasis exhibition opens in Manchester – Manchester Evening News. &#34;Acclaimed music photographer Jill Furmanovsky, who spent years on the road with the band and whose work featured in the band’s official exhibition in October , will be showcasing more of her pictures at the city’s Central Library&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["Manchester","Tue, 01 Nov 2016 21:47:10 +0000","Manchester – Manchester screening: Question Time for Entrepreneurs – Eventbrite. At Manchester Central Library. &#34;As part of Global Entrepreneurship Week 2016 we’re linking up with the British Library for a panel discussion with some top business names. Take this unique opportunity to quiz big-hitting entrepreneurs and leading business experts on how they went from small start-ups to big-time successes, including&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["Newcastle","Tue, 01 Nov 2016 21:47:10 +0000","Newcastle – ‘Selling the family silver’ – Newcastle City Council slammed for library move – Chronicle Live. &#34;Newcastle City Council has been accused of &#34;selling the family silver&#34; after it emerged they could flog much of the city’s cultural stack. The cash-strapped authority plans to sift through the extensive collection on the fifth floor of Newcastle City Library. A team of experts will then decide what to keep and what to let go. The collection contains rare manuscripts and books that have been amassed over nearly 150 years. It includes items such as complete set of the works of Sigmund Freud, different editions of Shakespeare’s works and long runs of important periodicals, such as the Times Literary Supplement.&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["North Yorkshire","Tue, 01 Nov 2016 21:47:10 +0000","North Yorkshire – Council pledges to support scheme to save libraries – Darlington and Stockton Times. &#34;A council has pledged to back a project which aims to recruit more than 100 volunteers to safeguard the futures of three local libraries. Philip Wicks approached Richmond Town Council for help with his scheme to save Richmond, Catterick Garrison and Colburn libraries, which are currently being run with just a handful of volunteers. He has proposed the group take on a short-term employee who would oversee the volunteers, help arrange their training, and organise rotas until the full team was up and running&#34; … &#34;Mr Wicks is looking for £10,000 for the project, and was delighted the council agreed to pay between £5,000 and £7,500, depending on how other town and parish councils agree to contribute&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["Plymouth","Tue, 01 Nov 2016 21:47:10 +0000","Plymouth – Reprieve for Plymouth’s libraries and toilets in council cuts re-think – Plymouth Herald. &#34;Presenting their renewed financial strategy for the next three years, Tory bosses said they must act fast to &#34;avoid a financial crisis&#34;. But thousands of pounds of potential cuts, including the possible closure of under-used libraries and public toilets, have been shelved. Instead, leader Ian Bowyer wants to focus on modernising services.&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["Sunderland","Tue, 01 Nov 2016 21:47:10 +0000","Sunderland – Tory councillor questions library closure after £500,000 spent on revamp – Sunderland Echo. &#34;The library, in Fawcett Street, was refurbished in 2014, at a cost of £500,000… It is now set to relocate to Sunderland Museum and Winter Gardens, where it will reopen in January.&#34;","2016/11/2016-the-year-the-fun-palace-became-mainstream-in-libraries.html"],["Barnet","Sun, 06 Nov 2016 19:36:28 +0000","Barnet – Strike: Barnet UNISON members to march against cuts in national demonstration – Times series. &#34;Members of Barnet Unison are urged to join the strike, and Shadow Chancellor MP John McDonnell has reached out to workers. &#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Cheshire West and Chester","Sun, 06 Nov 2016 19:36:28 +0000","Cheshire West and Chester – Big Energy events at Northwich and Winsford aim to help you reduce your bills – Northwich Guardian. &#34;Cheshire West Citizens Advice is helping people get ready for winter by hosting four events across the main libraries in Cheshire West and Chester on how to get the best value for money from their gas and electricity&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Cheshire West and Chester","Sun, 06 Nov 2016 19:36:28 +0000","Cheshire West and Chester – Cheshire West mobile library services launch new routes – Chester Chronicle.","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Conwy","Sun, 06 Nov 2016 19:36:28 +0000","Conwy – Celtic Connections ~ Literary Event at #Conwy Library – Between the lines.","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["East Riding of Yorkshire","Sun, 06 Nov 2016 19:36:28 +0000","East Riding of Yorkshire – East Yorkshire libraries to be protected – York Press. &#34;East Riding of Yorkshire Council’s cabinet announced on Tuesday that every town and larger village in the East Riding will retain a library or – in the cases of Pocklington, Brough and Market Weighton – multi-service centre, but said some would have their opening hours reduced. The council also said a mobile library service would also be continued, though the level of service was likely to be reduced, and both libraries in Bridlington will also be saved, with reduced opening hours.  &#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Essex","Sun, 06 Nov 2016 19:36:28 +0000","Essex – Meet #Chelmsford Libraries’ newest member, who lives 10,000 miles away – Essex TV. &#34;Chelmsford Libraries latest member is unlikely to visit very often – she lives more than 10,000 miles away. Six-year-old Scarlett Goody from Woongarrah, in Australia, visited the county as part of a holiday to see family in the UK, including a trip to meet her auntie who works at Chelmsford Library. Keen to make her visit as special as possible, staff invited Scarlett to join the library’s Rhymetime Session, and become an honorary member, so she could borrow books throughout her stay in the UK.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Lancashire","Sun, 06 Nov 2016 19:36:28 +0000","Lancashire – Former librarian and best-selling author laments county’s closure of libraries – Lancashire Evening Post. &#34;Andrew Hurley has taken the world by storm since leaving Kirkham library last year after releasing his novel The Loney.&#34; … &#34;But he says without being able to walk into his local library from a young age he wouldn’t have found the inspiration to forge his way as a writer. &#34;When I see what’s going on in Lancashire and all the libraries closing, it makes me very sad,&#34; said the 41-year-old from Fulwood, Preston. &#34;It’s absolutely devastating to see they’re closing so many of them. I think the worst part is once they’re gone, they’re gone – there’s no bringing them back.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Lancashire","Sun, 06 Nov 2016 19:36:28 +0000","Lancashire – Lancashire County Council considers bids to run under-threat services – BBC. &#34;Talks have begun with a number of groups, the council said, although there would be a bias towards those who could &#34;demonstrate exceptional community benefit&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Lancashire","Sun, 06 Nov 2016 19:36:28 +0000","Lancashire – Latest on transfer of LCC buildings – Blackpool Gazette.","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Lancashire","Sun, 06 Nov 2016 19:36:28 +0000","Lancashire – Residents react to Whalley library shutting – 2BR. &#34;The library will be shutting later today, as the doors close at 12.30pm.&#34; … &#34;I just wish Officers of Lancashire County Council could understand the visceral pain they have wrought via this entirely precipitate decision. &#34;By doing so they have placed themselves in an extremely invidious position because they are going to have to not only justify but also spend time re-opening libraries across the County they have closed when the Conservatives are re-elected to power at County Hall in May.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Lancashire","Sun, 06 Nov 2016 19:36:28 +0000","Lancashire – Roald Dahl illustrator joins campaign to save Silverdale library – Lancaster Guardian. &#34;Sir Quentin Blake, a children’s author who is known for illustrating Roald Dahl’s books, including the BFG, is joining the fight to stop Silverdale Library from closing.The group have been given permission to use Sir Blake’s illustrations of the BFG and Sophie on their information posters.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Lancashire","Sun, 06 Nov 2016 19:36:28 +0000","Lancashire – Sale of libraries in Preston and South Ribble should be ‘put on hold’  – Blog Preston. MP asks for delay while DCMS examines case. &#34;Mr Wallace is calling on the chief executive of the county council Jo Turton to ‘put on hold the sale of the library sites (particularly those in Fulwood and Thornton) until after the government’s investigation has been concluded.’ – he writes in a letter.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Lancashire","Sun, 06 Nov 2016 19:36:28 +0000","Lancashire – Silverdale residents bid to take over library – That’s Lancashire. &#34;Silverdale residents submit their plans to re-open the village library.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Milton Keynes","Sun, 06 Nov 2016 19:36:28 +0000","Milton Keynes – Milton Keynes libraries take to the road in search of volunteers – Milton Keynes. &#34;The aim of the Roadshow is to increase the number of volunteers throughout the library service to support paid staff and enhance Milton Keynes Libraries. There are currently over 70 volunteers helping with activities like shelving, greeting customers, IT help and home delivery services&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Newcastle","Sun, 06 Nov 2016 19:36:28 +0000","Newcastle – Newcastle City Library: Datamorphosis Highlights – Product Forge. &#34;Datamorphosis organised by Newcastle City Library on 1st October 2016. See also Flickr from the event.","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Newcastle","Sun, 06 Nov 2016 19:36:28 +0000","Newcastle – Books on Tyne offers the chance to meet some of your favourite authors in Newcastle – Chronicle. Sixth annual literary festival events for adults and kids at Newcastle City Library and the Lit and Phil","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Newcastle","Sun, 06 Nov 2016 19:36:28 +0000","Newcastle – Playwright Lee Hall hits out at decision that could see some of Newcastle’s cultural stack sold off – Chronicle and Experts warn cultural treasures could be lost in cultural stack clear out – Chronicle and What is Newcastle City Council’s cultural stack and why is some of it being sold? – Chronicle.","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Northern Ireland","Sun, 06 Nov 2016 19:36:28 +0000","Northern Ireland – A new chapter in story of Belfast Central Library as major revamp is planned – Belfast Telegraph. &#34;&#34;An outline business case has been prepared proposing the restoration of the original Central Library building on Royal Avenue, plus a new building to the rear of the iconic listed building aimed at providing some 9,000 m2 of public library space. &#34;However, development proposals are at an early stage and Libraries NI has yet to secure the necessary approvals and funding needed to take the project forward.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Oxfordshire","Sun, 06 Nov 2016 19:36:28 +0000","Oxfordshire – Libraries launch short story contest – Oxford Mail. &#34;The winners, who will be announced in March, will get to see their entries published as an eBook and available via the library website, to be borrowed and read across the county. The council’s cabinet member for cultural services Lorraine Lindsay-Gale said: &#34;Previous winners have been some of the most borrowed eBooks in our collection…&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Poole","Sun, 06 Nov 2016 19:36:28 +0000","Poole – Poole libraries play host to the the Travelling Light Theatre Tour – Blackmore Vale. &#34;‘The Mysterious Vanishment of Pobby and Dingan’, presented by Libraries West and Travelling Light Theatre Company, will be coming to Poole this month.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Powys","Sun, 06 Nov 2016 19:36:28 +0000","Powys – Literature lovers in Hay-on-Wye rally to save town of books’ library – Wales Online. &#34;But the facility in Hay-on-Wye, which was under threat of closure after a council outlined plans to cut funding, is now a step closer to being saved – with a community-led alternative plan to run it being floated.&#34; … &#34;The potential for library closures across Wales’ biggest county – and most notably in the self-dubbed town of books – was greeted with dismay by many, including Fatherland author Robert Harris.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Sheffield","Sun, 06 Nov 2016 19:36:28 +0000","Sheffield – Council on the same page as community as plan to protect Sheffield library is approved – Sheffield Telegraph. &#34;Sheffield Council has registered the Walkley Carnegie Library building as an asset of community value, following an application by users and residents.&#34; … &#34;Earlier this year councillors granted True North Brew Co permission to turn the library into a shared venue featuring a café bar. The library section – run by volunteers for almost two years – will be sub-let through the council.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Warrington","Sun, 06 Nov 2016 19:36:28 +0000","Warrington – LiveWire’s library survey reveals residents asked for more books and cafes – Warrington Guardian. &#34;The results of the survey, which was conducted between last December and January, were released under a Freedom of Information request. LiveWire said the 4,238 responses informed plans to ‘modernise’ the library service and cut £300,000 from the budget by closing nine libraries across the town. The survey showed just over 86 per cent of online respondents used their library to borrow books or ebooks.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Warrington","Sun, 06 Nov 2016 19:36:28 +0000","Warrington – Woolston Library to host Shetland murder mystery night – Cheshire Today. &#34;It is being organised to celebrate the release of Ann Cleeves’ 30th book publication, Cold Earth, which is now available across all Warrington libraries. The event follows her visit to Woolston Library earlier this year to launch her new quick read book, Too Good to be True. The book features Jimmy Perez from the Shetland series.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["West Berkshire","Sun, 06 Nov 2016 19:36:28 +0000","West Berkshire – Legality of library closures is ‘irrelevant’ – Newbury Today. &#34;Councillor Hilary Cole, who was previously responsible for libraries, admitted that the council &#34;took a risk&#34;, but refused to accept the plans were illegal. However, last week, Lee Dillon (Lib Dem, Thatcham North) said it was &#34;quite clear&#34; the council would have been neglecting its statutory duties if it followed through on the proposals. Replying to Mr Dillon at a public meeting, Dominic Boeck (Con, Aldermaston), who is now the councillor in charge of libraries, said: &#34;If it [the initial proposal] was illegal, the test would have been if it was challenged, but it wasn’t, so your question is irrelevant really.&#34;&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["West Sussex","Sun, 06 Nov 2016 19:36:28 +0000","West Sussex – Doug Eaton to talk 200 years of murder at Littlehampton Library – Littlehampton Gazette. &#34;The library is set to welcome back seasoned speaker Doug Eaton. In his talk, Doug will discuss our obsession with crime and detective novels. Hear about Sweeney Todd, Jack the Ripper and Sherlock Holmes; the rash of novels about female Private Eyes and how the First World War transformed crime fiction and the introduction of the ‘thriller’.&#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Worcestershire","Sun, 06 Nov 2016 19:36:28 +0000","Worcestershire – Outrage after poppy seller turned away from library – Evesham Journal. &#34;Red-faced council chiefs have apologised after a poppy seller was turned away from a city library. Staff at St John’s Library told the poppy seller that he could not raise money ahead of Armistice Day at the site due to a county council policy. But the conversation was overheard by an outraged library visitor who reported it to the Worcester News. And council chiefs have now issued an apology, saying the library staff were mistaken and that the sale of poppies is allowed in libraries.&#34; … &#34;the sale of poppies is not prohibited and that the staff at St John’s Library were wrong to intervene and have been made aware of the council’s policies. &#34;","2016/11/national-demonstrations-in-favour-of-libraries-lovetoread-and-placards.html"],["Barnet","Tue, 08 Nov 2016 20:40:23 +0000","Barnet – Save Barnet libraries campaigners join march in central London – Barnet Today. &#34;The Barnet Unison members joined thousands of campaigners, including members of other unions, activists and even children’s authors, at the National Libraries, Museums, Galleries demonstration. Meanwhile, back in Barnet, libraries remained closed at Burnt Oak, Chipping Barnet, Church End, Edgware, Mill Hill, North Finchley, Osidge and South Friern. And more industrial action is set to take place this Saturday (November 12) as well as during the week of Monday November 28 to Friday November 3.&#34;","2016/11/coding-clubs-triple-in-libraries-linking-library-books-to-amazon-and-a-really-quick-survey.html"],["Bolton","Tue, 08 Nov 2016 20:40:23 +0000","Bolton – Return of Astley Bridge library ‘not viable’ says council – Bolton News. &#34;Liberal Democrat campaigner Warren Fox has been leading a campaign over the last 18 months to bring back a library to residents in the town. A petition was signed by almost 1,300 residents and presented to the Mayor of Bolton in May, calling for the Grade II listed chapel at Astley Bridge Cemetery to be converted into a library, local education centre and community cafe. On October 18, Labour Executive Cabinet Member for Environmental Services, Councillor Nick Peel approved a response which stated &#34;having previously conducted a review of library provision across the borough the council considers there is adequate library provision for the area and no need for investment to provide for additional provision.&#34;","2016/11/coding-clubs-triple-in-libraries-linking-library-books-to-amazon-and-a-really-quick-survey.html"],["Bradford","Tue, 08 Nov 2016 20:40:23 +0000","Bradford – Renewed campaign for townspeople to take over Silsden library – Keighley News. &#34;Local councillor Adrian Naylor has revived his recruitment campaign for a team of volunteers to run the library in the town hall. Bradford Council has pledged to pay the majority of the running costs even after handing control of the service to townspeople. It plans to run training courses from February for volunteers willing to take over administration and staffing of the service from next April.&#34;","2016/11/coding-clubs-triple-in-libraries-linking-library-books-to-amazon-and-a-really-quick-survey.html"],["Cheshire West and Chester","Tue, 08 Nov 2016 20:40:23 +0000","Cheshire West and Chester – New routes for Cheshire West Mobile Library Service – So Cheshire.","2016/11/coding-clubs-triple-in-libraries-linking-library-books-to-amazon-and-a-really-quick-survey.html"],["Dudley","Tue, 08 Nov 2016 20:40:23 +0000","Dudley – Networking morning for aspiring writers – Dudley News. &#34;The library will be hosting an interactive Q&A session with a panel of published authors and poets on Saturday, November 26. They will be talking about the writing process and answering questions on working with publishers and agents during the session which runs from 10.30am to 1pm.&#34;","2016/11/coding-clubs-triple-in-libraries-linking-library-books-to-amazon-and-a-really-quick-survey.html"],["East Sussex","Tue, 08 Nov 2016 20:40:23 +0000","East Sussex – Uckfield Library hours are changing – Uckfield FM. Lists new hours.","2016/11/coding-clubs-triple-in-libraries-linking-library-books-to-amazon-and-a-really-quick-survey.html"],["Sandwell","Tue, 08 Nov 2016 20:40:23 +0000","Sandwell – Weigh in on smart scales at libraries – Sandwell Council. &#34;People keen to lose weight are getting help with unique smart scales – located at Sandwell libraries as part of a ground breaking health scheme. Sandwell is the first council in the country to introduce Smart scales as part of its Weigh2Go weight loss scheme. The scales are free to use and measure people’s weight, bmi and body fat and send the data straight to the user’s phone or email so people can track their weight. People need to sign up with Healthy Sandwell, part of Sandwell Public Health, to register to use the scales, which are currently located at six borough libraries.&#34;","2016/11/coding-clubs-triple-in-libraries-linking-library-books-to-amazon-and-a-really-quick-survey.html"],["Staffordshire","Tue, 08 Nov 2016 20:40:23 +0000","Staffordshire – Baswich Community Library offers community-run service – Staffordshire Newsletter. &#34;BASWICH Community Library has celebrated its new status as a community-run service. Representatives from South Staffordshire and Shropshire Healthcare NHS Foundation Trust (SSSFT) and Staffordshire County Council (SCC) were joined by guests to cut the ribbon and celebrate the new service on Wednesday. Library services at the building are now provided by a team of volunteers under the management of SSSFT and supported by SCC’s library service. Book lovers met library volunteers and viewed displays promoting the range of community groups who use the library at the ceremony. Library services such as book loans and information provision are still a core part of what’s on offer, but the intention is to work with the community to develop other functions based on what local people want and need.&#34;","2016/11/coding-clubs-triple-in-libraries-linking-library-books-to-amazon-and-a-really-quick-survey.html"],["Swindon","Tue, 08 Nov 2016 20:40:23 +0000","Swindon – Give us our say, say library campaigners – Swindon Advertiser. &#34;Current proposals would see the Cavendish Square facility closed by the middle of next year unless the community can come up with a way of securing the funds to run, stock and staff it. A petition, launched by the Parks and East Walcot Community Forum, is calling on the council to amend their decision and has topped 1,000 signatures.&#34;","2016/11/coding-clubs-triple-in-libraries-linking-library-books-to-amazon-and-a-really-quick-survey.html"],["Swindon","Tue, 08 Nov 2016 20:40:23 +0000","Swindon – Swindon campaigners join thousands to save town’s libraries – Swindon Advertiser. &#34;The group, set up earlier this year, saw around 20 members make their way to the capital for the rally which they hope will make more people aware that one of the town’s most valued services could be cut. Sarah Church, chairman of Save Swindon’s Libraries campaign said: &#34;We want to make a point nationally about a local problem.&#34;","2016/11/coding-clubs-triple-in-libraries-linking-library-books-to-amazon-and-a-really-quick-survey.html"],["Birmingham","Thu, 10 Nov 2016 22:24:07 +0000","Birmingham – Birmingham’s Young Poet Laureate – Libraries Taskforce. Includes pro library poems.","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Birmingham","Thu, 10 Nov 2016 22:24:07 +0000","Birmingham – Sutton Coldfield Town Council united in fight for library services – Sutton Coldfield Local News. &#34;Cllr Keith Ward (Con. Sutton Trinity) added that the Town Council should take a lead role in supporting the libraries as they did with the Town Hall and Cllr Pears followed this up with emphasising that the members should demand full consultation with Birmingham City Council. Cllr Pocock thanked everyone for their support and for helping to improve the wording of the motion. He agreed that assertive negotiations with Birmingham City Council were required. The motion, with a slight amendment to properly express the Town Council’s desire to take an assertive lead role, was passed unanimously.&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Essex","Thu, 10 Nov 2016 22:24:07 +0000","Essex – #Chelmsford Library to celebrate work of author Alan Bennett – Essex TV. &#34;Chelmsford Library has been selected as one of twenty libraries across the country to take part in a special ‘virtual author’ event this November. Celebrating everything Alan Bennett, the event, organised through The Reading Agency, will see the life and works of the author celebrated. The evening will see video appearances by Alan, and an actor reading extracts from his latest published diary, Keeping on keeping on. Audience members will also be called on to read diary entries covering everything from politics to the problems of getting old, and of course enjoy a cup of Tea and a biscuit…&#34;.","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Essex","Thu, 10 Nov 2016 22:24:07 +0000","Essex – SOUP Evening, Chelmsford Library | Wednesday 16 November – Chelmsford CVS. &#34;SOUP is a relatively new concept to these shores after beginning in the United States of America. So far SOUP events across Essex have raised more than £14,500 towards local grassroots projects seeking to make a real difference in their community. These are just ordinary people and local community groups looking to improve where they live, work and study. SOUP was a popular part of last year’s Art of the Possible festival and we’re looking to feature even more this year&#34;.  See this for a simple diagram of how SOUP works.","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Greenwich","Thu, 10 Nov 2016 22:24:07 +0000","Greenwich – Over a thousand march to fight museums and libraries cuts – Socialist Party. &#34;Greenwich Unite members in libraries have taken eight days of strike action so far this year to defend the library service. Our policy in Greenwich has always been to fight every cut – no matter how small. This year we took action to defend our mobile library. This service provides books to schools and nurseries and last year issued 30,000 books – and yet it was seen by Greenwich council to be old fashioned and an easy target&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Inverclyde","Thu, 10 Nov 2016 22:24:07 +0000","Inverclyde – Greenock museum to shut for £2m revamp – Greenock Telegraph. &#34;Greenock’s McLean Museum and Watt Library complex is set to undergo a £2m refurbishment — which will see the establishment closed for up to two years. The doors will shut next month to allow for emergency repairs to the building’s parapets and towers, plus window replacement, roof repairs and treatment for wet rot. High-value and fragile exhibits and artefacts are to be moved into safe storage while the work is carried out. Where possible as many archives, books and objects will be left on site in areas unaffected by the building work.&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Kingston","Thu, 10 Nov 2016 22:24:07 +0000","Kingston – Kingston Council to spend £500,000 on upgrading borough’s libraries as visitor numbers increase – Surrey Comet. &#34;Kingston Council will spend £500,000 upgrading all seven of the borough’s libraries to create a &#34;modern and dynamic&#34; service. Work has already begun on Kingston Library, with council officials pointing to increasing visitor numbers compared to figures across the country as reasoning for the upgrade. Self-service machines will replace the front desk at all seven libraries, which the council said will free up staff to promote &#34;reading, listening and discovery&#34; services. Cllr Andrea Craig, cabinet member with responsibility for libraries, said: &#34;There are really exciting changes ahead that we will see our libraries transformed into welcoming, dynamic, spaces, capable of supporting a wide range of activities and users.&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Lancashire","Thu, 10 Nov 2016 22:24:07 +0000","Lancashire – Alcohol and drug treatment organisation in library move bid – Accrington Observer. &#34;Red Rose Recovery has submitted an expression of interest with Lancashire County Council (LCC) to take over the Oswaldtwistle library building, which was closed in September . LCC has confirmed that Red Rose Recovery, which works with people in recovery from addiction to alcohol and substance misuse, is among bidders – although the nature of the bid has not been confirmed.&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Lancashire","Thu, 10 Nov 2016 22:24:07 +0000","Lancashire – Countdown to closure for library and children’s centre – Lancashire Evening Post. Will close on November 30th.","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["North Yorkshire","Thu, 10 Nov 2016 22:24:07 +0000","North Yorkshire – Volunteers book in to save library – Darlington and Stockton Times. &#34;community has rallied round to save their library with over 100 volunteers coming forward to carry on the service. Campaigners who set up a management group to take over the running of Bedale library say they’re overwhelmed at the response. Bedale is one of 21 libraries across North Yorkshire, where staff are being withdrawn from April 2017, and which are being handed over to volunteers as part of massive county council budget cuts.  Liz Bostock, of the Bedale management group said over 117 people have volunteered which means a possibility of extending opening hours.&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Sheffield","Thu, 10 Nov 2016 22:24:07 +0000","Sheffield – Shocking decline of libraries in the UK – Star / Letters. Summarises decline nationwide since 2010. &#34;As with so many vital services, with 50 per cent budget cuts from local government and more cuts in the pipeline, it is a sad truth that libraries and other local services will continue to be cut. Sheffield needs a fairer deal from central government to be able to properly fund it’s libraries and other vital services.&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Staffordshire","Thu, 10 Nov 2016 22:24:07 +0000","Staffordshire – Mary’s Primary School to take on running over Knutton Library – Stoke Sentinel. &#34;St Mary’s Primary School has stepped in to run the adjacent Church Lane facility – and safeguard its future. But staff at the school say they need at least eight volunteers to help them run the asset, which they are also hopeful of turning into a community hub.&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Staffordshire","Thu, 10 Nov 2016 22:24:07 +0000","Staffordshire – Virtual author event with Alan Bennett to be held at Stafford library – Staffordshire Newsletter. &#34;Gill Heath, Staffordshire County Council’s libraries chief said: &#34;We’re always looking to put on something different at our libraries and this is sure to be a popular event. Alan Bennett has been one of the country’s leading artists as an actor, dramatist, playwright and author, and it’s great that the new Stafford library has been chosen to host the event.&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Vale of Glamorgan","Thu, 10 Nov 2016 22:24:07 +0000","Vale of Glamorgan – Dinas Powys Library becomes third community run facility in the Vale – Penarth Times. &#34;The management of Dinas Powys Library has been formally transferred to Dinas Powys Library and Activity Centre (DPLAC), making it the third community library established in the Vale of Glamorgan after Wenvoe and Sully. The transfer comes after it was announced earlier this year that the Vale of Glamorgan Council was in discussion with community groups in five locations about taking over responsibility for running their local library including St Athan and Rhoose.&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Waltham Forest","Thu, 10 Nov 2016 22:24:07 +0000","Waltham Forest – Campaigners slam ‘inaccurate’ council claims no buses serve threatened Higham Hill Library in Walthamstow – Guardian series. &#34;Campaigners say they have &#34;no confidence&#34; in plans to shut a Walthamstow library amid claims a council report on its closure is inaccurate. Waltham Forest Council wants to sell Higham Hill Library and move services to a new premises in Priory Court, which it says will provide better accessibility and improved facilities for communities. Its report on new plans for libraries in the borough said the current building, in North Countess Road, was not &#34;directly served&#34; by a bus route.&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Warrington","Thu, 10 Nov 2016 22:24:07 +0000","Warrington – Culture crime – Warrington Guardian / Letters. &#34;Yes books are bulky and take up space. However the internet does not hold all information and an original volume and an artifact is worth a thousand pictures. Teachers could encourage students to include original material from the library in essays. Rename Bold Street as Library Row and promote the library and let the world know about the resources, not just for writers and researchers but for tourists too. I am sure there are many ideas that can be forwarded to develop and expand one of Warrington’s most valuable assets.&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Warrington","Thu, 10 Nov 2016 22:24:07 +0000","Warrington – Application to move Warrington Library to Funky Dory Shoes in Golden Square Shopping Centre withdrawn hours before decision on plans due – Warrington Guardian. &#34;A planning application to move the country’s first publicly-funded library into a shoe shop in Golden Square has been withdrawn hours before councillors were set to make a decision on the proposals. Livewire had applied for a change of use of the unit that presently houses Funky Dory Shoes in the shopping centre, with Warrington Library having looked set to move into the shop if the plans had been passed. Councillors were set to decide whether to grant planning permission for the scheme at this evening’s development management committee, but the application was withdrawn this afternoon.&#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Windsor and Maidenhead","Thu, 10 Nov 2016 22:24:07 +0000","Windsor and Maidenhead – Advice amongst the books: Citizens Advice Maidenhead & Windsor – Community Fund Aviva. &#34; A lack of local services and infrequent public transport only makes life harder. Over 7000 people live in rural areas across our Borough and reaching out to them is challenging. One service which visits rural areas on a regular basis is the mobile library, and Citizens Advice Maidenhead & Windsor would like to employ a Citizens Advice Adviser, part time, to travel with the mobile library service to provide advice and support amongst the books. We have agreement from the mobile library service for this partnership project. Our Adviser will also provide home visits for isolated people who cannot access our service any other way because of health issues, carer responsibilities or other challenges. &#34;","2016/11/more-money-for-kingston-more-volunteers-in-staffordshire-and-others.html"],["Cambridgeshire","Sun, 13 Nov 2016 21:19:19 +0000","Cambridgeshire – Protest: Bookworms in Cambridge furious over plans to slash spending on library books – Cambridge News. &#34;City MP Daniel Zeichner joined bookworms from across the city who are up in arms about Cambridgeshire County Council’s plan to slash spending on library books. They gathered at noon yesterday outside the Central Library in Grand Arcade to demonstrate their feelings and put pressure on county council chiefs to scrap the plan. The protesters held up library books that they plan to #wavetosave. The £325,000 planned cut will mean fewer books available in Cambridge’s public libraries for readers to borrow.&#34;","2016/11/250-ideas-and-innovations-in-public-libraries-and-the-rest-of-the-public-libraries-news.html"],["Cornwall","Sun, 13 Nov 2016 21:19:19 +0000","Cornwall – Library changes debated – Cornish Times. &#34;Cornwall Council cabinet members have been debating changes to library services and offices across Cornwall which involve devolving libraries and one stop shops to local councils and community organisations. Geoff Brown, the cabinet member for communities, said the council’s actions meant none of Cornwall’s 31 libraries had closed.&#34;","2016/11/250-ideas-and-innovations-in-public-libraries-and-the-rest-of-the-public-libraries-news.html"],["Haringey","Sun, 13 Nov 2016 21:19:19 +0000","Haringey – Muswell Hill library to stay in its historic home – for now – Ham and High. &#34;Plans to move the Muswell Hill Library from its beloved and historic home to the site of a former pub have been put on hold&#34; … &#34;Of the 1,282 people who responded, 71 per cent said they wanted the library to remain in its Grade II-listed building. Just 29 per cent supported moving it to the former site of the Green Man, under a new block of flats. In response, Haringey Council said on Tuesday it will revisit all its options, and make a decision in spring 2017. The option to use both sites has been put forward.&#34;","2016/11/250-ideas-and-innovations-in-public-libraries-and-the-rest-of-the-public-libraries-news.html"],["Lancashire","Sun, 13 Nov 2016 21:19:19 +0000","Lancashire – Cat Smith MP on libraries – YouTube. &#34;Unfair Conservative Government cuts have meant that Lancashire County Council can’t afford to run the services they want to run. They don’t want to close libraries or other services but when independent financial assessments say that there is no way that the council won’t go bankrupt in 2 years there aren’t many options on the table. I joined local community campaigners outside Cleveleys Library making the case for fair funding for our councils.&#34;","2016/11/250-ideas-and-innovations-in-public-libraries-and-the-rest-of-the-public-libraries-news.html"],["Lancashire","Sun, 13 Nov 2016 21:19:19 +0000","Lancashire – Lostock Hall library next in Lancashire closures – Lancashire Evening Post. &#34;Lostock Hall Library will close its doors for the last time as more than 200 buildings begin shutting. It has been confirmed the library will close on November 30 at 12.30pm. The children’s centre will close on the same day at 5pm.&#34;","2016/11/250-ideas-and-innovations-in-public-libraries-and-the-rest-of-the-public-libraries-news.html"],["Lancashire","Sun, 13 Nov 2016 21:19:19 +0000","Lancashire – Two more Lancashire libraries saved – 2BR. &#34;Coppull and Eccleston were set to see their libraries close and become ‘satellite libraries’, but will continue running as normal until March 2018. That’s because they’ll retain their current level of provision whilst the community can make plans to take over the libraries themselves.&#34;","2016/11/250-ideas-and-innovations-in-public-libraries-and-the-rest-of-the-public-libraries-news.html"],["Leicester","Sun, 13 Nov 2016 21:19:19 +0000","Leicester – ‘Wow – just wow&#39;: People power saves Leicester library – Leicester Mercury. &#34;Officials have ditched controversial proposals to close Belgrave Library after working out it would &#34;not be cost-effective&#34;. Leicester City Council had proposed, as a cost-cutting measure, to shut the building in Cossington Street and transfer the service to the nearby Belgrave Neighbourhood Centre, in Rothley Street. But following a determined campaign by Belgrave residents to oppose the move, the council has decided to keep the status quo.&#34;","2016/11/250-ideas-and-innovations-in-public-libraries-and-the-rest-of-the-public-libraries-news.html"],["Northern Ireland","Sun, 13 Nov 2016 21:19:19 +0000","Northern Ireland – First chief of Libraries NI announces her retirement – Belfast Telegraph. &#34;Irene Knox, the first ever chief executive of Libraries NI, which was established in April 2009, is to retire early in the new year. Ms Knox (59) has spent the last few years trying to maintain the standard of libraries here against the backdrop of relentless redundancies and stringent budget cuts. Speaking exclusively to the Belfast Telegraph, Ms Knox said she was extremely pleased with what she had done in her role as creator and boss of Libraries NI.&#34; … &#34;Since its formation in 2009, Libraries NI has lost nearly 150 employees through voluntary severance schemes rolled out every year, and stock has never been lower&#34;","2016/11/250-ideas-and-innovations-in-public-libraries-and-the-rest-of-the-public-libraries-news.html"],["Plymouth","Sun, 13 Nov 2016 21:19:19 +0000","Plymouth – Fines could increase at libraries across Plymouth – Plymouth Herald. &#34;Plymouth City Council bosses are considering increasing fees at the city’s 17 libraries, as they continue to address a £37million budget shortfall over the next three years.  This could mean an increase in overdue book fines, currently 13p per day for adults and 2p per day for children; borrowing DVDs, journal articles and musical scores; hiring musical instruments and toys; photocopying and scanning; research services; and hiring library meeting rooms.&#34;","2016/11/250-ideas-and-innovations-in-public-libraries-and-the-rest-of-the-public-libraries-news.html"],["Suffolk","Sun, 13 Nov 2016 21:19:19 +0000","Suffolk – iPad lending in Suffolk – Libraries Taskforce. &#34;The project began with a request from a library that wanted to find a way to make tablets available to customers who did not own that kind of technology and were unable to get access online services. The first step was to trial a number of different tablets. Library staff and the local friends group road tested a range of different devices and agreed that the iPad Mini would be best suited to library customers because of its ease of use, durability and compatibility with our digital services.&#34; … &#34;This project also created a valuable partnership with a local electrical retailer. They had been supportive of a programme of digital skills development called ‘Get Connected’ events in the past. Now they supply the iPads as well as providing expert staff for launch events in libraries.&#34; … &#34;One library is using its iPads as part of a training programme for older people; customers attend a training session, borrow a device for 3 weeks and then return to a further tra&#8230;","2016/11/250-ideas-and-innovations-in-public-libraries-and-the-rest-of-the-public-libraries-news.html"],["Bradford","Tue, 15 Nov 2016 20:24:34 +0000","Bradford – Volunteers celebrate five years running Denholme Community Library – Keighley News. &#34;The trailblazing team will highlight the success during their annual general meeting on Tuesday, November 15 at 2pm in the village’s Mechanics Institute. The volunteers are also running hosting a coffee morning at the Institute – which is home to the library – on November 26 from 10.30am to 11.30am. Annette Bell, coordinator of the library, said the dedicated volunteers had run the library successfully for five years with support from Bradford Council’s Library Service.&#34;","2016/11/focus-on-school-libraries.html"],["Cumbria","Tue, 15 Nov 2016 20:24:34 +0000","Cumbria – Public consultation into library plans – Times and Star. &#34;People will be consulted over plans to turn Cockermouth Library into a community hub run by the town council.&#34; … &#34;Cumbria County Council’s Allerdale local committee has supported the proposal, which would see the tourist information centre move into the Main Street building. But concerns have been raised about the effect the changes would have on the library service. The county council has now agreed to consult on the plans.&#34;","2016/11/focus-on-school-libraries.html"],["Lancashire","Tue, 15 Nov 2016 20:24:34 +0000","Lancashire – Let’s rejoice that we still have libraries – Burnley Express. History of Burnley Library.","2016/11/focus-on-school-libraries.html"],["Oxfordshire","Tue, 15 Nov 2016 20:24:34 +0000","Oxfordshire – November news from Cholsey Community Library – Cholsey Community Library. &#34; At the end of October we had out latest and last County book exchange. Please do take a look at the lovely new titles available to borrow now for our usual 3 weeks. Sadly this is our last exchange from the County Library service. As you may be aware Oxfordshire County Council are facing large budget cuts in all areas of their service and as we are a well stocked library our Committee and County agreed to allow these books to used in other Libraries with greater needs than ours. We have had a wonderful service and support from County since we opened and we hope that other Libraries can continue to enjoy these books as much as we have.  We are such a well stocked library due to the wonderful support from Friends, committee and volunteers who fundraising and donations allow us to keep our shelves well stocked and up to date …&#34;","2016/11/focus-on-school-libraries.html"],["Rutland","Tue, 15 Nov 2016 20:24:34 +0000","Rutland – Plans go on display for refurbishment of Oakham Library – Rutland and Stamford Mercury. &#34;Oakham Library was built in 1972 and is the largest of Rutland’s libraries. The service is incredibly well-used, receiving about 90,000 visits every year, but has changed very little since it first opened.Earlier this year Rutland County Council agreed to invest up to £280,000 in Oakham Library to refurbish facilities and ensure it can continue to serve residents over the next 25 years. This will include work to the lighting, flooring, ceiling and electrics, as well as repairs to the roofing outside. &#34;","2016/11/focus-on-school-libraries.html"],["South Tyneside","Tue, 15 Nov 2016 20:24:34 +0000","South Tyneside – The Word – design thinking for our time – Designing Libraries. &#34;The focus of The Word is very clearly regional, but it has for its strapline ‘The National Centre for the Written Word’. How much of this is hyperbole and how much a genuine ambition to become a beacon for the transformation of libraries as cultural and civic centres, combining the tradition of the printed word with new technology and individual creativity, remains to be seen. But there is no doubt that The Word has set the standard for design thinking in the UK.&#34;","2016/11/focus-on-school-libraries.html"],["Waltham Forest","Tue, 15 Nov 2016 20:24:34 +0000","Waltham Forest – A history of library cuts and book burning in Waltham Forest – Guardian series. Looks at reductions in stock and other cuts over the last decade&#34;.","2016/11/focus-on-school-libraries.html"],["Cambridgeshire","Thu, 17 Nov 2016 20:11:32 +0000","Cambridgeshire – Library Services Manager – Cambridgeshire Council. &#34;Cambridgeshire Library Service has a reputation for innovation, and with 4 new libraries planned for the next few years – the first opening in 2017 – you could play a crucial role in these developments. Based in the world renowned city of Cambridge, this role is the professional and functional lead for an innovative and inspiring county library service. It requires an experienced and capable leader, with expert knowledge of the sector, and the ability to shape the delivery of library services as part of a network of multi-agency community hubs. You will be responsible for the effective management of strategic change projects, operational delivery, and strengthening partnership working. You will be expected to maintain and improve the performance of front-line services and enhance the customer experience using the latest technologies and digital interfaces.&#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Cheshire West and Chester","Thu, 17 Nov 2016 20:11:32 +0000","Cheshire West and Chester – Move planned for Chester Library – Cheshire Today. &#34;The public is being invited to drop-in sessions to find out more about the changes taking place with Chester Library between now and the opening of Storyhouse – the new £37m theatre, cinema and library space. The sessions, hosted by Cheshire West and Chester Library Service and Storyhouse, take place on Thursday 1 December from 11am to 2pm, and Monday 5 December from 4pm to 7pm in Chester Library, Northgate Street. Visitors will be able to find out more about the new Storyhouse library including the dedicated children’s library, complete with an arts/crafts messy play area and a storytelling room; dedicated family and local history section; improved digital facilities and services; flexible event spaces; increased opening hours and opportunities to get involved.&#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Cornwall","Thu, 17 Nov 2016 20:11:32 +0000","Cornwall – Free Wi-Fi in Cornwall’s libraries – Packet. &#34;Mark Read, Cornwall Council service director for customer access and digital services, said: &#34;The introduction of free Wi-Fi, which allows people to access the internet through their own phone or other device whilst in the library, provides a great opportunity for people to have free, instant, easy access to council services online. &#34; [This seems like something from two or three years go – Ed.]","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Coventry","Thu, 17 Nov 2016 20:11:32 +0000","Coventry – ‘We are still being subjected to explosives being detonated around the city– Coventry Telegraph / Letters. &#34;The people of Coventry pay their council tax and should have their say in how the money is spent. Money is wasted in so many areas and a good council would find a way to save these wonderful amenities that have been a way of life for many people over many years.&#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Enfield","Thu, 17 Nov 2016 20:11:32 +0000","Enfield – Criticism triggers rethink on Enfield library – Haringey Advertiser. &#34;The detailed plans unveiled at a meeting of Enfield Council on Wednesday last week show that library provision at the Hertford Road site would be slashed by 75 per cent. Instead the borough’s main sexual health clinic will be sharing the ground floor with the adult and children’s library.&#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Hertfordshire","Thu, 17 Nov 2016 20:11:32 +0000","Hertfordshire – Watford library given new lease of life with £400,000 makeover – Watford Observer. &#34;Watford Central Library has been given a new lease of life with a £400,000 makeover. New facilities at the Hempstead Road building include a state-of-the-art &#34;creator space&#34; – a first for libraries in Hertfordshire – filled with cutting edge technology such as tablet computers and 3D printers available for public use. Charges for the equipment vary but are being kept &#34;affordable&#34;. For example, a 3D printer costs just £5 per hour to use.&#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Kent","Thu, 17 Nov 2016 20:11:32 +0000","Kent – Dartford Library reopens after a £650,000 restoration to mark its centenary year – Kent Online. &#34;Despite the amount of money and time poured into the restoration, the guiding principle of the project was to ensure that the building maintained its heritage. Walls and flooring have been redecorated, new furniture has been installed, art displays are dotted many of the rooms, and original listed bookshelves have been refurbished.&#34; … &#34;Changing facilities and toilets have been added, as has a new meeting room for groups and societies, and a Centenary Room has been created for use for deaths and births registrations.&#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Nottingham","Thu, 17 Nov 2016 20:11:32 +0000","Nottingham – City council buys Sneinton Police Station for library plans – Nottingham Post. &#34;Sneinton Police Station is set to become a library after Nottingham City Council bought the building – but officers will also continue to work from the site. The remodelled building in Sneinton Dale will be renamed The Dales Centre under plans by the city council, in partnership with Nottinghamshire Police.&#34; … &#34;The council said that previous public consultation conducted in 2016 showed overwhelming local support, with over 80 per cent of responses in favour of the plans.&#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Nottingham","Thu, 17 Nov 2016 20:11:32 +0000","Nottingham – Huge new office development to be built on Nottingham Central Library site – Nottingham Post. &#34;One of the most prominent public buildings in the city centre is to be transformed into new offices – after Nottingham City Council confirmed plans to sell Central Library to a development company. Nottingham City Council has approved a decision to sell Central Library, in Angel Row, to construction and property business Henry Boot Developments Limited. The site is currently home to the 30,000 sq ft four-storey library – which houses exhibition spaces, meeting and study rooms, a family history research area and a contact centre – but it is set to be transformed into 120,000 sq ft office block. The city council said Central Library will either be retained on the same site within the new development, or an alternative central location will be sought for the facility.&#34; see also Council to invest in new city library for Nottingham – West Bridgford Wire. &#34;The sale of the Angel Row site will mean money becomes available fo&#8230;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Rutland","Thu, 17 Nov 2016 20:11:32 +0000","Rutland – Controversial proposal to move Visions Children’s Centre to Oakham Library site is approved by councillors – Stamford Mercury. &#34;Councillors have voted to approve controversial plans to relocate the Visions Childrens Centre to a new extension at Oakham Library.&#34; … &#34;Coun Mark Oxley (Ind) said: &#34;The library is an ugly building in the centre of a conservation area. We are proposing an ugly extension on the back of an ugly building.&#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Swindon","Thu, 17 Nov 2016 20:11:32 +0000","Swindon – Over a thousand in call to save library – Swindon Advertiser. &#34;A petition calling on Park Library to be saved when the council reveals the future of the service has received 1,100 signatures. Despite serving one of the most economically disadvantaged communities in Swindon, and being among the most visited of the 15 libraries in the town, Park is set for closure amid drastic cuts to the libraries provision in Swindon.&#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Swindon","Thu, 17 Nov 2016 20:11:32 +0000","Swindon – Teachers and students praised by author as literature festival inspires more visits to school library – This is Wiltshire. &#34;The festival was launched by children’s laureate and prolific writer and illustrator Chris Riddell, and welcomed in a headline reading at The Wyvern Theatre from Geek Girl author Holly Smale. &#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Vale of Glamorgan","Thu, 17 Nov 2016 20:11:32 +0000","Vale of Glamorgan – New hub opens at library – Barry and District News. &#34;Construction of the new facility – which is a result of a £100,000 investment by the Vale council – was completed in October and opened on November 7. The facility includes three classrooms, computer suite, computer suite, office space and crèche. Councillor Lis Burnett, cabinet member for regeneration and education, said: &#34;Education and lifelong learning is central to the Vale of Glamorgan Council’s regeneration work and where better to locate a learning hub than the library, the first port of call for anyone seeking information.&#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Walsall","Thu, 17 Nov 2016 20:11:32 +0000","Walsall – Peeved parents stage walk-in protest amid proposed closure of Streetly Library – Sutton Coldfield Observer. &#34;VEXED families and users of Streetly Library staged a surprise walk-in demonstration last week (November 4) – in protest of the proposed closure. Walsall Council plan to shut every single one of its local libraries – 15 in total – and just keep Walsall Central Library open in a bid to save £86m by 2020. However, angry mothers and grandmothers stormed into the Blackwood Road facility last week to demand action. Rohanna Preece, who takes her two boys to the library every week, said: &#34;On Friday, November 4 we, the people who use Streetly Library all of the time, held a surprise walk-in to show our support for the facility. &#34;We have other events planned including a coffee morning on December 3 to celebrate the library.&#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["West Berkshire","Thu, 17 Nov 2016 20:11:32 +0000","West Berkshire – ‘Where is back-up plan for library volunteers?‘ – Newbury Today. &#34;West Berkshire Council has no back-up plan if volunteers don’t come forward to save libraries, it was claimed this week. Campaigners protested in force when Theale Library was earmarked for closure and now West Berkshire Council is asking residents to step in and save the service. The council is consulting on three options for the district’s libraries, with the most severe cut resulting in all library staff outside of Newbury axed and seven branch libraries run by volunteers. Option B would see would create a ‘hub and spoke’ library network, replacing half the staff at two branches and the remaining five run entirely by volunteers. The final option would see staffing levels at seven branches halved, with volunteers taking up the slack. Discussing the consultation at a meeting on Monday, parish councillors asked what would happen if volunteers did not come forward.&#34;","2016/11/refurbishments-commitments-and-shocked-librarian-reactions-to-president-trump.html"],["Aberdeenshire","Mon, 21 Nov 2016 20:22:20 +0000","Aberdeenshire – Council plans have ‘crossed a red line’ – Mearns Leader. &#34;Stonehaven and District Community Council Chairperson Phil Mills-Bishop has reacted angrily to proposals by Aberdeenshire Council to transfer ownership of their Sports and Culture services to a charitable trust. Mr Mills-Bishop was referring to a report due to go before Full Council next week (Thursday November 24) which states that a preferred option for the future of services including sports centres, swimming pools, libraries, museums and community centres would see them go into ownership of a charitable trust run by a board of directors.&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Argyll and Bute","Mon, 21 Nov 2016 20:22:20 +0000","Argyll and Bute – 250 council staff to be transferred if trust plan gets green light – Helenburgh Advertiser. &#34;Almost 250 Argyll and Bute Council staff will be transferred to a new employer if plans to set up a new charitable trust are approved next week. Members of the authority’s community services committee will be asked to approve the creation of a trust to run the area’s leisure and library services when they meet in Lochgilphead on Monday, November 21. A total of 247 council staff will see their employment transferred under TUPE regulations to the new trust if the recommendation is approved.&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Birmingham","Mon, 21 Nov 2016 20:22:20 +0000","Birmingham – Autumn statement: Birmingham MPs warn leisure centres, libraries and social care are close to collapse – Birmingham Mail. &#34;Birmingham MPs have issued a plea to Chancellor Philip Hammond to prevent &#34;catastrophic&#34; cuts to the city’s libraries, leisure centres and services for the elderly, ahead of the Autumn Statement on Wednesday. They say the city’s council and NHS services are set to go over budget by £150 million next year. And they warned: &#34;Unless the Government acts we now risk the collapse of some basic services next year and in subsequent years.&#34;&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Birmingham","Mon, 21 Nov 2016 20:22:20 +0000","Birmingham – Libraries in Birmingham will be closed for 9 days for Christmas and New Year 2016 – Birmingham Mail. &#34;Birmingham’s community libraries will shut down for nine days over Christmas and new year as a result of public and staff holidays leaving too few people to keep them open. The city council has announced that no libraries will be open from Christmas Eve to January 2, leaving residents without access to information and books for more than a week&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Bradford","Mon, 21 Nov 2016 20:22:20 +0000","Bradford – Renewed campaign for townspeople to take over Silsden library – Craven Herald. Cost is low but volunteers needed.","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Brent","Mon, 21 Nov 2016 20:22:20 +0000","Brent – Ealing Road Library Redevelopment – James Powney’s Blog. &#34;there is obviously some thought into how to develop the site in a way to help the Town Centre.  I think all Brent libraries have this potential to some extent, with Willesden and Wembley being perhaps the best examples.  I like the way the author is trying to get the open space to fit in with the buildings and be part of a wider vision for the future of Ealing Road in what he calls a &#34;gem chain strategy&#34;.&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Brent","Mon, 21 Nov 2016 20:22:20 +0000","Brent – Stars to host fundraising entertainment night for Kensal Rise Community Library – Brent and Kilburn Times. &#34;The event by the Friends of Kensal Rise Library (FOKRL) includes live performances of poetry and prose by award-winning actors and actresses who live locally.&#34; … &#34;FOKRL have already hit their £80,000 target of their first phase of fundraising which allows them to turn a community space into a volunteer-run reading room.&#34; … &#34;However they now need to raise the extra cash so they can buy equipment and furniture for the library in Bathurst Gardens. Margaret Bailey, chairwoman of FOKRL, previously told the Times: &#34;£160,000 in total is a lot to ask for the refurbishment of the shell we will inherit.&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Cheshire East","Mon, 21 Nov 2016 20:22:20 +0000","Cheshire East – Blame our MP – Knutsford Guardian / Letters. &#34;Every week the Guardian carries a report of a threat to, reduction of, or actual closure of a public service. Last week (November 9) it was threats to local libraries and to Macclesfield Hospital’s A&E department. Over the country nearly 400 libraries have closed and 8,000 jobs lost over the past few years. Our regional health authorities are being told to reduce spending by £900 million in the next four years. I’m afraid the finger has to be pointed at our local MP George Osborne. While Chancellor he instigated the policy of &#34;austerity&#34;&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Essex","Mon, 21 Nov 2016 20:22:20 +0000","Essex – ‘Could there be anything more beautiful, more aspirational or more sexy than a public library?’ – Gazette News. &#34;I know it’s probably technically cheating (because you’re only allowed one book) but if I were ever on Desert Island Discs and invited to name the luxury I could take with me Stanway Library would be high on the list. &#34; … &#34;Sharing knowledge for free, a repository where pages and pages of facts, fantasy and fiction can be the gateway to your soul. &#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Glasgow","Mon, 21 Nov 2016 20:22:20 +0000","Glasgow – Glasgow Libraries are giving away free books at GoMA today ahead of Book Week Scotland – Glasgow Live. &#34;How often do you borrow a brilliant book from your local library, and wish you could keep it forever?  Well, today you’ll be able to do just that, as Glasgow Libraries pop up at GoMA to give away free copies of the fantastic Secrets and Confessions, a collection of our author James Oswald, said: &#34;I’m fortunate enough to have grown up in a house full of books…&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Haringey","Mon, 21 Nov 2016 20:22:20 +0000","Haringey – Muswell Hill: Row erupts over plans to move library to ‘dark and oppressive pub’ – Evening Standard. &#34;Friends of Muswell Hill Library oppose proposals to move it from a Grade II listed building in Queens Avenue to the site of the Green Man pub, which they say is &#34;a dark, oppressive space with low ceilings&#34; under new flats. Last week, results of a public consultation revealed that 71 per cent of the 1,282 people who responded wanted the library to remain. Just 29 per cent backed moving it to the pub site. But George Danker, 25, who heads the Friends of Muswell Hill Library, said the council was still considering the Green Man site. &#34;It shows that they are not acting consistently with democracy.&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Hertfordshire","Mon, 21 Nov 2016 20:22:20 +0000","Hertfordshire – Library celebrates volunteering award – St Albans Review. &#34;A team of 45 volunteers who run the Chorleywood Library were voted runners up in the Volunteer Team of the Year category at Hertfordshire Year of Volunteering Awards 2016. Teresa Heritage, cabinet member for libraries, presented the award and councillor Chris Hayward, who provided start-up funding for the library, was given a book-shaped cake. The Communities Libraries scheme, launched last year, was part of Hertfordshire’s County Council’s plans to keep 46 libraries across the county open, while slashing their budgets&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Lambeth","Mon, 21 Nov 2016 20:22:20 +0000","Lambeth – Act quickly, Carnegie library campaigners urge – Brixton Blog. &#34;Library campaigners are urging supporters of the Carnegie library in Herne Hill to act quickly to comment on a planning application to convert the Grade II listed building into a &#34;neighbourhood library&#34; and gym run by Lambeth council’s leisure provider GLL, now known as &#34;Better&#34;. Comments on the application close in less than a fortnight on 29 November. Campaigners said that the plans would not only wreck a listed building, but also its &#34;unique&#34; garden.&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Lancashire","Mon, 21 Nov 2016 20:22:20 +0000","Lancashire – Trawden library will be saved – it’s just a question of who by – 2BR. &#34;Two bids have been put in for the building, which could see the service continue. The first could see a nursery on the site, whilst the other would see it taken over by the owners of the village’s community centre.&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Lancashire","Mon, 21 Nov 2016 20:22:20 +0000","Lancashire – Village libraries in Eccleston and Coppull get a reprieve – Chorley Citizen. &#34;A deal between Chorley Council and Lancashire County Council, will ensure a favourable ending for the hundreds who campaigned to save them … The libraries will now retain their current level of provision until March 2018, giving time for a community-based service to be considered. &#34; … &#34;Chorley Council will provide almost £100,000 funding to allow the county council to maintain the level of service while other options are considered. &#34; see also Another two years for Coppull library – 2BR.","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Leicester","Mon, 21 Nov 2016 20:22:20 +0000","Leicester – Staffless library opening planned as part of £1.3m county council savings – Leicester Mercury. &#34;Officials at County Hall have drawn up proposals to allow people to use their library cards to swipe their way in when there are no employees present. Books could then be borrowed and returned by using existing self-service scanning machines&#34; … &#34;The county council is planning a three-month trial of the idea at Syston library starting early next year. If the scheme succeeds it will be rolled out to 15 of the council’s largest libraries in a move that could save £300,000.&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Neath Port Talbot","Mon, 21 Nov 2016 20:22:20 +0000","Neath Port Talbot – Residents urge council to save local libraries from funding cuts as it tries to save £11 million – South Wales Evening Post. &#34;Unison members joined the concerned residents at Baglan Library along with Aberavon AM David Rees and MP Stephen Kinnock. They said they wanted to send a message to Neath Port Talbot Council to keep Skewen and Baglan Libraries and Cefn Coed Museum safe from cuts as it looks to save around £11.2 million.&#34; … &#34;&#34;NPT libraries have already experienced more than their fair share of cuts over the last four years, with funding being cut by over £600,000. Healthy communities need decently funded, professionally run library services and therefore, more library cuts is not a credible option.&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Nottingham","Mon, 21 Nov 2016 20:22:20 +0000","Nottingham – City Council confirms sale of library to Henry Boot – Business Desk. &#34;Cllr Jon Collins, leader of the City Council, said: &#34;Henry Boot are committed to providing the kind of top end office space businesses have been crying out for and helps us achieve our pledge to provide a new, revamped central library facility to meet the future needs of our citizens and visitors to the city. I understand people’s concerns about the sale and where the library will go but rest assured – there will be a central library in Nottingham.&#34;&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Nottingham","Mon, 21 Nov 2016 20:22:20 +0000","Nottingham – Hundreds sign petition opposing plans to build offices on Nottingham Central Library site – Nottingham Post. &#34;…, almost 400 people have signed an online petition against the sale of the library. A spokesman for anti-austerity group Nottingham People’s Assembly, which set up the petition 48 hours ago, said: &#34;While recognising that the building is in need of refurbishment, our concerns are that there appear to be no clear plans about maintaining service while the building is renovated.&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["South Lanarkshire","Mon, 21 Nov 2016 20:22:20 +0000","South Lanarkshire – As the UK’s oldest subscription library reaches a milestone, what is the future for its founding principles? – Herald Scotland. &#34;Later this month, the library, founded in 1741, will celebrate its 275th anniversary; villagers will meet in its single musty room to look at the newly-restored banner, the oldest in the country, and hear about the latest efforts to preserve and, perhaps, digitise the collection. But those who are closest to it – its trustees and committee members – are conscious of an irony: as they work to raise awareness of its significance, the tradition of learning it pioneered is threatened. &#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Western Isles","Mon, 21 Nov 2016 20:22:20 +0000","Western Isles – Let’s take in a movie- at the library – Island News. &#34;HebFlicks was created to allow members of the public in both Tarbert, Harris and Lionacleit, Benbecula  to enjoy a wide range of film screenings at their local library. The monthly club will screen its first films next Wednesday (23 November), book to film adaptations as part of Book Week Scotland, at both libraries for free. The club will then show a variety of films each month.The two films planned for next week are … The pioneering film club is one of six being trialled in Scotland as part of SLIC’s Film Education in Libraries Project. The £190,000 initiative was made possible through Creative Scotland as part of their Film Strategy and aims to improve the provision of film and moving image education across Scotland.&#34;","2016/11/being-free-about-being-free-the-charging-survey-results.html"],["Barnsley","Wed, 23 Nov 2016 20:12:12 +0000","Barnsley – Libraries review – Barnsley Council. &#34;The first stage of the review is a six week period of engagement in October and November 2016. This will help us to understand your needs. Tell us how you use libraries and what will be important to you in the future. We have a statutory responsibility to provide a comprehensive and efficient library service for local people, but in the context of changing demands, advancing technology and reducing budgets there is a need for change in coming years.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Bristol","Wed, 23 Nov 2016 20:12:12 +0000","Bristol – Big decisions tough choices – Bristol Council. &#34;People have high expectations and often care greatly about associating a specific service with a specific building, such as ‘My Library’. We can’t afford gold-level services or to keep all our assets&#34; … &#34;we must move away from a preference on dedicating buildings like libraries and community centres for single services. This may mean more community hubs with mixed uses and more access to convenient online services, rather than keeping all our library and Citizen Service Point buildings.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Bristol","Wed, 23 Nov 2016 20:12:12 +0000","Bristol – Corporate Strategy – Bristol Council. &#34;We will be exploring options such as: • Community groups to run local community hubs which include library services; Running some services from shared buildings; Developing an alternative model to run the remaining Bristol City Council owned libraries as a Trust or a Mutual; The level of savings will depend on the approach taken.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Cheshire West and Chester","Wed, 23 Nov 2016 20:12:12 +0000","Cheshire West and Chester – Chester Library drop-in sessions will reveal more about its new home – Chester Chronicle. &#34;Residents are invited to drop-in sessions to find out more about the exciting changes taking place with Chester Library between now and the opening of Storyhouse – the new £37m theatre, cinema and library space.&#34; … &#34;Visitors will be able to find out more about the new Storyhouse library including the dedicated children’s library, complete with an arts/crafts messy play area and a storytelling room; dedicated family and local history section; improved digital facilities and services; flexible event spaces; increased opening hours and opportunities to get involved.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Devon","Wed, 23 Nov 2016 20:12:12 +0000","Devon – Developers’ boost to help with library move – View News. &#34;Friends of Ottery Library have received a welcome boost after receiving £1,000 towards the imminent relocation. The donation came from house builders Persimmon Homes, who gave the money to help the library move from its current location to the former NatWest building which is currently being renovated. The library has been in its current spot since the 1970s but does not have wheelchair or pushchair access and has inadequate space for books.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Coventry","Wed, 23 Nov 2016 20:12:12 +0000","Coventry – Budget: Coventry council admits it can no longer protect most vulnerable – Coventry Telegraph. &#34;The city council will have shaved £650million from its spending in 2020 compared to 2010 as £120m of central government funding is pulled as a result of national austerity measures.&#34; … &#34;These latest cuts follow the news that hundreds of children with physical disabilities and learning difficulties face cuts to school transport, while library provision is also set to be massively cut&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Edinburgh","Wed, 23 Nov 2016 20:12:12 +0000","Edinburgh – Final mystery book sculpture settles at Edinburgh Central Library – Edinburgh Council. &#34;Created by an anonymous sculptor, the Butterfly Tree and the Lost Child is one of numerous intricate artworks to have appeared around Edinburgh over the last five years. The 2m tall tree, accompanied by a small paper child holding a book, features butterfly-shaped leaves made by members of the public from as far afield as Spain, Greece and the US, contributed after the artist made a call-out for donations. First unveiled at the Edinburgh International Book Festival (external link) in August, the work has been donated to the Central Library, where it will be kept on permanent display on the windowsill of the staircase leading to the Reference Library.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Essex","Wed, 23 Nov 2016 20:12:12 +0000","Essex – Libraries across Essex to support the Big Knit – Essex TV. &#34;Residents can help this year’s fundraising drive by joining Knit and Natter groups at libraries across Essex, knitting mini woolly hats in aid of Age UK Essex. Teaming with drinks brand Innocent, each hat donated will be placed on a bottle of Innocent Smoothie and sold, with 25p going to Age UK Essex. The deadline for contributions to the 2016/2017 campaign is Friday, 20 January, with the aim of beating last year total of 11,000 hats.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Essex","Wed, 23 Nov 2016 20:12:12 +0000","Essex – Library to reduce opening hours – council calls on volunteers to help secure its future – Maldon Standard. &#34;Writtle library will be operating reduced hours from this Friday 25 November. The changes come following a decision by the Post Office to move their service elsewhere in the village. Cllr Brown, Cabinet Member responsible for libraries at Essex County Council said: &#34;Following the Post Office’s decision to move their counter away from the shared building, we will be changing the opening hours to ensure we can continue to man the building six days a week.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Lancashire","Wed, 23 Nov 2016 20:12:12 +0000","Lancashire – Letters – Blackpool Gazette. &#34;Coun Fail and his colleagues point out their need to maintain statutory obligations … It seems odd, therefore, that they are closing libraries all over Lancashire when they have a statutory obligation to provide a &#34;comprehensive and efficient library service&#34; under the Public Libraries and Museums Act 1964. Coun Fail’s comment that an &#34;adequate service level&#34; is being maintained, is I suggest, not a satisfactory statement to those users of Thornton, Cleveleys, Northfleet, Frackleton, Lytham and other libraries that have now closed. &#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Liverpool","Wed, 23 Nov 2016 20:12:12 +0000","Liverpool – Opera exhibit in tune at Central Library – JMU Journalism. &#34;The world’s longest touring opera had a musical opening at Liverpool’s Central Library in ‘The Carl Rosa Opera Company’ exhibition this weekend&#34; … &#34;Music graduates and students from Liverpool Hope University performed recitals on the opening day of the exhibition.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Pembrokeshire","Wed, 23 Nov 2016 20:12:12 +0000","Pembrokeshire – Library set to continue to open – County Echo. &#34;St Davids Library is to continue opening on Saturday mornings until the end of January, thanks to its team of volunteers. The library has been opening on Saturdays between 10am and noon since the beginning of the summer holidays, in addition to its normal hours on Tuesdays and Thursdays. The trial will extend until 28 January and a decision on whether to continue will be made later. George Edwards, library operations manager for North Pembrokeshire, said the extra hours had received strong support from the community and St Davids City Council.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Scottish Borders","Wed, 23 Nov 2016 20:12:12 +0000","Scottish Borders – Job cull looms at Live Borders – Peebleshire News. &#34; charitable trust which, just six months ago, took control of the museums, libraries, community centres and public halls previously run by Scottish Borders Council is seeking to cut its 400-strong workforce in a bid to save cash. Live Borders, which also operates 14 major sports facilities including six swimming pools, is inviting staff to apply for voluntary severance or early retirement deals.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Sheffield","Wed, 23 Nov 2016 20:12:12 +0000","Sheffield – Chinese plan to turn Sheffield Central Library into five star hotel – Star. &#34;Should the project go ahead, the Graves Gallery would remain, most likely moving to the ground floor, but the council would move the library service to a more modern home elsewhere in the city centre. The council says that, without using the money from China, it would need to spend around £30 million of taxpayers’ money to revamp the building to 21st century standards.  Sichuan Guodong’s plans for a £30 million residential development off West Bar, near Aizlewood’s Mill, along with an education partnership and trade deals with two Chinese cities have also been revealed in a report ahead of a cabinet meeting on November 30.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Suffolk","Wed, 23 Nov 2016 20:12:12 +0000","Suffolk – Suffolk Libraries face £230,000 budget cut as bosses call for more public support to save all 44 branches – Ipswich Star. &#34;Suffolk Libraries could face a £230,000 reduction to their budget from Suffolk County Council (SCC) in 2017/18. Its current budget of £6.14million has already fallen from £8.9m in 2010/11. Library bosses last night reiterated a commitment to not closing any of the 44 libraries in Suffolk or reducing opening hours. But they admitted they would need more of the public’s &#34;extraordinary&#34; support to retain services.&#34; … &#34;Under the proposals, the library budget would fall to £5.91m – a 34% fall since 2010/11.&#34; see also Fresh fears over future of libraries as Suffolk County Council budget cut proposals revealed – Bury Free Press.","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["West Berkshire","Wed, 23 Nov 2016 20:12:12 +0000","West Berkshire – Library campaigners warn: ‘Don’t be fooled’ by consultation – Newbury Today. &#34;Campaigners fighting to save Hungerford Library have urged residents not to fall into what they perceive as a district council trap. The public has been given three options to tick in the latest consultation and campaign leaders fear that being tempted to tick the least bad of these would count as a de facto vote in favour of a purely volunteer-led service. West Berkshire Council recently opened the second public consultation following the completion of a needs assessment by consultant Red Quadrant. Option A states that, while Newbury Library would remain, the other seven branch libraries would be run by staff working alongside community volunteers. A campaign spokeswoman, Helen Simpson, said: &#34;Option B would leave two branch libraries with a single member of employed staff supported by volunteers, the rest solely run by volunteers. &#34;Option C would leave seven branch libraries run solely by volunteers…&#34; … &#34;&#34;We are say&#8230;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Wigan","Wed, 23 Nov 2016 20:12:12 +0000","Wigan – £1.4m cuts need to be made to borough’s library services – Leigh Journal. &#34;the libraries consultation, which launched last Monday, aims to find ways to improve the current service and make it more efficient and effective for the future. Libraries have been shutting all over the country but all 15 in the borough have remained open and the council says it is not proposing to close any. It added that ‘careful spending decisions and listening to resident feedback’ has enabled it to ‘retain vital services’ such as libraries and school crossing patrols. But the council admits it needs to make cuts of £1.4 million for the borough’s library services to continue.&#34;","2016/11/at-least-they-can-complain-when-theyre-being-cut-suffolk-libraries-speaks-out.html"],["Birmingham","Sun, 27 Nov 2016 22:03:55 +0000","Birmingham – Calling all local artists 0-18: The Library Lobby needs your help – Sutton Coldfield Local News. &#34;Could you design an eye-catching poster to raise awareness of the proposed closure of the library by Birmingham City Council? The group are looking for poster designs (any size, any medium) to use on their website, twitter and facebook accounts to highlight why we need to keep a library in Sutton town centre, and what our library means to us.&#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Birmingham","Sun, 27 Nov 2016 22:03:55 +0000","Birmingham – Michael Morpurgo voices his support for library campaign – Sutton Coldfield News. &#34;He met with members of the children’s book group run out of Sutton Coldfield library last year, and on hearing of the plans announced by the city council to close it, he said … &#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Bristol","Sun, 27 Nov 2016 22:03:55 +0000","Bristol – Scrutiny: update on libraries – Bristol Council. &#34;The number of unplanned closures has reduced dramatically. However we are struggling with some lunchtime closures as we are still carrying vacancies and recruiting to roles vacant from the staff review.&#34; … &#34;Following a discussion at the previous Scrutiny in March 2016, free reservations were introduced in June 2016 and we have seen a 100% increase across Libraries West (as Bath and North East Somerset and Dorset also have free reservations). Customer reaction has been very positive.&#34;… &#34;The revised opening hours began on April 4th 2016 with a 25% reduction. There will be a natural change as customers change borrowing and visiting habits to the libraries. For quarter one there was a decrease of 3.1%, in the number of items issued.&#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Central Bedfordshire","Sun, 27 Nov 2016 22:03:55 +0000","Central Bedfordshire – Library as Laboratory – Bedford Creative Arts (press release). &#34;Bedford Creative Arts has been exploring new ways that libraries can evolve for the future by bringing together artists and libraries. The result is five pioneering projects created by eight artists, ranging from festivals and performances to slot car championships.  The project is funded by Arts Council England Libraries fund and sits in the context of the government spending review which has brought about cuts to spending on libraries by local councils. Libraries are now looking at what services and community offers they can provide in order to stay open and working with other local organisations like BCA is a way to deliver this.  Library as Laboratory is a brand new, open and collaborative way of working for the Library Services which usually follow a more planned, traditional approach. This project promotes non-traditional activities and ways of working with artists to devise projects and workshops that collaborate with communities and libr&#8230;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Edinburgh","Sun, 27 Nov 2016 22:03:55 +0000","Edinburgh – Council Leader confirms that libraries will be protected – Edinburgh Reporter. &#34;The Leader of the City of Edinburgh Council,  Councillor Andrew Burns this morning denied recent press reports that the city’s libraries are going to close in light of cuts of over £6 million. He explained that the recent budget consultation had only just concluded, and that the council would take heed of what the public had said. But he repeated that it was not the council’s intention to close the doors on any libraries in the city, or make any changes to the council’s Community Learning services. He said : &#34;We plan to protect front line services all the time even in the face of restricted budgets. We have not closed any significant front line services.&#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Edinburgh","Sun, 27 Nov 2016 22:03:55 +0000","Edinburgh – Libraries in Capital could face closures as £6.4m cuts announced – Edinburgh News. &#34;Unison said all of the city’s libraries – including the historic Central Library on George IV Bridge – will have their opening hours slashed under &#34;hidden and drastic&#34; council cost-savings plans. Meanwhile, mobile library stops would &#34;vanish&#34; and jobs would be cut from community learning and development – hitting youth work, adult education and family learning. Amanda Kerr, Unison Edinburgh organiser, said: &#34;[We are] concerned that the council is trying to slip these hidden and drastic cuts through without any real public consultation.&#34; … &#34;Unison warned all city libraries will be closed on Monday and Wednesday mornings, Tuesday and Thursday evenings and only on Saturday mornings.&#34; … &#34;Some libraries will continue to stand alone, while others will be combined with community centres and some will be run by local communities.&#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Lancashire","Sun, 27 Nov 2016 22:03:55 +0000","Lancashire – Reprieve for Eccleston library – 2BR. &#34;Another library has been given a reprieve as Chorley council agrees to fund it until April 2018. They had been told the library would be turning into a satellite service – but instead the building can stay open. That means the children’s centre and youth centre can also continue in the village, as they can use the building as well.&#34; .. &#34;&#34;I thought it was too late, so for Chorley borough council to step forward and fund it until at least 2018.. They’re amazing, they’ve really saved the day&#34;.&#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Leicestershire","Sun, 27 Nov 2016 22:03:55 +0000","Leicestershire – Hinckley library could be unstaffed in cost-cutting measure – Hinckley Times. &#34;Libraries in Leicestershire, including Hinckley’s, could soon be unstaffed and automated in a bid to cut costs. Bosses at Leicestershire County Council are considering proposals to allow people to use swipe cards to access library facilities. The existing self-service scanners can then be used to borrow, return or renew items without the need for staff. The move would save up to £300,000 a year if implemented, councillors say. A three-month trial is being planned at Syston library next year. If it proves successful, the scheme could be rolled out to all of the county’s libraries, except Harborough where the shared facilities would make it impractical.&#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["North Lanarkshire","Sun, 27 Nov 2016 22:03:55 +0000","North Lanarkshire – Wisdom of Solomons to support library campaign – Motherwell Times. &#34;The Save Newarthill Library campaign committee organised a visit from screenwriter and children’s author David Solomons. The library is due to close on January 31, and campaigners await a decision from The Faculty of Advocates about launching a legal challenge against Culture NL.A Hallowe’en Family Night in the Newarthill Club raised £500 for potential legal fees&#34; … &#34;Campaign chairwoman Angie Walker said: &#34;David had specifically asked to come and visit the library to show his support for the campaign to save the library from closure.&#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["North Yorkshire","Sun, 27 Nov 2016 22:03:55 +0000","North Yorkshire – Council under fire for charging business rates to community-run libraries – Northern Echo. &#34;Volunteers and councillors have been left aghast by Hambleton District Council making libraries in Stokesley, Thirsk, Bedale and Easingwold hand over thousands of pounds while they attempt to save the services after North Yorkshire County Council moved to stop managing them. The county’s six other district authorities have agreed to allow community-run libraries not to pay the 20 per cent business rates levy charged to charitable organisations, with one council leader saying it was &#34;very keen to do all we can for the key community assets&#34;.&#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["North Yorkshire","Sun, 27 Nov 2016 22:03:55 +0000","North Yorkshire – New chapter about to open for Boroughbridge Library – Harrogate News. &#34;After nearly 18 months of hard work by Boroughbridge Area Community Library Association (BACLA) and North Yorkshire County Council, the library is about to enter a transitional period. BACLA will take on responsibility for its operation with assistance from local staff until 31 March next year to ensure that the full handover from 1 April 2017 is as seamless as possible. It will now be known as Boroughbridge Community Library and Resource Centre to signify its enhanced role in providing a programme of activities and events for local people while maintaining and building on the provision of information, IT and home delivery services.&#34; … &#34;The library will continue to have support from the County Council for the stock, IT, staffing to support volunteers and professional guidance while the community will benefit from the involvement of BACLA in delivering a local volunteer-led service which includes a new base for Boroughbridge Community C&#8230;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Sheffield","Sun, 27 Nov 2016 22:03:55 +0000","Sheffield – Plan to keep funding volunteer-run Sheffield libraries until 2020 – Sheffield Star. £262k funding p.a. for volunteer libraries until 2020 to be considered.","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Sheffield","Sun, 27 Nov 2016 22:03:55 +0000","Sheffield – Save Sheffield Central Library – 38 Degrees. &#34;Libraries have been under threat across the country. Sheffield has already seen Walkley library sold to commercial interests. Now our council has opened up a review into commercial uses for the Central Library, with the possibility it will become a five-star hotel. The Central Library is a meeting space for groups and individuals, hosts talks by local and national authors and helps people use the internet. It is also a beautiful building, purpose built as a public space, which the general public can currently enjoy…&#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Somerset","Sun, 27 Nov 2016 22:03:55 +0000","Somerset – Glass Box – Enterprise and innovation in Somerset Libraries – Libraries Taskforce [or Libraries Blogforce as I am increasingly mentally calling it – Ed.]. &#34;In our experience being in an area where digital making doesn’t yet have a big profile puts your library in a unique and exciting position. In 2015 a new set of commissioning outcomes were agreed for Somerset Libraries to deliver on…&#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Swindon","Sun, 27 Nov 2016 22:03:55 +0000","Swindon – All hope not lost as D-Day for libraries looms – Swindon Advertiser. &#34;Everybody left their political hats outside the room and it was very clear we were looking at what was currently being proposed and whether we could do anything to stretch that budget to include more libraries in the core strategy. I believe we were quite successful in that.&#34; The last version of the libraries strategy to be released envisaged a future core provision of just four sites compared to the 15 currently in operation&#34; Meetings give hope of reduced cuts. &#34;The final version of the libraries strategy will be released on Tuesday and will go before cabinet the week after. &#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Walsall","Sun, 27 Nov 2016 22:03:55 +0000","Walsall – End this obscene merry-go-round: New Walsall Council director to earn £200,000 in a year – Express and Star. &#34;It has also emerged that in a previous council consultancy role, Ms Alderson attracted criticism for claiming expenses including batteries and even light bulbs.&#34; … &#34;It comes at a time when Walsall Council needs to save £86 million in four years and faces having to shut 14 of the borough’s 15 libraries and relocate the Leather Museum into the one remaining library. Hundreds of jobs are at risk.&#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Westminster","Sun, 27 Nov 2016 22:03:55 +0000","Westminster – Leak reveals which library services face the axe with 22 jobs likely to go – West End Extra. &#34; figures have revealed which libraries will lose staff in the council’s massive £750,000 cuts programme. Posts may be axed at Charing Cross, Queen’s Park, Victoria, Westminster Music Library, City of Westminster Archives and Westminster Reference Library. &#34; … &#34;As previously revealed, Marylebone Library will bear the biggest brunt of the cuts with more than 17 full-time staff set for the chop. The cuts at Marylebone coincide with the library’s move from a temporary building in Beaumont Street, to a smaller space in New Caven­dish Street. &#34;","2016/11/the-usage-of-the-summer-reading-challenge-is-down-why.html"],["Bradford","Tue, 29 Nov 2016 20:33:55 +0000","Bradford – Care for elderly, library services, community halls and public toilets all face cuts in Bradford Council’s latest budget – Ilkley Gazette. &#34;Councillor Susan Hinchcliffe revealed how her authority plans to slash £82m from its budget over the next two years, in a set of proposals which also included cuts to libraries, public toilets, street lighting and community halls&#34; … &#34;Libraries – many of which are already having to move to volunteer-run arrangements – will face further cuts&#34;","2016/11/no-ambition.html"],["Cheshire West and Chester","Tue, 29 Nov 2016 20:33:55 +0000","Cheshire West and Chester – Move planned for Chester Library – Cheshire Today. &#34;The public is being invited to drop-in sessions to find out more about the changes taking place with Chester Library between now and the opening of Storyhouse – the new £37m theatre, cinema and library space.&#34; … &#34;Visitors will be able to find out more about the new Storyhouse library including the dedicated children’s library, complete with an arts/crafts messy play area and a storytelling room; dedicated family and local history section; improved digital facilities and services; flexible event spaces; increased opening hours and opportunities to get involved&#34;","2016/11/no-ambition.html"],["Cumbria","Tue, 29 Nov 2016 20:33:55 +0000","Cumbria – Bid to cut library hours to save cash – Times and Star. &#34;Letters announcing the review have been sent out last week by the county council to library workers in Cockermouth, Maryport, Seaton, Moorclose, Aspatria, Keswick and Wigton libraries. Workington and Silloth libraries will not be affected by the proposal. The county council will enter into formal consultation with staff on Tuesday, November 29. Proposals include lunch time and Saturday closures. A council spokesman said: &#34;Government cuts to the county council over the last few years have resulted in huge financial pressures, including those on libraries.&#34;","2016/11/no-ambition.html"],["Devon","Tue, 29 Nov 2016 20:33:55 +0000","Devon – Libraries Unlimited becomes registered charity – Libraries Unlimited. &#34;Libraries Unlimited, the independent organisation responsible for running all of Devon’s library services has been granted registered charity status by the UK Charity Commission. The organisation, which took full control of the county’s libraries in April 2016, is a staff and community owned social enterprise commissioned by Devon County Council.&#34; … &#34;In order to become a registered charity, Libraries Unlimited had to prove that its purpose is exclusively charitable and set up for public benefit. Libraries Unlimited met the criteria through the charity’s objectives, which include; promoting and encouraging a love of reading, providing free access to information, guiding and supporting people to explore and connect with the wider world, offering a welcoming space to meet, socialise and enjoy new experiences and to support the health and wellbeing of individuals and local communities.&#34; … &#34;Phil Blay has joined the charity as Head of IT and D&#8230;","2016/11/no-ambition.html"],["Edinburgh","Tue, 29 Nov 2016 20:33:55 +0000","Edinburgh – Tony Black: Don’t let them take our libraries without a fight – Scotsman. &#34;I worry about the future for storytellers. In 2016 it seems our fastest growth area in the United Kingdom is in food banks. Our book banks –the libraries – are becoming an afterthought. When the masses can’t feed themselves, so goes the logic, any other hunger they might have, for knowledge or even simple entertainment, gets pushed aside. And so our libraries have become easy targets for cuts. &#34;","2016/11/no-ambition.html"],["Greenwich","Tue, 29 Nov 2016 20:33:55 +0000","Greenwich – Greenwich Centre Library named as one of London’s best cultural venues – News Shopper. &#34;The award-winning Greenwich Centre Library came second in the local culture category for the ‘Time Out Love London Awards’. Time Out magazine holds the annual competition which encourages readers to vote for their favourite venues and attractions across the capital. The categories are restaurants, pubs, cafes, shops, bars and local culture. Only Greenwich Park did better in the category. Cllr Denise Scott McDonald said: &#34;What a successful week for libraries in the Royal Borough of Greenwich! The Greenwich Centre is one of the newest Royal Borough hubs but it has already won such a great award befitting of the quality of services it delivers.&#34;","2016/11/no-ambition.html"],["Liverpool","Tue, 29 Nov 2016 20:33:55 +0000","Liverpool – Lister Drive Library rebuilding plan wins £3.9m lottery cash – Liverpool Echo. &#34;The Heritage Lottery Fund today confirmed the grant to the Andrew Carnegie Library in Tuebrook that will see the derelict building converted into a multi-purpose hub.&#34;","2016/11/no-ambition.html"],["Redcar and Cleveland","Tue, 29 Nov 2016 20:33:55 +0000","Redcar and Cleveland – 100 job losses, bins and libraries – what you need to know about £25m Redcar and Cleveland cuts – Gazette Live. &#34;Yet despite fears that bin collections will decrease and libraries will close, the council says it is protecting frontline services wherever it can.&#34; … &#34;The headline: no libraries will close completely. But there are big changes to opening times. It’s proposed that three libraries – Redcar Central, Guisborough, and South Bank – will open 47 hours a week and be rebranded as ‘community hubs’ offering a range of services. Five more will be classed ‘modern libraries’ and will open 31 hours a week at Grangetown, Marske, Saltburn, Skelton and Ormesby. The remaining five libraries – Brotton, Dormanstown, Laburnum Road in Redcar, Roseberry in Redcar and Loftus – will be classified as community libraries and will open 14 hours a week, with Roseberry and Loftus moving to new locations. The changes represent libraries across the borough opening for almost 100 hours less a week than at present – but p&#8230;","2016/11/no-ambition.html"],["Sheffield","Tue, 29 Nov 2016 20:33:55 +0000","Sheffield – Volunteers welcome Sheffield Council’s library funding pledge – Star. &#34;Bob Mynors, one of the volunteer managers at Stannington Library, said: &#34;Stannington Library welcomes the renewed package of support from the council, as this will give us some financial stability for at least the next three years. &#34;We’re also pleased that it’s not just about grants but about other forms of professional and practical support as well. &#34;This helps us to run efficient libraries, and shows how much the council values the work of all the library volunteers.&#34; The preferred option does come with a warning, though. A report to councillors ahead of Wednesday’s meeting says: &#34;If there is a budget reduction in future years for the library, archives and information service, it may not be affordable for the service to continue to pay for all of the co-delivered libraries from its core budget.&#34;","2016/11/no-ambition.html"],["Swindon","Tue, 29 Nov 2016 20:33:55 +0000","Swindon – Park library saved but ten others now face a fight to survive on their own – Swindon Advertiser. &#34;Coun Mary Martin, the cabinet member responsible for libraries, said: &#34;I would like to thank everyone who took the time to take part in the public consultation as well as fellow councillors on the member task group as all their input has been invaluable in putting together this updated draft strategy. &#34;I am pleased we have been able to increase the core provision to include Park library. Discussions are already well underway to secure community-led library provision at Wroughton, Covingham and Upper Stratton and so I am asking cabinet colleagues to approve transitional funding for these at this stage.&#34;","2016/11/no-ambition.html"],["Swindon","Tue, 29 Nov 2016 20:33:55 +0000","Swindon – Securing a sustainable future for Swindon’s Library Services – Swindon Council. From page 90, full details of cuts to library service.","2016/11/no-ambition.html"],["Walsall","Tue, 29 Nov 2016 20:33:55 +0000","Walsall – Bloxwich Councillors bid to save Bloxwich Library and Theatre – Bloxwich Telegraph. &#34;The loss of the library staff, facilities and book stock as well as the attached 1964 theatre, which was, along with the 1960 library, rejuvenated in 2009-10 and has since gone on, with the help of Bloxwich Library Forum, to become a successful music and drama venue and much more, would be very damaging. This kind of cultural vandalism is simply insupportable, and once these facilities are gone, they will never return.&#34;","2016/11/no-ambition.html"],["Walsall","Tue, 29 Nov 2016 20:33:55 +0000","Walsall – Campaigners fight for future of closure-threatened Aldridge Library at protest – Express and Star. &#34;About 80 people, ranging from toddlers to pensioners, urged Walsall Council to save Aldridge Library from the axe at the weekend, along with another 13 libraries also under threat. The Labour-led authority, which needs to find £86 million in savings over four years, has proposed shutting all but one of the borough’s 15 libraries as part of cuts, leaving just the library in Walsall town centre open. Conservative Councillor John Murray, who represents Aldridge Central and South on Walsall Council, said: &#34;People come here because this is the only place they can access computers for work.&#34;","2016/11/no-ambition.html"],["Warrington","Tue, 29 Nov 2016 20:33:55 +0000","Warrington – MP Helen Jones slams LiveWire as ‘shambolic’ over libraries consultation – Warrington Guardian. &#34;Ms Jones is calling for the community interest company, which is responsible for running Warrington’s libraries and leisure services, to be stripped of its control of the town’s libraries. The company has been criticised for its handling of a public consultation into plans to save £300,000 by closing some libraries.&#34; … &#34;&#34;They conducted a consultation based on dodgy figures which they then had to withdraw. I also understand that they are paying a former council officer a five figure sum per year, as a consultant, for a couple of days work per week,&#34; she added.&#34; … &#34;There is no independent input and, as far as I can discover, no independent assessment of how board members are performing.  &#34;","2016/11/no-ambition.html"]]