[["Bradford","Sun, 03 Jan 2016 21:41:03 +0000","Bradford – Campaign planned to find volunteers to run Silsden library – Craven Herald. &#34;… politician warns many volunteers will be needed to keep the library, currently run by Bradford Council, open to the public. And he fears the library’s location, in Silsden Town Hall, could complicate the issue and deter townspeople from taking on responsibility.&#34;","2016/01/library-spending-and-usage-or-for-goodness-sake-dont-increase-the-e-book-budget-quite-yet.html"],["Swindon","Sun, 03 Jan 2016 21:41:03 +0000","Swindon – 2016 looking like a year of change for Swindon – Swindon Advertiser. &#34;Volunteers will be expected to play a bigger role in a new-look Swindon as well. Talks are currently taking place over libraries, with locals being told many will be lost unless people come forward to run them. &#34;","2016/01/library-spending-and-usage-or-for-goodness-sake-dont-increase-the-e-book-budget-quite-yet.html"],["Lancashire","Thu, 07 Jan 2016 22:29:26 +0000","Lancashire – Ingol library closure: Petition set up against against council cutback for ‘much needed resource’  – Blog Preston. &#34;The epetition is already gathering signatures and states: &#34;We the undersigned petition the county council to consider carefully the need and support that this Library gives to the members of the Ingol ward and surrounding areas. &#34;Many residents may not have access to books, internet and social clubs without this much needed social entreprise. This Library is well supported by our residents young and old alike. Please do not close this much needed resource.&#34;&#34;","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["Lancashire","Sun, 03 Jan 2016 21:41:03 +0000","Lancashire – Lancashire libraries consultation 2016 – Lancashire Council. &#34;Lancashire County Council wants to understand what you would like from this space. This space will be developed in response to individual community need. We are passionate about creating opportunities which give people the potential to develop in areas they choose themselves. These physical flexible spaces will be used to promote learning, arts, performance, social activity, digital inclusion, families, heritage and wellbeing. The spaces we aim to provide will enable our communities to enjoy an environment which has been tuned to their needs. The spaces need to be safe for everyone and comfortable. &#34;","2016/01/library-spending-and-usage-or-for-goodness-sake-dont-increase-the-e-book-budget-quite-yet.html"],["Nottinghamshire","Sun, 03 Jan 2016 21:41:03 +0000","Nottinghamshire – Bassetlaw: A right hullaballoo going on at libraries – Worksop Guardian. Events.","2016/01/library-spending-and-usage-or-for-goodness-sake-dont-increase-the-e-book-budget-quite-yet.html"],["Kent","Thu, 07 Jan 2016 22:29:26 +0000","Kent – Tributes paid after Whitstable campaigner Richard Stainton dies – Canterbury Times. &#34;Mr Stainton, of Sydenham Street, recently campaigned at Whitstable Library Square in an attempt to save the town’s local library service and he helped to organise the successful Whitstable Literary Festival (WhitLit).&#34;","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["Leicestershire","Sun, 03 Jan 2016 21:41:03 +0000","Leicestershire – Barwell library may not be facing final chapter – Hinckley Times. &#34;a recent meeting between council officials and 20 residents resulted in potential salvage options being tabled. Sandra Bates, from the Barwell Community Library group, said: &#34;While the support group has withdrawn our bid to operate the library, we have been working behind the scenes to try to resurrect the project and have come up with two possible solutions. &#34;One would be the formation of a friends group – if 250 users pledged £50 each every year we could raise the necessary revenue to fund the library on an on-going basis, if there were 500 pledges then each pledge would only need to be £25.&#34;","2016/01/library-spending-and-usage-or-for-goodness-sake-dont-increase-the-e-book-budget-quite-yet.html"],["Solihull","Sun, 03 Jan 2016 21:41:03 +0000","Solihull – Solihull Central Library and Arts Complex Refurbishment – Solihull Council. &#34;A major refurbishment project will be taking place between August 2015 and February 2016 so that the building continues to meet the needs of the local community. This scheme will improve existing facilities and introduce some important new functions.&#34; includes &#34;a new home for the Voluntary and Community Sector in Central Solihull including a new Solihull Community Advice Hub on the First Floor. Those voluntary organisations include Age UK, Citizens Advice Solihull Borough, Action for Blind People, Aquarius, Relate, Colebridge Trust/Solihull Sustain and Solihull Borough Talking Newspapers Association&#34; … &#34;create new Café Bars at Ground Level and First Floor Level&#34; … &#34;refurbish the Theatre, including seating, carpets and lighting, and provide a level entrance from the Ground Floor foyer&#34; .. &#34;provide a Changing Places Facility for disabled people visiting the Town Centre &#34;","2016/01/library-spending-and-usage-or-for-goodness-sake-dont-increase-the-e-book-budget-quite-yet.html"],["Barnet","Tue, 05 Jan 2016 22:02:58 +0000","Barnet – Saving Barnet’s Libraries – a ‘letter before claim’ … – Broken Barnet. &#34;As the previous post revealed, over the Christmas and New Year period Barnet Council has received not one, but two ‘letters before action’, the first stage in legal challenge by residents’ groups to decisions made in regard to two controversial proposals. &#34; … &#34;They’re keeping the buildings open but reducing the service so severely there’ll be almost nothing left. The consultation is much more limited than last year’s and it doesn’t even say what hours my library will be staffed&#34; see also Campaigners take first step in legal action over Barnet library cuts – This is Local London. &#34;The letter from Bindmans LLP says the second libraries consultation – which finishes on Wednesday (January 6) – is unlawful and &#34;riddled&#34; with errors. It accuses the council of not having &#34;adequately explained&#34; its current proposal to people, which prevents them from making an informed response&#34;","2016/01/wrecking-libraries-in-telford-plus-a-thought-or-two-on-dodgy-library-censoring.html"],["Cheshire West and Chester","Tue, 05 Jan 2016 22:02:58 +0000","Cheshire West and Chester – Weaverham library closure – Cheshire Today. Self-service being installed at Weaverham and Little Sutton. See also Ellesmere Port and Weaverham branch libraries launch self-service system  – Chester Chronicle.  &#34;Louise Gittins (Lab), cabinet member for culture, leisure and wellbeing, said: &#34;Our new self-service technology will make it much quicker and easier to issue and return books and multimedia. &#34;Having self-service means we can reduce the size of the counter and have more room for the visitors to the library.&#34; For customers who might have concerns about the new arrangements she added: &#34;Don’t worry, there will always be a member of staff on duty if you need assistance and to help with queries and browsing for books.&#34;&#34;","2016/01/wrecking-libraries-in-telford-plus-a-thought-or-two-on-dodgy-library-censoring.html"],["Edinburgh","Tue, 05 Jan 2016 22:02:58 +0000","Edinburgh – Pirniehall Primary enrols every pupil at local library – Edinburgh News. Thought to be first in Scotland to have every child enrolled as part of new scheme.","2016/01/wrecking-libraries-in-telford-plus-a-thought-or-two-on-dodgy-library-censoring.html"],["Staffordshire","Tue, 05 Jan 2016 22:02:58 +0000","Staffordshire – Library transformation in Staffordshire – Libraries Taskforce. Report by Staffordshire Libraries on responding to the severe cut to budget, including partner/volunteer libraries and a look at the new Stafford Central Library. &#34;It was really clear that libraries were facing incredibly challenging times and in many ways a very bleak future. We were dealing with changing demographics, changing customer habits and expectations, a changing local authority landscape and enormous budget pressures. If we, as a County Council, were to approach this properly, we would need to think innovatively, act collaboratively, and lead and manage creatively to provide Libraries that could help to deliver on our three key priorities: Health – so that our communities are able to live independently for as long as possible; Wealth – access to jobs and a steady income; Friends – enabling individuals and communities to stay connected and feel supported as part of a network.&#34;","2016/01/wrecking-libraries-in-telford-plus-a-thought-or-two-on-dodgy-library-censoring.html"],["Fife","Tue, 05 Jan 2016 22:02:58 +0000","Fife – Reprieve for Fife libraries as scrutiny committee rejects closure decision – Fife Today. &#34;Fife Council’s executive committee will be forced to reconsider the closure of 16 libraries – after its decision was rejected by a scrutiny committee. On the casting vote of chairman Councillor Susan Leslie, the education, health and social care scrutiny committee has requested Fife Council finds one-off funding of £571,000 to ensure all 16 libraries can be kept open for a further year. This funding would allow Fife Cultural Trust (FCT) – which runs the libraries on behalf of the council – and local communities to develop &#34;credible alternative delivery options for the 16 libraries&#34;.&#34;","2016/01/wrecking-libraries-in-telford-plus-a-thought-or-two-on-dodgy-library-censoring.html"],["Lancashire","Tue, 05 Jan 2016 22:02:58 +0000","Lancashire – Library set to re-open after flood damage – Burnley Express. Padham Library to reopen after electrical problems.","2016/01/wrecking-libraries-in-telford-plus-a-thought-or-two-on-dodgy-library-censoring.html"],["North Somerset","Tue, 05 Jan 2016 22:02:58 +0000","North Somerset – Still time to have your say on area’s future  – North Somerset Council. Consultation to include session at Nailsea Library.","2016/01/wrecking-libraries-in-telford-plus-a-thought-or-two-on-dodgy-library-censoring.html"],["Somerset","Tue, 05 Jan 2016 22:02:58 +0000","Somerset – Proposed change to Milborne Port Library opening hours meets opposition – Western Gazette. &#34;As part of county wide cuts of library opening hours Somerset County Council has proposed that Milborne Port Library will open for two and half hours less per week. While the Friends of Milborne Port Library have welcomed the news that the library will remain open it has greeted the new proposed opening hours, in particular the effect it will have on school children, with some trepidation.&#34;","2016/01/wrecking-libraries-in-telford-plus-a-thought-or-two-on-dodgy-library-censoring.html"],["Suffolk","Tue, 05 Jan 2016 22:02:58 +0000","Suffolk – Suffolk libraries to increase mental health services in 2016 – East Anglian Daily Times. &#34;The mental health programme offered up until now has been mainly an information-sharing system,  helping to direct people to various points of help while working with a wide variety of health and social care providers in the county. Library staff have been given guidance on how to support people seeking help and to provide the relevant information they might need. And a number of regular sessions have been held at the larger libraries by teaming up with other organisations and providers.&#34; … &#34;Based on an international scheme helping people with advice on how to become happier or help make their community a happier place, the programme also involves comedy film nights and &#34;laugh aloud&#34; book groups.&#34;","2016/01/wrecking-libraries-in-telford-plus-a-thought-or-two-on-dodgy-library-censoring.html"],["Telford and Wrekin","Tue, 05 Jan 2016 22:02:58 +0000","Telford and Wrekin – Libraries, markets and centres to go as Telford & Wrekin services slashed in £30 million cuts – Shropshire Star. &#34;Libraries in Dawley, Donnington, Hadley, Madeley, Newport and Stirchley face the axe.&#34; … &#34;&#34;It’s not something as an administration that we would have ever wanted to consider. None of us came into politics to make these kinds of cuts. &#34;Unfortunately we have been dealt a really horrible hand by the Chancellor. What I would say from evidence is that fairness and compassion has to be at the heart of what we do&#34;","2016/01/wrecking-libraries-in-telford-plus-a-thought-or-two-on-dodgy-library-censoring.html"],["Flintshire","Tue, 05 Jan 2016 22:02:58 +0000","Flintshire – Flintshire village library future in doubt as council axes funding – Daily Post. &#34;Public meeting organised to discuss the future of Halkyn service, which last year saw more than 7,850 books loaned out to 2,700 people &#34; [Population is around 3,000 – Ed.] … &#34;From March 31 cash-strapped Flintshire County Council will no longer stump up nearly £4,000 which covers half of Halkyn Parish Hall Library’s annual running costs. A public meeting has been organised by Halkyn Community Council for the evening of January 13 to discuss the future of the service and whether to retain it.&#34;","2016/01/wrecking-libraries-in-telford-plus-a-thought-or-two-on-dodgy-library-censoring.html"],["Walsall","Tue, 05 Jan 2016 22:02:58 +0000","Walsall – Protest planned over Walsall library closure proposals – Walsall Advertiser. &#34;A public demonstration will take place this weekend to protest against proposals to close a number of libraries in the borough. Draft budget options for consideration in the year of 2016/17 include the closure of seven Walsall libraries- Beechdale, Blakenall, New Invention, Pleck, Rushall, South Walsall and Walsall Wood. And Walsall South MP Valerie Vaz, who describes the libraries as &#34;treasured assets&#34;, will be holding a demonstration outside Pleck Library in Darlaston Road at 11am on Saturday, January 9 January urging the council not to close it.&#34; … &#34;A book exchange would also be established in the new Oak Park Active Living Centre to cope with the loss of Walsall Wood library.&#34;","2016/01/wrecking-libraries-in-telford-plus-a-thought-or-two-on-dodgy-library-censoring.html"],["Bristol","Thu, 07 Jan 2016 22:29:26 +0000","Bristol – Does Bristol still need its public libraries? – Bristol Post. More computers, fewer books, changes in opening hours. &#34;Some of the biggest changes libraries have seen in the city for a generation will come into force this Spring, following the most comprehensively engaged public consultation in Bristol City Council’s history.&#34;","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["Walsall","Thu, 07 Jan 2016 22:29:26 +0000","Walsall – Walsall Council cuts: Thousands oppose library closure plan – Express and Star. &#34;a petition opposing the closure of Pleck library has gained momentum with more than 3,000 names, according to campaigner Shabir Hussain. As part of an alternative option to closure, Mr Hussain claims Pleck library is the cheapest to run in the borough, at £38,179 – making up less than two per cent of the budget for libraries.&#34;","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["Wrexham","Thu, 07 Jan 2016 22:29:26 +0000","Wrexham – Trust ‘to protect libraries, museums and culture’ in Wrexham – News North Wales. &#34;Wrexham Council’s executive board will meet next week discuss proposals to establish a trust to take on the management of the services, with community well-being and development chief Lawrence Isted expected to get the nod to go ahead with the scheme. Once established, Cllr Hugh Jones, lead member for communities and partnerships, said there would be a possiblility the trust could run other county services.&#34;","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["Caerphilly","Thu, 07 Jan 2016 22:29:26 +0000","Caerphilly – Plaid and Labour clash over decision to reopen Aberbargoed library – Caerphilly Observer. &#34;The library was originally closed in March 2012 by the then Plaid Cymru administration because of cost, and the fact that Bargoed had a new library. Aberbargoed Library, in Pant Street, was then reopened by the Labour Party in 2013, following its local election win, at a refurbishment cost of £90,000. A fresh war of words has now erupted over the number of people using the reopened library. Figures obtained by Plaid Cymru under the Freedom of Information Act revealed that there were less than ten visits an hour at the library between April and September last year. Bargoed had 60 visits an hour over the same period. The number of items loaned out at Aberbargoed also averaged just five items an hour.&#34;","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["Fife","Thu, 07 Jan 2016 22:29:26 +0000","Fife – North east Fife campaigners claim library closures decision is ‘unsafe’ – Fife Today. &#34;Following a three hour debate on Tuesday – and after a tied vote of 7-7 – scrutiny committee chairman Councillor Susan Leslie used her casting vote to support a motion by SNP councillor Julie Ford requesting Fife Council agrees to find additional one-off funding of £571,000 to ensure all Fife libraries proposed for closure can be kept open for a further year. &#34;","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["Lancashire","Thu, 07 Jan 2016 22:29:26 +0000","Lancashire – Battle cry to save Longridge Library – Longridge News. &#34;Longridge Town Council wants as many people as possible to lobby Lancashire County Council’s cabinet member for environment, planning and cultural services, Marcus Johnstone with letters and emails and through social media if they want the library to be saved.&#34; [There are three online petitions so far to campaign for threatened Lancashire libraries: Save Longridge Library, Save Garstang Library and Save Ingol Library – Ed.]","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["Leicestershire","Thu, 07 Jan 2016 22:29:26 +0000","Leicestershire – Libraries, museums and services for elderly under cost review  – Loughborough Echo. &#34;The decision on where the actual cuts will fall has not been finalised and the council will be calling on residents to have their say as part of the plans to save more than £1.8m. &#34; … &#34;The council wants to help communities &#34;support themselves&#34; and &#34;be empowered to design and create their own cultural activity.&#34; The council will also further review its network of &#34;fully funded venues&#34; and explore the use of technology to increase self-service at some venues. The local authority will also look at reviewing and reducing targeted services that are funded solely by the council.&#34; … &#34;Already, the council has made dramatic changes over the last year including cutting library staff in Loughborough, Shepshed and at village libraries. It also called on local groups to take over the running of their village libraries or face closure and reduced library opening hours by 20 per cent.&#34;","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["Norfolk","Thu, 07 Jan 2016 22:29:26 +0000","Norfolk – Keep calm and colour in at West Norfolk libraries – Lynn News. &#34;People across West Norfolk are being invited to colour themselves calm during a series of regular events at the borough’s libraries. Sessions are being held at the libraries in Lynn, Gaywood, Dersingham, whose group members are pictured above, Downham and Hunstanton. Pens and pencils are provided at all locations, while sheets are also provided at Gaywood and Downham.&#34;","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["Telford and Wrekin","Thu, 07 Jan 2016 22:29:26 +0000","Telford and Wrekin – Telford & Wrekin Council will shut vast majority of its libraries with massive cuts – Wrekin News. &#34;Wrekin MP Mark Pritchard [Conservative – Ed.]has responded to the proposals. He said: &#34;The Borough Council need to spend its very large budget far better than they currently do. &#34;There is no excuse for closing libraries and local community services. &#34; Rather than blame the government they should be getting better value money for each pound of taxpayers’ money they spend.&#34;&#34;","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["North Yorkshire","Thu, 07 Jan 2016 22:29:26 +0000","North Yorkshire – Capita chosen as North Yorkshire library management system provider – CloudPro. &#34;North Yorkshire County Council has chosen Capita to provide its countywide library management system, helping the local authority reduce costs, while providing users with a more efficient service. Capita will provide the council with its cloud-based Chorus LMS platform rather than using the libraries’ existing hardware, which was expensive to run because of the maintenance needed. Additionally, moving to the cloud means staff can be re-deployed to improve customer experience rather than having to fix on-premise systems when they go wrong.&#34; see also the official Capita press release from which this was taken.","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["Swindon","Thu, 07 Jan 2016 22:29:26 +0000","Swindon – We are all set to tackle the budget, says council chief – Swindon Advertiser. &#34;We are also considering some specific changes to a number of services. For example, we are looking at different ways of providing services in the community such as libraries.&#34;","2016/01/libraries-the-thin-red-line-between-civilization-and-barbarism-neil-gaiman.html"],["Blackpool","Sun, 10 Jan 2016 23:06:18 +0000","Blackpool – £5m more in cuts: Blackpool’s libraries and leisures centres could now be at risk – Blackpool Gazette. &#34;Leisure centres and libraries could be under threat in Blackpool after further budget cuts of £5m were announced. The latest savings must be made on top of cuts of £20m unveiled last November … It means services which town hall chiefs had hoped to protect could now be at risk.&#34;","2016/01/hereford-and-the-library-of-things.html"],["Croydon","Sun, 10 Jan 2016 23:06:18 +0000","Croydon – Drama, Spanish and family history: library offers classes – Inside Croydon. &#34;A history project and a drama class for adults suffering from depression and other mental health conditions are among a range of groups offering education and training sessions in a range of life skills which have successfully bid to stage their activities at Upper Norwood Library. The groups’ activities are to be funded by Upper Norwood Library Trust.&#34;","2016/01/hereford-and-the-library-of-things.html"],["Fife","Sun, 10 Jan 2016 23:06:18 +0000","Fife – Council urged to ‘see sense’ on Fife libraries’ future – Courier. &#34;Residents are to be given a chance to have their say on the future of libraries, museums and adult learning. Leicestershire County Council needs to slash a massive £1.8 million from its budget and will soon launch a consultation on the future shape of its communities and wellbeing service. It currently spends £5.7 million per year.&#34;","2016/01/hereford-and-the-library-of-things.html"],["Herefordshire","Sun, 10 Jan 2016 23:06:18 +0000","Herefordshire – Start date confirmed for asbestos removal at Hereford Library and Museum – Hereford Times. &#34;It is expected to take five to six weeks to complete. Plans to spend £86,000 on the removal were approved at December’s cabinet meeting as well as a mmitment to spend a further £900,000 on the library. The council is now working with the Hereford Library Users Group to look at ways of providing an enhanced library facility and service for the people of Herefordshire.&#34;","2016/01/hereford-and-the-library-of-things.html"],["Isle of Man","Sun, 10 Jan 2016 23:06:18 +0000","Isle of Man – Library turns over a new leaf – IOM Today. &#34;The Henry Bloom Noble library has moved to the old Top Shop building on Duke Street. Before that the buildng was the main Co-op in th town. The library has a study area with learning resources, a children’s area where storytelling will take place and access to e-books and audio books. Regeneration committee chairman Councillor John Skinner said: ‘There is a school of thought that would suggest libraries have limited or no place in the digital age. This is not a view held by the council, which sees the library as an asset very much at the heart of the community.’&#34;","2016/01/hereford-and-the-library-of-things.html"],["Bradford","Sun, 10 Jan 2016 23:06:18 +0000","Bradford – Residents start campaign to save libraries in Bradford South – Telegraph and Argus. &#34;Last month, Councillor Susan Hinchcliffe warned that libraries across the district could shut if volunteers did not step forward to run them.  … Mrs Haxby, who said the campaign was in its early days, added: &#34;Everybody is just devastated. They have not left us a single library on this side of the city. Mrs Haxby, who is a member of the book club at the library, continued: &#34;The library is a hub for the community. It is always full of people reading newspapers, borrowing books, and using the computers.&#34;","2016/01/hereford-and-the-library-of-things.html"],["Bradford","Sun, 10 Jan 2016 23:06:18 +0000","Bradford – Two senior councillors given hour-long grilling from supporters of under-threat library – Telegraph and Argus. &#34;Council leader Councillor David Green and executive member Councillor Ralph Berry, both Labour councillors for Wibsey, were met with a 60-strong crowd when they turned up at Wibsey library for their regular advice surgery on Saturday. Wibsey is one of a host of libraries that could be closed if volunteers don’t come forward to run them, under cost-cutting proposals put forward by Bradford Council’s Labour administration.&#34;.  Forecast halving of total council budget blames, existence of volunteer libraries (inc. extension of hours at Wrose) noted as is proposed complete absence of a council public library in South Bradford.","2016/01/hereford-and-the-library-of-things.html"],["Bristol","Sun, 10 Jan 2016 23:06:18 +0000","Bristol – Bristol Central Library to be closed in March  – Bristol 247. &#34;Bristol Central Library will be shut on weekdays for four weeks in March as work is carried out to prepare the basement for the Cathedral Primary School. The school got planning permission last year for its controversial move underneath the library on College Green. As part of the move, glass blocks in the library floor are being restored to bring more light into the school below.&#34;","2016/01/hereford-and-the-library-of-things.html"],["East Sussex","Sun, 10 Jan 2016 23:06:18 +0000","East Sussex – Your chance to comment on proposed cuts to Uckfield library opening hours – Uckfield News. &#34;hours at Uckfield public library could be cut by a quarter from next autumn. The changes would target the hours least used by borrowers. The aim is to reduce library running costs by around £500,000 helping towards the library service’s savings target of £2 million over the next three years.&#34;","2016/01/hereford-and-the-library-of-things.html"],["Leicestershire","Sun, 10 Jan 2016 23:06:18 +0000","Leicestershire – Chance to have a say on Leicestershire budget cuts  – Hinckley Times.","2016/01/hereford-and-the-library-of-things.html"],["Cheshire West and Chester","Sun, 10 Jan 2016 23:06:18 +0000","Cheshire West and Chester – Cheshire West and Chester libraries to stage Health and Wellbeing Week – Chester Chronicle. &#34;Cheshire West and Chester Council’s Libraries Service has organised a health and wellbeing week and is promoting a range of activities to help people stay fit and well. Health and Wellbeing Week takes place between January 18 and 23 in libraries across Cheshire West and Chester.&#34;","2016/01/hereford-and-the-library-of-things.html"],["Dundee","Sun, 10 Jan 2016 23:06:18 +0000","Dundee – Council says £23m of cuts will affect ‘every part of Dundee’ – Evening Telegraph. Unison: &#34;&#34;It could be support staff at schools, it could be facilities like libraries facing closure.&#34;","2016/01/hereford-and-the-library-of-things.html"],["Lancashire","Sun, 10 Jan 2016 23:06:18 +0000","Lancashire – Rallying call to have say on planned cuts – LEP. Unison protest &#34;They wanted to highlight the changes proposed for libraries, transport to day care centres, jointly-funded police and community support officers (PCSOs) and other areas.&#34;","2016/01/hereford-and-the-library-of-things.html"],["North Yorkshire","Sun, 10 Jan 2016 23:06:18 +0000","North Yorkshire – Letters round-up – Gazette and Herald / Letters. &#34;It has become not just a library but a wonderful, multi-purpose resource. Its position in the centre of Pickering in a very attractive, light, airy, spacious building means that it is at the heart of the community. The staff have worked tirelessly to maintain this invaluable establishment. Extremely harsh government cuts have resulted in North Yorkshire County Council reducing funding for many aspects of community life. The dedication shown by Liz and the hard-working staff is to be repaid in 2017, not with thanks, but with offers of early retirement, loss of jobs and a library which is to be run by volunteers with possibly one paid professional in attendance.&#34;","2016/01/hereford-and-the-library-of-things.html"],["Lambeth","Sun, 10 Jan 2016 23:06:18 +0000","Lambeth – Internal Labour opposition to book-ish gyms grows as local Labour branch meetings pass motions condemning the move – Brixton Buzz. &#34;Internal Labour opposition to book-ish gyms grows as local Labour branch meetings pass motions condemning the move&#34;","2016/01/hereford-and-the-library-of-things.html"],["Lancashire","Sun, 10 Jan 2016 23:06:18 +0000","Lancashire – Disabled woman’s fear as axe hovers over &#34;lifeline&#34; libraries – Accrington Observer. Library user visits library every week, disabled but uses leg brace to walk the half mile. Fines no longer exempt for her.","2016/01/hereford-and-the-library-of-things.html"],["Norfolk","Sun, 10 Jan 2016 23:06:18 +0000","Norfolk – People show their love for libraries during protest against proposed Norfolk County Council cuts – Eastern Daily Press. &#34;The event, at the Millennium Library in Norwich this afternoon, saw members of the Norfolk People’s Assembly hand out leaflets outlining their opposition to proposals that could see staffed opening times reduced, less money spent on library stocks, and reductions to the mobile library service. They are part of the Norfolk County Council’s budget consultation, which closes on January 14. Kate Baczkowska, 11, from Long Stratton, showed her support for the library by writing on one of the dozens of red paper hearts that were then stuck on columns and book displays in the library.&#34; see also Austerity Cuts continue to hit Library Services in Norfolk, locals Protest – Katyjon.","2016/01/hereford-and-the-library-of-things.html"],["Birmingham","Tue, 12 Jan 2016 22:15:35 +0000","Birmingham – Birmingham’s 145,000 overdue library books – BBC. &#34;Books borrowed more than 20 years ago are among tens of thousands overdue from Birmingham’s libraries. A total of 145,671 overdue books have stacked up fines of £422,930 since 1995, according to council figures. The unreturned books make up more than 7% of the 1,984,954 literary works owned by the authority.&#34; … &#34;Library staff appealed for donations last August after the council stopped buying books for some of its 38 sites amid cuts.&#34;","2016/01/the-future-of-english-public-library-websites.html"],["Cambridgeshire","Thu, 14 Jan 2016 21:26:51 +0000","Cambridgeshire – Further £500,000 earmarked for cuts in Cambridgeshire libraries – now is the chance to have your say – Cambridge News. &#34;The council is looking to save a further £500,000 from its library budget, having already cut £2.5 million over the past five years. Previous savings have been made from back office support, management costs and a more self-service approach. Fresh proposals include reducing opening hours at larger libraries, cutting staff and spending less on new library stock. The council has already started a cross party group which has been looking at ways of increasing income.&#34; … &#34;Although current options do not include transferring any libraries to the community at this stage, this may still be an option the following year when even more savings are needed.&#34;","2016/01/democracy-of-space.html"],["Isle of Wight","Thu, 14 Jan 2016 21:26:51 +0000","Isle of Wight – How is the council going to survive? – On the Wight. £50m in cuts council-wide. &#34;The services the council provide are split into two: Statutory – the services that by law they must provide, like safeguarding children; and Discretionary – services they provide as part of making society work, like environmental health. A list of which service falls into which category has been provided below.&#34; – [List of services marks libraries as discretionary and not, as is correct, statutory – Ed.]","2016/01/democracy-of-space.html"],["Newcastle","Thu, 14 Jan 2016 21:26:51 +0000","Newcastle – Libraries in Newcastle could have their opening times slashed in £1m savings scheme – Chronicle. &#34;Nine libraries across Newcastle are set to have their hours slashed as part of a £30m cuts programme if plans are approved. Newcastle City Council has said Gosforth Library, East End Library and Centre Customer Outer West Library and Centre Customer Service Centre and West End Library and Centre Customer Service Centre could have their hours more than halved to 23 hours a week. All of the venues are currently open for at least 54 hours a week. Elsewhere, Fenham Library could have its hours cut to 18.5 hours per week, from 41.5 hours, Kenton Library could go from 51.5 hours to 23 hours, Newburn Library from 35.75 hours to 18.5 hours, Walker Library cut from 43 hours to 23 hours, and City Library could see hours cut from 69 hours to 49 hours. Newcastle Civic Centre’s Customer Service Centre could see its opening hours cut from 40 hours to 37.5 hours a week. The proposals are part of a plan to save £1m from the cost of runnin&#8230;","2016/01/democracy-of-space.html"],["Cambridgeshire","Tue, 12 Jan 2016 22:15:35 +0000","Cambridgeshire – Review of Library Service – Public Library Consultation – Cambridgeshire County Council. &#34;In February and March 2015, we asked you what you thought about the County Council’s strategy: &#34;Library Services in Cambridgeshire: Developing Our Approach for the Future&#34;. This strategy identified four key themes that are shaping the development of the service. These are Building community resilience; Enabling more than delivering; Maximising the use of our assets; Supporting the &#34;Digital First&#34; agenda.&#34;‘; Maximise the opportunity to generate income&#34; … &#34;Proposals include a combination of reducing opening hours at larger libraries, reducing management and professional staff and spending less on new library stock&#34;","2016/01/the-future-of-english-public-library-websites.html"],["Lambeth","Tue, 12 Jan 2016 22:15:35 +0000","Lambeth – Tate South Lambeth Library leads UK with newest Prodigi machine – Vauxhall CIC (press release received). &#34;A benefactor has given a remarkable reading machine to the ʻLibraries for Everyone/ DTVIPʼ scheme in Vauxhall – on condition that Tate South Lambeth remains a full-service library. &#34; … &#34;Christina Burnett of Vauxhall CIC, which set up Libraries for Everyone/DTVIP with Lambeth Libraries and Archives, said: &#34;Weʼre thrilled to have the latest Prodigi machine to help people overcome the barriers to employment, information and internet access caused by visual impairment or dyslexia.  This machine will restore independence and productivity to many who are currently excluded from the vital resources in public libraries.&#34;&#34;","2016/01/the-future-of-english-public-library-websites.html"],["Trafford","Tue, 12 Jan 2016 22:15:35 +0000","Trafford – Hale Library – an update on progress – Friends of Hale Library. &#34;… we are now close to finalising an interior layout for the new building that will deliver an excellent library on the first floor and vastly improved facilities for the Bowling Club and Seniors Group on the ground floor.&#34; … about to submit for planning permission.","2016/01/the-future-of-english-public-library-websites.html"],["Newcastle","Thu, 14 Jan 2016 21:26:51 +0000","Newcastle – Proposals to cut Newcastle libraries opening hours deemed ‘worrying’  – Chronicle. &#34;&#34;East and West Newcastle will suffer with hours in both areas significantly cut back. &#34;Those communities are not always areas where there is good access to educational opportunities and where people have specific needs. &#34;Kids might not be getting access to books, this would be denying people across communities.&#34;. While the proposals are out to consultation, and Newcastle City Council has arranged three meetings to hear feedback from councillors and residents.&#34;","2016/01/democracy-of-space.html"],["Clydebank","Tue, 12 Jan 2016 22:15:35 +0000","Clydebank – Clydebank libraries upgrade to superfast fibre-optic broadband – Clydebank Post. &#34;Superfast fibre-optic broadband is now available at all Clydebank libraries ‒ and there’s no more queuing for a computer as residents can log on wirelessly using their own devices. The £15,000 project was fully funded by the Scottish Government’s Public Library Improvement Fund and offers broadband speeds of up to 152Mbps. The UK average is 100Mbps.","2016/01/the-future-of-english-public-library-websites.html"],["Hampshire","Tue, 12 Jan 2016 22:15:35 +0000","Hampshire – More people urged to have say on strategy plan for libraries – News. &#34;So far, around 8,600 people have responded to Hampshire County Council’s plans for public libraries, making it one of the most popular consultations held by the authority.&#34; … &#34;more people are being asked to get involved as some libraries could face closure.&#34;","2016/01/the-future-of-english-public-library-websites.html"],["Walsall","Tue, 12 Jan 2016 22:15:35 +0000","Walsall – 100 gather to oppose Pleck library closure – Express and Star. &#34;The protest saw campaigners from the Friend’s of Pleck Library group, headed by Shabir Hussain and Naheed Gultasib, stage loud chants and display brightly coloured banners in a bid to keep the popular Darlaston Road library open. It is the second time that the library has been earmarked for closure, along with others in the borough, as part of the council’s bid to save £25 million. Ms Gultasib, who is also a lecturer at Sandwell College, described the library as the ‘jewel in Pleck’s crown’.&#34; … &#34;More than 3,000 people have signed a petition opposing the closure in recent weeks.&#34; see also Hundreds protest against planned closures of Walsall libraries – Walsall Advertiser.","2016/01/the-future-of-english-public-library-websites.html"],["Lambeth","Thu, 14 Jan 2016 21:26:51 +0000","Lambeth – Lambeth library cuts: staff to strike over ‘cultural vandalism’ – London SE1. &#34;Several Labour Party branches in Lambeth have passed motions criticising their own council’s library cuts. Cllr Jane Edbrooke, cabinet member for Neighbourhoods, said: &#34;I understand the frustrations of those working at our libraries, but this potential industrial action is unhelpful. &#34;We have worked with community groups and organisations and been imaginative in our proposals that keep the majority of our libraries open – while helping make us make the £200 million in savings needed in response to Government budget cuts.&#34;","2016/01/democracy-of-space.html"],["Lambeth","Thu, 14 Jan 2016 21:26:51 +0000","Lambeth – MP urges council to change mind on library – Brixton Blog. &#34;Lambeth MP Kate Hoey has said that &#34;even at this late stage&#34; the council should change its priorities on the future of Tate South Lambeth Library (TSL). The library is one of three in the borough that will be turned into gyms run by the council’s leisure provider GLL in plans to save money because of cuts in ventral government grants. But it is also the leading library in the whole of the UK in the use of digital technology to help people with sight problems and will lose a new cutting-edge aid if the gym plan goes ahead.&#34; see also Lambeth library cuts: staff to strike over ‘cultural vandalism’ – London SE1.","2016/01/democracy-of-space.html"],["Lincolnshire","Thu, 14 Jan 2016 21:26:51 +0000","Lincolnshire – Free sticker book gets families to libraries – Horncastle News. &#34;Children’s reading charity, BookTrust has written and produced a sticker storybook to encourage more children to visit their local library in 2016. Children can collect stickers every time they visit a library and put them in special sticker book to take home. The new book called, Bear’s Reading Adventure, was developed in partnership with Igloo Books, after librarians reported families need more encouragement to visit libraries&#34;","2016/01/democracy-of-space.html"],["Dudley","Tue, 12 Jan 2016 22:15:35 +0000","Dudley – Online help at Halesowen and Cradley libraries – Halesowen News. &#34;Four levels of support are on offer including on-the-spot help with simple problems and drop-in sessions for help with Internet and e-mail, smartphones, tablets, online applications and form filling. &#34;","2016/01/the-future-of-english-public-library-websites.html"],["Lambeth","Tue, 12 Jan 2016 22:15:35 +0000","Lambeth – Lambeth library staff vote overwhelmingly in favour of strike action as fightback against book-ish gyms begins – Brixton Buzz. &#34;A Unison ballot has led to 89% of staff voting in favour of industrial action to save the libraries and protect jobs. An extended period of strikes will now be discussed by the union.&#34;","2016/01/the-future-of-english-public-library-websites.html"],["North Yorkshire","Tue, 12 Jan 2016 22:15:35 +0000","North Yorkshire – Friends of Bentham Library seek volunteers and funds to secure future of much-loved ‘heart of the community’ – Westmorland Gazette. &#34;The much-loved ‘heart of the community’ is staffed by professional librarians for ten hours per week, and by volunteers for six-and-a-half, to cover the hours lost when opening times were reduced by North Yorkshire County Council. From 2017 the High Bentham library will be completely managed by the community, and the Friends of Bentham Library (FOBL) are actively looking for more help and a new venue that costs less to run, so they can keep the library open.&#34; … &#34;Bentham Town Council pledged to support the library financially at its recent meeting, and Cllr Brockbank said the council already made a valued contribution by paying FOBL’s liability insurance.&#34;","2016/01/the-future-of-english-public-library-websites.html"],["Suffolk","Tue, 12 Jan 2016 22:15:35 +0000","Suffolk – Revamped library is the ‘pride of Elmswell’ – Bury Free Press. &#34;The community rallied behind the Friends of Elmswell Library and Suffolk Libraries groups to raise more than £15,000 to complete the revamp.&#34; … &#34;The library, which has been hailed ‘the pride of Elmswell’, has seen extensive work completed including a new space-saving moveable shelving, new furniture and improvements to the children and young people’s areas. Students from West Suffolk College also lent a hand, decorating the inside of the library with a fresh lick of paint. Emma Yarrow, Elmswell Library Manager, said: &#34;Elmswell Library Friends, with the support of very generous fund-raisers and organisations, managed to achieve something really very special.&#34; … &#34;The new design incorporates ‘dementia friendly’ aspects, with plain carpets so as not to confuse or distress those who are living with the condition, a grey entrance mat instead of a black one, so as not to cause confusion, and our signage is clear and easy to understand.&#34;","2016/01/the-future-of-english-public-library-websites.html"],["Ceredigion","Thu, 14 Jan 2016 21:26:51 +0000","Ceredigion – Report of the Strategic Director for Sustainable Communities – Ceredigion Council. &#34;It is recommended that the Morgan Street building be refurbished to accommodate a library on the ground floor as outlined above, and that the current lease at Canolfan Teifi be terminated accordingly.&#34;","2016/01/democracy-of-space.html"],["Lancashire","Thu, 14 Jan 2016 21:26:51 +0000","Lancashire – Tweet by Lancashire Conservative Group (above).","2016/01/democracy-of-space.html"],["Lincolnshire","Thu, 14 Jan 2016 21:26:51 +0000","Lincolnshire – New community library opens in Spilsby – ITV, &#34;Customers will be able to borrow books as well as buying bags of shopping after the opening of a community library inside a food store in Spilsby. Lincolnshire County Council has handed over the responsibly of running 30 libraries to the community. One of these is Spilsby Library, which closed in its previous home in West End Villas last autumn, and is now being run by Lincolnshire Co-op.&#34; … &#34;A new library has been created inside the food store in the town’s Post Office Lane.  An area of the store which was previously used as warehouse space has been transformed into the library through the £30,000 project.&#34; see also Latest community-run library within Lincolnshire Co-op opens its doors to users – Lincolnshire Echo. &#34;Grandmother and library volunteer Jean Gates said she was spending up to £21 a week to take her two grandsons to exchange books in Skegness following the closure of the Spilsby library in September.&#34;","2016/01/democracy-of-space.html"],["Rhondda Cynon Taff","Thu, 14 Jan 2016 21:26:51 +0000","Rhondda Cynon Taff – Service Changes – Public Consultation: Have Your Say – RHondda Cynon Taff. &#34;Proposal (preferred options):\nOption 2 – Reduction in number of Reference & Information Service Librarians – saving £37k; Option 4 – Reduce overall weekly opening hours of branch libraries to 31.5  hours per library – saving £46k; Option 7 – Single staffed branch libraries at 5 branches; (Hirwaun, Ferndale, Pontyclun, Mountain Ash, Rhydyfelin) – saving £105k; Option 9 – Reduce the Book Fund by 25%– saving £89k ; Option 12 – Reduce the Mobile Libraries from 4 to 3 retaining a 2 weekly rota – saving £37k; Option 13 – Remove Community Learning Worker post (part time) – saving £7k; Option 14 – Reduce expenditure on magazines and newspapers purchased – saving £6k. The proposed preferred options would deliver full year savings to the Council of £0.327m.&#34;","2016/01/democracy-of-space.html"],["Fife","Tue, 12 Jan 2016 22:15:35 +0000","Fife – Closure-threatened Fife libraries given another reprieve – Courier. &#34;final decision on whether to accept a controversial plan to shut 16 libraries to save cash will be made at a full council meeting in March.&#34;","2016/01/the-future-of-english-public-library-websites.html"],["Lancashire","Tue, 12 Jan 2016 22:15:35 +0000","Lancashire – A rather damning open letter from the former head of Lancashire County Council’s Cultural Services to the Leader of the Council regarding the proposals to close Museums & Libraries  Lancashire County Council Conservative Group. &#34;Not long ago Lancashire possessed what was regarded as one of the finest public library services in Western Europe. With one stroke the County will be creating at best a patch-work mediocre service, whilst in some areas it will be reduced to some of the poorest provision in the North West. &#34; … &#34;certainly, the line in the budget papers that a reduction to 12 libraries (from 74!) ‘would meet … its statutory obligations’ represents a totally ludicrous interpretation of the legislation&#34; … &#34;For the County Library Service, since the principal decision to close 40 libraries has already been taken, the proposed consultation is entirely spurious and a complete smoke-screen to hide the fact that the public will have no genuine say over whether or not their library closes. &#34;","2016/01/the-future-of-english-public-library-websites.html"],["Swindon","Tue, 12 Jan 2016 22:15:35 +0000","Swindon – Libraries aid social care – Swindon Advertiser. Shirley Burnham: &#34;As is regularly the case, &#34;tackling&#34; a budget means hurling oneself at the knees of our public libraries and bringing them down. I can identify a contradiction in some statements from Cllr David Renard and, specifically, this one: &#34;We will build resilience, which will allow us to focus more preventative services on social care issues before they arise and help more people to take care of themselves.&#34; To that I respond that our public libraries are eminently qualified to foster healthy living, community inclusion and independence in those who are frail, elderly, visually impaired or otherwise disabled.&#34;","2016/01/the-future-of-english-public-library-websites.html"],["Lambeth","Tue, 12 Jan 2016 22:15:35 +0000","Lambeth – A proposal that will save all Lambeth libraries – and meet the Council’s budget target – Friends of Tate South Lambeth Library. Proposal to run libraries by a staff/mutual trust. &#34;The proposal was first put to Lambeth officers in April 2015, during the public consultation on the Council’s proposals for cultural services policy to 2020. It was not taken up by Council officers, who instead put forward their proposal for half of Lambeth’s libraries to become library service points, with minimal book and computer provision and no staff, and with three of these to be centred on a gym. Their proposal – set out in the document Culture 2020 – was approved by the Council last October. However Council officers were forced – by popular pressure and the recommendations of  a Council committee –to offer an opportunity to the Libraries  manager to develop her proposals.&#34;","2016/01/the-future-of-english-public-library-websites.html"],["St Helens","Tue, 12 Jan 2016 22:15:35 +0000","St Helens – Creative workshops at St Helens Libraries to help provide antidote to new year blues – St Helen’s Star. &#34;With the new year often a difficult time when people can feel down and worried about the year ahead, ‘Creative Alternatives’ will offer people who experience poor mental health access to a variety of sessions in drawing, painting, crafts and creative writing, all led by trained artists. &#34;","2016/01/the-future-of-english-public-library-websites.html"],["Wrexham","Tue, 12 Jan 2016 22:15:35 +0000","Wrexham – Trust ‘to protect libraries, museums and culture’ in Wrexham – Leader. &#34;Wrexham Council’s executive board will meet next week discuss proposals to establish a trust to take on the management of the services, with community well-being and development chief Lawrence Isted expected to get the nod to go ahead with the scheme. Once established, Cllr Hugh Jones, lead member for communities and partnerships, said there would be a possiblility the trust could run other county services.&#34; … &#34;An options appraisal was done to consider merging the services into one trust and it was determined this was the most viable sustainable model in the medium to long-term&#34;","2016/01/the-future-of-english-public-library-websites.html"],["Moray","Thu, 14 Jan 2016 21:26:51 +0000","Moray – Video: Moray proposes 18% council tax rise – Press and Journal. &#34;Moray Council has taken the &#34;bold step&#34; of defying the Scottish Government by moving to unfreeze council tax rates. Council leader Stewart Cree announced the plans during a meeting this morning at the local authority’s headquarters in Elgin. The tax will increase by 18% under the proposals, rising annually from £756 to £892 on Band A properties and from £2,270 to £2,678 on Band H homes. The levy has been frozen for nine years, under the instruction of the Scottish Government.&#34;","2016/01/democracy-of-space.html"],["North Yorkshire","Thu, 14 Jan 2016 21:26:51 +0000","North Yorkshire – Capita : North Yorkshire County Council selects Capita to deliver its library management system – 4-Traders. &#34;The Council will upgrade to Capita’s fully-hosted cloud-based Chorus LMS. Chorus will reduce on-site hardware and maintenance overheads, and free library staff from routine administrative responsibilities, enabling them to be re-deployed to customer-facing tasks. The Council will also utilise Capita’s web-based staff interface Soprano, an easy to use cloud-based service that provides staff with real-time access to the LMS on any internet-enabled device.&#34;","2016/01/democracy-of-space.html"],["Staffordshire","Thu, 14 Jan 2016 21:26:51 +0000","Staffordshire – Campaigners’ last-ditch bid to save the historic old Carnegie Library – Staffordshire Newsletter. &#34;Tireless members of the Friends of the Old Library Trust have been trying to get £650,000 to buy the former library at The Green and turn it into an arts space. They have managed to get the building listed by English Heritage and have been holding public tours to raise awareness and search for a benefactor. But the campaigners have to hand the keys back on February 6 when the lease runs out and the site goes up for auction.&#34;","2016/01/democracy-of-space.html"],["Lincolnshire","Tue, 12 Jan 2016 22:15:35 +0000","Lincolnshire – Letter: ‘Lincolnshire County Council is swinging its axe at the wrong target in libraries’ – Lincolnshire Echo. &#34;The organisers of the ‘Save Lincolnshire Libraries Campaign’ have voiced the opinions of thousands like me, who wished to retain the former system of a professional library service, managed by professional librarians.&#34; … &#34;In their haste to dispense with something which, it must be said, is rightfully ours, one may be excused for assuming that certain councillors may never have used a library – or are even unaware of the unacceptable literacy standards that still prevail in some Lincolnshire schools. Another reason for retaining a professional service.&#34;","2016/01/the-future-of-english-public-library-websites.html"],["Cardiff","Thu, 14 Jan 2016 21:26:51 +0000","Cardiff – Changes for Cardiff Executive Summary of the Consultation Results and Feedback Report on the City of Cardiff Council’s 2015/16 Budget Proposal – Cardiff Council. &#34;Whilst some practical concerns were expressed about community groups and third sector organisations being asked to run more local services and facilities, there is a clear support (74.6%) for volunteers assisting in a new approach to library services.   &#34; … &#34;The highest level of agreement was found regarding the Council’s proposal to transform Central Library into a Community Hub (74.1% / 2,794). The public expressed less agreement in instances where it was proposed that the Council withdraw funding from specific facilities with high numbers opposingi.e. (i.e Whitchurch 49.1%, Rhiwbina 49%, Cathays 46.4%, Rhydypennau 44.4%, Roath 44.1%, Radyr 41.8%, Rumney 39.2%)","2016/01/democracy-of-space.html"],["Devon","Thu, 14 Jan 2016 21:26:51 +0000","Devon – Libraries Unlimited leadership line up announced – Devon County Council. &#34;A Magistrate from East Devon, an Exeter based Artistic Director, an expert Business Growth Coach and a former BBC World Service Journalist are among those who have been appointed to help run Devon’s libraries.Libraries Unlimited, the new independent public service mutual set up by the County Council and tasked with delivering Devon’s library service from April, has recruited four independent trustees to join its board. Two staff trustees and two community trustees will also join the board, after being elected as representatives by their peers.Alongside the organisation’s new Chief Executive Ciara Eastell and the Board’s Chair, Julie Dent, they will work with library staff to deliver a modern, vibrant and sustainable library service for Devon.&#34;","2016/01/democracy-of-space.html"],["Hampshire","Thu, 14 Jan 2016 21:26:51 +0000","Hampshire – Executive Member reassures young reader during meeting at her local library– Hantsweb. &#34;Councillor Andrew Gibson met Alexandra Kelly, 11, at Yateley library, after she wrote a letter highlighting how much she and her family value her local library. The County Council has so far received more than 8,600 responses to its consultation on the draft Library Strategy, which includes a proposal to standardise services by placing Hampshire libraries into four tiers, based on how busy they are.&#34;","2016/01/democracy-of-space.html"],["Somerset","Thu, 14 Jan 2016 21:26:51 +0000","Somerset – Have your say and save your library urges Cheddar resident – Cheddar Valley Gazette. &#34;Friends of Cheddar Library (FOCL) are urging local library users to take part in the public engagement survey on libraries being run by the county council. The latest round of cuts by central government on Somerset County Council mean that Somerset Libraries Service is in the spotlight again.&#34;","2016/01/democracy-of-space.html"],["Shropshire","Tue, 12 Jan 2016 22:15:35 +0000","Shropshire – Judicial Review on Church Stretton Library to be heard in April – Shropshire Live. &#34;On 27th March 2015 Shropshire Council decided to close the Church Stretton Library in its current building at the heart of the community and move it out of town to be run by a private company at the school on Shrewsbury Road; thus marking the end of our exemplary vibrant community hub, with its visitor information centre, registrar, customer services and library, to create an isolated, single-use library.&#34; … &#34;The High Court has now listed the case for hearing on the 4th and 5th April 2016.&#34;","2016/01/the-future-of-english-public-library-websites.html"],["Solihull","Tue, 12 Jan 2016 22:15:35 +0000","Solihull – Revamped Library’s new name reflects role at the heart of Solihull – Birmingham Mail. &#34;Solihull Central Library will be given a new name as a £2.3million refurbishment programme nears completion. ‘The Core’ will include the town’s main library, the Arts Complex Theatre, Solihull Connect, a community advice hub and a number of voluntary and community sector organisations. Council bosses decided to refurbish the library in Homer Road to make it more user-friendly for staff and customers and it has been designed to offer residents access to a range of information and advice agencies in one central location. The refurbishment is due to be completed by the end of February.&#34;","2016/01/the-future-of-english-public-library-websites.html"],["Worcestershire","Thu, 14 Jan 2016 21:26:51 +0000","Worcestershire – Victory for Worcester’s Hive as HMRC refunds £1.8 million in taxes – Worcester News. &#34;University of Worcester has been left celebrating after the Government decided to refund £1.8 million in taxes on The Hive. The city’s gold-cladded £60 million building has been handed back its VAT costs after a long-running dispute involving fierce lobbying with the Treasury and ministers. For the last four years Worcester MP Robin Walker has been arguing that The Hive should be treated like any public building and be spared a VAT bill on its construction costs.&#34;","2016/01/democracy-of-space.html"],["Brighton and Hove","Sun, 17 Jan 2016 21:13:52 +0000","Brighton and Hove – Labour: Hove Library move is a great opportunity – Brighton and Hove Independent. &#34;The more residents hear about the proposals for a new Hove library at the Hove Museum site, the more they are getting behind the plans. Local Labour councillors Clare Moonan and Tom Bewick have been talking to residents on the doorstep about the plans. They have also joined forces with Peter Kyle, MP for Hove and Portslade, to deliver a newsletter asking residents for their views. Over 70 per cent of responders backed relocating the library to Hove Museum as part of a new cultural hub.&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Carmarthenshire","Sun, 17 Jan 2016 21:13:52 +0000","Carmarthenshire – Cut Ribbons announce Llanelli Library show for National Libraries Day – South Wales Evening Post. &#34;The indie rock fizzy pop five-piece, fresh from a BBC Maida Vale session, will be bringing their music to their hometown for a stripped back acoustic performance. The band will perform on Saturday, February 6, in Llanelli Library’s beautiful Athenaeum Hall, as part of a nationwide celebration of libraries.&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Cambridgeshire","Sun, 17 Jan 2016 21:13:52 +0000","Cambridgeshire – Public being asked to consult on future of area’s libraries – Hunts Post. &#34;A public consultation has been set up to gauge opinion and ask people to give a view about the options facing Cambridgeshire County Council, which could include changes to the mobile service and a reduction in opening hours.&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Devon","Sun, 17 Jan 2016 21:13:52 +0000","Devon – County bucking national library trend – Okehampton Times. &#34;Not only has it kept all 50 of the county’s libraries open, but more than three million visits to Devon libraries in 2014/15 ensured a 10% increase across the county. PC and Wi-Fi usage has also increased in Devon’s libraries by 100%. &#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["East Riding of Yorkshire","Sun, 17 Jan 2016 21:13:52 +0000","East Riding of Yorkshire – John Godber and daughter’s play tours to libraries – Scarborough News. &#34;&#34; We have created a mini musical about obsession, teenage life and box sets. New musicals are opening all over Yorkshire, and unlikely as it may seem one may be literally ‘popping up’ at a library near you.&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Essex","Sun, 17 Jan 2016 21:13:52 +0000","Essex – Hundreds of prisoners complete ‘life-changing’ book challenge in Chelmsford – Yellow Advertiser. &#34;Reading Ahead, formerly known as the Six Book Challenge, offers offenders a chance to improve their reading skills through six books of their own choosing. Inmates can choose from a wide selection of books in the prison li-brary. A number of prisoners revealed it gave them their first oppor-tunity to read a book cover to cover. Hundreds of prisoners signed up for the initiative, with 104 men completing the course resulting in a silver award for the library at Her Majesty’s Prison and Youth Offenders Institute (HMP & YOI) Chelmsford. One prisoner said: &#34;Before coming to prison I had never read a book start to finish. It feels like I have actually accomplished some-thing very positive.&#34;&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Herefordshire","Sun, 17 Jan 2016 21:13:52 +0000","Herefordshire – Libraries thrive Down Under – but not in Herefordshire – Hereford Times. &#34;Our daughter lives in Melbourne, where local councils are improving libraries and building new ones. There is also a magnificent Victoria State Library which could rival the British Library, as well as university libraries which are well stocked,with books, magazines and newspapers, and computers and Wi-Fi access at every desk. All the libraries that we visited were busy, which only goes to prove that if a good service is provided, it will be heavily used&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Telford and Wrekin","Sun, 17 Jan 2016 21:13:52 +0000","Telford and Wrekin  – Watch: We will fight to save Newport’s library, say residents – Shropshire Star. &#34;Town and borough councillor Peter Scott said he was amazed to see so many people turn out for the protest.&#34; … &#34;One regular user of the library, Barbara Wickstead, of Edgmond, said she would be lost if the library was to close as she uses it every few weeks. The 83-year-old said if the town was to lose the service she would have to travel to Wellington Library.&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Flintshire","Sun, 17 Jan 2016 21:13:52 +0000","Flintshire – ‘All systems go’ for library bid in Mancot following community campaign – News North Wales. &#34;Campaigners in Mancot have been told by council bosses that the library will be handed to them under a community asset transfer for a five-year period subject to the authority’s cabinet giving approval.&#34; … &#34;We are now looking at the logistics and administration of it. Obviously we won’t be using the computerised system, we will be going back to the old system with brown tickets.&#34;&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Flintshire","Sun, 17 Jan 2016 21:13:52 +0000","Flintshire – Talks loom on rescue bid for threatened libraries in Flintshire – Leader. &#34;Flintshire Council cabinet members will look at the responses from community groups interested in taking over ownership of libraries in Hope, Mynydd Isa and Saltney, which are under threat of closure by the local authority in order to save costs. They still could be saved by way of a community asset transfer (CAT) whereby Flintshire transfers ownership of the site to a community council or organisation.&#34; … &#34;It is hoped the transfer of these libraries could contribute towards a £544,000 saving for the county over the next year.  These three libraries have a combined yearly running cost of £88,000. &#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Lewisham","Sun, 17 Jan 2016 21:13:52 +0000","Lewisham – Building Community Capacity Loan to Eco-Communities – Lewisham Council. Having considered an amended open officer report and a presentation by the Cabinet Member for the Third Sector, Councillor Joan Millbank , Mayor and Cabinet (Contracts) agreed that a loan of £30,000 be made to Eco-Communities CIC.&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Telford and Wrekin","Sun, 17 Jan 2016 21:13:52 +0000","Telford and Wrekin – Tories hit back over Telford & Wrekin Council library closures plan – Shropshire Star. &#34;The Conservative opposition group on Telford & Wrekin Council has published its alternative budget and pledged to keep all six under-threat libraries open&#34; … &#34;Moves would be made to convert the other four into &#34;public service mutuals&#34; and run in a different way to ensure they stayed open. The Tory budget has been passed as &#34;robust&#34; by council finance chief Ken Clarke and will be taken into the council chamber alongside the Labour budget when a final vote and decision is made.&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Warwickshire","Sun, 17 Jan 2016 21:13:52 +0000","Warwickshire – Leamington, Nuneaton and Rugby libraries to shut on Sundays – BBC. &#34;The county’s three largest libraries in Rugby, Nuneaton and Leamington Spa currently open for four hours each. The council plans to save £54,000 from Sunday closures, £14,600 by cutting the wage bill and £31,400 by saving on administration and mobile libraries. The decision on whether to launch a consultation on the plan will be made on 22 January. If approved, Sunday opening would stop in August 2016.&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["West Sussex","Sun, 17 Jan 2016 21:13:52 +0000","West Sussex – Five-year-old pays tribute to librarian story-teller … by naming his dog after him – West Sussex County Times. &#34;The lovable Cavalier King Charles spaniel has been named after Daniel Belton, a senior West Sussex library assistant. &#34; … &#34;Daniel the spaniel was even allowed special VIP access into Lancing library to meet the original Dan up close and personal. Dan, who has worked in libraries across West Sussex for almost 22 years, said: &#34;The dog belongs to a member of staff who works at Steyning Library, but who often comes into Lancing. Her sons, Michael and William, had joined us for a story-time session. We did ‘Aliens and Robots,’ with the children designing their own robots. We always try to get into it too, so I was ‘wearing’ a very large brain on my head!&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Norfolk","Sun, 17 Jan 2016 21:13:52 +0000","Norfolk – ‘Porn-viewing’ Norwich library users banned – BBC. &#34;A library has banned three people suspected of using its computers to look at pornography. The Norfolk and Norwich Millennium Library said it was investigating the &#34;misuse&#34; of computers, after a child spotted someone viewing the images.&#34;","2016/01/no-money-no-policy-and-shouts-of-protest.html"],["Bradford","Thu, 21 Jan 2016 23:39:28 +0000","Bradford – Bradford Council has bowed to pressure and will hold an additional consultation on the future of threatened libraries – Telegraph and Argus. &#34;Council has bowed to public pressure and has just announced that a consultation meeting about the future of Shipley libraries will now take place in Baildon. On Monday, the Telegraph & Argus reported how the decision to discuss possible closure of Baildon, Burley, Menston and Silsden at a meeting in Keighley library tomorrow had been branded &#34;insulting&#34; and &#34;barmy&#34; by leading opponents. hey argued it was unfair to expect people to travel so far for a one-hour meeting or attend an earlier drop-in session.&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Bradford","Thu, 21 Jan 2016 23:39:28 +0000","Bradford – Volunteers flock to staff new super library – Telegraph and Argus. &#34;When closure of Idle Library was announced just over two years ago, community action group Inspired Neighbourhoods, chaired by ward Councillor Jeanette Sunderland, saw it as an opportunity to make a purpose-built new amenity. Grants and funding were secured to transform the site of a disused Methodist church on Albion Road, replacing it with a state-of-the art building incorporating seven business units above enough space for public meeting rooms and a library.&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Herefordshire","Thu, 21 Jan 2016 23:39:28 +0000","Herefordshire – Ambitious plans put forward to transform Hereford Library into modern community hub – Ledbury Reporter. &#34;Hereford Library Users Group (HLUG)’s plans to revolutionise the city’s Broad Street library by changing its interior entirely are detailed in a new 16-page document. HLUG was invited to work with Herefordshire Council to explore options for future service delivery of a library in the city following December’s cabinet meeting. And the group says its ideas for The Rankin Centre – named after philanthropist James Rankin who enabled the library to be built – include the interior being completely replaced, with added floors and virtually double the usable space.&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Isle of Wight","Thu, 21 Jan 2016 23:39:28 +0000","Isle of Wight – Report from the executive member for tourism, culture and heritage to the meeting of full council – Isle of Wight Council.  Notes libraries are a statutory service and quotes their obligations. &#34;The Full Council agenda item includes a possible choice on cutting libraries but please note that libraries are a statutory service.  &#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Lambeth","Thu, 21 Jan 2016 23:39:28 +0000","Lambeth – Book-ish Gyms back on agenda at Full Lambeth Council meeting as Cabinet member rejects Green proposal to consider in-house solution – Brixton Buzz. &#34;Little has been said about the proposal put forward by Susanna Barnes – mainly because Cllr Edbrooke has tried to shut down this suggestion as she pushes ahead with her deeply unpopular book-ish gyms&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Shropshire","Thu, 21 Jan 2016 23:39:28 +0000","Shropshire – Summer date for town council move into Shrewsbury Library – Shropshire Star. &#34;Shrewsbury Town Council hopes to move its offices to the town’s library and take over the running of the service by the summer.&#34; … &#34;The authority has been in discussions with Shropshire Council in an attempt to reach an agreement to relocate its main offices to the historic Castle Gates library since last November. Under the proposal the town council is also looking to take on the management of the town’s library service.&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Caerphilly","Thu, 21 Jan 2016 23:39:28 +0000","Caerphilly – Caerphilly library celebrates popular second year – Campaign series. &#34;Library is celebrating a successful second year in its custom-built town centre location. In 2015, the library welcomed 218,000 visitors, loaned over 134,000 items and staff fielded almost 274,000 enquiries.&#34; … &#34;The library houses a customer service centre and cash office which allows members of the public to access a wide range of council services. Another feature of the library is its heritage space, which hosts exhibitions and displays from the New Tredegar Winding House Museum and community organisations&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Lincolnshire","Thu, 21 Jan 2016 23:39:28 +0000","Lincolnshire – False dawn? – Secret Librarian. Summary of the turbulent times in the borough so far.","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["East Sussex","Thu, 21 Jan 2016 23:39:28 +0000","East Sussex – Battle council discusses library cuts consultation – Rye and Battle Observer. &#34;East Sussex County Council (ESCC) opened a public consultation on cutting library’s opening times on Monday, January 11.&#34; … &#34;Battle Library’s times would be reduced by 10 hours if ESCC’s proposals go through.&#34; … &#34;ESCC is proposing to reduce opening hours across all 24 of its libraries by around 25 per cent on average, in a bid to reduce library running costs by around £500,000. This would help towards the library service’s savings target of £2m over the next three years, according to the local authority.&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Lambeth","Thu, 21 Jan 2016 23:39:28 +0000","Lambeth – Labour peer urges Lambeth Council to save Waterloo Library – London SE1. &#34;&#34;I have just moved into the Waterloo area and am so impressed by the constant use of my new excellent local library, with its IT facilities, clearly very much needed, its good collection of local books and its helpful staff,&#34; said Baroness Whitaker. &#34;In my view it would be very damaging to the neighbourhood of Lower Marsh, the local vibrant shopping street, for it to be deprived of its library. &#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["South Gloucestershire","Thu, 21 Jan 2016 23:39:28 +0000","South Gloucestershire – South Gloucestershire Council meets tonight to discuss consultation on closing Chipping Sodbury Library under savings programme – Gazette Series. &#34;The small library on High Street is costing hard-up South Gloucestershire Council £42,000 a year to run but many of its visitors also use the much bigger Yate Library less than a mile away, leaving only 194 unique members who are costing the authority £216 each. Campaigners devastated at the potential loss of the much-loved library have this week launched a fight to save the facility, which opens two days and two mornings a week.&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Lancashire","Thu, 21 Jan 2016 23:39:28 +0000","Lancashire – Responses to Consultation – Lancashire County Council. (51 minutes in) Libraries important for books and as community hubs,","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["North Yorkshire","Thu, 21 Jan 2016 23:39:28 +0000","North Yorkshire – Craven libraries explore community-run solution – Craven Herald and Pioneer. &#34;&#34;We’re now out talking with groups in Settle, Cross Hills, Ingleton and Bentham to find out how they will run their libraries,&#34; she said. &#34;By doing this now, we’re giving people more time to get them up and running by April 2017. &#34;The county council is still going to put a lot of infrastructure in. We’ll continue to pay for books, the reservation service and van delivery, as well network and broadband access for the public PCs.&#34;. Settle: &#34;He said so far about a half a dozen volunteers had come forward, and the parish council had come up with a possible plan to see if parish councils across South Craven would make a donation towards running costs. &#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Lincolnshire","Thu, 21 Jan 2016 23:39:28 +0000","Lincolnshire – Gagged and bound – Secret Librarian. &#34;The ongoing and seemingly endless saga of the Library Service’s future did inevitably divide opinion amongst librarians themselves. There were some who just wanted the whole sorry mess sorted out once and for all and others who thought that the fight was worth pursuing. However we are now at a stage where the County Council have got their way through their heavy handed steam roller tactics and it remains to be seen what awaits the service when the not for profit charitable organisation takes over in April. For now there seems to be a kind of limbo existence as there has been no communication from them as yet.&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Newcastle","Thu, 21 Jan 2016 23:39:28 +0000","Newcastle – The Government hopes that a public weary of local council cuts will let them off the hook – Chronicle. &#34;The session I went to was about the proposal to reduce library opening hours. I wanted to hear from library users about the impact that these proposals would have and also listen to ideas about what we might do differently. I love libraries. I think libraries are a statement of what we stand for a city and I would fight to the end to save them from the Tory chopping block. We were clear this year that the budget proposals must not include any library closures. It has been really difficult to achieve that and whilst sacrificing library opening hours is disappointing it has saved all of our libraries from closure. Sitting in the consultation session at the City Library this week confirmed my view that libraries are not a luxury, they are a necessity.&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["St Helens","Thu, 21 Jan 2016 23:39:28 +0000","St Helens – St Helens prepares for global Harry Potter event  – Liverpool Echo. &#34;Young witches and wizards in St Helens can enter its Central Library through platform nine and three-quarters, for a night of games, crafts and book readings on Thursday, February 4. Children are invited to dress up in their best magical gear for the sorting ceremony, with the chance to be sorted into one of Hogwarts school’s four houses.&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Warwickshire","Thu, 21 Jan 2016 23:39:28 +0000","Warwickshire – Alcester Library set to move to new home in Globe House – Redditch Standard. &#34;The market town’s current library will close its doors tomorrow (Thursday) and will reopen at its new home on February 8. That means from Friday (January 22) to February 7 Alcester residents will briefly be without a library in order for the move to take place. However, members will still have access to services online 24 hours a day, seven days a week where they can renew and reserve items as well as access e-books and a range of free online reference material. County Councillor Mike Gittus said he was very much looking forward to the re-opening of Globe House which will bring together a great range of services under one roof&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Lincolnshire","Thu, 21 Jan 2016 23:39:28 +0000","Lincolnshire – Reporting from the Budget Meeting, Lincolnshire CC Offices, 19th January 2016 – Save Lincolnshire Libraries. &#34;At the top of the County News (CN) list of &#34;discretionary services&#34; is libraries, which of course is not discretionary but statutory. I drew this to the meeting’s attention. I also mentioned that the figure of a £6million budget next to the library service included £2 million savings already earmarked.&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Southampton","Thu, 21 Jan 2016 23:39:28 +0000","Southampton – SCA interested in running Cobbett Road Library – Bitterne Park Info. &#34;With council funding for Cobbett Road Library withdrawn from April, its future could be bleak. One ray of hope, however, is that Social Care in Action (SCA) has expressed interest in running it. We talk to SCA chief executive Ruth Marriott, left, who explains the current state of play, and what SCA running the library might look like in reality.&#34;","2016/01/halifax-give-a-little-extra-help-or-do-they-and-the-scl-fail-to-directly-support-mylibrarybyright.html"],["Bradford","Sun, 24 Jan 2016 23:32:02 +0000","Bradford – Bradford Council libraries boss promises a year of negotiation before closures – Telegraph and Argus. &#34;A consultation meeting held in Keighley Library last night was attended by local interest groups ranging from military research group Men of Worth to members of Baildon Youth Council. Bradford Council’s principal libraries officer, Jackie Kitwood,gave the stark reality of government funding cuts being translated by City Hall into either passing 17 outlying libraries into voluntary control – or closing them.&#34; … &#34;If Full Council votes on February 25 to just keep seven major libraries under its control and lose the rest, intense negotiations will begin with people keen to start Community Managed Libraries (CMLs). &#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Redbridge","Tue, 26 Jan 2016 22:05:07 +0000","Redbridge – Council leader guarantees no library closures in next two-and-a-half years – Guardian series. &#34;The leader of Redbridge Council has given a &#34;cast-iron guarantee&#34; that there are no plans to close any libraries in the borough before the next elections in 2018. In response to public concerns about library closures, council leader Jas Athwal pledged Wanstead Library in Spratt Hall Road will still be open at the time of the 2018 local elections&#34; … Woodford Green: &#34;&#34;The current library is tired, so we have proposed a new state of the art facility a few yards down the road, which will run a bit like the one at South Woodford. But the library will not close until the new one opens.&#34;&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Cheshire West and Chester","Sun, 24 Jan 2016 23:32:02 +0000","Cheshire West and Chester – Celebration of libraries in Cheshire West and Chester  – Chester Chronicle. &#34;To celebrate libraries in Cheshire West and Chester, library visitors will be photographed with their messages of what the library means for them. The responses and photographs will then be displayed in libraries and on the service’s Facebook, Twitter and Flickr pages&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Fife","Tue, 26 Jan 2016 22:05:07 +0000","Fife – School library cuts will deepen rich-poor divide, claims EIS – Courier. &#34;Cost-cutting measures like getting rid of professional librarians, which some Fife headteachers have done, is central to the decline of school libraries and is undermining the fight for equal opportunities, according to the Literature Alliance. Teachers, authors, librarians and unions have thrown their weight behind a petition from Save Scotland’s School Libraries, which is before MSPs today.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Southwark","Tue, 26 Jan 2016 22:05:07 +0000","Southwark – Dolly Parton to give books to children in Southwark – BookSeller. &#34;The scheme will give a every child born in Southwark from December 2015 to December 2016 a free book every month from birth until their fifth birthday. The project is being run through The Imagination Library, which began in 1995, and is supported by Parton’s Dollywood Foundation, which promotes early childhood literacy internationally, and travel company, DialAFlight. DialAFlight is the locally-based funder of the Southward scheme and is allocating £750,000 to the project from its own charity, Make My Day Better, as a part of its community outreach work with the aim of improving literacy in the borough.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["West Sussex","Tue, 26 Jan 2016 22:05:07 +0000","West Sussex – Week of celebration for West Sussex’s library service – Worthing Herald. &#34;To celebrate National Libraries Day, which is on Saturday February 6, customers will be able to try any borrowable stock for free, as all reservations from Monday February 1 to Sunday February 7 will be free of charge. Customers can choose from any items in stock across West Sussex; no matter which library the item is in, it can be delivered to the customer’s local branch.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Wiltshire","Tue, 26 Jan 2016 22:05:07 +0000","Wiltshire – Something for everyone at Westbury Library  – White Horse News. &#34;The library on Edward Street will be hosting four one-off events throughout the week including talks, games and workshops.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["City of London","Sun, 24 Jan 2016 23:32:02 +0000","City of London – National Libraries Day – City of London  Libraries. &#34;Saturday 6 February will see the fifth National Libraries Day – a day of events and activities promoting the difference that modern libraries make to people, families and communities across the UK. Libraries in the UK are loved, valued and were visited an astonishing 265 million times last year! They are a vitally important public service. Celebrate them on National Libraries Day, Saturday 6 February at Barbican Library, and with many exciting events to choose from – we’ve got something for everyone!&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Lambeth","Sun, 24 Jan 2016 23:32:02 +0000","Lambeth – Lambeth libraries – the alternative plan – Brixton Blog. &#34;The alternative plan [PDF download] for Lambeth’s libraries put forward by Susanna Barnes, its current head of library services, points out that the borough’s library service is one of only two in Great Britain in the last year to improve its performance in visits, membership and issues of books and other material. The council’s Culture 2020 report, agreed in October last year, said Barnes’ initial proposals, made last spring, could not meet the savings required in the necessary timescale because they did not specify how £500,000 extra income required would be found.&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Coventry","Sun, 24 Jan 2016 23:32:02 +0000","Coventry – Deals to move libraries revealed as council cuts begin to take shape  – Coventry Telegraph. &#34;Arena Park Library, in Holbrooks, and Willenhall Library, in Remembrance Road, are earmarked to move to new locations as part of the council’s Connecting Communities scheme which aims to shave £1.2million from this year’s budget, rising to £5m the following year. Council officials hope to be able to confirm the move of Arena Park Library to Holbrooks Community Care Association, on Holbrooks Lane, in the next few months.&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Worcestershire","Sun, 24 Jan 2016 23:32:02 +0000","Worcestershire – New Bromsgrove Library enjoys record visitor numbers in its first month – Bromsgrove Standard. &#34;Bromsgrove’s new library which opened in the new hub on the site of the former Parkside School building has already enjoyed record attendances. More than 16,000 visits have been recorded in the first month and the library has also gained 197 new members. As well as the usual loaning of books, Bromsgrove Library, which opened on November 30 offers free internet access, regular and holiday children’s activities, adult learning courses and a meeting room available for hire. Nicki Hitchcock, Bromsgrove Library Manager said: &#34;We love our new library – it’s so light and airy and is such a great place to work&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Lancashire","Tue, 26 Jan 2016 22:05:07 +0000","Lancashire – Last chance to save our libraries as consultation deadline nears – Accrington Observer. &#34;Lancashire County Council’s (LCC) consultation on whether to axe up to half of Lancashire’s libraries is due to end on Sunday, January 31 – leaving just days to oppose the cuts. Since starting our campaign against the closures in November, the Observer office has been flooded with responses from people, who, like us, believe that libraries play a vital role in our communities. Now we have until the end of this week to boost the final total before we deliver our petition to the county council’s head office.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Lancashire","Tue, 26 Jan 2016 22:05:07 +0000","Lancashire – Library campaigners hold peaceful protest – Chorley Guardian. &#34;Campaigners fighting to save their village library from closure amid funding cuts are organising a sit-in. And they will be supported by well-known faces, including comedian Dave Spikey&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Staffordshire","Tue, 26 Jan 2016 22:05:07 +0000","Staffordshire – Staffordshire people urged to love their libraries ready for National Libraries Day – Staffordshire Newsletter. &#34;People of all ages can join in the celebrations by taking part in a week of events and opportunities, including author appearances, reading and poetry competitions, a science fair, craft sessions, computer games evenings, local history, and health & wellbeing activities. Staffordshire County Councillor, Ben Adams, cabinet member responsible for libraries said: &#34;With the emphasis on fun and creating a buzz around our libraries, Saturday 6 February will round off a week of special celebrations showcasing the very best the county’s libraries have to offer.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Devon","Sun, 24 Jan 2016 23:32:02 +0000","Devon – Totnes librarian appointed as trustee to group that will help run Devon’s libraries – Herald Express. &#34;One of the staff trustees is Ann Draisey, Library Supervisor at Totnes Library, who said: &#34;I am very proud to have been elected by my colleagues to serve as a trustee on the board for Libraries Unlimited. This is a really exciting time to be in Devon Libraries and I am looking forward to getting started on the transition to the new organisation.&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Kirklees","Sun, 24 Jan 2016 23:32:02 +0000","Kirklees – Love your local library in February – Batley and Birstall News. &#34;&#34;The sheer breadth of activities and services one can access at a local library is simply staggering. Customers can find new authors and favourite novels; join in at story time or rhyme time; search for jobs; complete a digital skills course; attend Knit and Natter or local history groups, and find out what’s happening locally.&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Redbridge","Sun, 24 Jan 2016 23:32:02 +0000","Redbridge – Campaigner ‘not confident’ council will keep libraries open – Guardian Series. &#34;Chairman of Wanstead Society Scott Wilding said he does not know how Redbridge Council can keep libraries like Wanstead open following a £190,000 cut to the budget last year. &#34; … &#34;At a full council meeting last night, cabinet member for civic pride Councillor Dev Sharma said: &#34;I assure you that Wanstead Library will stay open and there are no plans to close any other libraries or make changes to opening hours.&#34; &#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Southwark","Sun, 24 Jan 2016 23:32:02 +0000","Southwark – Southwark council-run Canada Water Library ranked second busiest library in the capital – South London Today. &#34;&#34;As we continue to celebrate the success of our newest library in Camberwell, which this week hosted the successful launch of Dolly Parton’s Imagination Library, statistics like these are a fantastic boost. &#34;They provide clear evidence that libraries are still very much relevant and thriving community hubs for many of our residents.&#34;&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["East Sussex","Sun, 24 Jan 2016 23:32:02 +0000","East Sussex – What does it mean for staff? – Bexhill Observer / Letters. &#34;Under the guise of ‘savings’ the budget for libraries is to be cut by £2m, part of an overall budget cut of £93m. Is it worth putting in here how much ESCC has spent on the link road? The consultation is specifically about reducing library opening hours, although one question asks for other ways ‘savings’ might be made. Don’t fall for it. It is the classic ploy of getting us to cut our own throat.&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Swindon","Sun, 24 Jan 2016 23:32:02 +0000","Swindon – Submission from Royal National Institute of Blind People to Swindon Council  – Library Campaign. &#34;We have been asked to post this on our site and are happy to do so in order to highlight the issues raised by the submission of the Royal National Institute of Blind People (RNIB) to the Swindon Council budget consultation, with specific reference to libraries. Many of the points relate to libraries in general, not just those in Swindon. Cuts to library services and closures have a disproportionate impact on blind and partially sighted people. There is also concern that volunteers or community groups may not understand the needs of minority groups such as blind and partially sighted people, therfore having an unfair impact on their access and use of the service&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Enfield","Sun, 24 Jan 2016 23:32:02 +0000","Enfield – &#34;Superhero&#34; volunteers needed to support libraries – Enfield Independent. &#34;Last year nearly 50 volunteers gave over 700 hours to libraries that supported the Summer Reading challenge and ESOL (English for Speakers of Other Languages), as well as guiding people to certain sections of the library and training people on computers. The council also cover travel expenses for those who volunteer.&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Essex","Sun, 24 Jan 2016 23:32:02 +0000","Essex – Learn new skills at Essex libraries for free – Yellow Advertiser. &#34;Budding computer programmers and coders can hone their skills thanks to one-off makerspace or Raspberry Pi events, whilst those who are less computer savvy may enjoy the array of knitting and reading groups popping up at libraries across the county. Ciara Eastell, president of the society of chief librarians, said: &#34;Learning has always been at the heart of what libraries deliver and libraries are increasingly being used by a wide range of people to develop life-essential skills.&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Lewisham","Sun, 24 Jan 2016 23:32:02 +0000","Lewisham – Libraries under threat – Tim Parkin speaks out on Talk Radio Europe  – Lewisham People Before Profit.","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Leicestershire","Tue, 26 Jan 2016 22:05:07 +0000","Leicestershire – Hathern Library community partnership launches  – Loughborough Echo. &#34;Leicestershire’s latest community partnership library will open its doors today (Monday, January 25), when the county council hands over the keys to a group in Hathern. John Wigley, from Hathern Community Library, said: &#34;We’re really looking forward to the challenge and to seeing the community working on this project. Hathern has a good tradition of pulling together as a community when it needs to.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Lambeth","Sun, 24 Jan 2016 23:32:02 +0000","Lambeth – Council warned of occupations and strikes if library plans go ahead – Brixton Blog. &#34;Lambeth community groups have begun preparations for occupying libraries threatened with closure or conversion to gyms, Unison, the union representing library staff, said today (22 January). Warning Labour councillors that opposition to their plans for libraries was growing, union branch secretary Jon Rogers appealed to them to listen to members of their own party who were increasingly backing an alternative approach to making savings needed because of huge cuts in central government funding.&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Warwickshire","Sun, 24 Jan 2016 23:32:02 +0000","Warwickshire – Alcester Library moving to new home – Stratford Observer. &#34;The library will join Alcester Town Council and Roman Museum at their base at Globe House on Priory Road – the former Stratford District Council offices.&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Essex","Tue, 26 Jan 2016 22:05:07 +0000","Essex – Holocaust survivor shares his inspiring story with prisoners – Chelmsford Weekly News. &#34;An Auschwitz-Birkenau survivor has shared his inspiring story of survival with prisoners as part of a special event to mark Holocaust Memorial Day. Leslie Kleinman and his wife, Miriam Stein, visited the prison library at Her Majesty’s Prison & Youth Offender Institution Chelmsford (HMP &YOI Chelmsford) on Wednesday to speak of the atrocities he witnessed at the Nazi death camp.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Lancashire","Tue, 26 Jan 2016 22:05:07 +0000","Lancashire – Current e-petitions – Lancashire County Council. Includes twelve separate library petitions, one for the county library system as a whole and the others for individual libraries. Numbers signing range from 1 to 312.","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Lancashire","Tue, 26 Jan 2016 22:05:07 +0000","Lancashire – Villagers called to action over looming council cuts – LEP. &#34;The local Parish Council will be discussing Lancashire County Council’s proposals to axe the only bus service between villages and the possible closure of Longton Library, during it’s meeting from 7.30pm on February 2 at New Longton Village Hall.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Lincolnshire","Tue, 26 Jan 2016 22:05:07 +0000","Lincolnshire – Stop, we want to get off – Secret Librarian. &#34;The private organisation chosen by the council to operate the library service including the community hubs already heavily relies on volunteers where it operates elsewhere. It is currently attempting to turn some libraries into a healthy living centres replacing most of the book space with gym equipment. The increasing reliance on volunteers is not sustainable and will soon reach a saturation point and then rapidly fall away.&#34; … &#34;Is the library of the future a place where you surf the net whilst running on a treadmill? Well let’s please stop this headlong rush into madness now whilst we can still get off.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Wokingham","Tue, 26 Jan 2016 22:05:07 +0000","Wokingham – Wokingham Council plans to expand and protect libraries – Get Reading. Wokingham &#34;could be going against the national trend and investing more into the borough’s libraries. Councillors could be consulting on plans to protect and expand its libraries in February, if proposals are approved on Thursday, January 28. The eight week consultation would see a discussion on keeping library services in all areas open and includes some ways for them to open for longer.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Lambeth","Sun, 24 Jan 2016 23:32:02 +0000","Lambeth – Humiliating defeat for senior Cllr’s as Book-ish Gyms rejected by Constituency Labour Party – Brixton Buzz. &#34;The leadership of the Lambeth Labour group suffered its heaviest blow to the book-ish gyms plans last night when the Dulwich and West Norwood Constituency Labour Party (CLP) passed a motion condemning the plans. This represents widespread internal political opposition for the Labour Cabinet plans to gift three libraries in the borough to Greenwich Leisure Ltd so that it can convert them into gyms. The General Committee of the CLP met on Thursday evening with a motion supporting the alternative plans put forward by Susanna Barnes, the Head of Library Services in Lambeth. Only delegates are allowed to vote under Labour party rules. This still led to 16 delegates supporting the motion opposing book-ish gyms, with 8 voting against and one abstention.&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Oxfordshire","Sun, 24 Jan 2016 23:32:02 +0000","Oxfordshire – Oxfordshire County Council falls out with David Cameron again in row over £69m cuts – Oxford Times. &#34;Senior councillors have announced more savings they admit will be &#34;brutal&#34;, including scrapping mobile libraries and bus subsidies, and reducing funding for the arts, homeless, road gritting, elderly day services and support for carers. But yesterday the Prime Minister said: &#34;I understand it will be challenging for councils to make the further necessary savings but, as an Oxfordshire MP, I would urge Oxfordshire County Council to look again at its budget proposals&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Borders","Tue, 26 Jan 2016 22:05:07 +0000","Borders – National Library Day is celebrated – Southern Reporter. &#34;the council’s library services team has organised a number of free events. These include: writer and illustrator Tim Archbold holding a fun-filled session of family storytelling and drawing at Hawick; a library champion is being sought in Selkirk to have their ‘Shelfie’ taken to help spread the word by sharing their images through social media at #librariesday; and Duns Library Contact Centre has a special Therapet guest in the shape of Pip the Golden Retriever, a pet therapy dog in training to be a listener for children and adults who need encouragement with their reading.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Staffordshire","Tue, 26 Jan 2016 22:05:07 +0000","Staffordshire – Check out your library to help RSPB big Garden Bird Watch – Burton Mail.","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Stockton","Sun, 24 Jan 2016 23:32:02 +0000","Stockton – Plan for building society branch within Yarm library – Northern Echo. &#34;Part of Yarm Library will soon house a building society branch, if plans are approved by councillors. Some of the ground floor of the library will be leased by Newcastle Building Society under the proposals, aimed at making the service more viable. An extension is also planned to the side of the building to include a new toilet, entrance and ramp to fit in with disability laws.&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Dudley","Tue, 26 Jan 2016 22:05:07 +0000","Dudley – Dudley Connect to roll out at borough libraries – Dudley News. &#34;The new free, public access wi-fi will no longer require library visitors to log on using their membership card&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Lincolnshire","Tue, 26 Jan 2016 22:05:07 +0000","Lincolnshire – Maurice writes to the Secretary of State … Again – Save Lincolnshire Libraries. &#34;That our Conservative-controlled authority is provoked into launching a &#34;scathing attack on the government for its cuts to the council’s budget over upcoming years&#34; is unprecedented, but it explains why Lincolnshire proposes cutting a crucial service like public transport. I trust that you will now issue your decision on my request for intervention within 28 days, as the delay in dealing with the same leads me inexorably to the conclusion that your officials are trying to create a fait accompli because they ignore residents’ stated preference to continue to be able to access a public library as specified within the Public Libraries and Museums Act 1964.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Telford and Wrekin","Sun, 24 Jan 2016 23:32:02 +0000","Telford and Wrekin – MP Mark Pritchard calls for Commons debate over ‘heartless’ Telford library cuts – Shropshire Star. &#34;Is the Leader of the House aware of the heartless cuts to local library services by Labour-led Telford & Wrekin Council, and may we have a debate on the vital role that library services play in communities such as Donnington, Hadley and Newport in my constituency?&#34; At the start of the year it was revealed that libraries, markets and community centres face the chop as Telford & Wrekin Council plans to make £30 million of cuts.&#34;","2016/01/tangible-benefits-the-scl-defends-its-record.html"],["Lambeth","Tue, 26 Jan 2016 22:05:07 +0000","Lambeth – Save Lambeth Libraries Lobby of Lambeth Council, 7pm 27th Jan – Brixton Buzz. &#34;Campaigners will be at the full council meeting at Elm Green School in Tulse Hill from 7pm, and are expected to loudly lobby councillors as they fight to defend the future of Lambeth’s libraries. As they say on their Facebook page: &#34;If we do win we will have secured 10 libraries for the future generations of Lambeth citizens – quite a prize&#34;&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Nottinghamshire","Tue, 26 Jan 2016 22:05:07 +0000","Nottinghamshire – Pop-up theatre coming to Retford Library – Retford Times. &#34;Pop-Up Flashback will be performed in seven libraries in February during half term – the latest show in the county council’s Children’s Pop-Up Theatre project in partnership with The Spark Arts for Children. Performances will be supported by a number of poetry making workshops.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Berkshire","Tue, 26 Jan 2016 22:05:07 +0000","Berkshire – Welcome to Berkshire Education Library Service  – Berkshire Education Library Service. &#34;We are very sorry to have to announce that the decision has been made to close the Education Library Service and that the service is due to close on 31st March 2017. At this point there is considerable uncertainty about arrangements for the future. It is possible that the date for closure may be brought forward. In addition the five local authorities have yet to confirm their plans for library books and other resources currently on loan to schools. The website will be updated as soon as we have any further information. In the interim we would like to assure you that Education Library Service staff are committed to continuing to support schools until the service does close and will work with schools to plan for the long term future of their school libraries. ELS events and training courses will continue to run as normal. On behalf of everyone at ELS we would like to thank you for your continued support of the service.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Lincolnshire","Tue, 26 Jan 2016 22:05:07 +0000","Lincolnshire – &#34;This devastating report exposes the disgraceful con-trick&#34; – Save Lincolnshire Libraries. &#34;A damning report out today (Monday) reveals how Lincolnshire Conservatives were secretly planning to slash library opening hours – at the same time as making county-wide election promises to &#34;improve library opening hours&#34;. The official internal audit report shows that they put off public consultation on their draconian plan to close 30 libraries until after the County Council elections in May 2013.&#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["West Berkshire","Tue, 26 Jan 2016 22:05:07 +0000","West Berkshire – Council tax increase and cuts to buses and libraries on the cards – Newbury Today. &#34;Bus services and libraries are also among the latest public services to face the axe, it was confirmed today&#34; … &#34;It is now holding a second public consultation on the latest round of cuts before setting its budget in March. The budget consultation will begin on Monday February 15 and close on Monday March 7. Details of the proposals will be published at the beginning of the consultation and will be found at: www.westberks.gov.uk/budgetconsultation.  &#34;","2016/01/huge-response-to-scl-statement-at-least-we-all-care-about-libraries.html"],["Bradford","Sun, 31 Jan 2016 20:16:48 +0000","Bradford – Mixed response for council’s &#34;vastly improved&#34; offer to save Silsden library from closure – Keighley News. &#34;If full council votes on February 25 to just keep seven major libraries under its control and lose the rest, intense negotiations will begin with people keen to start Community Managed Libraries. &#34;","2016/01/speaking-up-for-libraries-2016.html"],["Lancashire","Sun, 31 Jan 2016 20:16:48 +0000","Lancashire – Chorley campaigners to stage Coppull Library protest – BBC. &#34;A comedian, an actress and an MP are among more than 100 people expected to join a fancy dress protest to protect a library from closure. The sit-in demonstration is being held at Coppull Library in Chorley, Lancashire. Lancashire County Council plans to reduce the number of libraries from 74 to 34, saving £7m.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Lincolnshire","Sun, 31 Jan 2016 20:16:48 +0000","Lincolnshire – Lincolnshire County Council hit by £1m malware demand – BBC. &#34;Lincolnshire County Council’s computer systems have been closed for four days after being hit by computer malware demanding a £1m ransom. Ransomware encrypts data on infected machines and only unscrambles it if victims pay a fee. The authority said it was working with its computer security provider to apply a fix to its systems.&#34; … &#34;This meant some services were affected, including libraries and online booking systems. Mrs Hetherington-Smith said: &#34;People can only use pens and paper, we’ve gone back a few years.&#34; see also Cyber hack cripples libraries and bus services for fourth day running – Lincolnshire Echo. &#34;Library staff across the county have resorted to stamping books in an out the old way while computers for public use have been out of action.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Norfolk","Sun, 31 Jan 2016 20:16:48 +0000","Norfolk – Norfolk fire stations and museums could be spared from axe – but only if council tax rises – Eastern Daily Press. &#34;The future of vital community services including fire stations and libraries in Norfolk could be saved from the chopping block – but only if council tax goes up.&#34; … &#34;County councillors have unanimously voted to remove £845,000 worth of cuts from their recommendations after a public outcry. The savings could instead be made by raising council tax by 0.27pc&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Staffordshire","Sun, 31 Jan 2016 20:16:48 +0000","Staffordshire – Boost your CV by volunteering at library – Staffordshire Newsletter. &#34;The new roles are available in all Staffordshire libraries. In return for helping for a minimum of just two hours a week, volunteers will have the opportunity to meet new people and learn new skills whilst helping the community to get the most out of their library. Volunteers already play an important role in Staffordshire’s 43 libraries – helping and advising customers, organising books and resources and helping out with reading groups, Bounce and Rhyme sessions for children, ‘Knit and Natter’ groups and job search activities. A team of volunteer IT Buddies also play a vital role in most libraries showing people how to access the latest technology, computers and the Internet.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Bristol","Sun, 31 Jan 2016 20:16:48 +0000","Bristol – Speak Up For Libraries 2016 – Interviews with public library users.","2016/01/speaking-up-for-libraries-2016.html"],["Derbyshire","Sun, 31 Jan 2016 20:16:48 +0000","Derbyshire – To save libraries they must offer more – Derby Telegraph comment – Derby Telegraph. &#34;Both Labour and the previous Conservative administration were keen to ensure libraries became &#34;community hubs&#34; offering much more than just books to borrow. The current administration, for example, has made some of them food bank collection points. They argue that such moves increase the libraries’ value to the community and that’s surely the case. But, if cuts to council budgets continue at their current rate for much longer, there will be arguably more vital services than book lending and access to computers that feel the pinch.&#34; … &#34;Could there be some way to base activities that would have been in the county’s 32 under-threat-children’s centres in libraries? Might there be scope to have post offices in them?&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Gwynedd","Sun, 31 Jan 2016 20:16:48 +0000","Gwynedd – Gwynedd Challenge – Gwynedd Council. &#34;24.1% of all respondents to the survey wanted to &#34;Protect the whole service&#34; and &#34;The options in the questionnaire that organisations or businesses were most eager to protect were Public Footpaths (Env13), Recycling Centres (Env22), Beaches (Econ9) and Libraries (Various13)&#34;.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Herefordshire","Sun, 31 Jan 2016 20:16:48 +0000","Herefordshire – Co-ordinated defence of Herefordshire’s libraries – Hereford Times. &#34;action group has been formed to protect library services in Herefordshire. Joint Action for Herefordshire Libraries (JAHL) is an independent group with members drawn from all the county library groups.&#34; … &#34;The separate town and city groups realised they needed co-ordinated action and set up JAHL, chaired by Elinor Kelly, the former chairman of Ross Library Development Group&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Lambeth","Sun, 31 Jan 2016 20:16:48 +0000","Lambeth – Kate Hoey MP asks for Book-ish Gyms re-think as Lambeth Council formally recognises two threatened libraries as Assets of Community Value – Brixton Buzz. &#34;Lambeth Council has formally recognised that the Carnegie and Tate South Lambeth libraries are both assets of community value – despite Cllr Jane Edbrooke pushing ahead with an amendment to a Full Council motion tonight that supports the gifting of the assets to Greenwich Leisure Ltd (GLL).&#34; … &#34;This now means that should Lambeth Council want to sell either of the buildings over the next five years, the Friends groups would be able to trigger a six month moratorium period, allowing them first refusal to buy the buildings at market rate. This is a move that has been set up to safeguard against the possibility of GLL turning aggressive and making a direct move to buy the public buildings off the Council – should the bonkers book-ish gyms ever be able to produce a long-term business plan.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Northern Ireland","Sun, 31 Jan 2016 20:16:48 +0000","Northern Ireland – Northern Ireland study suggests many poorer children starting school struggle with language – BBC. &#34;Save the Children – which is part of the coalition alongside organisations like Libraries NI, Parenting NI and Early Years – published the research.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Bristol","Sun, 31 Jan 2016 20:16:48 +0000","Bristol – Library staff furious about written exam ‘selection process’ – Bristol Cable. &#34;A new requirement for all Bristol library assistants to undergo formal written exams as part of a ‘selection process’ for their own jobs has left staff angry and offended, according to emails leaked to the Cable. Library management have not clarified exactly how performance in these exams will inform whether library assistants are to keep their jobs, be ‘redeployed’ or dismissed.&#34; … &#34;The written examinations will be held in early February and will involve timed aptitude tests and exam questions based on work-related scenarios. Staff, some of whom have worked at the library for 20 years, say the exams bear no relation to their day-to-day work and will be discriminatory to those who have difficulty essay-writing or speak English as a second language. &#34;","2016/01/speaking-up-for-libraries-2016.html"],["Manchester","Sun, 31 Jan 2016 20:16:48 +0000","Manchester – Reading Hack Manchester Libraries – Video – Mako Education. &#34;Recently, we were invited to work with Manchester Libraries on the launch of their Reading Hack program, where we ran a series of quick fire multimedia workshops, including green screen video, stop motion animation, E-Book Creation and digital music making. These workshops were specifically targeted for young people who regularly access Libraries across Manchester.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Somerset","Sun, 31 Jan 2016 20:16:48 +0000","Somerset – The Gruffalo helps Frome families celebrate National Libraries Day – Frome Standard. &#34;Libraries across Somerset will be running a simultaneous story time for children at 11am on National Libraries Day – reading aloud The Gruffalo by Julia Donaldson at the same time.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Warwickshire","Sun, 31 Jan 2016 20:16:48 +0000","Warwickshire – £50,000 investment for Warwickshire’s creative reading festivals – Arts Council England. &#34;Over the next two years the money will support two Fantastic Fun with Words festivals for children, young people and their families. The events will take place in spring 2016 and 2017. Over 100 creative events and activities will be happening at the county’s 19 libraries, including North Warwickshire, Nuneaton and Bedworth.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Buckinghamshire","Sun, 31 Jan 2016 20:16:48 +0000","Buckinghamshire – Letters round-up: Libraries as important to society as spleen to the body – Bucks Herald. &#34;I wonder which planet Mr Ripley is living on? In his letter last week he said that libraries are trivial, but only a trivial mind could think that. There is nothing trivial about libraries. The fiction departments may not be important but the non-fiction departments are a vital national resource; especially where there is a separate reference library as in Aylesbury. Libraries are an essential part of the nation’s education system.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Lincolnshire","Sun, 31 Jan 2016 20:16:48 +0000","Lincolnshire – Market Deeping’s volunteer-run library opens – BBC. &#34;Deeping Library in High Street, Market Deeping, was saved from closure after Lincolnshire County Council withdrew funding. It is to have one paid librarian along with a team of volunteers working on rota. Andrew Bowell, from Friends of Deeping Library, said the &#34;entire community got behind the campaign&#34;. The library is expected to open for three days a week at first, but the group hopes to extend that to six, said Mr Bowell.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Cambridgeshire","Sun, 31 Jan 2016 20:16:48 +0000","Cambridgeshire – Ely Library could close on Sundays to help county council save money – Ely News. &#34;city’s library, based in the Cloisters, is currently open from 12-4pm on Sundays but Cambridgeshire County Council is proposing to close the branch that day. The closure is being considered as part of the authority’s plans to save money and a public consultation is now underway..&#34;","2016/01/speaking-up-for-libraries-2016.html"],["East Sussex","Sun, 31 Jan 2016 20:16:48 +0000","East Sussex – Refurbishment timetable on Hastings library revealed – Hastings Observer. &#34;East Sussex County Council is embarking upon a complete revamp of the building, in Claremont, which will also see the children’s library move from its current base in nearby Robertson Passage.&#34; … &#34;The work will see a complete refurbishment of the library, which will create a welcoming environment with around 80sqm more public space than at present, while visitors will find a variety of online resources, books and newspapers.&#34;\nFife – School library cuts will deepen rich-poor divide, claims EIS – Courier. &#34;Children face a postcode lottery for access to school library services amid the slashing of council budgets, say campaigners. Cost-cutting measures like getting rid of professional librarians, which some Fife headteachers have done, is central to the decline of school libraries and is undermining the fight for equal opportunities, according to the Literature Alliance. Teachers, authors, librarians and unions have thrown their w&#8230;","2016/01/speaking-up-for-libraries-2016.html"],["Northern Ireland","Sun, 31 Jan 2016 20:16:48 +0000","Northern Ireland – National Libraries Day is fun for all – Larne Times. &#34;National Libraries Day is on February 6 and Libraries NI is inviting the public to call into any library from Monday February 1 until Saturday February 6 to get involved. Visitors can get their photo taken as part of the ‘What does your library mean to you?’ social media photograph campaign. Younger visitors can enjoy specially-themed National Libraries Day events for children. Ask in your local library or visit www.librariesni.org.uk.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Cardiff","Sun, 31 Jan 2016 20:16:48 +0000","Cardiff – Cardiff council receives five bids to take over closed Roath Library – Wales Online. &#34;Roath Library has been closed for 15 months after a building repair bill built up &#34; … &#34;Cabinet member Peter Bradbury told councillors that discussions will take place about the requirements from the council in terms of the communal and library space and they will need to see business plans about the financing and deliverability of the proposal.&#34; … &#34;in the meantime, a temporary lease is being agreed to deliver a temporary library and PCs from Cardiff Royal Infirmary. Books and Story and Rhyme Time classes are now available at Plasnewydd Community Centre.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Derbyshire","Sun, 31 Jan 2016 20:16:48 +0000","Derbyshire – Libraries face closure as Derbyshire County Council looks to save money – Derby Telegraph. &#34;councillor Dave Allen, who is responsible for the county’s 45 libraries, says closures will be looked at and, if they go ahead, they will most likely happen in the financial year starting on April 1, 2017.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Gloucestershire","Sun, 31 Jan 2016 20:16:48 +0000","Gloucestershire – Gloucester Libraries set for Harry Potter night – Gloucester Citizen.","2016/01/speaking-up-for-libraries-2016.html"],["Hertfordshire","Sun, 31 Jan 2016 20:16:48 +0000","Hertfordshire – Business plan to save Buntingford Library unveiled – Hertfordshire Mercury. &#34;Underfloor heating and LED lighting are among the details of a business plan that could be Buntingford Library’s best chance of survival.&#34; … &#34;After several petitions and meetings, the groups were told in November to produce the business plan. One of Buntingford In Transition’s founders, David Woollcombe, sees no reasons why it should be dismissed, but will refuse to accept defeat if it is. &#34;We are going to have a library on our high street, come hell or high water,&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Kirklees","Sun, 31 Jan 2016 20:16:48 +0000","Kirklees – Kirklees Council says protests at library and grass cutting cost taxpayers a fortune – Huddersfield Daily Examiner. &#34;Protests over Kirklees Council cuts have ended up costing taxpayers almost half-a-million pounds. Opposition from Conservative and Liberal Democrat groups to Labour’s plans to slash grass cutting and libraries left the council £480,000 worse off. The council revealed campaigns to protect services had ironically cost a fortune through the delayed implementation of the savings. But Kirklees Tory chief, Clr Robert Light, hit back and said the &#34;incompetent Cabinet&#34; was liable for the wasted cash. Lib Dem leader, Clr Nicola Turner, said councillors &#34;might as well go home&#34; if they could not fight decisions they thought were wrong.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Lancashire","Sun, 31 Jan 2016 20:16:48 +0000","Lancashire – Campaign launched to save under-threat library – LEP. &#34;Kingsfold library is a hub for the community for all Penwortham people and is in the centre of the shopping area in Kingsfold supported by good parking facilities. &#34;It’s also an important place for disabled people who come and use the computers there to access their Blue Badges and get help from the staff. Many other sessions run there too including courses to research your family tree.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Staffordshire","Sun, 31 Jan 2016 20:16:48 +0000","Staffordshire – Area prepares for biggest bird watch in the UK – Burton Mail. &#34;Staffordshire’s libraries are also getting involved to help the RSPB’s researchers this year. They are offering their help to any residents who would like to take part in the garden bird count. Staffordshire’s library chief is reminding residents that the county’s libraries are stocked with generous collections of books on Britain’s flora and fauna that can be a real help with identification.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Staffordshire","Sun, 31 Jan 2016 20:16:48 +0000","Staffordshire – Ghostly image caught on camera at library fundraiser – Sott.net. &#34;The campaigners have been trying to get £650,000 to buy the building at The Green and have managed to get it listed by English Heritage. But they have to hand the keys back on February 6 when the lease runs out and the site goes up for auction at the end of that month. Members are hoping a buyer will fail to come forward as the amount of work that needs doing to bring it up to scratch could run into hundreds of thousands. This would give campaigners more time to apply for cash from the Heritage Lottery Fund and Architectural Heritage Fund to buy it.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Lincolnshire","Sun, 31 Jan 2016 20:16:48 +0000","Lincolnshire – Out of the frying pan and into the fire? – Secret Librarian. &#34;Apparently according to the management speak there has been a high level of energy and enthusiasm on both sides, with everyone feeling positive about the future of the service. The contract is expected to be signed in the near future and, resulting in the organisation’s presence beginning to increase noticeably.&#34; … &#34;This organisation is inheriting a demoralised staff who just want some guarantees that there may be an improvement to working hours and job security without being patronised with targets and ‘corporate cultures’. Will they be just as draconian at not allowing staff to speak out against them if they are unhappy? Maybe it could be a new beginning but social enterprise companies taking over is privatisation in all but name and you only have to look elsewhere at prison services and security firms to see how well that has worked.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Neath Port Talbot","Sun, 31 Jan 2016 20:16:48 +0000","Neath Port Talbot – Much-loved museum and two community libraries spared closure – South Wales Evening Post. &#34;The authority said it had listened to public concerns about the proposed closures of Cefn Coed Colliery Museum, in Crynant, and Skewen and Baglan Libraries, and opted to keep them open. Skewen and Baglan libraries, along with the mobile library service, were facing closure in a bid to save £80,000, while the authority was proposing to withdraw the subsidy for the museum in a bid to save £60,000 between 2016 to 2018.&#34; … &#34;Mr Jenkins said the authority was still having talks with the communities, but neither the museum nor the libraries would close.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Perth and Kinross","Sun, 31 Jan 2016 20:16:48 +0000","Perth and Kinross – A new organisation – Culture Perth and Kinross – is to take over the running of council libraries, museums, galleries and arts development – Daily Record. &#34;From April 1 a third organisation – Culture Perth and Kinross – will take over the running of council libraries, museums, galleries and arts development.&#34; … &#34;It will take its place alongside bodies such as Live Active Leisure and Horsecross Arts which provide services on behalf of the council – and these too will be called on to play an increase part in leisure and recreation. All council-funded sports and recreational services will be delivered by Live Active Leisure.&#34;","2016/01/speaking-up-for-libraries-2016.html"],["Somerset","Sun, 31 Jan 2016 20:16:48 +0000","Somerset – In My View: Libraries should stay in Somerset’s town centres – Western Gazette. &#34;Moving it completely out of the town would basically be its death knell. It is too far for many older residents to walk and so people will just stop going which would then be an excuse for the authorities to shut it down. Libraries need to be in the centre of the town as they are an important community facility&#34;","2016/01/speaking-up-for-libraries-2016.html"],["West Sussex","Sun, 31 Jan 2016 20:16:48 +0000","West Sussex – Talk and tea in Shoreham marks National Libraries Day – Shoreham Herald. &#34;Award-winning author and historian Nicola Cornick will be discussing her latest novel at Shoreham Library next weekend. The special event on Saturday, February 6, at 2.30pm has been organised to celebrate National Libraries Day.&#34;","2016/01/speaking-up-for-libraries-2016.html"]]