[["Barnet","Sun, 02 Aug 2015 21:16:41 +0000","Barnet – Libraries consultation &#34;a wake up call&#34; as readers reject council plans - Barnet and Whetstone Press. &#34;The council said there was an unprecedented number of replies to its four month consultation as people gave their views on plans which range from reducing the number of libraries to using more volunteers. It has just published the 249 page report by Swansea based Opinion Research Services on Friday afternoon.&#34; … &#34;The report said there was little support for closing six libraries and only limited backing for reducing the size of the libraries, unstaffed opening or using automated libraries to replace staff.&#34; … &#34;A children’s march on libraries is planned on Saturday September 12 from Church End to North Finchley in advance of the committee meeting.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Brent","Sun, 02 Aug 2015 21:16:41 +0000","Brent – Inside the New Willesden Library Centre - James Powney’s Blog. Pictures of the new library.","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Buckinghamshire","Sun, 02 Aug 2015 21:16:41 +0000","Buckinghamshire – Library opening hours slashed to make £270k saving - Buckingham Today. &#34;Library-goers will have less time to enjoy their favourite books after plans to cut library hours were pushed through – despite 65 per cent of people not supporting the move.&#34; … &#34;the opening hour reductions were based on ‘reducing opening hours at periods of lowest usage’, and ‘complimentary patterns for libraries that are close to one another’.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Liverpool","Sun, 02 Aug 2015 21:16:41 +0000","Liverpool – Five Liverpool libraries to be handed over to volunteers and community groups – Liverpool Echo. &#34;The council is also to announce that Jan Parry, president of the Chartered Institute of Library Information Professionals (CILIP) will chair a task group to look at the future of the city’s library service. The libraries due to be transferred to new management will be Breck Road, Dovecot, Fazakerley, Kensington and Walton. Discussions are still underway over the future management of Sefton Park and West Derby libraries.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Nottinghamshire","Sun, 02 Aug 2015 21:16:41 +0000","Nottinghamshire – Save our libraries – plea to Notts council – Hucknall Dispatch. &#34;Coun John Wilmott, of the Hucknall First Community Forum, challenged the chair of the culture committee to agree that ‘it is essential that we keep open all the libraries as a basic necessity for all our residents’. &#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Swansea","Sun, 02 Aug 2015 21:16:41 +0000","Swansea – Swansea nightclub site could become new council building – BBC. &#34;The site which used to house Swansea’s biggest nightclub could become the new home for Swansea council and library. The former Oceana nightclub building will be demolished in October and replaced with a new office block.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Birmingham","Sun, 02 Aug 2015 21:16:41 +0000","Birmingham – Google scheme saves Birmingham Library from restricting opening hours over budget cuts - Independent. &#34;When Birmingham’s multimillion-pound new library announced it was being forced to slash its opening hours due to budget cuts less than two years after opening, the humiliation looked like it might turn the architectural landmark into an expensive white elephant. But soon the city’s residents will once more be able to access the building far more often thanks to Google and a local language classes scheme. The internet giant has backed a pop-up &#34;Digital Garages&#34; business programme – which nurtures digital talent – and which will move into the Library of Birmingham, in conjunction with the city’s Brasshouse Language Service.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Birmingham","Sun, 02 Aug 2015 21:16:41 +0000","Birmingham – Why Birmingham library needs Google and language classes to keep doors open - Guardian. &#34;Here at Birmingham city council, we’re wrestling with how to maintain essential services while taking £850m out of our annual budget, and cutting our workforce by about two-thirds. In that context, any argument that starts from the premise that things should stay the same is never going to stack up, no matter how much we might wish it could&#34; … &#34;Local government isn’t going to get any easier over the next few years, and local politicians have no choice but to rise to the transformation challenge. If we want to hang onto the services we all value, things are going to have to change.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Croydon","Sun, 02 Aug 2015 21:16:41 +0000","Croydon – Union concerned about ‘unclear’ plans to restructure Croydon library staff – Croydon Advertiser. &#34;Unison branch secretary Laurie Pocock said meetings with staff about the changes are against the union’s advice because he believes Carillion managers &#34;are unclear as to what the company’s proposals are&#34;. … &#34;There is the equivalent to 74.36 full time jobs in Croydon libraries but Carillion will not say which job title are at risk at this stage&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["East Sussex","Sun, 02 Aug 2015 21:16:41 +0000","East Sussex – Thousands pour through the door at new library site - Sussex Express. &#34;More than 13,000 people have crossed the threshold of Newhaven’s new library since it opened earlier this year. With the library fast becoming a popular community hub, the county council’s lead member for community services, Cllr Chris Dowling, visited the facility this week to perform the official opening.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Lincolnshire","Sun, 02 Aug 2015 21:16:41 +0000","Lincolnshire – County council defeats second High Court challenge to plans for libraries - Local Government Advertiser. &#34;The claimant, backed by the Save Lincolnshire Libraries Group, argued that the revised plans – approved by the council’s executive in February this year – were fundamentally no different to a plan decided upon in December 2013. The first decision was quashed by the High Court because of flaws in decision making and consultation. Mrs Justice McGowan heard the latest proceedings in the High Court last week (21 July). The county council reported today [28 July] that the judge had ruled that its decision was taken in a lawful manner.&#34;  see also  Lincolnshire County Council wins second library court battle – BBC and Lincolnshire library cuts challenge dismissed, and one Lincoln facility to close - Lincolnite.","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Cambridgeshire","Sun, 02 Aug 2015 21:16:41 +0000","Cambridgeshire – Milton Road Library to become a ‘community hub’ with flats on top - Cambridge News. &#34;A Cambridge library faces being torn down and rebuilt as a new community hub with flats on top. The Milton Road library in Ascham Road will be subject to a completely fresh approach as one of the county council’s fledgling ‘community hub’ libraries. A scheme is well developed that would have the building replaced with a three-storey facility including nine flats on its top floor.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Lincolnshire","Sun, 02 Aug 2015 21:16:41 +0000","Lincolnshire – ‘County Council has squirreled away £17m of your money – but won’t put penny into libraries’ - Lincolnshire Echo. &#34;Days earlier [than the judicial review hearing], the council’s Tory-LibDem executive met to decide what to do with a surplus £17 million which it demanded from local council taxpayers last year, but failed to spend on services. A tenth of this cash bonus would keep libraries running for another year, and leave more than £15 million to invest in vital services. Instead, the executive chose to squirrel away the £17 million by putting it in &#34;reserves&#34;.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Cambridgeshire","Sun, 02 Aug 2015 21:16:41 +0000","Cambridgeshire – Review planned over Cambridge Central Library enterprise centre – but no independent inquiry – Cambridge News. &#34;A probe into failed plans for an enterprise centre at Cambridge Central Library will be carried out in-house despite calls for an independent inquiry.&#34; … &#34;&#34;The CLEC proposals brought out a level of public opposition that is unprecedented in all my years involved with the libraries,&#34; said Cllr Barbara Ashwood. &#34;We need to be seen to investigate what happened there very, very thoroughly. It also needs to be seen to be impartial and that can only happen if the review is carried out by an independent body.&#34; … &#34;But council leader Cllr Steve Count called it &#34;a bizarre amendment&#34; by the Lib Dems. &#34;This is about who to blame from the officers and who to blame democratic society,&#34; he said. &#34;That’s not about learning from your mistakes and going forward – that is very much about a blame culture.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Leeds","Sun, 02 Aug 2015 21:16:41 +0000","Leeds – New chapter in campaign by libraries – Morley Observer. &#34;A total of 36 learning hubs across Leeds – including Morley Library – hope the #Whatsyourstory campaign will get more people using their free services and workshops.&#34; … &#34;The campaign is also urging people to come forward if library services have helped change their life. Ms Rice said inspirational case studies helped raise awareness of the work libraries do and the services that they run.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Leicestershire","Sun, 02 Aug 2015 21:16:41 +0000","Leicestershire – First Leicestershire volunteer-run library opens – BBC. &#34;The authority said 27 libraries would follow Barrow-upon-Soar’s lead in a move that will save £800,000. It said it was waiting on registrations of interest to run the remaining nine. The plan to hand over the libraries to volunteers is part of efforts to cut £86m from the council’s budget by 2019.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Devon","Tue, 04 Aug 2015 19:51:52 +0000","Devon – Julie Dent talks about Devon’s Library Service - Youtube. &#34;An exciting new era is on the horizon for Devon Libraries, with plans to set up a new independent organisation to run the service. Work is underway to establish a staff and community owned ‘mutual’ which would be commissioned by Devon County Council to run libraries on their behalf from April 2016.&#34;","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Camden","Sun, 02 Aug 2015 21:16:41 +0000","Camden – West Hampstead Library ‘could move to controversial housing development’ -Ham and High. &#34;Several members of the community have backed the idea of the library moving from its current home in West End Lane further down the road to the site of Travis Perkins building merchants, where a developer plans to build 200 homes. The idea was put forward at a bustling public meeting on Tuesday, where residents and councillors discussed the £800,000 worth of cuts that Camden Council is making to the libraries service. It was mooted as an alternative cost-saving measure to the closure of the library, which this financial year will cost the council £216,759 to run.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Fife","Sun, 02 Aug 2015 21:16:41 +0000","Fife – Kinghorn steps up campaign against Cultural Trust plans to axe library – Fife Today. &#34;Residents in Kinghorn have issued a resounding &#34;no&#34; to proposals to close the town’s library following a busy public meeting last week. Kinghorn Community Council hosted the meeting in the church halls last Thursday to discuss the threatened facility, and it soon became clear that the unanimous message was that everyone was totally opposed to any closure or erosion of the current services provided through Fife Cultural Trust&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Merton","Sun, 02 Aug 2015 21:16:41 +0000","Merton – Work underway on £1.2m new library ahead of open day - Your Local Guardian. Donald Hope Library: &#34;Work has started on a £1.2m library face-lift leaving book lovers to contend with a much smaller temporary library for the next two years. The new six-storey development was initially met with objections from some residents due to the building’s height but, after approval from Merton Council in March, the building project is now underway.&#34; … &#34;A temporary facility about a quarter of the size of Donald Hope library in Colliers Wood will be available with a range of services for library users. &#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Stockton","Sun, 02 Aug 2015 21:16:41 +0000","Stockton – Official opening for £2.7m library in Billingham – Northern Echo. &#34;A new library and customer information centre held its official opening today (Thursday, July 30) following a £2.7 million refurbishment. The combined facility sits on the site of the former Art Gallery and council offices in Billingham and was opened by the chairman of Arts Council England, Sir Peter Bazalgette and Stockton Borough Council leader, Cllr Bob Cook.&#34; … &#34;The building brings together new and improved library services plus customer services for Stockton Borough Council and Thirteen Housing Group, a cash office and Billingham Town Centre Headquarters.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Herefordshire","Tue, 04 Aug 2015 19:51:52 +0000","Herefordshire – Critics warn county library service will &#34;cease to exist&#34; under new council cuts plan — Hereford Times. &#34;All but one of the county’s main libraries are now marked for closure or &#34;self service&#34; under Herefordshire Council’s latest cost saving proposals. Community libraries would be expected to find their own funding for administration and support services. The plan goes further than savings proposed for libraries in 2013. Critics have already warned that the county’s library service would &#34;cease to exist&#34; if the latest plan went ahead.&#34;","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Croydon","Sun, 02 Aug 2015 21:16:41 +0000","Croydon – More redundancies announced at Croydon’s libraries – Your Local Guardian. &#34;Carillion, which runs 13 of the borough’s 14 libraries, announced further cuts this month after making 11 redundancies early last year. &#34; … &#34;Croydon library staff received notices earlier this month informing them the equivalent of 2.5 full-time posts were to go as part of a restructure. &#34;. Campaigner Elizabeth Ash says &#34;&#34;I do not know how the staff keep delivering what they are delivering with so little support. The stock is being run down, people say they can’t get anything, they have cut the DVDs, and there are just no staff anywhere.&#34; &#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Herefordshire","Sun, 02 Aug 2015 21:16:41 +0000","Herefordshire – &#34;Community hub&#34; dream fades for the Master’s House? – Ledbury Reporter. &#34;Cracks are already appearing in the role of the Master’s House as a community hub for Ledbury, with the town’s new library facing possible closure and a local charity serving notice it is moving out. &#34; … &#34;In the case of Ledbury Library, its survival could come down to volunteers. &#34; … &#34;Ledbury people can have their say at consultation days on August 4 and September 22, in the High Street. Former Ledbury mayor, Cllr Bob Barnes said: &#34;Ledbury has always been good at volunteering; but is it sustainable? &#34;If volunteering is taking up 50 per cent of your own time, you might start to question it.&#34;&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Lincolnshire","Sun, 02 Aug 2015 21:16:41 +0000","Lincolnshire – Is privatisation the key to saving Lincolnshire’s libraries? – Lincolnite. &#34;Can you picture a state-of-the-art building full of books, magazines and periodicals of all sizes, with free wifi zones? How about the provision of eReaders for users who prefer to hold something electronic in their hands? Conference rooms, lecture rooms, presentation suites, private venues for hire, cafés – maybe even a bar? Dare we suggest a bookstore too? Moreover, we could encourage noise – as much as you want – offset by the provision of dedicated quiet zones for those who still crave abject silence.&#34; … &#34;It is not beyond the wit of man to maintain the status quo on the provision of free library services; complemented and secured by the provision of enhanced fee-paying services to encourage investment.&#34; Several useful comments.","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Herefordshire","Sun, 02 Aug 2015 21:16:41 +0000","Herefordshire – Income and savings proposals  – Herefordshire Council. &#34;It is proposed to keep Hereford Library and The Hereford Centre (customer services), as they are the most used facilities, whilst the centres covering both customer services and libraries in Belmont (Hereford), Leominster and Ross-on-Wye would be withdrawn, along with access to public computers. Customer services in Bromyard, Kington and Ledbury would also be withdrawn but a self-service library facility would remain at these locations, as the buildings are also used by other organisations.The library delivery service for house bound residents would be retained whilst the school library service would also continue but become self-financing. The back office support for community libraries would need to be funded by the community.\nKirklees – Councillors debate threat to libraries in Kirklees - Examiner. &#34;Councillors have debated how to slash £1.85m from Kirklees’ libraries budget. The long running threat to libraries has been looming since government cuts be&#8230;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Herefordshire","Tue, 04 Aug 2015 19:51:52 +0000","Herefordshire – Herefordshire libraries would ‘cease to exist’ under new proposals – BookSeller. &#34;John Hitchin, secretary to Hereford Library Users Group (HLUG), told the newspaper that the plan meant the county’s library service would &#34; virtually cease to exist&#34;. &#34;Expect a reduction in stock purchases and the provision of expert staff,&#34; he said. Under the proposals, the library delivery service for house bound residents would be retained, but the school library service is expected to become self-funding.&#34;","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Kirklees","Sun, 02 Aug 2015 21:16:41 +0000","Kirklees – Friends group aims to save town’s library – Mirfield Reporter. &#34;A bid to safeguard the future of Batley’s central library is to be made next week when a meeting will be held with the aim of forming a friends of the library group. It follows the presentation of a petition containing more than 11,000 signatures urging Kirklees Council to safeguard the library for the thousands of people who use it in many ways during the year.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Knowsley","Tue, 04 Aug 2015 19:51:52 +0000","Knowsley – Knowsley library cutbacks: council cannot afford &#34;same level of service&#34; as opening hours cut - Liverpool Echo. &#34;The council announced all five Knowsley libraries will no longer open on Wednesdays in a statement online this morning. It said every library will also open an hour later from Monday to Friday, with the changes starting from Monday, August 24. The move means most libraries will see their opening hours cut by 12 hours week but Huyton will lose 15 hours a week as its 6pm closing time is pushed back to 5pm. The council also announced a new e-books system will launch in the autumn.&#34;","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Lincolnshire","Sun, 02 Aug 2015 21:16:41 +0000","Lincolnshire – Council leader Martin Hill launches scathing attack on Save Lincolnshire Libraries campaigners - Lincolnshire Echo. &#34;In an open letter, he said: &#34;I am very pleased to hear the good news that the county council’s decision to modernise the library service, encourage volunteering and save money has been vindicated in the High Court. &#34;The unnecessary and politically-inspired legal challenge has been dismissed on all grounds. &#34;What is disappointing is that over £350k of taxpayers’ money has been wasted, voluntary groups frustrated and at least one library lost as a result of this action. &#34;The only obstacle has been the ironically-named Save Lincolnshire Libraries group and the Labour Party – not that anyone can tell the difference between the two. &#34;Their actions have been a costly political exercise in making matters worse for library users, volunteers and staff.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Surrey","Sun, 02 Aug 2015 21:16:41 +0000","Surrey – Cobham Library reopens as part of new ‘community hub’ - Dorking and Leatherhead Advertiser. &#34;The county council will operate the library but lease the rest of the building to Cobham Cedar Centre Limited, a social enterprise run &#34;by the community, for the community&#34;. Richard Walsh, cabinet member for localities and community wellbeing, said: &#34;The way people use libraries is changing, which is why it’s so important we continue to adapt and improve our library service. The social enterprise is a great example of the community pulling together to help shape local services.&#34; Among new amenities are computers, laptop plug-in points, free Wi-Fi and improved study and children’s areas.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Buckinghamshire","Tue, 04 Aug 2015 19:51:52 +0000","Buckinghamshire – Libraries Will Be Open Less Across Bucks – Mix 96. &#34;In the consultation, 65% of respondents did not support reductions in opening hours, but 74% of respondents confirmed that the revised hours would not prevent them from continuing to use the service. The changes, thanks to a loss of £270,00 in yearly funding, will only affect Council run libraries, community libraries will remain the same.&#34;","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Dorset","Tue, 04 Aug 2015 19:51:52 +0000","Dorset – Letter: a mum’s view of libraries - Blackmore Vale Magazine. Mother describes the importance of libraries to her life and says all should be able to use them. see also Letter: Deputy Mayor speaks out in defence of library activities - Blackmore Vale Magazine. Both letters in response to letter complaining about the noise of child activities disturbing the quiet reading of others.","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Herefordshire","Tue, 04 Aug 2015 19:51:52 +0000","Herefordshire – Fearless Librarian Saves The Day - BBC Radio Four. &#34;Written by Sebastian Baczkiewicz, this is the story of no ordinary librarian. Sitting behind the wheel of a clapped-out mobile library, Harry Hayman is the easy rider of Herefordshire’s remote country lanes. Whether it’s as a knight in shining armour, a getaway driver or an unlikely Casanova – Harry repeatedly finds himself having to save the day. But when his cherished job is jeopardised, can he pull out all the stops? A road trip that weaves together stories inspired by life in the Herefordshire countryside. &#34; [This is from September 2011 – Ed.]","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Kirklees","Tue, 04 Aug 2015 19:51:52 +0000","Kirklees – Book end battle – Yorkshire Evening Post. &#34;Councils across the land have looked for ways to balance their books in the wake of deep spending cuts, which in the case of Kirklees Council is expected to be in the region of 40 per cent of its annual budget by 2018. Cutting bin collections and reducing grass cutting just isn’t enough and if you close the odd library, people may complain but no one is going to die.&#34; … &#34;Relying on volunteers to run libraries might be seen as an option but Doncaster librarian Lauren Smith from campaign group Voices for the Library, says it’s not a viable long term solution. &#34;It’s very well intentioned but it’s not sustainable. Many groups feel as if they’ve been pressured into it, hoping it’s a short-term solution.&#34;&#34; see also New chapter for Yorkshire’s libraries… but who’s writing it? – Yorkshire Post.","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Lincolnshire","Tue, 04 Aug 2015 19:51:52 +0000","Lincolnshire – Last minute bid by Lincoln community group to take on Boultham library – Lincolnshire Echo. &#34;Learning Communities, an organisation which is preparing to run two library community hubs in Ermine and Birchwood, have now agreed to take on Boultham too. Councillor Nick Worth, Lincolnshire County Council‘s executive member for libraries, said: &#34;Lincolnshire Co-op was originally in place to run library services in Boultham, but, unfortunately, the hold-ups caused by the legal challenges meant they had to withdraw their offer. &#34;As a result, we approached Learning Communities, and I’m delighted to say they have agreed to work with us on this additional site.&#34;","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Liverpool","Tue, 04 Aug 2015 19:51:52 +0000","Liverpool – Five Liverpool libraries ‘ready for community groups’ – BookSeller. &#34;The five libraries – at Breck Road, Dovecot, Fazakerley, Kensington and Walton – are to be transferred to local groups to manage as part of wider cost-cutting measures instigated by the council, following a reprieve for 11 libraries threatened with outright closure last year.&#34; see also Council hand over library reins to community group – Champion.","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Barnet","Sun, 09 Aug 2015 18:14:47 +0000","Barnet – Council delivered ‘wake up call’ as survey reveals library closures strongly opposed - Times Series. &#34;Campaigners say Barnet council should go back to the drawing board as almost all library users say they oppose the potential closures. As libraries are packed with children completing a summer reading challenge, Barnet council has released its results of the recent consultation into the possibility of closing up to six libraries in the borough. More than 3,800 people submitted their opinions during the course of the survey, which cost £200,000 and ran from November 15 to February 22.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Birmingham","Sun, 09 Aug 2015 18:14:47 +0000","Birmingham – Library of Birmingham tourist information office closes  – Birmingham Post. &#34;It means tourists will no longer receive dedicated visitor advice, directions and guidance in person at the library … City bosses say tourists are increasingly using websites and social media to accesss information and there will still be general help available from staff working at the library, Birmingham Museum and Art Gallery, hotels and other attractions. The cuts are the latest to hit the library which has already reduced its opening hours and made dozens of staff redundant earlier this year – although new partnership deals announced last month will see some of those withdrawn.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Cardiff","Sun, 09 Aug 2015 18:14:47 +0000","Cardiff – CardiffCentral Library goes digi-tastic - Alyson’s Welsh Libraries Blog. &#34;There was a buzz in Cardiff city centre last Thursday (30th July 2015) with the re-opening of the revamped Cardiff Central Library. I was invited to the launch event and joined the tour which took us around the new council services advice hub and the state-of-the-art digital floor that have been developed at the library&#34; … &#34;The new digital floor has some terrific features including a tablet bar, digital wall, digital creative suite, children’s media zone and a gaming area. Oh and a 3D printer! This might be the first one in a Welsh public library – please let us know if there are others.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Plymouth","Sun, 09 Aug 2015 18:14:47 +0000","Plymouth – Plymouth library plans in after council warns itself over ‘invalid’ submission - Plymouth Herald. &#34;the Central Library is to be moved from North Hill to the heart of the city centre in a £1.4million revamp as it makes way for the history centre’s regeneration. The library will takeover Taylor Maxwell House in Armada Way, formerly a branch of the Woolwich Building Society, and the first and basement floors of Cornwall College’s building in Mayflower Street. In a letter from Plymouth City Council’s planning team, it informed colleagues behind the move that their planning application was &#34;invalid&#34; and that they were preparing to terminate the request – despite £385 having been paid in fees.&#34; … &#34;A slightly more central location is hoped to tackle the declining numbers visiting the library, with an 18 per cent drop between 2012/13 and 2013/14. Only the library element of the North Hill building will relocate to 1,076 square metres of Taylor Maxwell House – library storage, administration and the schools libra&#8230;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Stockton on Tees","Sun, 09 Aug 2015 18:14:47 +0000","Stockton on Tees – Opening a new chapter at new £2.7m library - Hartlepool Mail. &#34;Billingham’s new £2.7million Library and Customer Service centre has been officially opened. Sir Peter Bazalgette, chairman of Arts Council England, visited the town centre to perform the opening ceremony. The centre has a variety of library and customer services all under one roof, and is part of the ongoing regeneration of Billingham town centre.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Fife","Sun, 09 Aug 2015 18:14:47 +0000","Fife – 16 library closures and one close-up scrutiny… – Fife Today. &#34;Councillor Susan Leslie, who chairs the committee, said: &#34;It has been impossible to progress this as Fife Council officers have, up until now, failed to provide the required report. &#34;We are now left looking at the proposed model at the same time as proposed libraries closures.&#34;&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Harrow","Sun, 09 Aug 2015 18:14:47 +0000","Harrow – Learning is child’s play at Lego education workshops – Harrow Times. &#34;Last month, Wealdstone Library invited 10 lucky children along to the trial launch of Lego Education which is to be introduced to libraries across the borough in September. Since then, libraries across the borough have been hosting fun-filled and interactive workshops for children enjoying their summer holidays where they have learnt about design and technology using resources familiar to them.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Leicestershire","Sun, 09 Aug 2015 18:14:47 +0000","Leicestershire – Future looks bright for village library - Hinckley Times. &#34;The future of Burbage Library looks assured after more than a dozen people joined a management committee to press forward community ownership plans. It is a turnaround in fortunes for the facility which looked destined for closure as part of Leicestershire County Council’s cost-cutting plans. Last year a lengthy consultation run by the parish council on whether the Church Street library could or should be run by villagers received support but not enough, it was considered, to take proposals to the next level.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Fife","Sun, 09 Aug 2015 18:14:47 +0000","Fife – Libraries campaign steps up a gear – Fife Today. &#34;The Keep Fife’s Libraries Open Campaign’s team of community activists are offering advice and support to local communities and are planning to more events to highlight their campaign.&#34;  … &#34;The group is also starting a letter campaign, writing to community councils and elected representatives in a bid to keep pressure up on Fife Cultural Trust and Fife Council to stop the closures. The continued pressure follows a public meeting in Glenrothes this week when more than 100 people heard local, award-winning author James Robertson back the campaign.&#34; … &#34;Glenwood, Thornton, Markinch and Pitteuchar in the Glenrothes area, and Kinghorn are earmarked for closure in the current financial year, but Fife Council will provide funding to support these libraries until the consultation process has been completed and a final decision has been made on the future model. It’s proposed Crail, Lundin Links, Pittenweem, Colinsburgh, Falkland, Freuchie, East Wemyss, Bowhill and Cros&#8230;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Fife","Sun, 09 Aug 2015 18:14:47 +0000","Fife – What’s the story at the library? - Fife Today. &#34;A Levenmouth councillor is appealing for support from local people as he mounts a campaign to save the library in East Wemyss – just days before Fife Council holds a vital scrutiny meeting to discuss closure plans. Councillor John O’Brien hopes to launch a petition and possibly organise a public meeting, involving the local MP and MSP, to deflect what he described as &#34;a direct hit for the people of East Wemyss&#34;.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Knowsley","Sun, 09 Aug 2015 18:14:47 +0000","Knowsley – Knowsley library cutbacks: critics slam cuts to &#34;access to knowledge&#34; – Liverpool Echo. &#34; Labour MP Maria Eagle, whose constituency includes Halewood Library, said the cuts left Halewood in a poorer state but blamed a government &#34;bent on shrinking services&#34;. … &#34;Ian Smith, chair of Knowsley Liberal Democrats and a former longstanding Prescot councillor, said: &#34;This is a vital service for people who use it, and they will not be happy at all. It’s just another unnecessary closure – they blame the government, but they find money for their favoured projects. The priorities are all wrong.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Isle of of Wight","Sun, 09 Aug 2015 18:14:47 +0000","Isle of of Wight – Libraries key to an educated populace – Isle of Wight County Press. &#34;What will it take to make this council realise how important this library is to so many people in Ventnor? The last time drastic changes were proposed, I took a petition to every house in my neighbourhood, missing no-one, I believe, and at that time everyone except two self-confessed Conservative Party members signed to keep the library as it was: fully supported by the library service, with two paid librarians&#34; … &#34;We should be investing in our libraries to enable them to help improve adult literacy; further cuts to Ventnor Library would jeopardise the excellent work that is currently being done.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Liverpool","Sun, 09 Aug 2015 18:14:47 +0000","Liverpool – Tony Snell in the morning - BBC Radio Merseyside. Alan Gibbons (argues for the need for paid librarians and national/formal structures) and Mayor Anderson (argues for volunteer libraries and say that such deep cuts mean Alan needs to &#34;smell the coffee&#34;) talk about the cuts to Liverpool Libraries (1 hour 9 minutes in). May or Anderson says there may be no &#34;discretionary services&#34; at all in 2017 due to budget cuts and that Alan should be protesting against central government. Alan argues that Mayor Anderson should not &#34;roll over&#34; and implement cuts.","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Lincolnshire","Sun, 09 Aug 2015 18:14:47 +0000","Lincolnshire – Ruskington Library set to be run by volunteers – Sleaford Target. &#34;Fifteen major libraries including Sleaford – which now opens for an extra hour on Thursdays until 6pm – will remain. Richard Higgs, chairman of Heckington Parish Council, said: &#34;We are offering an eager group of volunteers the use of the Parish Chambers and Community Centre and they have been rather frustrated by this judicial review. &#34;It would be really good for the village to have its own library service.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Liverpool","Sun, 09 Aug 2015 18:14:47 +0000","Liverpool – Liverpool Town Hall protest over plans to transfer libraries to volunteers - Liverpool Echo. &#34;Angry protestors gathered outside Liverpool Town Hall in a campaign against council plans to hand over five Liverpool libraries to community groups. The demonstration took place just before a council cabinet meeting over the proposals which would see libraries across the city taken over by volunteers.&#34; … &#34;A group of about 20 protestors stood outside the hall with a banner reading &#34;Save Our Libraries&#34;. Among them was children’s author Cathy Cassidy who told the ECHO libraries &#34;will die&#34; under the plans. She said: &#34;Volunteer-run libraries will not be able to sustain opening hours. It will be a slow death.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Staffordshire","Sun, 09 Aug 2015 18:14:47 +0000","Staffordshire – Plans unveiled for New state-of-the-art library for Stafford - Stone and Eccleshall Gazette. &#34;The new library, based at Staffordshire Place 1 in Tipping Street will not only offer access to books and resources for members of the public, but a range of modern facilities for businesses, community groups, schools and colleges. Offering the latest in technology the library will be more accessible, with a more flexible space and will continue to give access to over one million books and over three thousand e-books as well as computers and free Wi-Fi. New digitable touch tables will also give people easier access to online archives, photographs and other materials. A new Innovation Suite will provide access to 3D printing, helping people and businesses to design and develop new products and prototypes, while Raspberry Pi’s will be available to help children and young people learn coding and other computer science skills needed for the jobs of the future&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Vale of Glamorgan","Sun, 09 Aug 2015 18:14:47 +0000","Vale of Glamorgan – Residents win right to take legal challenge against closure of library to High Court – Wales Online. &#34;Residents and book lovers have won the right to take their legal challenge against a library closure to the High Court. The action comes after Vale of Glamorgan councillors voted to close Rhoose library in March as part of plans to cut costs. But residents of the village in the Vale of Glamorgan announced their &#34;delight&#34; after a judge in the High Court in Cardiff agreed campaigners have a case that the consultation in closing the library &#34;may have been unlawful&#34;.&#34; … &#34;Michael Imperator, a partner of the law firm, said: &#34;Rhoose library is a very important case that is part of a bigger issue concerning the viability of libraries. Local libraries play an important role in the development of residents’ literacy skills and are taken for granted by many local authorities.&#34; see also Rhoose library campaigners set for High Court hearing – Barry and District News.","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Dorset","Tue, 11 Aug 2015 21:40:03 +0000","Dorset – Letter: Praise for Colehill Library - Blackmore Vale Magazine. Library user visits library that was the subject of a letter complaining about how loud children were in it.  Reports a courteous and well-run library that played an important part in the education and eventual success of their children.","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Lincolnshire","Tue, 11 Aug 2015 21:40:03 +0000","Lincolnshire – Library volunteers plea ‘putting an end to council cuts politics’ - Lincolnshire Free Press. &#34;A Lincolnshire county councillor at the forefront of plans to scale down the library service says volunteers coming forward to run a community hub in the town he represents are ready to put politics behind them and focus on the future. Coun Nick Worth is appealing for help to run Holbeach Library and prepare for when services are transferred in the middle of October – and the response so far has been &#34;very positive&#34;.&#34; … &#34;Four training sessions will be provided, which will be informal and relaxed and will cover the basic requirements of managing information, safeguarding children and adults, equality and diversity, health and safety and the operation of the library itself.&#34;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Enfield","Tue, 11 Aug 2015 21:40:03 +0000","Enfield – Call for businesses to share space with libraries - Enfield Independent. &#34;Calls have been made for local businesses to share space with one of three libraries as part of new library plans. An open day for businesses to consider sharing a space with Bullsmoor, Enfield Island Village and Ponders End libraries will take place next week at the Dugdale Centre, in London Road, Enfield.&#34; … &#34;Under new plans approved last month, the council will keep all 17 libraries open, the highest of any London borough, but make 11 of them ‘community libraries’, sharing premises with other services. &#34;.  Council: &#34;Under new plans approved last month, the council will keep all 17 libraries open, the highest of any London borough, but make 11 of them ‘community libraries’, sharing premises with other services. &#34;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Fife","Tue, 11 Aug 2015 21:40:03 +0000","Fife – Community call to save libraries – Courier. &#34;A rallying call has gone out to Fife communities to join forces and fight proposed library closures. The challenge by Kirkcaldy MSP David Torrance came as a campaign was launched to save East Wemyss Library, described as a lifeblood of the village. The facility is one of 16 earmarked for closure under Fife Cultural Trust’s cost-cutting exercise, aimed at saving more than £800,000 over three years.&#34;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Herefordshire","Tue, 11 Aug 2015 21:40:03 +0000","Herefordshire – A young library user says how it felt to have his library threatened, the last time in 2013","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Lincolnshire","Tue, 11 Aug 2015 21:40:03 +0000","Lincolnshire – My many reasons for supporting Save Lincolnshire Libraries – none of them political - Save Lincolnshire Libraries. &#34;I  am one of the people at the heart of the Save Lincolnshire Libraries campaign. Martin Hill has now written an open letter (dated 29 July 2015) attacking me and other campaigners, claiming our actions are political and unnecessary. I must now make it clear I have several motivations for opposing Mr Hill’s plan. None of them are political, and people can judge for themselves if my concerns are well founded.&#34; … &#34;I was also one of the directors on Market Rasen’s Portas Pilot scheme, and I can say with absolute certainty that finding enough good volunteers with enough time to spare in a rural location was an Achilles Heel&#34; … &#34;finally, who is monitoring the progress of the hubs, so everyone knows the outcome and lessons can be learnt? It is now vital that other UK councils know how Martin Hill’s plan works in reality, so they do not blindly follow the same path.&#34;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Southampton","Tue, 11 Aug 2015 21:40:03 +0000","Southampton – Southampton libraries face axe unless volunteers come forward – BBC. &#34;Five libraries in Southampton are set to be shut unless volunteers come forward to run them. The city council has been consulting on the plans since last year as it tries to make budget savings.&#34; … &#34;&#34;The consultation showed that Southampton can have an efficient library service if we implement the preferred option, with 99% of households being within a 1.5 mile distance from their closest library. &#34;However, the findings of the consultation also show the important role that libraries play in Southampton’s communities, so a decision on whether to introduce a community package will also be made, to allow this to continue.&#34;&#34; see also Southampton libraries to close unless volunteers come forward – BookSeller.","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Southampton","Tue, 11 Aug 2015 21:40:03 +0000","Southampton – Opposition groups have branded Southampton City Council’s plans to shut libraries as ‘irresponsible’ – Daily Echo. &#34;Cash-strapped council bosses will next week take a decision whether to stop running five libraries and the mobile library from next year. And while they say they are &#34;optimistic&#34; groups will come forward to run them, opponents have attacked them as &#34;irresponsible&#34; saying they could deprive thousands of people of cherished community hubs.&#34;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Herefordshire","Tue, 11 Aug 2015 21:40:03 +0000","Herefordshire – Campaigners in bid to retain vital community hub as Leominster Library faces closure threat - Hereford Times. &#34; the Friends of Leominster Library (FOLL), a group dedicated to supporting and promoting Leominster Library, said it will fight for the cultural and community hub to be retained in North Herefordshire. &#34; … &#34;&#34;We understand absolutely there’s the need to cut costs. But I do feel with Herefordshire, we are such a rural county that we have a particular need and we don’t have very many large towns in which to send people.&#34;  … &#34;FOLL is urging library supporters to fill in a questionnaire about how much they value the service. These can be found online on Herefordshire Council’s website. &#34;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Southampton","Tue, 11 Aug 2015 21:40:03 +0000","Southampton – Chris Packham criticises cuts to his childhood library – BBC. &#34;Mr Packham said he was &#34;really, really angry&#34; on learning his childhood library was among those facing cuts. The presenter, who grew up near Cobbett Road library, says he spent every Saturday afternoon there from the age of five to 16. The council says it is hopeful community groups will run them instead. Mr Packham, whose father is still a frequent user of Cobbett Road library, said it was an invaluable resource for the community. &#34;I can remember every single one of those books I read sitting in these musty, dusty rooms,&#34; he said. &#34;It gave me the framework to help me understand the natural world.&#34;&#34;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Herefordshire","Tue, 11 Aug 2015 21:40:03 +0000","Herefordshire – Proposed cuts to Herefordshire Community Services and Libraries - Herefordshire Library Users Group and four other organisations.  Letter to local MPs. &#34;During the last round of budget cuts this Group made a strong case that cuts had already gone far enough. Further cuts would have been counter-productive then and will be even more damaging now. They would generate high social costs by the removal of essential services. The situation has not changed and the arguments remain the same or stronger.&#34; … &#34;We are writing to ask for your assistance and support. It is difficult to believe that the government intended to inflict such damage on our county when they drew up the parameters for the cut backs. Please will you raise these issues with the Council. We recognize the financial problems they face but we need a better way to move forward and are prepared to work with them on this. The cuts to our libraries and customer services, if implemented, would not only have an adverse effect on other aspects of Council ex&#8230;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Hertfordshire","Tue, 11 Aug 2015 21:40:03 +0000","Hertfordshire – Buntingford groups unite to save library - Mercury. Buntingford in Transition, Buntingford Civic Society and Save the Buntingford Library groups are seeking to make the library a community asset and taking over the service.  Groups disagree with council proposal to move the library (a &#34;commercial magnet&#34;) into fire brigade building due to it being away from the High Street","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Southampton","Tue, 11 Aug 2015 21:40:03 +0000","Southampton – Cobbett Road Library: ‘What was the purpose of the huge consultation?’  – Bitternepark.info. &#34;The Friends of Cobbett Road have argued throughout the £26,000 library consultation process that there could be a ‘third way’ for the library other than closure or community asset transfer. Finally the outcome of the consultation, which saw 7,706 people take part, has been published, with recommendations that the council stop running five city libraries including Cobbett. We spoke to the Friends of Cobbett Road Library chair Kevin Lancashire, pictured, to get his reaction.&#34; … &#34;We’ve looked at what’s involved at other libraries which are run by volunteers, like at North Baddesley, and the task is huge. Cobbett is a much larger enterprise, and we feel taking on more for the Friends group is unrealistic. I can’t see it operating without council input.&#34;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Fife","Thu, 13 Aug 2015 21:45:36 +0000","Fife – Decision on library closures postponed, but there is no ‘plan B’ – Courier. &#34;Fife Council has bowed to pressure to extend a consultation period over plans to shut 16 libraries in a bid to save more than £800,000. The move follows serious concern that people had not been given enough time to explore alternative cost-cutting options and comes less than a month after the council refused to put the plans on hold. Taken on the back of fresh legal advice, the U-turn means a final decision on the fate of the libraries will now be made on December 8 rather than at the end of September.","2015/08/outrage-in-birmingham.html"],["Barnet","Sun, 09 Aug 2015 18:14:47 +0000","Barnet – Council delivered ‘wake up call’ as survey reveals library closures strongly opposed – Times Series. &#34;Campaigners say Barnet council should go back to the drawing board as almost all library users say they oppose the potential closures. As libraries are packed with children completing a summer reading challenge, Barnet council has released its results of the recent consultation into the possibility of closing up to six libraries in the borough. More than 3,800 people submitted their opinions during the course of the survey, which cost £200,000 and ran from November 15 to February 22.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Cardiff","Sun, 09 Aug 2015 18:14:47 +0000","Cardiff – CardiffCentral Library goes digi-tastic – Alyson’s Welsh Libraries Blog. &#34;There was a buzz in Cardiff city centre last Thursday (30th July 2015) with the re-opening of the revamped Cardiff Central Library. I was invited to the launch event and joined the tour which took us around the new council services advice hub and the state-of-the-art digital floor that have been developed at the library&#34; … &#34;The new digital floor has some terrific features including a tablet bar, digital wall, digital creative suite, children’s media zone and a gaming area. Oh and a 3D printer! This might be the first one in a Welsh public library – please let us know if there are others.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["East Sussex","Sun, 02 Aug 2015 21:16:41 +0000","East Sussex – Thousands pour through the door at new library site – Sussex Express. &#34;More than 13,000 people have crossed the threshold of Newhaven’s new library since it opened earlier this year. With the library fast becoming a popular community hub, the county council’s lead member for community services, Cllr Chris Dowling, visited the facility this week to perform the official opening.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Lincolnshire","Sun, 02 Aug 2015 21:16:41 +0000","Lincolnshire – Council leader Martin Hill launches scathing attack on Save Lincolnshire Libraries campaigners – Lincolnshire Echo. &#34;In an open letter, he said: &#34;I am very pleased to hear the good news that the county council’s decision to modernise the library service, encourage volunteering and save money has been vindicated in the High Court. &#34;The unnecessary and politically-inspired legal challenge has been dismissed on all grounds. &#34;What is disappointing is that over £350k of taxpayers’ money has been wasted, voluntary groups frustrated and at least one library lost as a result of this action. &#34;The only obstacle has been the ironically-named Save Lincolnshire Libraries group and the Labour Party – not that anyone can tell the difference between the two. &#34;Their actions have been a costly political exercise in making matters worse for library users, volunteers and staff.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Herefordshire","Thu, 13 Aug 2015 21:45:36 +0000","Herefordshire – New fight to save Library – Ross Gazette. &#34;The Council has prepared a series of questions asking residents what they think could be cut, such as road maintenance or libraries. There is an alternative to cuts and that is to increase the Council Tax paid by residents.&#34;","2015/08/outrage-in-birmingham.html"],["Kent","Thu, 13 Aug 2015 21:45:36 +0000","Kent – 17 Apprenticeships available for young people in Kent – Courier. &#34;There are 17 apprenticeship roles within libraries, registration and archives departments,with 16 within customer services and one in business administration. The work will cover all aspects of work within a library; assisting customers, organising and promoting events and activities taking place at the library, booking appointments and maintaining records. Apprentices are needed in Sheerness, Sittingbourne, Whitstable, Folkestone, Hythe, Larkfield, Tonbridge, Ashford, Tenterden, Dartford, Gravesend, Maidstone and Sevenoaks.&#34; … &#34;The apprentices will gain a customer service qualification while working and earning and once their apprenticeship has finished they can explore the many other employment possibilities within Kent County Council.&#34; Apprentices will earn £115 per week which will rise to £140 in October with the opportunity for a further increase based on performance.&#34;","2015/08/outrage-in-birmingham.html"],["Stockton on Tees","Sun, 09 Aug 2015 18:14:47 +0000","Stockton on Tees – Opening a new chapter at new £2.7m library – Hartlepool Mail. &#34;Billingham’s new £2.7million Library and Customer Service centre has been officially opened. Sir Peter Bazalgette, chairman of Arts Council England, visited the town centre to perform the opening ceremony. The centre has a variety of library and customer services all under one roof, and is part of the ongoing regeneration of Billingham town centre.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Herefordshire","Tue, 04 Aug 2015 19:51:52 +0000","Herefordshire – Fearless Librarian Saves The Day – BBC Radio Four. &#34;Written by Sebastian Baczkiewicz, this is the story of no ordinary librarian. Sitting behind the wheel of a clapped-out mobile library, Harry Hayman is the easy rider of Herefordshire’s remote country lanes. Whether it’s as a knight in shining armour, a getaway driver or an unlikely Casanova – Harry repeatedly finds himself having to save the day. But when his cherished job is jeopardised, can he pull out all the stops? A road trip that weaves together stories inspired by life in the Herefordshire countryside. &#34; [This is from September 2011 – Ed.]","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Barnet","Sun, 02 Aug 2015 21:16:41 +0000","Barnet – Libraries consultation &#34;a wake up call&#34; as readers reject council plans – Barnet and Whetstone Press. &#34;The council said there was an unprecedented number of replies to its four month consultation as people gave their views on plans which range from reducing the number of libraries to using more volunteers. It has just published the 249 page report by Swansea based Opinion Research Services on Friday afternoon.&#34; … &#34;The report said there was little support for closing six libraries and only limited backing for reducing the size of the libraries, unstaffed opening or using automated libraries to replace staff.&#34; … &#34;A children’s march on libraries is planned on Saturday September 12 from Church End to North Finchley in advance of the committee meeting.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Buckinghamshire","Sun, 02 Aug 2015 21:16:41 +0000","Buckinghamshire – Library opening hours slashed to make £270k saving – Buckingham Today. &#34;Library-goers will have less time to enjoy their favourite books after plans to cut library hours were pushed through – despite 65 per cent of people not supporting the move.&#34; … &#34;the opening hour reductions were based on ‘reducing opening hours at periods of lowest usage’, and ‘complimentary patterns for libraries that are close to one another’.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Leicestershire","Thu, 13 Aug 2015 21:45:36 +0000","Leicestershire – Library use falls as county sites look to a new chapter – Hinckley Times. &#34;The proportion of adults from the East Midlands who use libraries has plummeted in the last decade. Back in 2005/06 it was 44.7%. It first dipped under 40% in 2008/09 and last year it was just over 30%.&#34;","2015/08/outrage-in-birmingham.html"],["Reading","Thu, 13 Aug 2015 21:45:36 +0000","Reading – £580k bookfund stays the same this year – Get Reading. &#34;Local mum Emma Reeves has launched a petition to make sure Southcote Library in Southcote Lane does not close and she is supported by fellow library user Claire Wilson.&#34;","2015/08/outrage-in-birmingham.html"],["Sheffield","Thu, 13 Aug 2015 21:45:36 +0000","Sheffield – People’s wishes over-ruled – Star. &#34;Walkley Library was built from a financial gift to Sheffield in 1905 by Andrew Carnegie. It’s the only Carnegie Library in the city and of considerable historical significance. It’s a well-used community asset but is about to be sold to Forum Cafe Bars. How can this be?&#34; … &#34;Members of the public attending a Scrutiny committee meeting on this issue were dismayed by the conduct of Labour councillors and their dismissive attitude towards any public scrutiny. A suggestion by Green councillor Rob Murphy to postpone the decision and further consult the Friends of Walkley Library – they believed the money could be raised to buy the freehold for the community – was dismissed. This whole process, like the felling of street trees, has underlined to many that public involvement in important local decisions is increasingly restricted and discouraged by the ruling Labour party, using their big council majority.&#34;","2015/08/outrage-in-birmingham.html"],["Walsall","Thu, 13 Aug 2015 21:45:36 +0000","Walsall – More than a thousand Walsall school children join summer library book challenge – Walsall Advertiser.","2015/08/outrage-in-birmingham.html"],["Liverpool","Sun, 09 Aug 2015 18:14:47 +0000","Liverpool – Tony Snell in the morning – BBC Radio Merseyside. Alan Gibbons (argues for the need for paid librarians and national/formal structures) and Mayor Anderson (argues for volunteer libraries and say that such deep cuts mean Alan needs to &#34;smell the coffee&#34;) talk about the cuts to Liverpool Libraries (1 hour 9 minutes in). May or Anderson says there may be no &#34;discretionary services&#34; at all in 2017 due to budget cuts and that Alan should be protesting against central government. Alan argues that Mayor Anderson should not &#34;roll over&#34; and implement cuts.","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Plymouth","Sun, 09 Aug 2015 18:14:47 +0000","Plymouth – Plymouth library plans in after council warns itself over ‘invalid’ submission – Plymouth Herald. &#34;the Central Library is to be moved from North Hill to the heart of the city centre in a £1.4million revamp as it makes way for the history centre’s regeneration. The library will takeover Taylor Maxwell House in Armada Way, formerly a branch of the Woolwich Building Society, and the first and basement floors of Cornwall College’s building in Mayflower Street. In a letter from Plymouth City Council’s planning team, it informed colleagues behind the move that their planning application was &#34;invalid&#34; and that they were preparing to terminate the request – despite £385 having been paid in fees.&#34; … &#34;A slightly more central location is hoped to tackle the declining numbers visiting the library, with an 18 per cent drop between 2012/13 and 2013/14. Only the library element of the North Hill building will relocate to 1,076 square metres of Taylor Maxwell House – library storage, administration and the schools libra&#8230;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Rotherham","Thu, 13 Aug 2015 21:45:36 +0000","Rotherham – Dolly Parton book scheme in Rotherham to be scrapped, council confirms – South Yorkshire Times. &#34;No further children will be enrolled onto the Imagination Library in Rotherham although youngsters already receiving books will continue to do so until February&#34; … &#34;Rotherham was the first town in Britain to adopt the Imagination Library programme which was started by Ms Parton in the United States. The global star visited South Yorkshire in 2007 to launch the scheme which involved sending books every month to young children in the town.&#34;","2015/08/outrage-in-birmingham.html"],["Wolverhampton","Thu, 13 Aug 2015 21:45:36 +0000","Wolverhampton – Balancing the books: Library budget cuts continue – Express and Star. &#34;The city council revealed it would put £113,450 into new books for its 16 libraries this year – a fall of £100,000 on the year before. Other Black Country and Staffordshire councils are continuing to spend vastly more – with one neighbouring borough even increasing its budget. Sandwell will put £400,000 into new books alone this year, plus a further £80,000 for other materials such as DVDs, CDs, audiobooks, magazines and newspapers. It was an increase of £6,000 on the previous year to account for inflation. Staffordshire County Council will also keep its £625,000 new book budget the same. And Walsall Council said its spend on library stocks would stay at £580,000. The cuts to Wolverhampton’s library books budget comes before a proposed £500,000 reduction to the overall budget for 16 libraries – currently £1.7 million – as part of £134m worth of cuts over five years&#34;","2015/08/outrage-in-birmingham.html"],["Leicestershire","Sun, 09 Aug 2015 18:14:47 +0000","Leicestershire – Future looks bright for village library – Hinckley Times. &#34;The future of Burbage Library looks assured after more than a dozen people joined a management committee to press forward community ownership plans. It is a turnaround in fortunes for the facility which looked destined for closure as part of Leicestershire County Council’s cost-cutting plans. Last year a lengthy consultation run by the parish council on whether the Church Street library could or should be run by villagers received support but not enough, it was considered, to take proposals to the next level.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Cambridgeshire","Sun, 02 Aug 2015 21:16:41 +0000","Cambridgeshire – Milton Road Library to become a ‘community hub’ with flats on top – Cambridge News. &#34;A Cambridge library faces being torn down and rebuilt as a new community hub with flats on top. The Milton Road library in Ascham Road will be subject to a completely fresh approach as one of the county council’s fledgling ‘community hub’ libraries. A scheme is well developed that would have the building replaced with a three-storey facility including nine flats on its top floor.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Merton","Sun, 02 Aug 2015 21:16:41 +0000","Merton – Work underway on £1.2m new library ahead of open day – Your Local Guardian. Donald Hope Library: &#34;Work has started on a £1.2m library face-lift leaving book lovers to contend with a much smaller temporary library for the next two years. The new six-storey development was initially met with objections from some residents due to the building’s height but, after approval from Merton Council in March, the building project is now underway.&#34; … &#34;A temporary facility about a quarter of the size of Donald Hope library in Colliers Wood will be available with a range of services for library users. &#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Dorset","Tue, 11 Aug 2015 21:40:03 +0000","Dorset – Letter: Praise for Colehill Library – Blackmore Vale Magazine. Library user visits library that was the subject of a letter complaining about how loud children were in it.  Reports a courteous and well-run library that played an important part in the education and eventual success of their children.","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Devon","Tue, 04 Aug 2015 19:51:52 +0000","Devon – Julie Dent talks about Devon’s Library Service – Youtube. &#34;An exciting new era is on the horizon for Devon Libraries, with plans to set up a new independent organisation to run the service. Work is underway to establish a staff and community owned ‘mutual’ which would be commissioned by Devon County Council to run libraries on their behalf from April 2016.&#34;","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Enfield","Tue, 11 Aug 2015 21:40:03 +0000","Enfield – Call for businesses to share space with libraries – Enfield Independent. &#34;Calls have been made for local businesses to share space with one of three libraries as part of new library plans. An open day for businesses to consider sharing a space with Bullsmoor, Enfield Island Village and Ponders End libraries will take place next week at the Dugdale Centre, in London Road, Enfield.&#34; … &#34;Under new plans approved last month, the council will keep all 17 libraries open, the highest of any London borough, but make 11 of them ‘community libraries’, sharing premises with other services. &#34;.  Council: &#34;Under new plans approved last month, the council will keep all 17 libraries open, the highest of any London borough, but make 11 of them ‘community libraries’, sharing premises with other services. &#34;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Herefordshire","Tue, 11 Aug 2015 21:40:03 +0000","Herefordshire – Campaigners in bid to retain vital community hub as Leominster Library faces closure threat – Hereford Times. &#34; the Friends of Leominster Library (FOLL), a group dedicated to supporting and promoting Leominster Library, said it will fight for the cultural and community hub to be retained in North Herefordshire. &#34; … &#34;&#34;We understand absolutely there’s the need to cut costs. But I do feel with Herefordshire, we are such a rural county that we have a particular need and we don’t have very many large towns in which to send people.&#34;  … &#34;FOLL is urging library supporters to fill in a questionnaire about how much they value the service. These can be found online on Herefordshire Council’s website. &#34;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Lincolnshire","Tue, 11 Aug 2015 21:40:03 +0000","Lincolnshire – Library volunteers plea ‘putting an end to council cuts politics’ – Lincolnshire Free Press. &#34;A Lincolnshire county councillor at the forefront of plans to scale down the library service says volunteers coming forward to run a community hub in the town he represents are ready to put politics behind them and focus on the future. Coun Nick Worth is appealing for help to run Holbeach Library and prepare for when services are transferred in the middle of October – and the response so far has been &#34;very positive&#34;.&#34; … &#34;Four training sessions will be provided, which will be informal and relaxed and will cover the basic requirements of managing information, safeguarding children and adults, equality and diversity, health and safety and the operation of the library itself.&#34;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Knowsley","Tue, 04 Aug 2015 19:51:52 +0000","Knowsley – Knowsley library cutbacks: council cannot afford &#34;same level of service&#34; as opening hours cut – Liverpool Echo. &#34;The council announced all five Knowsley libraries will no longer open on Wednesdays in a statement online this morning. It said every library will also open an hour later from Monday to Friday, with the changes starting from Monday, August 24. The move means most libraries will see their opening hours cut by 12 hours week but Huyton will lose 15 hours a week as its 6pm closing time is pushed back to 5pm. The council also announced a new e-books system will launch in the autumn.&#34;","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Birmingham","Sun, 02 Aug 2015 21:16:41 +0000","Birmingham – Why Birmingham library needs Google and language classes to keep doors open – Guardian. &#34;Here at Birmingham city council, we’re wrestling with how to maintain essential services while taking £850m out of our annual budget, and cutting our workforce by about two-thirds. In that context, any argument that starts from the premise that things should stay the same is never going to stack up, no matter how much we might wish it could&#34; … &#34;Local government isn’t going to get any easier over the next few years, and local politicians have no choice but to rise to the transformation challenge. If we want to hang onto the services we all value, things are going to have to change.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Lincolnshire","Sun, 02 Aug 2015 21:16:41 +0000","Lincolnshire – ‘County Council has squirreled away £17m of your money – but won’t put penny into libraries’ – Lincolnshire Echo. &#34;Days earlier [than the judicial review hearing], the council’s Tory-LibDem executive met to decide what to do with a surplus £17 million which it demanded from local council taxpayers last year, but failed to spend on services. A tenth of this cash bonus would keep libraries running for another year, and leave more than £15 million to invest in vital services. Instead, the executive chose to squirrel away the £17 million by putting it in &#34;reserves&#34;.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Surrey","Sun, 02 Aug 2015 21:16:41 +0000","Surrey – Cobham Library reopens as part of new ‘community hub’ – Dorking and Leatherhead Advertiser. &#34;The county council will operate the library but lease the rest of the building to Cobham Cedar Centre Limited, a social enterprise run &#34;by the community, for the community&#34;. Richard Walsh, cabinet member for localities and community wellbeing, said: &#34;The way people use libraries is changing, which is why it’s so important we continue to adapt and improve our library service. The social enterprise is a great example of the community pulling together to help shape local services.&#34; Among new amenities are computers, laptop plug-in points, free Wi-Fi and improved study and children’s areas.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Herefordshire","Tue, 11 Aug 2015 21:40:03 +0000","Herefordshire – Proposed cuts to Herefordshire Community Services and Libraries – Herefordshire Library Users Group and four other organisations.  Letter to local MPs. &#34;During the last round of budget cuts this Group made a strong case that cuts had already gone far enough. Further cuts would have been counter-productive then and will be even more damaging now. They would generate high social costs by the removal of essential services. The situation has not changed and the arguments remain the same or stronger.&#34; … &#34;We are writing to ask for your assistance and support. It is difficult to believe that the government intended to inflict such damage on our county when they drew up the parameters for the cut backs. Please will you raise these issues with the Council. We recognize the financial problems they face but we need a better way to move forward and are prepared to work with them on this. The cuts to our libraries and customer services, if implemented, would not only have an adverse effect on other aspects of Council ex&#8230;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Hertfordshire","Tue, 11 Aug 2015 21:40:03 +0000","Hertfordshire – Buntingford groups unite to save library – Mercury. Buntingford in Transition, Buntingford Civic Society and Save the Buntingford Library groups are seeking to make the library a community asset and taking over the service.  Groups disagree with council proposal to move the library (a &#34;commercial magnet&#34;) into fire brigade building due to it being away from the High Street","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Liverpool","Sun, 09 Aug 2015 18:14:47 +0000","Liverpool – Liverpool Town Hall protest over plans to transfer libraries to volunteers – Liverpool Echo. &#34;Angry protestors gathered outside Liverpool Town Hall in a campaign against council plans to hand over five Liverpool libraries to community groups. The demonstration took place just before a council cabinet meeting over the proposals which would see libraries across the city taken over by volunteers.&#34; … &#34;A group of about 20 protestors stood outside the hall with a banner reading &#34;Save Our Libraries&#34;. Among them was children’s author Cathy Cassidy who told the ECHO libraries &#34;will die&#34; under the plans. She said: &#34;Volunteer-run libraries will not be able to sustain opening hours. It will be a slow death.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Brent","Sun, 02 Aug 2015 21:16:41 +0000","Brent – Inside the New Willesden Library Centre – James Powney’s Blog. Pictures of the new library.","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Lincolnshire","Tue, 11 Aug 2015 21:40:03 +0000","Lincolnshire – My many reasons for supporting Save Lincolnshire Libraries – none of them political – Save Lincolnshire Libraries. &#34;I  am one of the people at the heart of the Save Lincolnshire Libraries campaign. Martin Hill has now written an open letter (dated 29 July 2015) attacking me and other campaigners, claiming our actions are political and unnecessary. I must now make it clear I have several motivations for opposing Mr Hill’s plan. None of them are political, and people can judge for themselves if my concerns are well founded.&#34; … &#34;I was also one of the directors on Market Rasen’s Portas Pilot scheme, and I can say with absolute certainty that finding enough good volunteers with enough time to spare in a rural location was an Achilles Heel&#34; … &#34;finally, who is monitoring the progress of the hubs, so everyone knows the outcome and lessons can be learnt? It is now vital that other UK councils know how Martin Hill’s plan works in reality, so they do not blindly follow the same path.&#34;","2015/08/read-on-get-on-scots-wifi-donaldson-and-the-rest-of-the-library-news.html"],["Staffordshire","Sun, 09 Aug 2015 18:14:47 +0000","Staffordshire – Plans unveiled for New state-of-the-art library for Stafford – Stone and Eccleshall Gazette. &#34;The new library, based at Staffordshire Place 1 in Tipping Street will not only offer access to books and resources for members of the public, but a range of modern facilities for businesses, community groups, schools and colleges. Offering the latest in technology the library will be more accessible, with a more flexible space and will continue to give access to over one million books and over three thousand e-books as well as computers and free Wi-Fi. New digitable touch tables will also give people easier access to online archives, photographs and other materials. A new Innovation Suite will provide access to 3D printing, helping people and businesses to design and develop new products and prototypes, while Raspberry Pi’s will be available to help children and young people learn coding and other computer science skills needed for the jobs of the future&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Lincolnshire","Sun, 02 Aug 2015 21:16:41 +0000","Lincolnshire – County council defeats second High Court challenge to plans for libraries – Local Government Advertiser. &#34;The claimant, backed by the Save Lincolnshire Libraries Group, argued that the revised plans – approved by the council’s executive in February this year – were fundamentally no different to a plan decided upon in December 2013. The first decision was quashed by the High Court because of flaws in decision making and consultation. Mrs Justice McGowan heard the latest proceedings in the High Court last week (21 July). The county council reported today [28 July] that the judge had ruled that its decision was taken in a lawful manner.&#34;  see also  Lincolnshire County Council wins second library court battle – BBC and Lincolnshire library cuts challenge dismissed, and one Lincoln facility to close – Lincolnite.","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Fife","Sun, 09 Aug 2015 18:14:47 +0000","Fife – What’s the story at the library? – Fife Today. &#34;A Levenmouth councillor is appealing for support from local people as he mounts a campaign to save the library in East Wemyss – just days before Fife Council holds a vital scrutiny meeting to discuss closure plans. Councillor John O’Brien hopes to launch a petition and possibly organise a public meeting, involving the local MP and MSP, to deflect what he described as &#34;a direct hit for the people of East Wemyss&#34;.&#34;","2015/08/23-shared-library-services-nuns-and-ferguson-one-year-on.html"],["Dorset","Tue, 04 Aug 2015 19:51:52 +0000","Dorset – Letter: a mum’s view of libraries – Blackmore Vale Magazine. Mother describes the importance of libraries to her life and says all should be able to use them. see also Letter: Deputy Mayor speaks out in defence of library activities – Blackmore Vale Magazine. Both letters in response to letter complaining about the noise of child activities disturbing the quiet reading of others.","2015/08/world-record-attempts-and-the-joy-of-not-saying-no.html"],["Birmingham","Sun, 02 Aug 2015 21:16:41 +0000","Birmingham – Google scheme saves Birmingham Library from restricting opening hours over budget cuts – Independent. &#34;When Birmingham’s multimillion-pound new library announced it was being forced to slash its opening hours due to budget cuts less than two years after opening, the humiliation looked like it might turn the architectural landmark into an expensive white elephant. But soon the city’s residents will once more be able to access the building far more often thanks to Google and a local language classes scheme. The internet giant has backed a pop-up &#34;Digital Garages&#34; business programme – which nurtures digital talent – and which will move into the Library of Birmingham, in conjunction with the city’s Brasshouse Language Service.&#34;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Herefordshire","Sun, 02 Aug 2015 21:16:41 +0000","Herefordshire – Income and savings proposals  – Herefordshire Council. &#34;It is proposed to keep Hereford Library and The Hereford Centre (customer services), as they are the most used facilities, whilst the centres covering both customer services and libraries in Belmont (Hereford), Leominster and Ross-on-Wye would be withdrawn, along with access to public computers. Customer services in Bromyard, Kington and Ledbury would also be withdrawn but a self-service library facility would remain at these locations, as the buildings are also used by other organisations.The library delivery service for house bound residents would be retained whilst the school library service would also continue but become self-financing. The back office support for community libraries would need to be funded by the community.\nKirklees – Councillors debate threat to libraries in Kirklees – Examiner. &#34;Councillors have debated how to slash £1.85m from Kirklees’ libraries budget. The long running threat to libraries has been looming since government cuts be&#8230;","2015/08/wouldnt-it-be-nice-if-information-played-a-part-in-the-public-library-sector.html"],["Birmingham","Sun, 16 Aug 2015 16:22:15 +0000","Birmingham – I love the new Birmingham Library – and I hate what’s happening to it  – Guardian. &#34;The mucky concrete ziggurat it replaced – which Prince Charles said he thought looked like a building where books were &#34;incinerated, not kept&#34; – just needed a good clean, as far as I was concerned. … Nonetheless, I quickly fell for its successor – content mattering more than style – and spent much of last year working there, riding the bank of escalators that spears through the library’s core to one of the light, open study areas … In the past six months, though, it’s felt as though the whole enterprise has been falling to bits, which is why it doesn’t surprise me in the slightest that Birmingham’s libraries are now asking their users to donate spare books while its book-buying fund is &#34;paused&#34;.&#34; … &#34;it’s about the mistake of putting the box before the contents: libraries, first and foremost, have to be about the free availability of quality, up-to-date reading material. Is it really the case that the council cou&#8230;","2015/08/public-libraries-as-charity-basket-case.html"],["Nottinghamshire","Tue, 18 Aug 2015 20:30:34 +0000","Nottinghamshire – Robin Hood and young bookworms celebrate reopening of Arnold Library – Nottingham Post. Arnold Library: &#34;People flocked from far and wide to get a glimpse of the £300,000 improvements – with regular users describing it as ‘unrecognisable’. The library, which closed in January, now boasts £40,000 worth of new books, a gift shop, small cafe and study section. The building has also benefited from new windows, sun panels and LED lighting throughout.&#34; … &#34;Nottinghamshire County Council has implemented improvements to a number of libraries in the last two years – including Newark, Bingham and Stapleford. Beeston is likely to be the next to benefit.&#34;","2015/08/is-it-fine-to-fine.html"],["Suffolk","Wed, 19 Aug 2015 22:37:08 +0000","Suffolk – Literacy boost for Suffolk Libraries – Suffolk Libraries. &#34;Matt Shenton has joined Suffolk Libraries this week as the new Literacy Ambassador – a post funded from a successful bid to the Foyle Foundation. Matt will work with schools and other organisations to promote the benefits of library use and with an aim for all Year 7 children across the county to have their own library card. Matt will also be visiting schools and working with other organisations.&#34; … &#34;Suffolk Libraries’ Literacy Project has been funded by a grant of £30,000 from the Foyle Foundation which is an independent grant-making trust which awards funding to charitable organisations involved with arts and learning.&#34;","2015/08/special-automatic-english-child-library-membership-no-not-really.html"],["Fife","Sun, 16 Aug 2015 16:22:15 +0000","Fife – Consultations over future of West Fife libraries begins – Dunfermline Press. &#34;  proposal from Fife Cultural Trust, who operate most of Fife Council’s libraries, would see 16 llibraries – including Abbeyview, Crossgates and Townhill – close in a bid to deliver savings required by the council. Also under review are opening hours and mobile library routes, and standardising the range of services offered across the library network.&#34;","2015/08/public-libraries-as-charity-basket-case.html"],["Herefordshire","Sun, 16 Aug 2015 16:22:15 +0000","Herefordshire – Save the library  – Ross Gazette / Letters. &#34;Can we please have a huge and concerted effort from the whole community to ensure that our libraries remain open and available to all local residents. If this requires an increase in Council Tax it will be a small price to pay for ensuring the continuation of this essential part of British Life.&#34;","2015/08/public-libraries-as-charity-basket-case.html"],["Lincolnshire","Sun, 16 Aug 2015 16:22:15 +0000","Lincolnshire – Campaign under attack – Spalding Today. &#34;I am one of the people at the heart of the Save Lincolnshire Libraries campaign. Martin Hill has now written an open letter (dated July 29) attacking me and other campaigners, claiming our actions are political and unnecessary. I must now make it clear I have several motivations for opposing Mr Hill’s plan. None of them are political, and people can judge for themselves if my concerns are well-founded. &#34; … &#34;If you want to really understand the people supporting this campaign, you must read the 900 comments on our website from those who signed our online petition (www.savelincslibraries.org.uk/nine-hundred-comments/). If you can get through that page without becoming tearful you have a heart of stone.&#34;","2015/08/public-libraries-as-charity-basket-case.html"],["Southampton","Sun, 16 Aug 2015 16:22:15 +0000","Southampton – Southampton councillors have been urged to use money from housing and education budgets to save six libraries – Daily Echo. &#34;Civic chiefs in Southampton have been accused of failing to listen to residents’ views in putting forward plans that could see six city libraries close. Council leaders have also been urged to find different ways to fund the libraries, by finding the funding from housing and education budgets. The council’s cabinet is being recommended to stop running five city libraries and the mobile service at its meeting on Tuesday (Aug 18).&#34;.  Consultation questions have caused criticism: &#34;critical of the way the consultation questions were phrased, saying there were not different options presented to residents but variations of the same outcome.&#34;","2015/08/public-libraries-as-charity-basket-case.html"],["Lincolnshire","Tue, 18 Aug 2015 20:30:34 +0000","Lincolnshire – First community run Lincolnshire library officially opens – Lincolnshire Echo. &#34;Sutton on Sea library and community hub was officially opened on Thursday with a ribbon cutting ceremony by deputy Mayor, Councillor Joyce Taylor. The opening was attended by Councillor Bill Aron, representing Nick Worth the executive member for libraries. Paul Espin, chairman of Sutton on Sea Library and Community Hub said: &#34;I appreciate the issue regarding the library services has been a very emotive subject and has required much political and legal attention.&#34; … &#34;Opening hours at the Sutton on Sea hub remain the same on Monday, Friday and Saturday from 10am-1pm and Wednesdays 2pm-4pm.&#34;","2015/08/is-it-fine-to-fine.html"],["Lancashire","Sun, 16 Aug 2015 16:22:15 +0000","Lancashire – Two libraries closed due to staff shortage – Clitheroe Advertiser. &#34;Chatburn and Mellor libraries usually open from 10 am to 1 pm on a Saturday, but will be closed due to staff sickness&#34; … &#34;Each of these small libraries is run by one member of staff and unfortunately at the moment we haven’t got enough staff available to be able to cover from other libraries.&#34;","2015/08/public-libraries-as-charity-basket-case.html"],["Lincolnshire","Sun, 16 Aug 2015 16:22:15 +0000","Lincolnshire – Barrowby’s library bid moves forward – Grantham Journal. &#34;Members of a village group working to set up the library believe it will be well used by children, young people and older people in the village, which has 2,000 residents and a primary school with 250 pupils. Initially it would be open on Wednesday afternoons and Saturday mornings, but supporters hope this could be extended. When the plan was first mooted it was hoped the library could be open early next year.&#34;","2015/08/public-libraries-as-charity-basket-case.html"],["Lincolnshire","Tue, 18 Aug 2015 20:30:34 +0000","Lincolnshire – Community Hubs Libraries, Sink or Swim… -Save Lincolnshire Libraries. &#34;Thursday the 13th of August saw the official opening of the Sutton on Sea Community Hub and Library, formerly Sutton on Sea Library. Changing from professionally run and County Council maintained, to a volunteer run and managed service to the community.  As the good ship SS County Council steams off into the distance it throws a couple of life rafts in the form of a 4 year part finance package and a one off capital expense package. Completely ignoring the one hundred plus jobs that have sunk without a trace and the sharks circulating around a once proud Lincolnshire Library service that boasted 45 proper libraries that all people in the county could access with ease…&#34; … &#34;Not one single person supported the plan outside of the Administration Councillors and believe me for all opposition parties to vote against something is rare. In the consultation over 21,000 responses were all against and comments from Sheffield Hallam and the Judge refl&#8230;","2015/08/is-it-fine-to-fine.html"],["Lincolnshire","Sun, 16 Aug 2015 16:22:15 +0000","Lincolnshire – People from all parties wanted to save Lincolnshire libraries – Lincolnshire Echo. &#34;It was clear that many of those attending were people who cared about Lincolnshire and the library services that the council should provide. I am sure that many there would subsequently voted for David Cameron on May 7.&#34; … &#34;now live in Northamptonshire and, although times have been tough time for the library service, towns such as where we live continue to enjoy a council-funded service. The County Council here has shown imagination which Lincolnshire CC and Councillor Hill clearly lack.&#34;","2015/08/public-libraries-as-charity-basket-case.html"],["Southampton","Sun, 16 Aug 2015 16:22:15 +0000","Southampton – Residents hit out at Southampton’s Labour council chiefs over plans to shut six city libraries – Daily Echo. &#34;Sparks flew in a heated meeting where residents grilled the council’s leisure chief with one branding her a &#34;disgrace&#34;. ‎Labour cabinet member Satvir Kaur said she believed groups would take on the libraries and that the changes would create a &#34;sustainable&#34; future for the service.&#34;","2015/08/public-libraries-as-charity-basket-case.html"],["Southampton","Sun, 16 Aug 2015 16:22:15 +0000","Southampton – Southampton residents confront council over library closures – BookSeller. &#34;Southampton residents branded their council leisure chief a &#34;disgrace&#34; at a meeting to discuss the closure of six libraries in the area. According to local newspaper the Daily Echo, library users and council members met Labour cabinet member Satvir Kaur, member for communities, culture and leisure, about the proposed library closures, announced last week.&#34; … &#34;A Labour council member, Cathie McEwing, said she did not understand why the final decision was going just to the cabinet and not the full council for a full debate.&#34;","2015/08/public-libraries-as-charity-basket-case.html"],["Edinburgh","Wed, 19 Aug 2015 22:37:08 +0000","Edinburgh – Libraries report rising numbers through doors – Scotsman. &#34;Figures show the total number of occasions on which services were accessed rose four per cent to 12.2 million in 2014-15, with visits up two per ent to over 3.4m. And attendance at special events has soared 16 per cent as the range of activities held at Edinburgh’s public libraries – which now includes community food schemes and digital skills classes – continues to expand.&#34;","2015/08/special-automatic-english-child-library-membership-no-not-really.html"],["Oldham","Sun, 16 Aug 2015 16:22:15 +0000","Oldham – Melvyn Bragg and Attila the Stockbroker to star at Live@TheLibrary – Oldham Council (via email). &#34;Oldham Council is bringing an exciting array of theatre, literature and comedy this autumn for its latest Live@thelibrary programme. More than 20 performances are taking place throughout September, October and November, at various venues around the borough – with the majority taking place in Oldham Library’s newly-refurbished performance space. Broadcaster, writer and Parliamentarian Melvyn Bragg will be talking about his new book at The Grange Theatre, in Oldham, on Tuesday, November 10.Oldham Council Libraries is also pleased to present an afternoon with novelist Louis de Bernières, well known for Captain Corelli’s Mandolin, at the Millgate Arts Centre, in Delph, Saddleworth, on Saturday, October 24. Radical punk poet and folk musician Attila the Stockbroker will be playing his only Greater Manchester gig this year at Oldham Library. The library welcomes back theatre company Colour the Clouds with their brand new show for c&#8230;","2015/08/public-libraries-as-charity-basket-case.html"],["Angus","Tue, 18 Aug 2015 20:30:34 +0000","Angus – Overdue library book fees may be scrapped – Courier. &#34;Angus Council could to become the first local authority in Scotland to scrap charges for overdue library books. County libraries could scrap &#34;old-fashioned&#34; late fees in an attempt to woo back lapsed customers with armfuls of books they were too embarrassed to return. Councillors will be asked to approve the termination of the traditional fees – which generated around £18,000 a year for the council – from November. It is hoped the loss of revenue will be made up by an influx of new readers, at a time when other businesses that charge late fees are in decline and the emergence of websites like Amazon has made downloading books easier and more affordable.&#34; … &#34;Mr Wilson acknowledged there is a risk that the incidence of late returns will increase, making stock unavailable for others but the new library management system will provide &#34;new opportunities&#34; to mitigate this risk, including email reminders before books become overdue.&#34;","2015/08/is-it-fine-to-fine.html"],["Isle of Wight","Tue, 18 Aug 2015 20:30:34 +0000","Isle of Wight – Consultation on library cut-backs draws closer – On the Wight. &#34;If you’re concerned about the possible closure of Ventnor Library or the proposed massive reduction in paid staff and possible relocation to the old Youth Centre, why not become a Friend of Ventnor Library? The group, which was formed after threats by the previous Conservative council to close nine of the eleven libraries on the Island, supports the library in many ways, including regular fundrasising. The Friends will be meeting at the library on Wednesday (19th) from 6.30pm – the last meeting before the current Isle of Wight consultation closes on 6th September.&#34;","2015/08/is-it-fine-to-fine.html"],["Southampton","Tue, 18 Aug 2015 20:30:34 +0000","Southampton – ‘Defer libraries decision to September full council meeting’ – Bitternepark.info. &#34;At the scrutiny meeting, where various library friends groups were represented, Cllr Kaur called for talks with friends of library groups, claiming her offer hadn’t previously been taken up. &#34;I’m more than happy for you to come to this meeting and have your say, but there’s nothing like a face-to-face, one-to-one conversation,&#34; said Cllr Kaur. Members of FOCRL and other libraries under threat will be at the cabinet meeting on Tuesday, although unable to speak.&#34;","2015/08/is-it-fine-to-fine.html"],["Southampton","Tue, 18 Aug 2015 20:30:34 +0000","Southampton – Decision day for future of under threat Cobbett Road, Burgess Road, Millbrook, Weston and Thornhill libraries – Daily Echo. &#34;City council bosses will today decide whether to stop running six of the facilities from April next year. And while they say they are confident groups will come forward to run them there are fears that it could mean the end for some of the city’s most loved community facilities. Proposals to close Cobbett Road, Burgess Road, Millbrook, Weston and Thornhill libraries, as well as the mobile service, first surfaced almost a year ago when a review into their future was launched.&#34;","2015/08/is-it-fine-to-fine.html"],["Staffordshire","Tue, 18 Aug 2015 20:30:34 +0000","Staffordshire – Take a look: £1m new Stafford Library is in touch with new technology – Express and Star. &#34;Touchscreen tables, 3D printers and giant computer tablets – Stafford’s new £1million library looks more like an art gallery or technology hub.&#34; … &#34;Gone are lifeless signs and notice boards which traditionally greet library-goers, instead those visiting the new facility at Staffordshire Place will be met by a large state-of-the-art touchscreen display which resembles an iPad. The six-foot tall information point will show activities happening on the day, promote what is going on at other libraries, display family history events and even recommend books to loan.&#34; … &#34;The vision set out by Staffordshire County Council, which will run the site, is for it to be a centre of excellence and the Innovation Suite will be at the heart of that ambition.Much of the digital-centric facility has the Government’s new STEM – Science Technology, Engineering and Maths – agenda in mind which is aimed at enhancing the next generati&#8230;","2015/08/is-it-fine-to-fine.html"],["Bradford","Wed, 19 Aug 2015 22:37:08 +0000","Bradford – Calls for more cash to be spent on Baildon library – Telegraph and Argus. &#34;Baildon Councillor Debbie Davies has hit out at Bradford Council’s decision to put cash from the sale of a Shipley building exclusively towards the £640,000 bill for a raft of improvements to Shipley library, while she says Baildon Library has dire problems including draughty windows and a leaking roof – a claim the local authority disputes. Shipley Library will close on Friday, August 28, for eight months with the revamp to include new heating and lighting and carpets, improved meeting rooms, updated toilets and an exhibition area. New self-service kiosks will also be installed.&#34;","2015/08/special-automatic-english-child-library-membership-no-not-really.html"],["Leicester","Sun, 23 Aug 2015 19:34:10 +0000","Leicester – Unison accuses Leicester City Council of planning to decimate library services through cost-cutting – Leicester Mercury. &#34;Branch secretary Gary Garner has written to city mayor Sir Peter Soulsby warning that the plan – outlined to staff earlier this month – would decimate services which are essential to residents. The proposals would see 20 jobs axed and staff who remain facing pay re-grades as their jobs changed. &#34;&#34;A senior library assistant will be downgraded from £22,212 to £17,372.&#34;","2015/08/just-100k-volunteers-and-some-curious-stock-policies.html"],["Southampton","Sun, 23 Aug 2015 19:34:10 +0000","Southampton – Southampton Council accused of political point scoring over libraries – BookSeller. &#34;Conservative MP Royston Smith has accused Southampton Council of making a &#34;political point at the expense of constituents&#34; by axing five of its libraries. On Tuesday night (18th August), the council approved plans to shut five libraries in the area in a bid to save £286,000 unless community groups came forward to run them. The MP for the Southampton Itchen Constituency, Royston Smith, has accused Southampton Council, run by Labour, of closing the five libraries as a tool to make a &#34;political point at the expense of his constituents,&#34; adding that they could &#34;easily be saved.&#34;&#34;","2015/08/just-100k-volunteers-and-some-curious-stock-policies.html"],["Birmingham","Tue, 18 Aug 2015 20:30:34 +0000","Birmingham – Librarians call on Birmingham to maintain library services  – Guardian. &#34;Poole urges the council &#34;to carefully consider the impact of budget cuts on library services and how in turn communities and the local economy will be affected&#34;, recommending that it maintains &#34;as much professional expertise in the library service as possible so that Birmingham’s libraries continue to innovate and meet the changing needs of the city&#34;. Offering to meet Rogers’ team, Poole writes that while &#34;I understand that Birmingham city council has to make significant savings … properly resourced and staffed library services&#34; need to be &#34;part of the solution&#34;. Rogers wrote on Twitter that he &#34; welcome[s] the letter&#34;, that the reply is &#34;in the post&#34;, and that he will work with CILIP. CILIP said on Tuesday that Poole had yet to hear back, but that &#34;we expect to and look forward to following up with him and his team&#34;.&#34;","2015/08/is-it-fine-to-fine.html"],["Herefordshire","Tue, 18 Aug 2015 20:30:34 +0000","Herefordshire – Campaigner: ‘The library is a fantastic service for Ross’ – Hereford Times. &#34;Clare West of the Ross Library Development Group said they are very concerned about the current proposals to close the library in Cantilupe Road. Under Herefordshire Council‘s latest cost-saving proposals, Ross could be ‘withdrawn’ along with Belmont and Leominster. &#34; … &#34;The group is encouraging people to sign the county-wide petition and it will also be putting out a petition specifically to keep Ross library open. &#34;","2015/08/is-it-fine-to-fine.html"],["Blackpool","Tue, 18 Aug 2015 20:30:34 +0000","Blackpool – Hours change in pipeline for town libraries – Blackpool Gazette. &#34;Libraries could be in the firing line as council chiefs look at more ways to save money. Town hall chiefs today stressed there were no plans to close any of the facilities – but councillors have been consulted over possible changes in opening hours. One councillor admitted he believes opening hours will be cut but The Gazette understands this may not necessarily be the case&#34; … &#34;Coun Gillian Campbell, Deputy Leader of Blackpool Council, said: &#34;At present our library team are talking to councillors about potential changes to library services ahead of a possible public consultation later in the year. &#34;Those changes could potentially include altering opening hours to make them more suitable for residents – including outside of normal standard working hours and more widely at weekends.&#34;","2015/08/is-it-fine-to-fine.html"],["Suffolk","Wed, 19 Aug 2015 22:37:08 +0000","Suffolk – Suffolk Libraries Presents – Suffolk Libraries. Two ballet productions screened (tickets £7.50 each) put on with support from Arts Council England.","2015/08/special-automatic-english-child-library-membership-no-not-really.html"],["Hertfordshire","Tue, 18 Aug 2015 20:30:34 +0000","Hertfordshire – Volunteers break the record in this year’s Summer Reading Challenge – Hertfordshire County Council (press release). &#34;Youngsters across the county are volunteering their time to help libraries deliver this year’s Summer Reading Challenge. As many as 358 14-24 year olds have signed up to donate 12 hours of their time to the challenge. In total an impressive 441 people are volunteering this year – the largest amount ever recorded in the county. Additionally, more than 15,000 children have already signed up to take part in this year’s Record Breakers themed Summer Reading Challenge, which continues across the county until 5 September.  &#34;","2015/08/is-it-fine-to-fine.html"],["Southampton","Wed, 19 Aug 2015 22:37:08 +0000","Southampton – Five Southampton libraries cut in council funding vote – BBC. &#34;Five Southampton libraries are at risk of closing after councillors voted to stop running them from next year. The local authority’s cabinet made the decision on Tuesday evening in a bid to make an annual saving of £286,200.&#34; … &#34;The report recommends Bitterne Library, Central Library, Portswood Library, Woolston Library, Shirley Library and Lordshill Library remain open. But it says Burgess Road, Cobbett Road, Millbrook, Thornhill and Weston libraries should no longer be funded and managed by the council. Southampton’s mobile library service is also under threat.&#34; see also Five libraries to shut in Southampton – BookSeller.","2015/08/special-automatic-english-child-library-membership-no-not-really.html"],["Southampton","Wed, 19 Aug 2015 22:37:08 +0000","Southampton – Funding withdrawn for Cobbett & four other Southampton libraries from April 2016 – Bitterne Park Info. &#34;&#34;I will keep repeating this until I’m blue in the face: we are not closing libraries tonight. We are seeking to re-establish them as community run libraries. If they close it is because there is no capacity in the city to come forward and help run them,&#34; said Leader of Southampton City Council Simon Letts (Lab) at a cabinet meeting on Tuesday (Aug 18) which later unanimously passed a motion to withdraw council funding for five branches including Cobbett Road from April next year.&#34; … &#34;Speaking after the meeting, Kevin Lancashire, Friends of Cobbett Road Library chair, said that he thought the council hadn’t started from a position of looking at how to keep libraries open. It’s very frustrating that the arguments that we’ve put over the last 12 or 18 months have been virtually ignored&#34;","2015/08/special-automatic-english-child-library-membership-no-not-really.html"],["Fife","Sun, 23 Aug 2015 19:34:10 +0000","Fife – Could communities unwittingly undermine efforts to save libraries from closure? – Fife Today. &#34;Cllr Leslie – whose scrutiny committee last week examined in some detail the proposed changes to the library network in Fife – said: &#34;I’m concerned we’re asking people to talk about the closure of their library and talk about alternatives at the same time. &#34;Why would our communities want to talk about alternatives when they don’t want the facility to close in the first place? &#34;We should take a decision on the closures and then, if their library is to close, go back to the communities to give them the chance to discuss alternative provision.&#34;&#34;","2015/08/just-100k-volunteers-and-some-curious-stock-policies.html"],["Fife","Sun, 23 Aug 2015 19:34:10 +0000","Fife – Fife library closures will be a ‘looming catastrophe’ – Courier. &#34;Colinsburgh Library users’ group had been in talks in the past about voluntarily providing help, its chairman Peter Marshall called on Fife Cultural Trust and Fife Council to think again. It was better, he argued, to invest in libraries as &#34;to abandon libraries seems to me to be a policy of despair.&#34; Meanwhile, Youth MSP Lewis Akers called for Fifers to &#34;stand in solidarity&#34; against the &#34;looming catastrophe&#34;.&#34;","2015/08/just-100k-volunteers-and-some-curious-stock-policies.html"],["Herefordshire","Sun, 23 Aug 2015 19:34:10 +0000","Herefordshire – Anti-cuts campaign started over Leominster library – Shropshire Star. &#34;A consultation day on the proposals is being held in the Corn Square in Leominster on September 18, from 10am to 2pm, for residents to make their feelings known. Sue Lindsay, treasurer of Friends of Leominster Library, said a petition had already been started against any cuts. She said: &#34;We’ve got a big campaign going on in Leominster. We’ve had a stall in the market today and we will be having another one on September 18, right opposite the council’s consultation. &#34;We want to get the council’s consultation questionnaire into the hands of as many people as possible to fill it in so that they (Herefordshire Council members) are inundated.&#34;&#34;","2015/08/just-100k-volunteers-and-some-curious-stock-policies.html"],["Warwickshire","Sun, 23 Aug 2015 19:34:10 +0000","Warwickshire – Views can be expressed in Nuneaton library service survey – Nuneaton News. &#34;Throughout September and October, Warwickshire County Council’s Library and Information Service is finding out what people think of how things are run. Public Library User Surveys, known as PLUS, are to be carried out for a week at a time in each of the county’s libraries including the 12 community managed libraries and Nuneaton, Bedworth and Atherstone&#34;","2015/08/just-100k-volunteers-and-some-curious-stock-policies.html"],["Suffolk","Sun, 23 Aug 2015 19:34:10 +0000","Suffolk – Ed Sheeran reaffirms his love of reading as he bumps into library manager in Costa at Copdock – EADT. &#34;Ed was having a coffee with a friend on the edge of Ipswich when Suffolk Libraries general manager Alison Wheeler spotted him – she already knows his mother Imogen who was in Halesworth Library at the same time running a jewellery design workshop. The Thinking Out Loud hit-maker was happy to pose for a selfie with her – and said that reading and visiting his local libraries in Suffolk were very important to him when he was growing up.&#34;","2015/08/just-100k-volunteers-and-some-curious-stock-policies.html"],["Birmingham","Thu, 27 Aug 2015 20:08:39 +0000","Birmingham – Literacy campaigner hits out at cuts to Birmingham’s library service – Birmingham Post. &#34;One of Britain’s top literacy campaigners has spoken of his fears about the &#34;ongoing quality of library services&#34; in Birmingham after it emerged the city was no longer buying books. The Post reported last week that less than two years after the £189 million Library of Birmingham opened the city’s library service was asking for books to be donated due to cutbacks. The revelation prompted Nick Poole, chief executive of the Chartered Institute of Library and Information Professionals, to pen an open letter to council chief executive Mark Rogers.&#34;","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Fife","Thu, 27 Aug 2015 20:08:39 +0000","Fife – Community urged to lead library fight – Fife Today. &#34;Politicians involved in the campaign to save East Wemyss library from closure have called on the community to lead the fight. A meeting to encourage people to get involved was organised by Councillor John O’Brien last Wednesday, with speakers David Torrance MSP and Peter Grant MP. Addressing around 30 people – including community council members – who ventured out to the the Senior Citizens Hall on a rainy August night, Mr Torrance said: &#34;The town has already lost its bank, and even this hall could be under threat too, so this campaign needs to be driven by the people.&#34;","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Southampton","Thu, 27 Aug 2015 20:08:39 +0000","Southampton – Labour leaders plans to stop running six libraries in Southampton have been halted due to opposition from Tory councillors – Daily Echo. &#34;The Conservative opposition have called in the decision to stop running the six facilities for further scrutiny, saying there hasn’t been enough information provided about whether groups will come forward to run them. It means the plans must be halted until they are scrutinised again although Labour council chiefs have insisted they are &#34;confident&#34; groups will come forward to take on all five of the closure-threatened library buildings.&#34; see also Southampton library closures ‘halted’ – BookSeller.","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Caerphilly","Thu, 27 Aug 2015 20:08:39 +0000","Caerphilly – Changes made to library access across Caerphilly County Borough – Caerphilly Observer. &#34;From September 1, all library users must present their library card in order to use library services. Users must take their library card with them if they want to borrow, reserve or renew items, use ICT services, pay any charges or to access their account at the library or at home.&#34;","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Lincolnshire","Thu, 27 Aug 2015 20:08:39 +0000","Lincolnshire – Sutton on Sea leads the way in library changes – Louth Leader. &#34;Sutton on Sea Library has officially become one of the first in the county to open its doors under the running of volunteers. The library was taken over by the volunteers and went live on July 27, but the official launch of the newly taken over library and community hub took place just recently on August 13.&#34;","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Cumbria","Sun, 30 Aug 2015 18:54:19 +0000","Cumbria – Library service is unpredictable – Westmorland Gazette. &#34;Several weeks ago I went to Kendal Library and found it was unexpectedly closed ‘due to staff issues’. Recently I have been again and found another unscheduled closure. On investigating I find that random closure of libraries across the county has been happening for well over a year and is becoming increasingly frequent.&#34;","2015/08/amateurisation-mergings-post-offices-and-unstaffed-opening.html"],["Staffordshire","Sun, 30 Aug 2015 18:54:19 +0000","Staffordshire – Tamworth Library’s weekday opening hours could be reduced – Tamworth Herald. &#34;Library’s opening hours could be reduced as part of an ongoing consultation. If given the go-ahead, the Corporation Street-based library will close at 6pm Monday and Tuesday, and 5pm Wednesday to Friday.&#34;","2015/08/amateurisation-mergings-post-offices-and-unstaffed-opening.html"],["Dundee","Thu, 27 Aug 2015 20:08:39 +0000","Dundee – Dundee Library & Information Services a finalist at Scotland’s Dementia Awards 2015 – Dundee Libraries (press release). &#34;Dundee Library & Information Services, Leisure & Culture Dundee, hope to win a prestigious award after it was announced that their Dementia Information Service at Central Library has been short-listed as a finalist in the &#34;Best dementia friendly community initiative&#34; category at Scotland’s Dementia Awards 2015″. The winners will be announced at the awards ceremony, which will take place on Thursday 24 September 2015 at the Marriott Hotel in Glasgow, in celebration of World Alzheimer’s Day. Scotland’s Dementia Awards celebrate the work of both professionals and community groups who are committed to helping people with dementia and their families. The awards showcase the creativity, innovation and dedication that make a real difference to the daily lives of people with dementia and their families across Scotland when organisations, groups and teams work together. Central Library is the first publi&#8230;","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Isle of Wight","Thu, 27 Aug 2015 20:08:39 +0000","Isle of Wight – Libraries are not a luxury and the council should reconsider approach say Friends – On the Wight. Compares with Scottish investment in library cards for children. &#34;Ventnor has areas of deprivation and child poverty that have been exposed by the recent report published in the Joint Strategic Needs Assessment. That alone should trigger the Isle of Wight Council to reconsider its approach to the need for well run, fully staffed and adequately funded libraries. Libraries are not a luxury they are an essential part of a child’s development.&#34;","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Kent","Thu, 27 Aug 2015 20:08:39 +0000","Kent – More Kent libraries fail to provide WiFi wireless internet access than anywhere else in the country – Kent Online. &#34;More libraries in Kent are failing to provide wireless internet access than anywhere else in the country. According to a government survey, 65 of the county’s 99 libraries do not offer WiFi. It follows a warning from ministers that the lack of WiFi could fuel their alarming decline … After Kent, the next worst-hit areas are Cumbria with 46, Durham with 33, Lincolnshire with 31 and Northumberland with 30. In contrast, libraries in 26 of London’s 32 boroughs all have WiFi.&#34; … &#34;Bradford, Leeds, Leicester, Liverpool, Manchester and Stoke all boast 100 per cent coverage in their libraries.&#34; see also West one of the worst regions for public libraries with no WiFi fuelling their alarming decline – Western Daily Press.","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Carillion","Sun, 30 Aug 2015 18:54:19 +0000","Carillion – Lego – Facebook. &#34;First libraries in the UK to be working with LEGO Education; bringing LEGO to our libraries #LegoLibraries. Introducing new, exciting LEGO resources such as StoryStarter, MoreToMaths, WeDo, and Machines and Mechanisms for ages 8+. Highlights of our LEGO Library launch events. Managed by Cultural Community Solutions on behalf of Croydon, Ealing, Harrow and Hounslow Councils in partnership with LEGO Education.&#34;","2015/08/amateurisation-mergings-post-offices-and-unstaffed-opening.html"],["Haringey","Sun, 30 Aug 2015 18:54:19 +0000","Haringey – News Update and Rally – Change. &#34;Despite voicing reservations about taking a legal route in order to get the Council to listen to us David Lammy has signed our pro bono application and we have now sent it to the Bar Pro Bono Unit. This Unit is a charity which helps organisations to find free legal assistance from volunteer barristers. It is doubtful that they will be able to respond before the MGL is closed on Sunday 30th August but that does not mean we cannot launch a legal challenge to what they are doing.&#34;","2015/08/amateurisation-mergings-post-offices-and-unstaffed-opening.html"],["Herefordshire","Thu, 27 Aug 2015 20:08:39 +0000","Herefordshire – Library campaign goes to the streets in Leominster – Hereford Times. &#34;Campaigners who want to keep a library in Leominster took to the streets last week to obtain more than 400 signatures on a petition. A group of teenagers taking part in the National Citizen Service (NCS) Engage4Life programme set up a stall in the Corn Square as part of their social action project.&#34; … &#34;Meanwhile, the Friends of Leominster Library is encouraging people to fill in the council’s questionnaire and sign an e-petition calling for the plans to be halted. &#34;","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Knowsley","Thu, 27 Aug 2015 20:08:39 +0000","Knowsley – Knowsley library cutbacks: shorter opening hours begin today – Liverpool Echo. &#34;All five Knowsley libraries will shut on Wednesdays and open an hour later from today under cost-cutting plans. Knowsley council announced earlier this month that libraries in Halewood, Huyton, Kirkby, Prescot and Stockbridge Village would see their opening hours cut by at least 12 hours a week. Every library now opens at 10am from Monday to Friday and will be closed all-day on Wednesdays, as the council tries to meet its £31m budget deficit following cuts in central government funding.&#34; … &#34;&#34;We held a consultation and received more than 600 responses which helped inform the new hours. It is important to note we are not closing any libraries in Knowsley.&#34;&#34;","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Shropshire","Thu, 27 Aug 2015 20:08:39 +0000","Shropshire – Action group formed to safeguard Ellesmere Library – Shropshire Star. &#34;The newly-formed Friends of Ellesmere Library group has promised to fight for &#34;firm guarantees&#34; that a library service will be retained in the town and will continue to be run by professionally trained staff.&#34; … &#34;According to Shropshire Council, user numbers at the library have fallen from 25,275 in 2010/11 to 23,853 in 2014/15. The library now has fewer than 500 users a week and a total of 998 active borrowers.&#34;","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Liverpool","Thu, 27 Aug 2015 20:08:39 +0000","Liverpool – Former Hillsborough Independent Panel civil servant on mission to save Liverpool’s libraries – Echo. &#34;Jan Parry will lead the task-force charged with working out how the city’s libraries will be funded in the future. Mrs Parry said: &#34;This is about making sure we have got a Liverpool library service for the future. We will listen to people’s ideas then come up with recommendations. &#34;We need libraries. Perhaps not for the traditional services we think of because libraries have to change, they have to offer different things and become community spaces or hubs. They are not just houses full of books.&#34;","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Cornwall","Sun, 30 Aug 2015 18:54:19 +0000","Cornwall – Bid to save Lostwithiel library from closure – Cornish Guardian. &#34;Lostwithiel’s library could be saved by moving it into the community centre where it will be run by volunteers. A town council working party believes it is the best option for safeguarding the book-lending service and the Lostwithiel Community Association is willing to discuss the move with Cornwall Council officials. If both sides agree to the venture, a charitable trust will be set up to oversee the management of community-led library service in Lostwithiel. Cornwall Council is intending to make savings of £1.8 million from the existing £4 million library and One Stop Shop budget, and has urged town and parish councils or other local organisations to express an interest in managing local libraries.&#34;","2015/08/amateurisation-mergings-post-offices-and-unstaffed-opening.html"],["North East Lincolnshire","Sun, 30 Aug 2015 18:54:19 +0000","North East Lincolnshire – Library reopening will be new chapter for community – Grimsby Telegraph. &#34;The opening comes after the village lost its library late last year, when it and others across North East Lincolnshire were closed as part of a £500,000 cost-cutting programme  … &#34;As planned previously, the library will be run by the Grimsby charity Foresight, which is based in Freeman Street and runs a series of luncheon clubs across the borough, including at Scartho. Foresight older persons co-ordinator Lynne Smith says the aim is to have the library open &#34;as early in September as possible.&#34; … &#34;By January, the charity had 30 volunteers, mainly elderly, ready to run it. Some have since dropped out, leaving Foresight seeking replacements&#34;","2015/08/amateurisation-mergings-post-offices-and-unstaffed-opening.html"],["Manchester","Thu, 27 Aug 2015 20:08:39 +0000","Manchester – Elbow singer Guy Garvey to lead special day of events at Manchester Central Library – Manchester Evening News. &#34;The internationally renowned musician will be broadcasting his BBC 6 music radio show, ‘Finest Hour’, live from the event on the day and sharing some of his favourite songs for listeners from 2pm-4pm. Guy will be joined on the show by guests including Radiohead’s Phil Selway and New Order’s Stephen Morris, to discuss the literary influences that have inspired their work. During the show, Phil Selway will present Central Library with a special drum kit, in memory of Radiohead’s late drum technician Scott Johnson.&#34;","2015/08/national-libraries-day-scots-kids-cards-and-batman.html"],["Brighton and Hove","Sun, 30 Aug 2015 18:54:19 +0000","Brighton and Hove – Book worms to be allowed to use libraries unsupervised and out of hours – Argus. &#34;bookworms who successfully apply for an enhanced library card at Woodingdean or Portslade library will be able to use services by themselves at times when the library would ordinarily be closed. The card will allow residents to meet friends and family at the library, browse and read books, borrow and return books, CDs and DVDs through self-service machines and use computers and printers. They will be monitored by CCTV and a live audio feed with library support staff on hand via a helpline. An emergency phone line to security staff will also be set-up. &#34; … &#34;bookworms who successfully apply for an enhanced library card at Woodingdean or Portslade library will be able to use services by themselves at times when the library would ordinarily be closed. The card will allow residents to meet friends and family at the library, browse and read books, borrow and return books, CDs and DVDs through self-service machines and use comput&#8230;","2015/08/amateurisation-mergings-post-offices-and-unstaffed-opening.html"],["Southampton","Sun, 30 Aug 2015 18:54:19 +0000","Southampton – Council consultation on libraries’ closure was not fair – Southern Daily Echo. &#34;The council maintains that the majority of respondents to the public consultation supported its preferred option (closing five libraries) yet respondents were given no option to maintain all or even most of the city libraries. They could choose between five or more closures&#34;","2015/08/amateurisation-mergings-post-offices-and-unstaffed-opening.html"],["Devon","Sun, 30 Aug 2015 18:54:19 +0000","Devon – Community celebrates Ashburton Post Office and library opening – Torquay Herald Express. &#34;Stuart and Jackie Rogers, who own and operate Ashburton Post Office, volunteered to house the library when Devon County Council was looking for innovative ways to work with local communities to improve library services.&#34; … &#34;Ashburton Post Office and library now open Monday to Saturday 8.30am to 5.30pm. Previously the library was open 18 hours a week and now it is open 54 hours a week. The library is still professionally run by paid Devon County Council staff and supported by a team of library volunteers.&#34; [The article claims this is the first combined library / post office – this is untrue: there are examples of this also in Buckinghamshire and Suffolk – Ed.]","2015/08/amateurisation-mergings-post-offices-and-unstaffed-opening.html"],["Fife","Sun, 30 Aug 2015 18:54:19 +0000","Fife – Save our libraries – Scotsman. &#34;Fife. Its Cultural Trust – an arm’s-length body, a company limited by guarantee with charitable status – proposes to save £800,000 by closing 16 libraries and introduce an ill-defined &#34;hub and spoke&#34; model throughout the region. Some of the proposed closures are in villages such as Crail and Freuchie where there are no other council facilities; some are in areas of deprivation such as Abbeyview in Dunfermline and part of the west of Glenrothes.&#34;","2015/08/amateurisation-mergings-post-offices-and-unstaffed-opening.html"],["Lincolnshire","Sun, 30 Aug 2015 18:54:19 +0000","Lincolnshire – ‘Even those who declared loyalty to Stalin kept their libraries open, so why not Lincolnshire’ – Lincolnshire Echo. &#34;as we’re currently witnessing, local Conservative councillors do actually seem rather proud of perpetrating a fully fledged assault on the service. Truth be told, Lincolnshire County Council’s desire to rid itself of its statutory responsibility to provide a properly funded and comprehensive library service has been pursued with a zeal that can perhaps best be equated with Simon Cowell’s determination, pursued over many years, to destroy the British music industry.&#34;","2015/08/amateurisation-mergings-post-offices-and-unstaffed-opening.html"],["Southend","Sun, 30 Aug 2015 18:54:19 +0000","Southend – Shoeburyness Library to open next month as two libraries merge – Enquirer. &#34;A new chapter will be turned for the library service in Shoebury on 14 September as Thorpedene and Friars libraries merge into Shoeburyness Library in Delaware Road. Along with longer opening hours, the new library will have improved facilities including a café, free WiFi and lift access. Cllr Ian Gilbert, Deputy Leader of the Council, said: &#34;The opening of the new library is brilliant news for the town.&#34;","2015/08/amateurisation-mergings-post-offices-and-unstaffed-opening.html"]]