[["Aberdeenshire","Sun, 07 Aug 2016 18:28:53 +0000","Aberdeenshire – Pokemon Go game pulls youngsters to north-east libraries – Press and Journal. &#34;North-east librarians have revealed their delight that the Pokemon Go craze which has swept the world is now luring youngsters back to books.&#34; … &#34;Our doors are open to children and adults alike and we’re inviting anyone who wants to use our free wifi to catch a Pokemon or two to visit&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Vale of Glamorgan","Sun, 07 Aug 2016 18:28:53 +0000","Vale of Glamorgan – Community group officially takes over running of Sully Library – Penarth Times. &#34;Sully Library was officially handed over to the Sully and Lavernock Community Library Trust on Wednesday, July 27. Sully is the first of the five planned library handovers from Vale of Glamorgan Council control. The other four libraries which are still to be officially handed over are Dinas Powys, Wenvoe, St Athan and Rhoose. The Vale cabinet agreed in February to the establishment of community libraries which is estimated to save the council more than £500,000.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Angus","Sun, 07 Aug 2016 18:28:53 +0000","Angus – Tesco Bank prove ‘every little helps’ at Forfar Library – Forfar Dispatch. &#34;Run by national charity The Reading Agency in partnership with Scotland’s libraries and Tesco Bank, the Tesco Bank Summer Reading Challenge Scotland encourages children to read six books during the summer holidays, a time when children’s literacy skills traditionally dip&#34; … &#34;With a grant available to libraries taking part in the challenge, Angus Libraries put the funding towards a number of activities, including Zoolab, which are designed to inspire children and show them just how much fun reading can be. &#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Buckinghamshire","Sun, 07 Aug 2016 18:28:53 +0000","Buckinghamshire – Bucks Libraries Could Go It AloneTo Save Millions – Mix 96. &#34;Bucks County Council reckons the library service needs to save £1 million  by 2019, that’s despite saving £2 million in the last five years. The total library budget has dropped from £7 million to £5 million, which has been done by re-structuring staff, new systems, self-service technology and creating new community library partnerships. But the council foresee a problem in the future, they think the library service is likely to face significant financial challenge and will need to save at least £1 million by 2019. &#34; 3 possibilities: Re-modelled in-house option, Spin Out, Outsource.","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Northern Ireland","Sun, 07 Aug 2016 18:28:53 +0000","Northern Ireland –  Hands Off Our Libraries campaign ‘celebrating victory’ – Newtownabbey Times. &#34;Minister for Communities Paul Givan announced that extra funds have been found to prevent cuts to opening hours at 14 branches, including Glengormley. The campaign organised a day of action on Saturday, June 25, supported by Unite the Union, which saw protests and campaigning at all the libraries under threat. The campaign also picketed Minister Givan’s constituency office in Lisburn and delivered thousands of petitions against the cuts to the Department of Communities&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Stockton","Sun, 07 Aug 2016 18:28:53 +0000","Stockton – Fairfield Library could be saved from the axe thanks to new co-location plan – Gazette Live. &#34;Fairfield Library has been the subject of much debate over the last few months after plans were revealed to close it. Closing the library would save Stockton Council £77,000 a year – but the plan to axe it was met with strong opposition from its members. Now Labour councillor Carol Clark has teamed up with Cabinet members in an attempt to preserve the library’s presence in Fairfield by incorporating nursery provision.&#34; … &#34;A petition set up by supporters of the library gained over 3,000 signatures, and was presented to council last month&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Brighton","Sun, 07 Aug 2016 18:28:53 +0000","Brighton – Geoffrey Theobald: Improved library services and a new attraction for the city – Brighton and Hove Independent. &#34;In terms of the new Libraries Extra service, simply by upgrading to a free Libraries Extra Membership Card, residents will now be able to use their local community library, even outside of staffed hours. This will mean that most libraries will now be available seven days a week, more than doubling the amount of opening hours across the city from 362 to 768 hours per week.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Lancashire","Sun, 07 Aug 2016 18:28:53 +0000","Lancashire – Calls to extend library and children centre consultation in Lancashire – 2BR. &#34;The elderly generation is being excluded from consultations about the future of Lancashire’s services. That’s according to a Whalley Borough Councillor who wants locals to be given more time to have their say on proposals to close a number of buildings across the county. Ged Mirfin, who represents the Billington and Old Langho Ward, says the online nature of consultations excludes a large portion of the population who aren’t web-savvy.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Brighton","Sun, 07 Aug 2016 18:28:53 +0000","Brighton – Historic Hove library now open seven days a week just weeks after closure plan averted – Argus. &#34;Hove library is now open seven days a week – two months after it was saved from closure and being sold into private hands. The Carnegie library building in Church Road, Hove, is now open and staffed on Monday mornings and Sundays. Ten out of the city’s 12 branch libraries will also open for longer and and three-quarters for seven days a week under the council’s Libraries Extra scheme which will allow readers to pick up books even when there are no staff.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Lambeth","Sun, 07 Aug 2016 18:28:53 +0000","Lambeth – Lambeth Council denounce library protest ‘mob’ throwing plastic eyes to chants of ‘we’re watching you’ – SW Londoner. &#34;A campaigner described the spat as ‘childish’ but today Lambeth Council suggested police could be involved in future meetings as tensions between library protestors and councillors hit an all-time low.&#34; … &#34;There have been incidents of glitter being thrown directly into a council officer’s face, plastic eyes being thrown at councillors with intimidating chants of ‘we’re watching you’ and repeated abusive and threatening language.&#34; The meeting in May was abandoned but protestors say it was the councillors who refused to engage with protestors who had been denied the opportunity to bring a deputation (a form of public lobbying made by groups with concerns to present to the council).&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Lancashire","Sun, 07 Aug 2016 18:28:53 +0000","Lancashire – Rossendale Scribbler: Small cost of keeping libraries open should shock us all – Rossendale Free Press. &#34;what is the price of giving children access to the knowledge and information they need to get on in life? When it comes to our local libraries currently at risk – around £60,000 a year. The recent revelation in the Rossendale Free Press that closing several of our local libraries will save such small amounts of money should shock us all. Up until now, Lancashire County Council has focused its public defence of its cuts on the scale of the overall savings it needs to find. Between now and 2021, it needs to save around £221m, an eyewatering figure in anyone’s books – and that’s on top of the tens of millions of pounds LCC has already saved.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Norfolk","Sun, 07 Aug 2016 18:28:53 +0000","Norfolk – Library workshops help children entering Write on Norfolk creative writing competition – Eastern Daily Press. &#34;A fairy detective agency solving a crime at Norwich Cathedral, and a pair of cheeky otters living on the Broads, were just two of the ideas at the first creative story writing workshop for children entering the Write on Norfolk competition.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Northern Ireland","Sun, 07 Aug 2016 18:28:53 +0000","Northern Ireland – Libraries to avoid cuts to opening hours with extra £225k funding – BBC. &#34;Under proposals made in May, some libraries were set to close for an extra day every week. A public consultation on the plan received more than 8,000 responses. But, the Department for Communities has said that the public library service, Libraries NI, will receive £225,000 to help avoid curbs on opening hours. Communities Minister Paul Givan said the money was allocated to his department in a reallocation of government funds in June.  He said the views of the public had &#34;been clearly heard&#34;.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Suffolk","Sun, 07 Aug 2016 18:28:53 +0000","Suffolk – Suffolk Libraries chief recalls letter received from Roald Dahl 30 years ago – Ipswich Star. &#34;When Alison Wheeler was a librarian at Chantry library 30 years ago, she sent a letter with the summer reading club kids to Roald Dahl as it was BFG themes.Now with this year’s reading challenge also BFG themed, Alison has found the letter.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Wandsworth","Sun, 07 Aug 2016 18:28:53 +0000","Wandsworth – Wandsworth bucks London’s library closure trend with three branch rebuilds and expanding services – Wandsworth Council. &#34;A new report explores how Wandsworth has managed to keep its entire local library network fully open while delivering a wide range of service improvements and branch upgrades. The paper, which was discussed by the council’s community services committee, shows that all 11 branches have gone from strength to strength since 2013 when the day-to-day management was outsourced to charitable social enterprise Greenwich Leisure Ltd (GLL) following a competitive tendering exercise.&#34;. Coping with £300k cut in budget per year. &#34;Work has now started on a brand new Wandsworth Town centre library on Garratt Lane and the council is also developing plans to replace another two existing branches, York Gardens and Roehampton, with new state of the art buildings offering a wide range of modern services&#34; … &#34;The report goes on to say that in 2014/15, the last year for which comparative statistics are ava&#8230;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Warrington","Sun, 07 Aug 2016 18:28:53 +0000","Warrington – LiveWire introduce new library management system – Livewire (publicity email). &#34;LiveWire will introduce a new library management system at all of its libraries this month which will enable members to access more services online. The new system is called Koha which means ‘gift’ in Maori. It will offer an improved service to both staff and customers with a more intuitive interface and the ability for staff to access the system outside of libraries at community events. One of the key benefits to the public will be that from the launch date any future items library users borrow will be recorded so they can view their own borrowing history both in libraries and at home&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Derby","Sun, 07 Aug 2016 18:28:53 +0000","Derby – Anger as Derby plans to hand over most of city’s libraries to volunteers – Guardian. &#34;Campaigners condemn strategy to retain four council-run branches, but pass the other 11 to voluntary operations&#34; … &#34;The council, which will open a consultation on the proposals in the autumn, has admitted that there would be &#34;a significant reduction in the number of paid jobs&#34; in the city’s libraries as a result of the cost-cutting, and that &#34;if enough volunteers don’t come forward to run a particular library, that library would close&#34;. The grants, meanwhile, would not be sufficient to cover running costs, and &#34;management groups would need to supplement their council grant by fundraising activities or generating some income from other sources&#34;.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Lancashire","Sun, 07 Aug 2016 18:28:53 +0000","Lancashire – Teenage pop sensation Grace the latest library guest – North West Evening Mail. &#34;As part of the Get It Loud In Libraries programme, the BBC Radio 1 and Radio 2 playlisted singer-songwriter will play Kendal Library on Tuesday October 4.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Derby","Sun, 07 Aug 2016 18:28:53 +0000","Derby – Petition launched to keep Allestree Library open – Derby Telegraph. &#34;A petition has been launched to keep Allestree Library open. It is one of 11 libraries in Derby which would either be handed over to the community or closed under plans aimed at saving the city council cash.&#34; … &#34;Their methodology in identifying which libraries should remain open is fundamentally flawed and is seeing decisions being made according to deprivation stats rather than usage, on which point Allestree being one of the most used libraries outside of the city centre. Everyone should have access to a library and none should be facing closure.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Herefordshire","Sun, 07 Aug 2016 18:28:53 +0000","Herefordshire – Library users and supporters urged to fill in survey to help safeguard ‘jewel in the crown’ of Leominster – Hereford Times. &#34;Library users and supporters in Leominster have been urged to complete a questionnaire to avoid losing a ‘jewel in the crown’ of the town. Herefordshire Council‘s customer services and library survey runs until Friday (August 5), with feedback from the consultation to be used to help shape how the services will operate in the future. The Friends of Leominster Library (FOLL) held a stand at last Friday’s market where they handed out 150 questionnaires to people in a bid to revive interest in safeguarding the town’s library.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["North Somerset","Sun, 07 Aug 2016 18:28:53 +0000","North Somerset – Older, fewer and ‘overworked’ – Weston’s library books – Mercury series. &#34;The library buys fewer new books than all but one library in England, and the situation is expected to get worse if it does not receive additional funding. Data from the Chartered Institute of Public Finance and Accountancy shows Weston’s books are issued around 5.8 times a year, compared to the England average of 3.3 times. The library buys 57.9 books per 1,000 people every year. The England average is 145 books per 1,000 people. Figures show the library also has the lowest quantity of books, at 844 per 1,000 people, compared to 1,452 per 1,000 people across England. Books in Weston are generally 10.9 years old, compared to the England average of 8.7 years.&#34;.  Population increases while budget stays same.","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["West Berkshire","Sun, 07 Aug 2016 18:28:53 +0000","West Berkshire – Theale Library: parish councillors question West Berkshire’s figures – Get Reading. &#34;Parish councillors in Theale will be making Freedom of Information requests for the costs incurred in building and running the library&#34; … &#34;After originally planning to shut all the branch libraries in the district, West Berkshire Council settled on a plan earlier this year to close Theale and Wash Common libraries and reduce the mobile library fleet to one. Then the council launched an independent review being run by library service experts Red Quadrant which will report at the end of August. Theale parish councillors who attended a meeting with Red Quadrant said they felt &#34;more positive&#34; about the future of the library.&#34;","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["York","Sun, 07 Aug 2016 18:28:53 +0000","York – Plans for new community hub at Burnholme – Minster FM. &#34;Residents and businesses in the Tang Hall area of the city will get chance to have their say on proposals for a new community hub, including a new library, on the site of the former Burnholme School from this week.&#34; … proposals include &#34;Development of an Explore library learning centre and café.&#34; see also Have your say on new library and care home – The Press.","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Northumberland","Sun, 07 Aug 2016 18:28:53 +0000","Northumberland – ‘Not fit for purpose’ – backlash over a Northumberland town’s library move – Chronicle.","2016/08/the-quietest-of-times-the-busiest-of-times.html"],["Darlington","Wed, 10 Aug 2016 20:11:07 +0000","Darlington – Planning application is in to move library from Crown Street to Dolphin Centre in Darlington – Northern Echo. &#34;The contentious closure of Darlington’s Crown Street Library has moved a step closer with the official submission of planning proposals. Planning applications have been submitted detailing the proposed relocation of existing library services from Crown Street Library to the Dolphin Centre. The move to the leisure centre will result in the strongly opposed closure of the historic Crown Street building, which will eventually be put on the market. Darlington Borough Council’s plans to move library services from the Grade II listed library to the nearby leisure centre were outlined earlier this year as part of a programme of dramatic budget cuts.&#34;","2016/08/leading-the-way-reading-dogs-in-public-libraries.html"],["Sheffield","Wed, 10 Aug 2016 20:11:07 +0000","Sheffield – Kind of Library – Star (Letters). &#34;If public libraries are allowed to close, not only will it be a loss of books to borrow but a whole concept of life such as the reference library, the manuscripts, the science department, the classics, the list goes on. Public libraries are an important part of the community, giving everyone the opportunity to improve their knowledge if they so wish.I am an avid library user and enjoy every visit. As Jorge Luis Borges said, &#34;I have always imagined that paradise will be a kind of library.&#34;","2016/08/leading-the-way-reading-dogs-in-public-libraries.html"],["West Berkshire","Wed, 10 Aug 2016 20:11:07 +0000","West Berkshire – Key report on future of libraries will be made public – Newbury Today. &#34;The council is proposing to close Theale and Wash Common libraries and pass the responsibility of others on to volunteers as part of its plan to save £17.5m this year. However, the council was advised by the Department of Culture, Media and Sport that it should first carry out an independent needs assessment to determine the impact. The assessment has now concluded and the findings will be reported back to the council by the end of August. Officers will then work on a set of proposals based on those findings, which will be available on the council’s website.&#34;","2016/08/leading-the-way-reading-dogs-in-public-libraries.html"],["Devon","Wed, 10 Aug 2016 20:11:07 +0000","Devon – Happy ending as hopes for new Ottery St Mary library set to become a reality – Sidmouth Herald. &#34;The town council spent £134,000 on the former NatWest Bank in September as a site for a new library, tourist information centre and public toilets, but renovation work has yet to begin. Speaking at a town council meeting on Monday, Mayor Glyn Dobson revealed lease terms have finally been agreed with Libraries Unlimited – an organisation that will be running the facility. He said: &#34;Devon County Council has given Libraries Unlimited a sum of money to cover Ottery, but this leaves a shortfall. When they have done the building it will be greatly improved, which benefits the town. It is whether we are prepared to help pay for the shortfall.&#34; … &#34;It was agreed that if Libraries Unlimited is unable to meet any shortfall in funding, the town council would help.&#34;","2016/08/leading-the-way-reading-dogs-in-public-libraries.html"],["Lancashire","Wed, 10 Aug 2016 20:11:07 +0000","Lancashire – Backlash over child centres – Blackpool Gazette. &#34;She also says the site is too small and insists Lancashire County Council should look at putting more services into closure-threatened libraries instead.  Coun Kay has previously spoken about her concerns to shut library branches in Thornton and Cleveleys&#34;. Cllr Kay says &#34;&#34;I am concerned that Lancashire County Council is proposing to close Thornton and Cleveleys libraries and that the community have been working hard to try to save them both.&#34;","2016/08/leading-the-way-reading-dogs-in-public-libraries.html"],["Southampton","Wed, 10 Aug 2016 20:11:07 +0000","Southampton – See inside new Woolston Library in Southampton – Southern Daily Echo. &#34;Woolston Library will reopen today at its new location in Victoria Road in the emerging Centenary Quay complex. Meanwhile, the former library in Portsmouth Road could be turned into flats if plans are approved by the city council. The new library is part of the £500million plans to redevelop the former Vosper Thornycroft site which will eventually see 1,600 homes built there. Based at the junction of Victoria Road and John Thornycroft Road, it will host an opening day event from 10am.&#34; … &#34;The reopening of Woolston Library comes as five other libraries transferred to community management after the council cut their funding. Weston Library has now reopened in 68 Weston Lane, while Millbrook Library is now open in its new location at the Pickles Coppice Children’s Centre in Windermere Avenue. Cobbett Road and Thornhill libraries have also reopened under new management, but Burgess Road is still unable to open due to &#34;complications with th&#8230;","2016/08/leading-the-way-reading-dogs-in-public-libraries.html"],["Lancashire","Wed, 10 Aug 2016 20:11:07 +0000","Lancashire – A gateway to knowledge – Lancashire Evening Pos / Letters. &#34;Libraries are about freedom.  Freedom to read, freedom of ideas, freedom of communication. They are places where you go to explore, interact and imagine. They are about education for life, about entertainment and about access to information. There is much misunderstanding about what is the purpose of libraries today.&#34;","2016/08/leading-the-way-reading-dogs-in-public-libraries.html"],["Lancashire","Wed, 10 Aug 2016 20:11:07 +0000","Lancashire – Last push to save Fulwood Library – Blog Preston. &#34;Two ongoing petitions have been created by regular library goers in a final campaign to prevent the closure of Fulwood Library. Lancashire County Council (LCC) has announced the possible closure of 40 libraries across Lancashire and Fulwood Library, in Garstang Road, is the only one to face shutting in Preston. The campaign comes from a group of regular Fulwood Library goers who have devised an online and paper petition against the threat in attempt to gain as many signatures as possible. The e-petition on the LCC website has 163 signatures and the paper petition has over 3500 signatures, which will be handed over on Wednesday 10 July at 4.30pm along with letters received. Last year the library had a total of 47,980 visitors according to the Freedom of Information Act (FOI).&#34;","2016/08/leading-the-way-reading-dogs-in-public-libraries.html"],["Northern Ireland","Wed, 10 Aug 2016 20:11:07 +0000","Northern Ireland – Northern Ireland library cuts scrapped – BookSeller. &#34;Libraries NI u-turned on the plans, revealed in May in wake of budget cuts, after an extra £225,000 was reportedly &#34;found to ward off the threat&#34;, according to Belfast Live. The proposals, under which some libraries stood to close for up to an extra day every week, attracted more than 8,000 responses opposing the plans as part of the Libraries NI consultation&#34;","2016/08/leading-the-way-reading-dogs-in-public-libraries.html"],["Southampton","Wed, 10 Aug 2016 20:11:07 +0000","Southampton – Bitterne Parker: Rónán O’Beirne – Bitterne Park Info. &#34;I am passionate about libraries and the ways in which they support people at the various stages of their lives. I am also passionate about providing everyone with the opportunity to learn. In fact, putting these two together, what I’m most passionate about is getting libraries to support learning. I wrote a book about this and my book tours took me to far-flung places like Belgrade, Melbourne and Sydney, where audiences were aghast at the senseless closure of public libraries in the UK – you should be, too! I am, of course, one of the many Friends of Cobbett Road Library, and would encourage people to use this precious facility.&#34;","2016/08/leading-the-way-reading-dogs-in-public-libraries.html"],["Barnet","Sun, 21 Aug 2016 17:58:31 +0000","Barnet – Digital Garage for small businesses – Barnet Council. &#34;Digital capability is a big issue for small businesses in the UK. Barnet libraries is opening a free, pop-up service to help improve digital skills which will save time, increase turnover and cultivate customers. Using the Google Digital Garage online learning platform, individuals can choose from over 23 different topics ranging from creating a website to learning about Google Analytics.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["North Yorkshire","Sun, 21 Aug 2016 17:58:31 +0000","North Yorkshire – Bilton and Woodfield Community Library animation workshops a huge success – Harrogate News. &#34;Young people created their own animations, which were inspired by the writing of Roald Dahl. The workshops are being delivered as part of North Yorkshire’s Creative Residencies Artists into Libraries project, funded by Arts Council England.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["York","Sun, 21 Aug 2016 17:58:31 +0000","York – Libraries announce embroidery workshops – York Press. &#34;Textile artist Janet Browne will be at the Bilton and Woodfield Community Library and Stokesley Library, to help people make artwork which will later be exhibited at the library It is an opportunity for anyone who would like to develop their sewing machine skills or learn something bright and eye-catching.  County Councillor Chris Metcalfe, North Yorkshire County Council’s executive member for Library and Information Services, said: &#34;These workshops run under the Creative Residences programme help libraries to be seen as the hub of their communities and give people a chance to enhance their creativity.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Blaenau Gwent","Sun, 21 Aug 2016 17:58:31 +0000","Blaenau Gwent – Staff celebrate Ebbw Vale library renovation as visitors flock to use services – South Wales Argus. &#34;The newly renovated Ebbw Vale library has received more than 500 visitors per day on average during its first week, with people of all ages accessing a number of services. The new-look was helped with a Welsh Government museum and libraries grant as well as money from the Welsh European Funding Office Convergence Programme. Since re-opening, visitors have been accessing services including book loans, job clubs and computer and internet access while families and children have been taking advantage of several schemes.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Lancashire","Sun, 21 Aug 2016 17:58:31 +0000","Lancashire – Anxious wait as future of libraries is decided – Blackpool Guardian. After consultation, council is deciding fate of libraries &#34;County Councillor David Borrow, deputy leader for Lancashire County Council, said: &#34;This is a difficult process for everyone involved but the ongoing cuts in central government funding combined with rising demand for some of our services means we have no choice but to make changes to the way we deliver them.&#34; [So it’s not looking good then – Ed.]","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Lewisham","Sun, 21 Aug 2016 17:58:31 +0000","Lewisham – Protest planned over Lewisham library cuts – BookSeller. &#34;Library campaigners plan to gather this Saturday (20th August) to protest the £1m cuts to Lewisham Council’s library budget, which will see staff removed from four libraries across the borough. Under current plans, Forest Hill, Catford, Torridon Rd and Manor House libraries will lose staff as the council is looking to hand over responsibility for the libraries to community organisations. The council says it has to make budget cuts of £45m over the next two years and closing the libraries and cutting staff would save around £1m. However, the Save Lewisham Libraries campaign group believes that the cuts could be &#34;easily reversed&#34; by using a &#34;small percentage&#34; of the council’s reserves.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Lincolnshire","Sun, 21 Aug 2016 17:58:31 +0000","Lincolnshire – Library looking for more helpers – Market Rasen Mail. Caistor volunteer library is running out of volunteers.","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Surrey","Sun, 21 Aug 2016 17:58:31 +0000","Surrey – Surrey County Council to slash library opening hours by 7 per cent – Surrey Mirror. £250k cut: 7% cut to opening hours (9.30am rather than 9am opening in many).","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Torbay","Sun, 21 Aug 2016 17:58:31 +0000","Torbay – Fears over future of Torbay libraries – Herald Express. Libraries Unlimited (Devon) in talks with Torbay over taking over borough library service: volunteers and job losses feared.","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Bradford","Sun, 21 Aug 2016 17:58:31 +0000","Bradford – Bradford gets set to celebrate National Poetry day with inclusive film – Bradford Review. &#34;Bradford Libraries are teaming up with Bradford City of Film to make a film for National Poetry Day. The film will celebrate poetry and will feature people of Bradford reading poems – either one they have written themselves or their favourite poem by another poet. Anyone can be in the film and we have people of all ages reading poems in different languages. The Lord Mayor of Bradford, Councillor Geoff Reid, will be reading a poem. The film will feature each person reading a section of a larger poem or all of a short poem. Filming will take place in City Hall on 12th September and participants will be encouraged to dress up and bring props. Steve O’Connor, a performance poet and tutor of Bradford libraries Creative Writing Course, will be on hand to offer performance advice to those who need it. The film will be shown on the big screen in City Park on National Poetry Day and online.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Carillion","Sun, 21 Aug 2016 17:58:31 +0000","Carillion – Lego libraries a year on – Libraries Taskforce. &#34;A year into our work with Lego Education, the regular workshops that we have delivered in the libraries CCS (Cultural Community Solutions) manage across the London boroughs of Croydon, Ealing, Harrow and Hounslow, have attracted 854 children, all aged 8 years and over. It’s been great to see young people visiting our libraries to enjoy something different, but we’ve been surprised that 70% of those taking part have been boys – it seems that the winning combination of Lego, team-building and coding is fast becoming a favourite pastime&#34;. Involved in First Lego Junior League. 25 staff received one full day training rom Lego,","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["North Yorkshire","Sun, 21 Aug 2016 17:58:31 +0000","North Yorkshire – How 2 North Yorkshire towns are helping to save their libraries – Press. &#34;Volunteers in two North Yorkshire towns are steaming ahead with their plans to take over the running of their libraries. Twenty more community-managed libraries are planned across North Yorkshire, as the county council cuts funding to meet its savings targets.&#34; Norton and Sherburn-in-Elmet. &#34;In Norton, they have plans for new facilities including a kitchen which would allow them to run a cafe in the future, and with the nearby Brooklyn youth centre set to close soon volunteers and county councillor Elizabeth Shields are keen to make sure there is space for young people in the new community hub at the library. &#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Powys","Sun, 21 Aug 2016 17:58:31 +0000","Powys – Powys Library Research Service Hits Top Three for Use in UK – Business News Wales. &#34;Latest figures released by the Publishers Licensing Society showed the library service was the third highest performing service during July for people using Access to Research, ahead of Aberdeen City, Worcestershire and Kensington and Chelsea.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Swansea","Sun, 21 Aug 2016 17:58:31 +0000","Swansea – No broadband or home computers – why many library visitors are not going there for a book – South Wales Evening Post. &#34;A new survey shows 38 per cent of computer users at Swansea’s libraries go there because they don’t have their own PC while 16 per cent do not have access to broadband at home. Swansea Council says the figures show the value and impact of the service in tacking digital exclusion and in helping people to use the internet to search for jobs, update CVs or keep in touch with family members.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Coventry","Sun, 21 Aug 2016 17:58:31 +0000","Coventry – Arena Park Library in Coventry to close by the end of the month – Coventry Telegraph. &#34;Arena Park Library in Coventry is to close at the end of the month with the possibility of a nearby community group taking over. The last day of opening for the library will be Saturday, August 27. The closure of the library in the Arena Park Shopping Park is part of a series of cuts by Coventry City Council. Staff and volunteers from Holbrooks Community Care Association are hoping to move some of the books to their premises in Holbrook Lane and run a library from there. The rest would be put in store by the council.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Coventry","Sun, 21 Aug 2016 17:58:31 +0000","Coventry – Could Coventry’s libraries go online to save cash? – Coventry Telegraph. &#34;Ordering books online and picking them up from a community centre could be the future for some of Coventry’s library users. Coventry City Council has come up with the idea of keeping some books in storage. Library users would go online, search a list of books in the store and choose which ones they would like. Staff would get the chosen books off shelves and send them out to community centres for the library users to collect. Councillors regard the proposal as an extension of the existing system in which people can request books from other libraries to delivered to their local library. Coun Kevin Maton (Lab, Henley), cabinet member for learning and skills which includes libraries said: &#34;Some council wards like mine, Henley, don’t have libraries. &#34;We are looking to move towards people being able to order their books online and then collect them.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Hertfordshire","Sun, 21 Aug 2016 17:58:31 +0000","Hertfordshire – New Hertfordshire library scheme helps youngsters with mental health issues – Welwyn Hatfield Times. &#34;The scheme ‘Shelf Help: Reading Well for Young People’, provides 13-18 year olds with high-quality information, support and advice on a wide-range of mental health issues such as anxiety, depression, eating disorders and self-harm, and difficult life pressures, such as bullying and exams. &#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Lancashire","Sun, 21 Aug 2016 17:58:31 +0000","Lancashire – Tributes paid to pioneering former Accrington libraries chief – Accrington Observer. &#34;Tributes have been paid to a long-serving librarian who was a key figure in the running of the borough’s libraries for more than 30 years. Brian Ashton served as Hyndburn’s district librarian for two decades and was instrumental in establishing it  reference library in 1962″. Son says &#34; &#34;My dad would be absolutely horrified with the state of the libraries now. There is always a perfect time for some jobs and he was lucky to get the best out his.&#34;&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["North Lanarkshire","Sun, 21 Aug 2016 17:58:31 +0000","North Lanarkshire – Newarthill Library saved my life – now we have to save it – Guardian / Damian Barr. &#34;It was my sanctuary and inspiration and now it is threatened with closure along with four other local libraries and two mobile libraries. Savings of £1.5m are touted by CultureNL, the hapless quango that is pressing ahead despite a public consultation that has united the community – protests and fundraisers were held, more than 5,000 people signed a petition and writers including Ian Rankin, Armistead Maupin, David Nicholls, Val McDermid, Matt Haig and Caitlin Moran pledged support. The UK has already lost 343 libraries in the past six years. We cannot lose another. Libraries in Hove and Kensal Rise have been saved from closure: it can be done.&#34; … &#34;Projected savings are probably a fiction because the librarians will be redeployed elsewhere and the recently refurbished building will be mothballed, requiring expensive security and maintenance.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Coventry","Sun, 21 Aug 2016 17:58:31 +0000","Coventry – Plan to slash £3.8million from Coventry’s libraries and children’s services – Coventry Telegraph. &#34;Plans are to ask volunteers to run the public libraries at Caludon Castle School, Cheylesmore, Coundon, Finham and Earlsdon. They will be closed if nobody takes them on. Libraries at Allesley Park, Canley, Hillfields, Radford and Stoke Aldermoor will be run in partnership with other organisations on a reduced budget. The Central Library along with the libraries at Bell Green, Foleshill, Stoke and Tile Hill would have volunteers and a reduced budget&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Lancashire","Sun, 21 Aug 2016 17:58:31 +0000","Lancashire – Anger as books donated after Freckleton Air Disaster ‘disposed of’ in council blunder – Lancashire Evening Post. &#34;The 400-strong book collection was gifted to the people of Freckleton by members of the US Army Air Force and their families since the Freckleton Air Disaster of 1944, when an American pilot lost control of his bomber plane and crashed into the heart of the village and school, killing 61 people, including 38 children&#34; … &#34;Brian Willis, chairman of the Friends of Freckleton Library, said: &#34;I don’t understand why they thought they could just take the books away and destroy them. They have now said they will replace the books, but the messages inside can never be replaced.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Lancashire","Sun, 21 Aug 2016 17:58:31 +0000","Lancashire – Give people more time to have their say on planned cuts to libraries and children’s services, says MP – Clitheroe Advertiser. &#34;Ribble Valley MP Nigel Evans has spoken out on the planned closure of libraries and children’s services, including Whalley library, saying that the consultation regarding the closures should be extended until September when families who may be on holiday can focus on it.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Cumbria","Sun, 21 Aug 2016 17:58:31 +0000","Cumbria – CEO of National Libraries Taskforce visits award winning Barrow Library – Cumbria Crack. &#34;Kathy visited Dalton Library and Dalton Community Centre to see how the re-location will work and was impressed by the approach to new opening hours and the free Wi-Fi provision.  Kathy then attended Barrow Library and was met by the sight of a Giant Peach outside on the lawn – the library is taking part in the Summer Reading Challenge and the Roald Dahl-themed ‘Big Friendly Read’ with drama workshops, short stories, fancy dress and all sorts of whacky whiz-popping fun.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Lewisham","Sun, 21 Aug 2016 17:58:31 +0000","Lewisham – Torridon Community Library- the volunteer hunt begins – Our Hither Green. &#34;Despite a long and determined campaign by local people, library  staff and unions, Lewisham’s Labour Mayor and Councillors pushed through their decision to divest itself of another four local libraries as part of a slew of budget cuts. The Borough of Lewisham now has only has three libraries staffed by professional  librarians.&#34; … &#34;The experiences of other libraries transferred to the community at Blackheath and Sydenham suggest that the scramble  for volunteers and resources to keep both the building open and a reliable  service running is both exhausting and never ending. Moreover, official Lewisham figures monitoring foot fall show that after transfer, book lending rates and school visits plummet.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Lincolnshire","Sun, 21 Aug 2016 17:58:31 +0000","Lincolnshire – Holbeach Library plans come under ‘travesty’ attack – Lincolnshire Free Press. &#34;Lincolnshire Co-op plans to invest more than £750,000 in creating a food store, pharmacy, post office and book lending centre after moving Holbeach Library from Church Street to Fleet Street, Holbeach.&#34; Parish councillor says &#34;I’m very concerned over the safeguarding policy and it not having any tables and chairs for children.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Darlington","Sun, 21 Aug 2016 17:58:31 +0000","Darlington – Last-ditch legal challenge to save Darlington library – Northern Echo. &#34;Campaigners battling to save the closure-threatened historic library have used legal aid to appoint one of the country’s leading judicial review lawyers to challenge Darlington Borough Council. Earlier this year, the authority voted to close the Grade II listed library as part of a sweeping £12.5m programme of budget cuts. The decision came despite a high profile Northern Echo campaign backed by thousands of individuals, community groups and best-selling authors including Philippa Gregory and Anne Fine.&#34; … &#34;the authority’s decision was taken without due process or proper consultation. &#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Hertfordshire","Sun, 21 Aug 2016 17:58:31 +0000","Hertfordshire – London Colney library set for transformation under community scheme – Herts Advertiser. &#34;The county council’s cabinet member for public health, localism and libraries, Teresa Heritage, said that volunteering in a local library was &#34;a great way to give something back, meet new people and also learn new skills&#34;. &#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Fife","Sun, 21 Aug 2016 17:58:31 +0000","Fife – All change for mobile library service – Fife Today. Mobile library stops will be come fortnightly, not weekly. Mobile library fleet reduced from 3 to 2.","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Lancashire","Sun, 21 Aug 2016 17:58:31 +0000","Lancashire – Bids to save borough libraries revealed – but will they succeed? – Accrington Observer. &#34;Groups have produced individual plans to Lancashire County Council (LCC) that they hope will secure the future of Clayton-le-Moors, Rishton and Oswaldtwistle libraries.&#34;. Oswaldtwistle: &#34;Part of the library will be a book shop essentially and people can take three items a day and give a donation for those books. And people eventually bring them back and they start all over again.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Northumberland","Sun, 21 Aug 2016 17:58:31 +0000","Northumberland – Library: nothing short of a scandal – Morpeth Herald / Letters. &#34;previously adequately resourced and roomy, expertly staffed and well-provided libraries are relocated to cramped, badly resourced and wholly inadequate facilities&#34;. Manchester Street Library, Morpeth: &#34;Gone is over 75 per cent of floor space with plenty of room to work in peace – a facility we used to take for granted, valued by many and used by a significant number of high school students in the run up to exams.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Oxfordshire","Sun, 21 Aug 2016 17:58:31 +0000","Oxfordshire – Ex-Top Gear presenter Chris Goffey slams mobile library cuts – BBC. &#34;A former Top Gear presenter who works as a driver for a mobile library service has described the decision to axe it as an &#34;absolute travesty&#34;. Oxfordshire County Council will stop operating the six vans from next month, as part of £1m savings to its library service. Chris Goffey said cutting them was &#34;stupid&#34; and &#34;crazy&#34;. The council said it was expanding its volunteer-based home library service for people with mobility issues. In the last year 190,238 items were borrowed from the county’s mobile libraries, 59% of which were borrowed by children.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Fife","Sun, 21 Aug 2016 17:58:31 +0000","Fife – Village libraries spared closure to start new chapter in book-lending – Courier. &#34;Business plans have been approved for continuation of the closure-threatened libraries in Lundin Links, Pittenweem and Kinghorn. Arrangements are now to be made for community groups to lease the buildings before Fife Cultural Trust pulls out in March. Discussions are continuing over proposals for three other libraries – Colinsburgh, Glenwood, in Glenrothes, and Townhill, in Dunfermline – and two competing bids for Falkland are to be decided by councillors.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Midlothian","Sun, 21 Aug 2016 17:58:31 +0000","Midlothian – Community survey concerns played down – Midlothian Advertiser. Consultation criticised as too low-key, with many not knowing about it. &#34;&#34;My concern lies in that the council are asking people to complete postcards that are in the library or email the Council, message via Twitter etc. However, the posters are nondescript and ineffective in catching your attention and I doubt many people in Midlothian know that their opinions are being sought&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["West Sussex","Sun, 21 Aug 2016 17:58:31 +0000","West Sussex – Resurgent Harry Potter fever reaches Sussex libraries – Argus. &#34;West Sussex County Council West Sussex said they had 11 copies in stock with 56 requests to date. &#34; … East Sussex only ordered four copies [! – Ed.]","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Isle of Man","Sun, 21 Aug 2016 17:58:31 +0000","Isle of Man – New chapter begins for town’s library – Isle of Man Today. &#34;The library – closed since refurbishment of the centre began earlier this year – can be accessed by lift.Opening hours have been extended and are: Monday and Wednesday, 1pm to 5pm, Tuesday, Friday and Saturday, 10am to 12.30pm and Thursday, 3pm to 7pm. It is also introducing a ‘self-service’ system, whereby books can be returned or borrowed when the library is closed&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Sheffield","Sun, 21 Aug 2016 17:58:31 +0000","Sheffield – Libraries need staff – Star / Letters. &#34;The politicians seem to have got off lightly, with no awkward questions asked of councillors to justify their supporting of policies which have led to the decline in and lack of statutory status (and therefore easier closure of) 16 out of 28 of the city’s libraries. There is a need for the cold hard facts to be acknowledged. The staff have gone and it is putting people off visiting. People need their librarians.&#34;","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Shropshire","Sun, 21 Aug 2016 17:58:31 +0000","Shropshire – Council ‘can’t afford’ £20,000 to run library – Shropshire Star. &#34;Shawbury Parish Council said it could not afford to keep the village library open as it would have cost it about half of its budget. The situation illustrates the difficulty facing town and parish councils across the county that are being asked to take on services that were previously funded by Shropshire Council.&#34;. Expected to be replaced by a mobile library stop.","2016/08/fewer-are-taking-part-so-lets-have-a-national-demonstration.html"],["Angus","Wed, 24 Aug 2016 20:23:18 +0000","Angus – Cop counters move into Angus libraries as part of one-stop shop programme – Courier. &#34;The move is part of six-figure plans to integrate Angus Council’s Access offices and libraries into a &#34;one stop shop.&#34; Police counters in Montrose, Brechin and Carnoustie were axed as the new body sought to achieve more than £60 million of savings following the introduction of Scotland’s single force. Police Scotland announced more than 60 counter closures around the country arguing that people can report crimes over the phone.&#34; … &#34;Councillors approved the initial phase of £2.3m investment in the integration programme for Carnoustie, Forfar and Montrose libraries. The estimated cost of the full integration programme across the county has been estimated at £4.2m with all work due to be completed by 2021.&#34;","2016/08/a-labour-library-mess-up-and-the-police-in-libraries.html"],["Cornwall","Wed, 24 Aug 2016 20:23:18 +0000","Cornwall – Upton Cross library facing closure as council calls on mobile service for villagers – West Briton. &#34;A village library is to close and be replaced by a mobile service – the first victim of £1.8 million cuts imposed on the library service by Cornwall Council. The facility at Upton Cross near Callington, one of the smallest in Cornwall and based in the village school is open for only a few hours per week. Cornwall Council officials have been trying to find a local organisation willing to take over responsibility for the service, but now time is running out – and the school itself now needs the space once summer holidays end in a few weeks.&#34;","2016/08/a-labour-library-mess-up-and-the-police-in-libraries.html"],["Isle of Wight","Wed, 24 Aug 2016 20:23:18 +0000","Isle of Wight – Mobile Libraries Hit By Isle of Wight Council’s Funding Cuts – Isle of Wight Radio. &#34;The local authority said it plans to reduce the number of stops from 77 to 53, focusing on those stops which are least used. The frequency of visits will also reduce from three-weekly to four-weekly, with the borrowing period of items adjusted to reflect this.&#34; … &#34;The reduction in the Mobile Library Service will save £23,500 annually, or the equivalent of one full-time post according to the local authority. Regular users and town and parish councils affected by this will be informed of the planned changes and asked for their views. Feedback on the plans will close on 30 September.&#34; … &#34;The Library Service is also working with AgeUK Isle of Wight to have its Home Library Service clients taken on by the AgeUK Isle of Wight ‘Good Neighbour’ volunteers. The intention is to have enough of these clients transferred over in 2017 to allow the mobile library schedule to return to three-weekly by the end of the year.&#34;","2016/08/a-labour-library-mess-up-and-the-police-in-libraries.html"],["Islington","Wed, 24 Aug 2016 20:23:18 +0000","Islington – Islington libraries are now offering Pokémon Go supplies – Islington Gazette. &#34;Players can certainly expect a safe environment, after three teenagers were robbed at gunpoint while playing the game in Whittington Park last month. And it appears Islington Council is trying to expose more young people to the variety of services and activities on offer in its libraries.&#34;","2016/08/a-labour-library-mess-up-and-the-police-in-libraries.html"],["Lancashire","Wed, 24 Aug 2016 20:23:18 +0000","Lancashire – 2,450 sign Morecambe Library petition – Visitor. Against reduction in opening hours.","2016/08/a-labour-library-mess-up-and-the-police-in-libraries.html"],["Lewisham","Wed, 24 Aug 2016 20:23:18 +0000","Lewisham – Library campaigners take fight to Lewisham council – Socialist Worker. &#34;Around 80 campaigners protested in Lewisham, south east London, last Saturday against the Labour council’s cuts to the library service. Library worker Caroline told the rally that experienced workers had been made redundant or had their hours drastically cut in the past few weeks. She said, &#34;We’re going to be left with just three libraries for the whole borough.&#34;&#34;","2016/08/a-labour-library-mess-up-and-the-police-in-libraries.html"],["Norfolk","Wed, 24 Aug 2016 20:23:18 +0000","Norfolk – Council library staff trained to help people file police reports – Local.gov. &#34;Library staff at Norfolk County Council will be helping people access police services as part of a six month pilot scheme. The trial will see library staff help residents to complete online self-reporting forms, such as enquiring about lost and found items.&#34; … &#34;Members of the public using the library for a police related matter will be asked to complete a satisfaction survey. The results of the project will be presented the council and chief officers after the six month trail to assess if the new partnership has been a success.&#34;","2016/08/a-labour-library-mess-up-and-the-police-in-libraries.html"],["Norfolk","Wed, 24 Aug 2016 20:23:18 +0000","Norfolk – Police station counter services to move to libraries in pilot scheme in Norfolk – ITV. &#34;A library isn’t the obvious place to report a crime but people will be able to from September at Thetford in Norfolk following the closure of the front desk at the town’s police station&#34;","2016/08/a-labour-library-mess-up-and-the-police-in-libraries.html"],["Rhondda Cynon Taff","Wed, 24 Aug 2016 20:23:18 +0000","Rhondda Cynon Taff – These are the leisure centres, libraries, theatres and day centres in Rhondda Cynon Taff set to get WiFi – Wales Online. &#34;In total, 40 buildings – ranging from council offices to leisure centres, libraries, theatres and day centre – will soon allow users to access public WiFi through the Sky Cloud.&#34;","2016/08/a-labour-library-mess-up-and-the-police-in-libraries.html"],["Aberdeenshire","Tue, 30 Aug 2016 20:49:28 +0000","Aberdeenshire – MSP completes surgery tour of libraries – Ellon Times. Gilliam Martin MSP &#34;&#34;It was also great to be able to highlight the job that local libraries do for their communities. As well as providing access to vast catalogue of books they are a brilliant space for community groups to meet.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Coventry","Tue, 30 Aug 2016 20:49:28 +0000","Coventry – ‘Anyone who thinks this is a good idea has no concept of what a library really is’ – Coventry Telegraph / Letters. &#34;It is shameful that a city bidding to be named a City of Culture is even considering closing libraries. To add insult to injury the council has come up with some crackpot idea of &#34;click and collect&#34;. Anyone who thinks this is a good idea has no concept of what a library really is. They are not mere store rooms for books awaiting to be loaned, there is a certain ambiance and tranquility within a library which makes them a pleasure to visit much the same as a church … However I found it impossible to concentrate due to the volume of chatter coming from the mostly student visitors to the library. Amazingly the staff made no effort to maintain any rule of silence and carried on as if it was perfectly normal. If this library was to close they would need a megaphone to announce it.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Croydon","Tue, 30 Aug 2016 20:49:28 +0000","Croydon – Let’s protect Croydon’s pioneering libraries – Croydon Citizen. &#34;Let’s hope that when Croydon Council Cabinet members consider the outcome of the current library review, they remember that a key challenge is to ensure the continuance of the network of libraries that their predecessors proudly built. The first library had been opened in two rented shops in North End in March 1890, with 6,399 books in stock. In the year ending of March 1931 borrowings and consultations were up to 1,673,558 books.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Ealing","Tue, 30 Aug 2016 20:49:28 +0000","Ealing – Claim service is being cut to boost profits of centre’s owners – Ealing Today. &#34;The Conservative opposition on Ealing Council are claiming that the reduction in book stock at Ealing Central Library will effectively amount to the end of the children’s library. The number of children’s books at Ealing Central library will be reduced by 66% from 21,000 to 7,000. These figures emerged after questioning by Conservative Councillors at the 4 August Overview and Scrutiny Meeting. Under the current plans, the total library site will be reduced from 1106sqm to 727sqm, the book stock from 124,000 to just 35,000; study spaces will fall from from 145 to 45 and the Local History service will be moved from the main library to West Ealing. Much of the archives is to be put into ‘deep storage’.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Hampshire","Tue, 30 Aug 2016 20:49:28 +0000","Hampshire – Actor donates his family’s Lego collection to library – Bournemouth Echo. Hugh Bonneville gives collection after New Milton library staff heard he had too much lego when he appeared on Desert Island Discs.","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – Anger as Lancashire County Council announce 20 libraries face the axe over cash – Lancashire Telegraph.. &#34;Plans to shut more than 20 libraries in East Lancashire as part of a major cuts programme have been branded a ‘disgrace’. Libraries set to be lost in the latest phase of a £262million budget reduction initiative by Lancashire County Council include Rosegrove, Briercliffe, Barrowford, Trawden, Clayton-Le-Moors, Oswaldtwistle, Rishton, Whalley, Adlington and Read. However Brierfield, Bacup and Whitworth libraries were given a stay of execution as well as Willows Park Children’s Centre in Longridge.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – Broadcast – BBC Radio Lancashire. Covers library cuts in depth. 1.13 – Ged Mirfin @GedMirfin (Whalley Library),  1.18 Laura Swaffield of the Library Campaign @lswaffield1,  2.08 – various incl @LancashireCC,  2.18 – Unison rep (50 comp redundancies). Notes library cuts report put out late on a Friday before the Bank Holiday Monday. &#34;A deliberate attempt to confuse the public&#34;.","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – Council chiefs at war in ‘cheek of the devil’ row – Blackpool Gazette. &#34;Lancashire Tories have been accused of &#34;having the cheek of the devil&#34; after they launched an online Save Our Services petition just days before the Labour-run County Council is to reveal the names of some 100 buildings set for closure. The cuts are set to be approved by the the council’s Cabinet on September 8. &#34;","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – Lancashire to go ahead with ‘disgraceful’ library cuts – BookSeller. &#34;Lancashire County Council has decided to press ahead with plans to close more than 20 libraries after a 12-week consultation. In May, the council proposed to close 29 libraries in a bid to make £200m worth of cuts by 2020. Following the consultation, which received a total of 7,719 responses, a report has been drawn up recommending that libraries in Morecambe and Carnforth will retain full library status, while the future of libraries in Brierfield, Bacup and Whitworth are still under review. Libraries set to be lost include Rosegrove, Briercliffe, Barrowford, Trawden, Oswaldtwistle, Rishton, Walley and Read. In total, more than 100 buildings – including libraries, children’s centres and adult disability centres – are being earmarked for closure by the council.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – Campaigners continue to fight for Lancashire’s libraries – Lancashire Headline News. &#34;In May, it was announced 29 libraries and 35 buildings used by children centres were at risk as part of cuts at County Hall. But groups aren’t going quietly.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – Future of Preston and South Ribble libraries and children’s centres decided – Blog Preston. &#34;However a campaign to save Fulwood library has fallen on deaf ears as the county council says it will no longer deliver services at the site in Garstang Road. Only one expression of interest in keeping the library open has been received, but no business case provided.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – Lancashire councils spend £1.5m on pay offs – Lancashire Evening Post.","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – Lancashire County Council to go ahead with library cuts – BBC. &#34;Following the 12-week consultation plans to make Morecambe a satellite service will now be shelved and it will keep its full library status but the future of libraries in Brierfield, Bacup and Whitworth are still under review. David Borrow, deputy leader of Lancashire County Council and portfolio holder for finance, said it has tried to &#34;make the best decisions it can&#34; and to &#34;come up with imaginative ways to protect services&#34;.","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – Libraries and children’s centres to close – Blackpool Gazette. Lists all council buildings to close.","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – Library Campaigner Dom Conlon reacts to library closures – Lancashire Headline News Interview – Lancashire Headline News. &#34;Lancashire County Council revealed revised plans. In May the total under threat was 29 and now only Carnforth library has been taken off list.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – Morecambe Library to remain fully open – Visitor.","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – No reprieve as public fears are confirmed – Chorley Guardian. Adlington library to close, much to annoyance of local MP.","2016/08/lancashire-labour-and-libraries.html"],["Lancashire","Tue, 30 Aug 2016 20:49:28 +0000","Lancashire – What the latest county council cuts mean for you. Our guide to what happens next – Lancashire Evening Post. &#34;The proposals will go the the County Council’s Cabinet meeting on September 8 for approval. But first they will be debated by the council’s cross party Executive Scrutiny Committee on Tuesday, September 6 at County Hall in Preston&#34; … &#34;The time span for the changes ranges from September 30, 2016 to March 2020.It is proposed services will end at Fulwood, Bamber Bridge and Penwortham libraries and Garstang Young People’s Centre on September 30 this year.&#34; … &#34;You could volunteer to run a library service. The county council is proposing to offer help to establish community run libraries.A help package will include £5,000 to cover set-up costs, shelving, an initial supply of books from the county council’s store and advice from a special community library development officer. Call 0300 1236701 for more information. &#34;","2016/08/lancashire-labour-and-libraries.html"],["Leicestershire","Tue, 30 Aug 2016 20:49:28 +0000","Leicestershire – &#34;Bloody-minded&#34; county council accused over Leicestershire library closure plan – Leicester Mercury. &#34;Tory-led Leicestershire County Council is in the process of trying to offload 36 of its smaller libraries to volunteer groups, in a bid to save £800,000. Officials have an agreement for volunteers to take over the running of Desford library. However the building, in Main Street, needs £45,000 of repairs, largely to its slate roof. The volunteers said they cannot take on such a commitment and want the building fixed before they take it on. Otherwise, they are prepared to take on an internal lease where the council maintains responsibility for the fabric of the building. Council officers said they could not offer Desford a preferential deal to other communities that have already assumed responsibility for their libraries.&#34; … &#34;Desford county councillor David Sprason said: &#34;They have already been preferential to other libraries. Kegworth was offered an internal lease. &#34;They extended the time Ki&#8230;","2016/08/lancashire-labour-and-libraries.html"],["Manchester","Tue, 30 Aug 2016 20:49:28 +0000","Manchester – Central Library exhibition celebrates the history of Manchester’s drag queens – Manchester City Council. Heritage Lottery Funded. &#34;As part of the project, volunteer researchers trained by Manchester Metropolitan University have conducted interviews with drag queens past and present, which are being catalogued and stored at the Archives+ Centre.  Snippets of the interviews can be heard through the Archives+ Centre’s interactive digital features, as part of the exhibition. Volunteers have also unearthed many relevant archive documents and materials, using Central Library resources such as the Theatre Collection and the Queer Up North archive.  As part of the exhibition, Jez has created a series of Andy Warhol-inspired screen prints, based on selfies sent to him by current drag queens.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Norfolk","Tue, 30 Aug 2016 20:49:28 +0000","Norfolk – Crooks booked: Skint cops now want you to report crimes to librarians to save cash as force aims to slash its budget by £5m – Sun. &#34;Trials will start in Thetford and Gorleston from September where victims will be able to receive help at the towns’ libraries making reports directly onto the force website. Critics have slammed the policy as &#34;alarming,&#34; warning victims too self conscious to reveal details to librarians may decide not to report crimes.&#34;","2016/08/lancashire-labour-and-libraries.html"],["North Lanarkshire","Tue, 30 Aug 2016 20:49:28 +0000","North Lanarkshire – Chapelhall Library’s opening hours cut by more than 25% to save cash – Daily Record. 13 hours cut per week in Chapelhall. Airdrie and Coatbridge will also reduce hours.","2016/08/lancashire-labour-and-libraries.html"],["North Somerset","Tue, 30 Aug 2016 20:49:28 +0000","North Somerset – Consultation over cuts to library services and children’s centres – North Somerset Times.","2016/08/lancashire-labour-and-libraries.html"],["Northern Ireland","Tue, 30 Aug 2016 20:49:28 +0000","Northern Ireland – BBC signs partnership with Libraries NI to promote reading – BBC. &#34;The agreement aims to support learning and development opportunities across Northern Ireland. Plans are in place for events which explore connections between libraries, learning, broadcasting and books in autumn this year.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Northumberland","Tue, 30 Aug 2016 20:49:28 +0000","Northumberland – Library: change is the best option – Morpeth Herald. Cllr Val Tyler, portfolio holder, argues council policy was best for libraries: relocating and colocations rather than closures.","2016/08/lancashire-labour-and-libraries.html"],["Pembrokeshire","Tue, 30 Aug 2016 20:49:28 +0000","Pembrokeshire – Trade union hits out at Pembrokeshire County Council £700k savings plans for leisure and tourism services – Western Telegraph. Council considering passing leisure/tourism/culture to a non-profit. Consultancy recommends it claiming £700k in savings. Unison launched petition against it for a while.","2016/08/lancashire-labour-and-libraries.html"],["St Helens","Tue, 30 Aug 2016 20:49:28 +0000","St Helens – Actor Ralf Little’s praise for St Helens library teams – St Helens Reporter. &#34;The arts in libraries programme had beaten off stiff competition from over 600 other projects within the Arts category to reach the finals, where it received the most public votes. Ralf Little presented Cultural Hubs with a prestigious National Lottery Awards trophy after the British public recognised the programme’s impressive achievements. Ralf, famous for his roles in The Royle Family and Two Pints of Lager and a Packet of Crisps, met the people behind the success of Cultural Hubs. He said: &#34;It is great to see libraries turned into vibrant places where people can try something new and develop their artistic talents.&#34;","2016/08/lancashire-labour-and-libraries.html"],["St Helens","Tue, 30 Aug 2016 20:49:28 +0000","St Helens – Cultural Hubs claims National Lottery Award – St Helens Star. &#34;Royle Family actor Ralf Little celebrated with St Helens Libraries’ Cultural Hubs team as it was crowned the UK’s favourite Lottery-funded arts programme. The arts in libraries programme had beaten off stiff competition from more than 600 other projects within the Arts category to reach the The National Lottery Awards finals, where it received the most public votes.Ralf Little presented Cultural Hubs with a National Lottery Awards trophy after the British public recognised the programme’s impressive achievements.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Somerset","Tue, 30 Aug 2016 20:49:28 +0000","Somerset – Shepton Mallet library: Protesters gather to oppose possible move out of town centre – Somerset Live. Library could be moved to a less convenient location in order to save money.","2016/08/lancashire-labour-and-libraries.html"],["South Gloucestershire","Tue, 30 Aug 2016 20:49:28 +0000","South Gloucestershire – Hollywood star continues to lend support to Save Hanham Library campaigners – Week In. &#34;As library campaigners across South Gloucestershire await the results of the consultation into cuts to the service, the Save Hanham Library team have received another message of support from local boy and Hollywood star Stephen Merchant. Hanham, Downend, Staple Hill, Cadbury Heath and Emersons Green libraries are among those threatened with reduced hours and the mobile library could be stopped altogether. The council has said it needs to save around £650,000 from the library service budget with a proposed overall cut of 42% in service and while the proposed new model involves reducing some library opening hours, it hopes that through discussions with the community that reductions can be minimised.&#34;","2016/08/lancashire-labour-and-libraries.html"],["South Lanarkshire","Tue, 30 Aug 2016 20:49:28 +0000","South Lanarkshire – Leadhills has oldest library – Carrick Today. Subscription library opened in 1741 is still going strong.","2016/08/lancashire-labour-and-libraries.html"],["Suffolk","Tue, 30 Aug 2016 20:49:28 +0000","Suffolk – Council buys middle school site for redevelopment – About My Area. &#34;The purchase of this site also includes community buildings which are home to a library run by Suffolk Libraries and an internet café run by members of the local community.  Mid Suffolk will now work closely with these groups on continuing to provide much valued local facilities.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Suffolk","Tue, 30 Aug 2016 20:49:28 +0000","Suffolk – Winners revealed for Suffolk Libraries’ Bookface and Get Caught Reading campaigns – EADT. &#34;Dozens of creative entries have been submitted into the Suffolk Libraries Get Caught Reading and Bookface competitions as a means to inspire readers.&#34; … &#34;The Get Caught Reading project challenges readers to get a snap reading in an unusual place, with Amanda Collins submitting the winning entry of her daughters Cahir and Eira reading at Haverhill pool. The Bookface photo invites readers t  take a picture holding up a book to their face – a category won by Elize Collins from Newmarket. Both won £50 of high street shopping vouchers.&#34;","2016/08/lancashire-labour-and-libraries.html"],["Surrey","Tue, 30 Aug 2016 20:49:28 +0000","Surrey – Petition launched as plans to close Bookham Library at lunchtime announced – Surrey Mirror.","2016/08/lancashire-labour-and-libraries.html"],["Worcestershire","Tue, 30 Aug 2016 20:49:28 +0000","Worcestershire – Council plans fears over Redditch library – Redditch Standard. &#34;The authority is looking at the possibility of another public sector organisation moving into the Alcester Street building to share its floor space with the aim of creating a ‘hub’. The model has already been trialled elsewhere in the county with libraries hosting groups like the Citizens Advice Bureau and the Department for Work and Pensions. However, leading Redditch county councillor Joe Baker (Lab, Arrow Valley East) fears the loss of floor space could lead to a downsizing of the library and a loss of service for local people.&#34;","2016/08/lancashire-labour-and-libraries.html"],["York","Tue, 30 Aug 2016 20:49:28 +0000","York – New mobile library plan after closure – York Press. Haxby Library closed due to structural fears. £80k given by York Council to York Explore for mobile library stops. &#34;&#34;Options are being investigated for a new library building in the area,&#34; he said. &#34;However this is likely to take upwards of two years to deliver; therefore an interim service is needed. &#34;The most cost effective way to deliver this will be through the acquisition of an additional mobile vehicle, allowing it to be based in the area to cover the current library opening hours.&#34;&#34;","2016/08/lancashire-labour-and-libraries.html"]]