[["Blackburn with Darwen","Sun, 03 Apr 2016 20:42:48 +0000","Blackburn with Darwen – Community Living Room – &#34;The Community Living Room project is funded by Arts Council England and is delivered  by Blackburn with Darwen Council’s Library and Information Service in partnership with Age UK, NHS Blackburn, Action Factory Community Arts Ltd and Blackburn with Darwen Council’s Health and Wellbeing Services&#34;.  Lots of varied craft activities for public libraries [like a craft-focused makerspace or a well-funded U3A but in a library – Ed).","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Devon","Sun, 03 Apr 2016 20:42:48 +0000","Devon – New organisation takes control of Devon’s library services – Herald Express. &#34;Libraries Unlimited, a staff and community-owned social enterprise, was established with the support of Devon County Council following extensive public consultation on the future of the library service. From April 1, the mutual will run the library service on behalf of Devon County Council in a move to secure the future of all 50 of the county’s libraries. The move will save £1.5million a year in addition to the £3 million already saved from the library service budget over the past three years. DCC remains responsible for the library service, but now commissions the delivery of the service from Libraries Unlimited, which is managed by chief executive Ciara Eastell and led by a board of trustees recruited from library staff, library friends groups and independent members of the Devon community.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Brent","Sun, 03 Apr 2016 20:42:48 +0000","Brent – The Library at Willesden Green by Allford Hall Monaghan Morris – Architect’s Journal. A long look, with pictures and floorplans, of the new library. &#34;The Willesden Green cultural centre currently provides an astonishing wealth of cultural amenity: library, gallery, museum, archive, performance space. So it is worth pointing out that both sides in the debate believed that libraries were at the heart of communities. They just disagreed about what the scale of ‘community’ was. Interestingly, the disagreement rarely went into the definition of what libraries did. Bennett’s own criticism of the move was based as much around access to computers as to books. &#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Cumbria","Sun, 03 Apr 2016 20:42:48 +0000","Cumbria – Cumbria libraries staff reduced by 76 over past six years – North West Evening Mail. &#34;A spokesperson for Cumbria County Council said that a number of full-time library staff had taken up the option of voluntary redundancy, and alongside that there had been a rise in part-time staff seeking or getting increased hours. He said: &#34;These figures have been down to a combination of things but it’s certainly nothing sinister&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Cambridgeshire","Sun, 03 Apr 2016 20:42:48 +0000","Cambridgeshire – Cambridgeshire library hours cut in council budget blitz – Cambridge News. &#34;Opening times at libraries in Cambridgeshire are being slashed as the county council pushes on with a cash-saving drive. Cambridge Central library will open half an hour later during the week, and hours will also be reduced for libraries at Ely, Huntingdon, and St Neots. Some libraries will also shut on Sundays, and opening times for archives in Cambridge and Huntingdon will also face curbs and closures.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Lambeth","Sun, 03 Apr 2016 20:42:48 +0000","Lambeth – Carnegie library occupation deepens cracks in Lambeth’s austerity Labour Party – Socialist Worker. &#34;The Labour Party in Lambeth, South London, is in crisis after being caught off guard by the scale and determination of opposition to its council’s library cuts. Councillors face strikes, protests and an occupation – while big chunks of their own party’s membership are also attacking them.&#34; … &#34;Dulwich and West Norwood Constituency Labour Party has spoken out saying it &#34;stands with librarians and Friend’s Groups opposing Lambeth Council’s plan for the library service&#34;.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Lambeth","Sun, 03 Apr 2016 20:42:48 +0000","Lambeth – Lambeth library occupation ‘turning into a siege’ – BBC. &#34;Campaigners who have been occupying a library for more than 24 hours say security outside has been tightened. They have been refusing to leave Carnegie Library in Loughborough Junction, south London, since Thursday evening in protest at its closure. Police stationed outside the library are allowing people to leave but not to return, protester Laura Swaffield said. She said the occupation was &#34;turning into a siege&#34;. About 80 people are thought to be inside the library.&#34; see also Locals protest as benchpresses replace books – Financial Times (behind pay wall) and Protestors refuse to leave Herne Hill’s Carnegie Library – BookSeller.","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Lambeth","Sun, 03 Apr 2016 20:42:48 +0000","Lambeth – Lambeth library plans condemned as ‘absolute shambles’ – Guardian. &#34;Opponents counter that the changes are unpopular and chaotic. They say the two libraries closing on Thursday will remain untouched for months as officials remain unsure how to install &#34;healthy living centres&#34; in the Grade II-listed structures. &#34;It’s pointless,&#34; said Laura Swaffield, chair of the Friends of Lambeth Libraries, a pressure group that has campaigned noisily over the planned changes. &#34;The staff are still on the payroll pending a restructure. They’re also paying for security guards now the buildings will close.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Lincolnshire","Sun, 03 Apr 2016 20:42:48 +0000","Lincolnshire – New providers to take over remaining 15 Lincolnshire libraries – Lincolnite. &#34;Management will transfer to not-for-profit organisation Greenwich Leisure Ltd (GLL), to be run alongside the county’s 30 community hubs, now managed by volunteers. The new chapter for the library service will also see GLL handle the county’s online library services and support for those unable to reach their nearest library because of things like disability, age or ill-health.&#34; … &#34;&#34;We are hitting the ground running with new plans for a Reading Garden and Teenage Library in Lincoln and a revamped Mobile Library in Mablethorpe – on top of scheduled library activities like the Summer Reading Challenge, Home Library and IT tasters.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Doncaster","Sun, 03 Apr 2016 20:42:48 +0000","Doncaster – Doncaster libraries experience biggest drop in number of books being borrowed in England – Doncaster Free Press. &#34;Borrowing statistics from the Chartered Institute of Public Finance and Accountancy released this week showed the number of books issued at the borough’s libraries fell by 571,761 between 2012 and 2014. There were 628,709 books issued in 2014, compared with 1.2 million two years earlier&#34;.","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Manchester","Sun, 03 Apr 2016 20:42:48 +0000","Manchester – Two is the magic number for Manchester’s reborn Central Library – Manchester Council. &#34;Today, Tuesday 22 March marks the second anniversary of the reopening of Central Library – and 2.5 million people have already visited the Manchester landmark since its reopening in 2014.&#34; … &#34;The library has hosted two literature festivals, two jazz festivals, two science festivals and two film festivals since the four-year, £50m project to restore the building was completed. More than 2,000 events and activities have been hosted at the reopened library, plus 254 educational sessions for school pupils. &#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Suffolk","Sun, 03 Apr 2016 20:42:48 +0000","Suffolk – Beccles Library to increase opening hours and launch new Reading Hack project – Suffolk Libraries. &#34;The additional staffing cost of the extra hours is being funded by Beccles Library Community Trust, the library’s community group set up to support and develop the library. The Trust have signed a formal agreement with Suffolk Libraries to fund the additional hours for an initial two year period which will be reviewed towards the end of this period.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Hertfordshire","Sun, 03 Apr 2016 20:42:48 +0000","Hertfordshire – Sawbridgeworth library could move to same site as town fire station – Herts and Essex Observer. &#34;The library has been a topic of debate over the last year-and-a-half as HCC looks to revitalise its library facilities. In a 10-year plan produced by the authority, each of its libraries was assessed on accessibility, condition and size. Sawbridgeworth’s was deemed one of the worst. A report said: &#34;Poorly configured…on two floors with no lift. Less than ideal for modern service delivery. High maintenance liability&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Lambeth","Sun, 03 Apr 2016 20:42:48 +0000","Lambeth – MP says main use of Carnegie must be as a library – Brixton Blog. &#34;Dulwich and West Norwood MP Helen Hayes has said that it is clear to her that &#34;the main and dominant use&#34; of the Carnegie library – currently occupied by protesters – &#34;must be the provision of a library and spaces for community meetings and that any other revenue raising uses must be subservient to these&#34;. The Labour MP said she was &#34;absolutely committed to seeing the Carnegie Library retained as a library&#34;. see also Occupation of Lambeth’s Carnegie Library continues into second day – Brixton Buzz, with pictures.","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Lambeth","Sun, 03 Apr 2016 20:42:48 +0000","Lambeth – Fury from campaigners as Lambeth Council spends £5,000 on video justifying cuts – ITV. &#34;The short film, called Tough Choices, was produced by Lambeth Council in south London. Two council libraries in Lambeth are due to close today due to &#34;severe budget pressures&#34;.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Lambeth","Sun, 03 Apr 2016 20:42:48 +0000","Lambeth – Lambeth library occupation continues, supported by community donations of food and bedding – BBC. &#34;Children, mothers with babies and pensioners have been among protestors occupying a library since it was due to close on Thursday. A group of around 40 people are living in Carnegie Library in Loughborough Junction, south London, as part of a campaign to keep it open. Supporters have been proving food and bedding to those inside.&#34; … &#34;Teenagers Phoebe Griffiths and Greta Thompson have been occupying the library since Tuesday, despite having to revise for their GCSEs and A-Levels. Greta told BBC London: &#34; &#34;On the day of the occupation I was working here, I was revising, and we decided to stay.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Swindon","Sun, 03 Apr 2016 20:42:48 +0000","Swindon – Labour Leader Corbyn backs bid to save Swindon libraries – Swindon Advertiser. &#34;Jeremy Corbyn has backed a campaign to save Swindon libraries from the threat of closure. Bestselling authors Jake Arnott, Alan Gibbons and Paul Cornell have also lent their support. Fourteen of the town’s 15 libraries could be shut as part of proposals to cut £50 million from its budget over the next three years. Mr Corbyn was in Oxford on a speaking tour of the regions when he was buttonholed by Councillor Jim Robbins (Lab, Mannington and Western) and told about the campaign.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Nottingham","Sun, 03 Apr 2016 20:42:48 +0000","Nottingham – Happy 200th Birthday Bromley House Library – Left Lion. &#34;If you were going to list the tools of the librarian’s trade, it’s doubtful a truncheon would make the cut. But there it is, in the hands of Carol Barstow, the head librarian of Bromley House Library for the last decade or so. It’s about 12&#34; and weighty enough to give your head some sudden and drastic blunt force surgery. It’s also old, and Carol thinks it’s from a time when Goose Fair would pop up right outside on the street, lions and all. Of course, it could be around because of all the gambling, drunkenness and gunplay in the library.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Peterborough","Sun, 03 Apr 2016 20:42:48 +0000","Peterborough – Libraries’ success story is a good read – Peterborough Telegraph. &#34;I read in the national media this week that councils have closed nearly 350 libraries across the country and a further 111 are planned this year. How sharply this contrasts with our own city’s libraries which, despite swinging cuts to local authorities by this government, are not only being kept open but we’ve also found ways to keep them open for longer and attract more people to use them! The latest initiative by the council, working in partnership with Vivacity, is building on the success of its Open+ library technology and rolling out free Wi-Fi connectivity across 11 of the city’s libraries, from the beginning of this month, funded via an Arts Council grant of £25,000.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Nottinghamshire","Sun, 03 Apr 2016 20:42:48 +0000","Nottinghamshire – Nottinghamshire: Membership rises for council library scheme – Chad. &#34;More than 20,000 people have become members of Nottinghamshire County Council’s new cultural organisation Inspire which began operating this week. The council is the first in the Midlands to set up an organisation to manage its libraries, archives, learning and cultural services across the county and began recruitment in November, which stands at 20,818 members to date.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Shropshire","Sun, 03 Apr 2016 20:42:48 +0000","Shropshire – ‘Postcode lottery’ warning on future of Shropshire services – Shropshire Star. &#34;Shropshire Council’s cabinet is expected to approve plans next week which could lead to the closure of a number of the county’s public services, including arts, tourism, museums, youth activities, leisure centres, swimming pools, large libraries, public open spaces, and some bus routes.&#34;","2016/04/lessons-from-last-week-an-extreme-message-works.html"],["Barnet","Thu, 07 Apr 2016 18:48:53 +0000","Barnet – Plans to maintain 14 library sites approved – Barnet Council. &#34;Proposals which will maintain 14 library sites in Barnet have been given the go ahead by full council. At a meeting of full council on Monday 4 April members voted to approve the proposals which follow public consultation. The changes to the library service will see: 14 library sites retained, as well as the home, mobile and digital library services; • Increased opening hours at 10 sites through the use of new technology to enable a library to open unstaffed, as being trialled at Edgware Library; • Volunteering opportunities for individuals and community groups to help run their local library; • Increased income generated through greater commercial usage of library buildings to off-set the level of budget reductions.&#34;","2016/04/the-other-11-are-misinformed-89-say-public-libraries-are-crucial.html"],["Lambeth","Thu, 07 Apr 2016 18:48:53 +0000","Lambeth – Library campaigners challenge GLL – Brixton Blog. &#34;Vauxhall MP Kate Hoey and Pastor Lorraine Jones, director of the Dwayne Simpson Foundation, are two prominent local figures to have signed an appeal to GLL, Lambeth council’s leisure provider, to pull out of plans to turn two libraries into &#34;healthy living centres&#34;. They were joined by the occupiers of one of the two libraries, the Carnegie in Herne Hill who, in a statement, said the silence of GLL, a social enterprise company, was &#34;baffling&#34;. They said GLL (formerly Greenwich Leisure Limited) prided itself on being an ethical, community-oriented enterprise, but went on: &#34;Yet it seemingly stands to benefit from a plan that deprives vulnerable people of a lifeline, while offering, instead, a gym facility that is not wanted and not needed&#34;","2016/04/the-other-11-are-misinformed-89-say-public-libraries-are-crucial.html"],["Lambeth","Sun, 10 Apr 2016 20:17:30 +0000","Lambeth – Library campaigners say council is now under greater pressure – Brixton Blog. &#34;Lambeth council is under far greater pressure over its libraries policy than it was before the 10-day occupation of the Carnegie library in Herne Hill, the sit-in campaigners said in an exit statement. Thanking supporters, they said the occupation would not have been possible without them. &#34;We are all part of one action to save our libraries and protect our public services,&#34; said the statement. &#34;We took this drastic action in the face of an intransigent council that refused to listen. 10 days ago we decided to stay in the library to stop it closing its doors for the last time.&#34;&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["South Lanarkshire","Sun, 10 Apr 2016 20:17:30 +0000","South Lanarkshire – Petition launched to save Whitehill Library from closure – Daily Record. &#34;A petition has been launched calling on the council to reverse the closure of Whitehill Library. The library, which is within the Whitehill Neighbourhood Centre, has been axed as part of South Lanarkshire Council’s budget cuts which were approved last month, and will close on April 2.&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Bexley","Thu, 07 Apr 2016 18:48:53 +0000","Bexley – Pictured: Bostall Library re-opens under community volunteers after Bexley Council cuts – This is Local London. &#34;The first of the four libraries out-sourced by Bexley Council last year has finally re-opened, as a community run facility. Bostall Library, in King Harolds Way, Belvedere, risked closing for good when the council gave residents the option to step up and run the book haven or lose it forever&#34;","2016/04/the-other-11-are-misinformed-89-say-public-libraries-are-crucial.html"],["Darlington","Thu, 07 Apr 2016 18:48:53 +0000","Darlington – MP visits Mount Pleasant primary school to hear children’s concerns about libraries – Darlington and Stockton Times. Jenny Chapman MP :&#34; Pupils at Mount Pleasant Primary School have been campaigning against the potential closure of libraries across the town. Darlington Borough Council budget proposals suggest closing Cockerton and the mobile library and transferring resources from Crown Street Library into the Dolphin Centre, while putting the historic building on the market. Mount Pleasant children have put pen to paper to resist changes to the libraries they visit regularly, writing to council leader Bill Dixon to beg him to reconsider the plans.&#34;","2016/04/the-other-11-are-misinformed-89-say-public-libraries-are-crucial.html"],["Bradford","Sun, 10 Apr 2016 20:17:30 +0000","Bradford – Authors hold ‘dinosaur day’ at Bradford libraries – Telegraph and Argus. &#34;Two children’s authors took part in a mini-tour of Bradford libraries as part of a ‘Dinosaur Day’. Louise Aaron and Steve Howson, who have both written dinosaur books for children, took part in reading sessions and games with children.&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Swindon","Sun, 10 Apr 2016 20:17:30 +0000","Swindon – Authors back library campaign following 2,000 name petition success – Swindon Advertiser. &#34; chairman of the Save Swindon Libraries campaign Sarah Church presented a petition containing more than 2,000 signatures from people opposed to cuts that could see the libraries fall into volunteer hands to councillor Jim Grant at the Civic Offices. The petition was presented prior to a meeting to discuss their concerns and comes ahead of the campaign group’s first public meeting on Sunday, which will welcome three popular authors – including two Dr Who writers.&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Bristol","Thu, 07 Apr 2016 18:48:53 +0000","Bristol – Library assistants in Bristol to go on strike over dispute with council – Bristol Post. &#34;More than 90 members of trade union UNISON have balloted to walk out over an argument about the number of hours they are working, including weekends. Council reforms saw Eastville Library closed last week as part of the council’s cost-cutting measures. The council had initially planned to close seven libraries as part of controversial cutbacks, but backed down after widespread protests from members of the public, staff and councillors. The plan could have saved the council £500,000 from its budget&#34;","2016/04/the-other-11-are-misinformed-89-say-public-libraries-are-crucial.html"],["Cheshire West and Chester","Thu, 07 Apr 2016 18:48:53 +0000","Cheshire West and Chester – More Cheshire West libraries to introduce self-service – Chester Chronicle. Great Boughton, Barnton, Lache, Helsby and Hope Farm. see also Barnton Library to close next month for self-service technology to be installed – Northwich Guardian.","2016/04/the-other-11-are-misinformed-89-say-public-libraries-are-crucial.html"],["Devon","Thu, 07 Apr 2016 18:48:53 +0000","Devon – New Devon library service goes live – North Devon Gazette. &#34;Libraries Unlimited, a community-owned social enterprise, takes over running the service from Devon County Council, which says it is business as normal for library users. The aim is to safeguard all 50 Devon libraries and to save £1.5million. It continues to remain responsible for the service, but now commissions its delivery from Libraries Unlimited.&#34;","2016/04/the-other-11-are-misinformed-89-say-public-libraries-are-crucial.html"],["Lambeth","Thu, 07 Apr 2016 18:48:53 +0000","Lambeth – Authors support occupation of south London library in protest against closure – Guardian. &#34;Neil Gaiman, Nick Hornby and Colm Tóibín back action at Carnegie Library which has been occupied after closure by Lambeth council&#34; … &#34;Neil Gaiman, Nick Hornby and Colm Tóibín are among more than 220 writers and illustrators who signed a letter with 24 hours of being asked to support the occupiers of Carnegie Library and condemn changes to Lambeth’s library service. Some of the signatories were present amid emotional scenes last Thursday at the closure of the Carnegie and Minet libraries.&#34;","2016/04/the-other-11-are-misinformed-89-say-public-libraries-are-crucial.html"],["Darlington","Sun, 10 Apr 2016 20:17:30 +0000","Darlington – Fight to save Darlington library – Darlington and Stockton Times. &#34;Edward Pease, a member of the prominent Quaker family, gifted a magnificent library to Darlington townspeople. The council proposes to close it and move the lending library to the Dolphin Centre, home of a sports hall and swimming pool. The cost of this move is to be considerably more than the money saved. There are no plans, apparently, to store the archives – a very large collection. No buyer has been found for the impressive building which does not lend itself to flats or offices, of which there are many standing empty.&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Lambeth","Thu, 07 Apr 2016 18:48:53 +0000","Lambeth – Opinion: Lambeth council – This is why libraries are important – Brixton Buzz. &#34;They say a picture is worth a thousand words, and maybe this one perfectly sums up why libraries must not be closed or turned into sweaty, noisy and plain weird gym/unstaffed library hybrids.&#34; … &#34;This was the packed scene in the Brixton Tate Library upstairs room at 5.25pm today as people gathered to study in a quiet, comfortable and safe environment. Just out of sight, a queue of people were being offered expert advice and information from one of the librarians, while downstairs there were equally busy scenes&#34; … &#34;Above is the empty Minet Library, now completely deserted after Lambeth Council closed the community facility last Thursday.&#34; … &#34;A notice outside the library tells people that the library is now closed but will open as a ‘healthy living centre’ (whatever that is) sometime in 2017. Whether they mean Jan 2017 or December 2017 no one knows.  Lambeth aren’t interested in divulging the details&#34;","2016/04/the-other-11-are-misinformed-89-say-public-libraries-are-crucial.html"],["Lancashire","Thu, 07 Apr 2016 18:48:53 +0000","Lancashire – Lending a hand to libraries – Lancashire Evening Post. &#34;Go round the county and you will find libraries now opening their doors to choirs, healthy living, stop smoking, weight management and dementia groups, Baby Bounce, crafter and IT learners, to name but a few of the groups that use the library. Silence, it seems, is no longer golden.&#34;","2016/04/the-other-11-are-misinformed-89-say-public-libraries-are-crucial.html"],["Cambridgeshire","Sun, 10 Apr 2016 20:17:30 +0000","Cambridgeshire – Wisbech Library’s opening hours reduced – Fenland Citizen. &#34;The town’s library will be shutting on a Monday afternoon from Monday, April 25. Cambridgeshire County Council needs to save £48 million over the next financial year and will save £700,000 by reducing the opening hours of libraries&#34;&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Lancashire","Sun, 10 Apr 2016 20:17:30 +0000","Lancashire – Silverdale villagers urged to have their say on library’s future – Westmorland Gazette. &#34;A question mark hangs over the Emesgate Lane library as Lancashire County Council cuts millions of pounds’ spending. Silverdale Parish Council’s annual parish meeting heard that the number of libraries across the county will be trimmed from 74 to 34 – one in each planning area. Julie Bell, Lancashire’s head of libraries, museums, culture and registrars, said that a 12-week consultation would begin on May 16, with final decisions made on September 8. She urged members of the public to take part and said that all views would be logged&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Swansea","Thu, 07 Apr 2016 18:48:53 +0000","Swansea – ​Chat show host Jeremy Vine told to shelve library talk – South Wales Evening Post. &#34;Any librarians listening to the Jeremy Vine phone-in show on Radio 2 recently would have been forgiven for wanting to say &#34;quiet please!&#34; as the host appeared to be less than supportive of their profession. Whether deliberately playing devil’s advocate or not, Vine questioned the need for librarians in an age when the internet is king and books appear to be heading for nostalgia section. At one point, Vine told a librarian &#34;I know there is a complicated system which means you put Agatha Christie on the second shelf,&#34; before adding: &#34;Computers can do it, they can shelve the stuff and they can find it for us.&#34; … &#34;One Swansea Valley-based librarian told the Evening Post: &#34;I listened to the programme and thought that it was a bit harsh, we do far more than stack books. You only have to look at the library service’s website to see the range and breadth of services that libraries provide.&#34;","2016/04/the-other-11-are-misinformed-89-say-public-libraries-are-crucial.html"],["West Berkshire","Thu, 07 Apr 2016 18:48:53 +0000","West Berkshire – Were council’s library closure proposals legal? – Newbury Today. &#34;Council sidesteps questions over whether it would have been in breach of its statutory duty&#34; … &#34;It is still no clearer as to whether West Berkshire Council’s original proposals to close eight of the district’s nine libraries was legal. Under the 1964 Public Libraries and Museums Act, local councils have a statutory duty to provide a ‘comprehensive and efficient library service’. The council last week admitted it had to take advice from the Department of Culture, Media and Sport (DCMS) during the public consultation period due to the &#34;vague nature&#34; of the Act.&#34;","2016/04/the-other-11-are-misinformed-89-say-public-libraries-are-crucial.html"],["Dorset","Sun, 10 Apr 2016 20:17:30 +0000","Dorset – Is this the end for Dorset’s mobile libraries (and do you care?) – Bournemouth Echo. &#34;A decline in the number of users and &#34;unprecedented&#34; budget pressures have been cited by Dorset County Council to justify the plan. A final decision will be made after the authority completes a public consultation, launched on Monday, into the future of the service.&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Shropshire","Sun, 10 Apr 2016 20:17:30 +0000","Shropshire – High Court quashes decision to close Shropshire Library – Doughty Street Chambers. &#34;On 5 April 2016, at the beginning of a three day judicial review hearing into Shropshire council’s decision to close Church Stretton Library, the defendant Council conceded that its decision was unlawful, agreed to quash the closure decision, and to lawfully reconsult. The challenge to the Council’s decision to close Church Stretton library and relocate it within a local school was brought by local resident and library user Andrew Williams, with the support of Church Stretton Library Support Group (‘CSLSG’).&#34; …&#34;The Defendant has at no stage during these proceedings invited the Claimant or CSLSG to submit an expression of interest  to run the Library pursuant to the Localism Act 2011. Indeed, the 2nd reason the Defendant was prepared to accept that its decision was unlawful was that it had not properly directed the Claimant’s attention to the possibility of submitting an expression of interest under the Localism Act 2011, and/or&#8230;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Brent","Sun, 10 Apr 2016 20:17:30 +0000","Brent – Brent Library Visits Up for Fifth Consecutive Year – James Powney’s Blog. &#34;The Council’s Libraries Transformation Project, which closed six libraries to concentrate resources on a smaller number of buildings, began in 2011 (the first column in the series).  The actual visit figures are at the bottom of this post.  The growth in book loans is less dramatic, but still significant, given the gloomy national picture.  Note the higher baseline in this graph to better illustrate the movement in the numbers.&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Lambeth","Sun, 10 Apr 2016 20:17:30 +0000","Lambeth – Passionate open letter to Cllr Lib Peck on the morning of the Save Lambeth Libraries march – Brixton Buzz. Letter points to poor understanding of the issue by councillors, lack of meaningful consultation and manipulation of the facts.","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Lancashire","Sun, 10 Apr 2016 20:17:30 +0000","Lancashire – Village takes on library fight – Lytham St Anne’s Express. &#34;The protest against proposed cuts to local libraries switches to Freckleton this weekend as the Friends organisation at the village library stage a read-in. Following a similar event at Ansdell, which was followed by a public meeting, and a walk between St Annes, Ansdell and Lytham libraries last month, the villagers are eager to make the point about the value of their library in the face of Lancashire County Council’s plan to shut 40 of the 74 libraries&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Lambeth","Sun, 10 Apr 2016 20:17:30 +0000","Lambeth – Protesters end Carnegie Library occupation and hold rally – BBC. &#34;A nine-day occupation of a south London library has ended, only hours before those inside were due to be evicted. Campaigners for the &#34;Defend the 10″ group have been inside Carnegie Library in Loughborough Junction since 31 March, the day it was closed for a year. Lambeth Council said its plans would &#34;guarantee&#34; the library’s future. Protesters voluntarily left at about 12:30 BST and marched to Brixton Library to show &#34;the fight goes on&#34;. The Carnegie and Minet libraries officially closed for a year on 1 April. The council said they would reopen in 2017 with a gym as &#34;healthy living centres&#34;.&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Lambeth","Sun, 10 Apr 2016 20:17:30 +0000","Lambeth – Why we’ll continue our fight to save Lambeth’s Carnegie Library – Guardian / Toby Litt. &#34;What’s really amazing, and encouraging, is the imagination that has gone into the occupation. There is more fun, passion, humour and intellectual energy hanging on the iron railings outside Carnegie Library than you’ll ever find posted on a healthy living centre notice board.&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Pembrokeshire","Sun, 10 Apr 2016 20:17:30 +0000","Pembrokeshire – Library plan is part of £3.4m transformation of Riverside indoor market in Haverfordwest – Western Telegraph. &#34;PLANS for the long-awaited new County Library in Haverfordwest have been revealed today (Friday) as part of a transformation of the town’s Riverside market. Pembrokeshire County Council is to receive almost £300,000 in funding for the facility. The grant will go towards a £3.4 million scheme to transform the indoor market. It is anticipated the flagship project will act as a catalyst for the regeneration of Haverfordwest. The new facility will also house a fully integrated Tourism Information Centre, a Life Hub zone – with access to financial and health information – as well as a coffee shop and a top class exhibition gallery through a ground-breaking partnership with the National Library of Wales.&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Lambeth","Sun, 10 Apr 2016 20:17:30 +0000","Lambeth – Thousands march in library protest – Brixton Blog. &#34;Thousands of supporters of the Defend The Ten Lambeth libraries campaign rallied in Windrush Square today (9 April) after marching there from the Carnegie library in Herne Hill via the Minet library in Myatt’s Fields. Both are closed in preparation for their conversion into &#34;healthy living centres&#34; to be run by Lambeth council’s leisure provider, GLL. Local campaigners were joined by library supporters from Barnet, Liverpool and elsewhere and by doctors from King’s College hospital who are campaigning against a new contract being imposed on them by government. Organisers put the number of protesters at 2,000, making one of the largest in Brixton for some time. The figure was even more impressive with a &#34;Cameron must resign&#34; protest in central London going on at the same time.&#34; see also 2,000 march to support Carnegie library fightback in south London – Socialist Worker.","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["North Yorkshire","Sun, 10 Apr 2016 20:17:30 +0000","North Yorkshire – North Yorkshire libraries lose 34 per cent of paid staff in five years – Harrogate Advertiser. 800 volunteers added in the same amount of time.  Paid staff will soon disappear altogether form 20 libraries.","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Stoke on Trent","Sun, 10 Apr 2016 20:17:30 +0000","Stoke on Trent – Love letter from 1945 found in library book – Stoke Sentinel. &#34;Staff at Hanley’s City Central Library discovered the message within the biography – William Wordsworth of Rydal Mount, by Frederika Beatty – in its storage area.&#34;","2016/04/the-only-hand-of-cards-left-the-strength-and-weaknesses-shown-in-the-lambeth-protest.html"],["Barking and Dagenham","Sun, 17 Apr 2016 19:25:32 +0000","Barking and Dagenham – Feature: What has become of Barking and Dagenham’s libraries? – Barking and Dagenham Post. &#34;after years of public spending cuts, more than half are no more. Wantz Library, in Rainham Road North, and Markyate Library, in Markyate Road, both closed in 2012 – the former is now used by Eastbrook Community Centre, the latter a nursery. Similar fates befell five others leaving only four libraries – Dagenham, Valence, Thames View and the Barking Learning Centre – still open and run by the local authority. There were 96,581 registered borrowers last year with 334,635 library books loaned out in 2015.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lambeth","Sun, 17 Apr 2016 19:25:32 +0000","Lambeth – Lambeth Council back tracks over press release that attempted to politicise the Carnegie protestors – Brixton Buzz. &#34; The Council has scrubbed out a quote in a press release from Cllr Jane Edbrooke [right] about the ongoing Carnegie library occupation. It appeared that the Progress Cllr was using the apolitical Communications Team to politicise her stance against the occupation. This is forbidden under government regulation as part of purdah [pdf], the period leading up to any election campaign. Council Communication Teams are prohibited from helping politicians to put across their blatant political message in the run to an election.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Brent","Sun, 17 Apr 2016 19:25:32 +0000","Brent – Success of the New Library at Willesden Green – James Powney’s Blog. Figures show usage has more than doubled.","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Liverpool","Sun, 17 Apr 2016 19:25:32 +0000","Liverpool – A Love Letter To Central Library – Independent Liverpool. &#34;BBC Culture just announced Liverpool’s Central Library to be one of the ten most beautiful libraries in the world. We think we speak on behalf of all bookworms when we whole-heartedly agree. In an ode to the recent prestigious title, we’ve decided to write a love letter to Central Library and libraries everywhere. Eleven libraries were due to close last year but were thankfully saved. Our mirage of a cultural desert did not come to fruition but it shouldn’t take the immediate closure of somewhere for us to appreciate them. So, whilst we try to articulate the sheer beauty of the building in a couple hundred words, we deep down realise that words are not enough. And that is kind of bittersweet as it has to be seen to be appreciated, making your visit all the more significant.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Brighton and Hove","Sun, 17 Apr 2016 19:25:32 +0000","Brighton and Hove – CCTV to be installed to allow bookworms access out of hours – Argus. &#34;A historic library will be fitted with seven CCTV cameras as a scheme allowing bookworms to browse unsupervised is rolled out. Rottingdean library is being fitted with £23,000 of new surveillance equipment as Brighton and Hove City Council’s Libraries Extra scheme is extended to more community libraries. The scheme allowing adult library users to use facilities after closing time and without librarians was launched in September in Woodingdean and Portslade libraries. Now after an increase in library users and the overcoming of the odd glitch, the council is preparing to roll out the scheme to more community libraries around the city creating a seven day a week service and doubling opening hours to more than 700 hours per week.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Kirklees","Sun, 17 Apr 2016 19:25:32 +0000","Kirklees – Kirklees Council has broken its promise over Holmfirth library, campaign group claims – Huddersfield Daily Examiner. &#34;One of the few Kirklees libraries promised &#34;full council support&#34; will need volunteers to keep it going, it is claimed. Kirklees Council restructured its libraries last year, splitting them into ‘Town Libraries’ and ‘Community Supported Libraries’.&#34; … &#34;Clr Turner told the Examiner volunteers would only be needed to &#34;enhance&#34; the service. But Mr Rudman said he was &#34;mystified&#34; how the council could deny volunteers were crucial and said he was concerned that people thought the eight Town libraries were completely spared from cuts.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lambeth","Sun, 17 Apr 2016 19:25:32 +0000","Lambeth – Carnegie Lesson – BookSeller / Stella Duffy.  &#34;Last Saturday morning I went for a walk with my neighbours – all 2,000 of them. For the 10 preceding days, members of the community had occupied the Carnegie Library in South London. These people are locals, ranging in age from small children to the retired, from all walks of life, and passionate about one thing – that, in a time of austerity, with central government cuts to local government budgets, the last thing it is appropriate to do is to close libraries&#34; … &#34;What the Carnegie Occupation proves is that not only is there huge support for libraries from the grassroots up, but that we also do not have to do as the council says. They are, after all, our elected representatives.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lambeth","Sun, 17 Apr 2016 19:25:32 +0000","Lambeth – Government Minister considers formal inquiry into Lambeth Council’s book-ish gyms plans – Brixton Buzz. Letter says &#34;The Department for Culture, Media and Sport (DCMS) has recently received a number of representations concerning the revisions to Lambeth’s library service provision. After consideration of the various issues raised, I can confirm that these are being treated as formal complaints in accordance with Section 10 (1) (a) of the Public Libraries and Museums Act 1964. Under the 1964 Act the Secretary of State may intervene if he is of the opinion that a local authority is failing to carry out its duty under the Act to deliver a &#34;comprehensive and efficient&#34; library service for library users by making a remedial order following a local inquiry.&#34;&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lincolnshire","Sun, 17 Apr 2016 19:25:32 +0000","Lincolnshire – ‘Propaganda does not deceive people; it merely helps them to deceive themselves.’ – Secret Librarian. &#34;So the not for profit organisation is now in charge of the County Council’s library operation, which is much trumpeted in their quarterly propaganda rag, with claims that as much as £500 000 can be saved in costs on top of the £1.9m already saved by delivering the service more effectively (for that read redundancies and cut hours).&#34; … &#34;So far there has been barely any communication from the social enterprise company to its new staff. Maybe that is because they realise that they have had much to contend with recently and are trying to take a gentle approach. However it does seem bizarre that staff do not have much of an idea so far of what their new employer’s policies and rules are across the board and are in a kind of limbo at present.&#34; see New Lease of Life – &#34;County News&#34;, Lincolnshire County Council (pages 16/17).","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Newport","Sun, 17 Apr 2016 19:25:32 +0000","Newport – Angry about cuts to Newport Libraries – Public LIbraries News, &#34;Catherine Finch recently contacted me about cuts to the library service in my home town of Newport in South Wales.  I remember using the Central Library there as a child. There was little to recommend the town apart from the library at the time.  I include this article here to stand for the many hundreds, thousands, or angry and disappointed library users who are looking on while their services are being destroyed. April, 2016.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Cheshire West and Chester","Sun, 17 Apr 2016 19:25:32 +0000","Cheshire West and Chester – Cheshire West and Chester Libraries to celebrate World Book Night – Chester Chronicle. Library staff giving books out in town centres, leisure centres and at a library theatre production.","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lancashire","Sun, 17 Apr 2016 19:25:32 +0000","Lancashire – Fylde MP Mark Menzies in Freckleton Library support – Mark Menzies. &#34;Mark Menzies attended a ‘read-in’ at Freckleton Library to show his backing for the facility. The library is currently under threat after Lancashire County Council revealed plans to severely curtail services as part of its annual budget. While county councillors are yet to reveal where the cuts will fall, Mr Menzies said it was vital communities came together to show their support for their local facilities.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Swindon","Sun, 17 Apr 2016 19:25:32 +0000","Swindon – Council left in no doubt about public opinion after passionate meeting of library campaigners – Swindon Advertiser. &#34;THE first public meeting of the Save Swindon’s Libraries campaign was held yesterday, with the council left in no doubt that residents are determined to fight them all the way. The Community Centre at Christ Church in Old Town was at standing room only, with organisers putting the attendance at 124 people. Best-selling guest authors Alan Gibbons and Jake Arnott spoke in support of Swindon libraries before the meeting was opened up for questions and answers. The campaign was formally launched six weeks ago after it became clear that Swindon Borough Council planned to make savings from the libraries budget of up to 65 per cent by 2020.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Croydon","Sun, 17 Apr 2016 19:25:32 +0000","Croydon – Have your say ….the Croydon libraries survey – Save Croydon Libraries Campaign. &#34;The ruling Labour administration claim to be ambitious for libraries yet it is unclear how they could be any more unambitious for libraries or in seeking the views of residents.&#34; … &#34;Those wanting a paper copy have to request one, in person, at a library. Their process advised was that the details would be taken and passed to the council officer who would then post a single copy out.  In some cases at least, the request had to go via the library manager before being passed on. Some residents have received a copy via this route.  Others have not&#34; … &#34;There are no public meetings planned, only focus groups, the location and time of which are secret. There is a public meeting called to discuss the issue, but this is a meeting called by the residents for the residents&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Dudley","Sun, 17 Apr 2016 19:25:32 +0000","Dudley – Dudley libraries to be run by volunteers – Express and Star. &#34;These services will now be run as a not-for-profit ‘mutual’ as part of the authority’s drive to save cash in the wake of Government cuts. All libraries, library links and the archive service will remain open, with the new combined service less reliant on council funding, which means a council saving of 11 per cent in 2016-17 rising to 30 per cent by 2017-18.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lambeth","Sun, 17 Apr 2016 19:25:32 +0000","Lambeth – Government intervention in Lambeth libraries confirmed – BookSeller. &#34;The government is to investigate Lambeth council’s plans to turn some of its libraries into &#34;healthy living centres&#34; run by social enterprise Greenwich Leisure Limited. The news comes after protestors yesterday (11th April) ended their 10-day occupation of Carnegie Library.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lancashire","Sun, 17 Apr 2016 19:25:32 +0000","Lancashire – Library closures to go ahead despite big visitor numbers – Pendle Today. &#34;Lancashire County Council will have no choice other than to go ahead with library closures despite figures showing Pendle’s libraries were visited 594,646 times in 2015. Statistics show Colne Library was visited 254,746 times last year while people went through the doors of the Nelson Library on a total of 187,435 occasions&#34;. Cutting councillore says &#34;Although there were 594,000 visits last year to libraries, that clearly isn’t 594,000 different people visiting, there may be one person visiting 100 times.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Leicestershire","Sun, 17 Apr 2016 19:25:32 +0000","Leicestershire – Leicestershire faces more cuts to library and heritage services – Hinckley Times. &#34;Toddler reading sessions, IT training and the Green Plaque scheme are all under threat as part of continued cost-cutting plans by cash-strapped Leicestershire County Council. Despite a raft of money-saving measures, including off-loading most of its rural libraries onto community groups and shutting Snibston Discovery Park, the authority still needs to slash its budget. For the communities and wellbeing service this means radically reducing spending on libraries, heritage and learning once again. A consultation is taking place until Monday May 2 and people are being urged to have their say on what matters to them most.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["North Yorkshire","Sun, 17 Apr 2016 19:25:32 +0000","North Yorkshire – Volunteers save Scalby Library from closure – Scarborough News. Scalby Library has been saved from closure thanks to a new group of volunteers supported by the parish council. The library had been earmarked for potential closure in February 2017 unless a community group came forward to run it.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Staffordshire","Sun, 17 Apr 2016 19:25:32 +0000","Staffordshire – Campaigners say petition shows strength of opposition to Lichfield Library plans – Lichfield Live. &#34;Campaigners say a 5,000 signature petition shows the strength of local anger over plans to relocate Lichfield Library. Staffordshire County Council has put forward proposals to move the facility to St Mary’s in the Market Square, allowing its current home at The Friary to be converted into residential accommodation.&#34; … &#34;&#34;Many, many people in this city are angry that decisions regarding the future of a vital public service and a much-loved Lichfield landmark have been taken behind closed doors without any regard for their views. They’re angry that the relocation of the library and the sale of The Friary have been presented as a done deal.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Dorset","Sun, 17 Apr 2016 19:25:32 +0000","Dorset – Dorset’s schools library service set to close this summer – Western Gazette. &#34;At a council meeting yesterday it was agreed that as a result of declining numbers of schools subscribing to the service, along with operational pressures, the service will close at the end of the summer term this year. The seven staff who will be directly affected by the closure have been informed of the decision&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Sheffield","Sun, 17 Apr 2016 19:25:32 +0000","Sheffield – Community libraries in Sheffield – Libraries Taskforce. &#34;Of the 16 libraries vulnerable to closure, 15 are now being run by community organisations: 5 are co-delivered and 10 are associate libraries and one is currently in transition to become an associate library. Although these libraries complement the service to the city, they do not form part of SCCs duty under the 1964 Act.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Sunderland","Sun, 17 Apr 2016 19:25:32 +0000","Sunderland – Libraries sell-off could raise £500,000 for Sunderland council – Sunderland Echo. &#34;Change of use for former libraries will net the six-figure sum as part of a council ‘property rationalisation programme’, which has seen the authority sell off or lease assets to help with financial restraints. Of the nine sites, three are currently being leased for community and charity projects, while four have been sold off for housing or commercial developments.&#34; … &#34;Hendon Library, in Toward Road, is under community rent and is being used by charity Back on the Map, which provides various courses, a community library and hub for residents.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["West Berkshire","Sun, 17 Apr 2016 19:25:32 +0000","West Berkshire – Thatcham residents’ views to be sought on future of town library – Newbury Today. &#34;the council said that no library would close until a detailed needs assessment had been carried out. Thatcham councillors discussed their next moves at an extraordinary meeting, where they heard that around 54,000 people used the library last year and that it employs five part-time staff. Town council leader Richard Crumly (Con, Thatcham Central) said he didn’t want to see any library close, but added they were expensive. Nevertheless, he said the town council would see if it could do anything to keep Thatcham Library open and to enhance the service.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["East Sussex","Sun, 17 Apr 2016 19:25:32 +0000","East Sussex – Water leak affects electrics at Eastbourne library – Eastbourne Herald. &#34;Library customers are being advised to use alternative facilities after a leak from a drainage pipe closed the library on Friday (April 8). Efforts are being made to reopen the library as soon as possible, but the East Sussex County Council facility will remain closed until next week.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lambeth","Sun, 17 Apr 2016 19:25:32 +0000","Lambeth – Rebel libraries councillor speaks out – Brixton Blog. &#34;while she said the Conservative government was &#34;the real villain&#34; of the piece, treating her constituents &#34;like dirt&#34;, her statement added several more areas where she believes the council has lost sight of what its communities want and need.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Powys","Sun, 17 Apr 2016 19:25:32 +0000","Powys – Some libraries could close, council warns – Brecon and Radnor Press. &#34;The council’s library service must find a quarter of a million pounds by April 2019 towards the authority’s overall £27m savings target. The current proposal is that the six main libraries – Ystradgynlais, Brecon, Llandrindod, Machynlleth, Newtown and Welshpool – and the two mobile library services for North and South Powys form the cornerstone of the service.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Renfrewshire","Sun, 17 Apr 2016 19:25:32 +0000","Renfrewshire – Book in to avoid late library fines – Daily Record. &#34;really tasty project launched yesterday means readers with overdue books can dodge fines by making a foodbank donation at their local library. The &#34;fines-for-food initiative&#34;, which runs until May 7, has been kicked off by Renfrewshire Libraries as part of World Book Night celebrations. It is believed to be the only library service in Scotland offering the food-for-fines swap.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Swindon","Sun, 17 Apr 2016 19:25:32 +0000","Swindon – Anger as councillors discuss library petition – Swindon Advertiser. &#34;Dozens of people gathered on the council chamber steps to protest against proposed changes to the library service ahead of a lively meeting on Thursday night. Swindon Borough Council has said to balance the books, the fund will need to be reduced by almost 60 per cent in the coming years, meaning many will need to be run by volunteers. Since the announcement was made, thousands of people have signed several petitions against the move, arguing libraries are too important not to fund.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Hampshire","Sun, 17 Apr 2016 19:25:32 +0000","Hampshire – Libraries offer help for young people – Portsmouth News. &#34;Reading Well provides 13 to 18-year-olds with information, support and advice on a wide range of mental health issues such as anxiety, depression, eating disorders and self-harm, and difficult life pressures such as bullying and exams&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lambeth","Sun, 17 Apr 2016 19:25:32 +0000","Lambeth – Rosamund Urwin: Lambeth sees libraries as relics and a luxury – Evening Standard. &#34;Is Lambeth council actively trying to alienate its electorate? First it angered the residents of Cressingham Gardens with plans to demolish up to 300 homes on the well-functioning estate. Then it failed to intervene as Network Rail booted out businesses in Brixton’s railway arches. And now — in the most baffling move yet — it has needlessly battered library provision in the borough.&#34; … &#34;Perhaps you’re wondering if austerity is the real cause here. And yes, Lambeth is having to make savage cuts. But there was an alternative, cheaper proposal to keep all 10 Lambeth libraries open and fully staffed. Head of library services Susanna Barnes believed it could be done as a community trust, as has happened in York. Lambeth seems barely to have entertained her idea. &#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lambeth","Sun, 17 Apr 2016 19:25:32 +0000","Lambeth – Waterloo Library will leave Lower Marsh ‘some time in June’ – London SE1. &#34;Originally slated to close at the beginning of this month, the existing Waterloo Library on Lower Marsh will stay open for at least another six weeks. However, there is still no clarity over the future staffing arrangements for the new library. The council has previously indicated that there would be no permanent library staff presence at the Oasis Centre. In one of her last actions before handing over responsibility for Lambeth’s libraries, Cllr Jane Edbrooke last week issued an update to local residents. &#34;Thanks to everyone for their patience in waiting for information on the move of the Waterloo Library from Lower Marsh to its temporary new home at the Oasis Centre, 1 Kennington Road,&#34; wrote Cllr Edbrooke. &#34;The building work on the Oasis Centre will be completed by the end of May. It will then take a week or so to prepare and stock the new library. We therefore look forward to an opening date some time in June.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lewisham","Sun, 17 Apr 2016 19:25:32 +0000","Lewisham – Balloting for strike – Concern over changes to library services – South London Press. &#34;Lewisham council is going ahead with its plan to replace paid jobs in libraries with volunteer positions and hand operation of Torridon Road, Manor House and Forest Hill sites to a third party. The council’s decision to press ahead was taken despite public opposition to the changes at consultation meetings and protests by library staff and users including pensioners and families with young children. The strike ballot, could lead to industrial action in May&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Wiltshire","Sun, 17 Apr 2016 19:25:32 +0000","Wiltshire – A question of age at the library – Gazette and Herald. &#34;Ten weeks after repeatedly calling on Wiltshire Council to publish their proposals for Calne library, which include adding unstaffed hours, they finally did so on Friday, April 1 (possibly an appropriate date). They will not be consulting on these plans – indeed work is due to start on the library on April 18. It may be of interest to your readers to note this insight into the council’s thinking. In the leaflet they have just published they write, under Frequently Asked Questions: ‘How will you stop this [library] being used as a meeting place for young people after hours?’ What is the problem with young people – ie under 16s? Are they not to be welcome in the library? Are public libraries not as much for children as adults? What kind of library is being created if children are not wanted at certain times?&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lambeth","Sun, 17 Apr 2016 19:25:32 +0000","Lambeth – Government to investigate Lambeth’s library plans – Guardian. &#34;The government is to investigate a council’s plans to turn some of its libraries into gyms with unstaffed book-lending sections, following a protest against the scheme – which won support from authors including Nick Hornby and Ali Smith. The Department for Culture, Media and Sport (DCMS) said it was treating objections to the Lambeth council plans as official complaints, the first stage in an investigation process that will determine if the south London authority has potentially breached the law.&#34; see also Government seeks answers over Carnegie Library closure – BBC.","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Leicestershire","Sun, 17 Apr 2016 19:25:32 +0000","Leicestershire – Deals could be struck to save three more closure-threatened Leicestershire libraries – Leicester Mercury. &#34;County Hall says it is confident deals can be struck to allow volunteers to take over three closure-threatened libraries. The Conservative-run council is seeking to save nearly £600,000 a year by off-loading 36 of its smaller libraries to community groups.&#34; … &#34;&#34;So far, 16 libraries have transferred to community groups, who have already made a series of improvements like longer opening hours and a wide range of sessions. It proves that local residents have the best ideas to run their libraries and I would like to see all 36 run by communities.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Shropshire","Sun, 17 Apr 2016 19:25:32 +0000","Shropshire – Letter: Close down library and we will lose that facility forever – Shropshire Star. &#34;Unless another organisation, be it Ludlow Town Council, a private concern or a community group agree by September to take over the running of Ludlow Library, it is liable to complete closure from April 2017. Shropshire Council is being typically close-lipped on the details, to the extent of forbidding its employees from discussing it or disclosing any details to the public. Another example of the cult of secrecy so loved by the council.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Somerset","Sun, 17 Apr 2016 19:25:32 +0000","Somerset – Librarian Theatre to visit Yeovil Library on Apil 25 to coincide with the 400th anniversary of Shakespeare’s death – This is the West Country. &#34;The Librarian Theatre will be performing ‘The Book’s the Thing’ – a retelling of Hamlet by William Shakespeare…but as it’s never been seen before, on Monday April 25 at 7.30pm&#34;. Tickets £7/£4.50.","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Suffolk","Sun, 17 Apr 2016 19:25:32 +0000","Suffolk – Suffolk Libraries introduces scheme to help young people with mental health issues – Bury Free Press. &#34;It is part of the successful Reading Well Books on Prescription scheme which is already available through the library service and has been developed with the help of a panel of young people who have had experience of mental health issues.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lancashire","Sun, 17 Apr 2016 19:25:32 +0000","Lancashire – Brought to book over cuts threat – Lytham St Anne’s Express. &#34;A ‘read-in’ held at Freckleton on Saturday attracted a large number of library users and a Friends of Freckleton Library organisation has been set up to co-ordinate the campaign. Chairman Brian Willis said: &#34;We feel we have a strong case and hope we can keep the library open. It is so important to so many organisations and individuals in the village and with good parking, it is very accessible to those from neighbouring villages, too.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lincolnshire","Sun, 17 Apr 2016 19:25:32 +0000","Lincolnshire – Application made to turn former library into shops – Boston Standard. &#34;Boston Borough Council has received the application from South Lincs Property Ltd which asks for a ‘change of use from library (Class D1) to shops (Class A1)’. Kirton’s library, on Station Road, was one of those closed by Lincolnshire County Council when it decided to reduce funding due to ‘cuts’. It has since transferred control of 15 major libraries to Greenwich Leisure Limited (GLL), a not-for-profit organisation. The library in Kirton has been taken on by volunteers following an appeal by the parish council. It has relocated to the New Life Community Church, at The Junction, on Wash Road.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Lincolnshire","Sun, 17 Apr 2016 19:25:32 +0000","Lincolnshire – Secretary of State declines to launch an Inquiry into Lincolnshire’s Library service – Save Lincolnshire Libraries. &#34;&#34;I am very disappointed with the response received, but not at all surprised. Despite my sending a great deal of evidence, Mr Ed Vaizey, M.P. has indicated that there will be no Inquiry.  This is despite the fact that he has used no standards to measure what a Comprehensive and Efficient Service would look like. The letter fails to address how the Secretary of State concluded that there will be a comprehensive and efficient service after reducing the core libraries to just 15.&#34; … &#34;My personal response to the Secretary of State’s decision not to intervene is that it must be a political one. He is saying that he will not intervene, yet the only 2 enquiries that have been undertaken at all have been to Labour controlled councils. One was the Wirral some years ago when Jeremy Hunt was the SOS (the details of which I compared with Lincolnshire in my own representation and it showed that Lincoln&#8230;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["North Yorkshire","Sun, 17 Apr 2016 19:25:32 +0000","North Yorkshire – Major achievement for library saved by volunteers – York Press. &#34;Town library saved by volunteers has been so successful it now plans to expand. Volunteers have been running the Barlby Library and Community Hub in Howden Road, for about four years, following national and local funding cuts. Last month, Barlby and Osgodby Town Council bought the building from North Yorkshire County Council for a nominal sum of £1, and now plans to bring even more activities to the centre.&#34;","2016/04/harry-potter-and-the-dcms-library-investigation.html"],["Bradford","Thu, 21 Apr 2016 21:28:59 +0000","Bradford – On Charlotte Bronte’s 200th birthday council to close library at her birthplace – Express. &#34;The plan by Bradford Council to close down the library in Thornton, where Charlotte, Emily and Anne were born and lived for their early part of their lives, has been branded &#34;shameful&#34;. The Brontes are more famously associated with nearby Haworth, to where their father Patrick moved the family in 1820. But all of the Bronte children, including wayward brother Branwell, were born at a small house on Market Street, Thornton, where Patrick was curate of the local chapel. On Thursday morning Bradford Council tweeted: &#34;Happy 200th birthday Charlotte Brontë, born in Thornton on 21 April 1816!&#34;&#34;","2016/04/more-remote-controlled-libraries-and-digital-trends.html"],["Monmouthshire","Thu, 21 Apr 2016 21:28:59 +0000","Monmouthshire – Take part in World Book Night at Abergavenny Library – Abergavenny Today, &#34;The celebration event tonight (Thursday April 21, 7pm) will have as guest speaker local author and historian Mr Frank Olding. Tickets are £3 to include a glass of wine – or two.&#34;","2016/04/more-remote-controlled-libraries-and-digital-trends.html"],["Hampshire","Thu, 21 Apr 2016 21:28:59 +0000","Hampshire – Future of 20 libraries in Hampshire up in the air as £1.7m of cuts agreed – Southern Daily Echo. &#34;chiefs have approved £1.7m cuts to Hampshire libraries including the end of the mobile library service. But small libraries could be saved from closure if new technology and other efficiencies are successful, Hampshire County Council told campaigners. Cllr Andrew Gibson, executive member for culture, recreation and countryside, said: &#34;I don’t think you’ll see me next year closing libraries.&#34; He approved a 14 per cent reduction yesterday which will see mobile libraries shut in June, saving £360,000 per year, but deferred a decision on whether to cut the book fund by 25 per cent.&#34;","2016/04/more-remote-controlled-libraries-and-digital-trends.html"],["Hampshire","Thu, 21 Apr 2016 21:28:59 +0000","Hampshire – Pensioner hits out at decision to end mobile library services across Hampshire – Portsmouth News. &#34;Mrs Bradley said: ‘It’s awful. ‘We haven’t really got a lot happening here, apart from the pub. It was just a God-send. ‘I don’t drive. I have good friends who take me out and I use taxis, but you don’t get a taxi to go to the library.&#34;","2016/04/more-remote-controlled-libraries-and-digital-trends.html"],["Kensington and Chelsea","Thu, 21 Apr 2016 21:28:59 +0000","Kensington and Chelsea – Council denies asset-stripping as community vows ‘to fight for future of North Kensington Library’ – Get West London. &#34;It plans to lease the current building to Notting Hill Prep School library in nearby Lancaster Road &#34; … &#34;Kensington and Chelsea Council has vociferously denied claims it is closing North Kensington Library and stripping the community of its assets. They were made during a protest outside the library in Ladbroke Grove after it emerged that the Grade II listed building is to be leased to a nearby prep school. But the Royal borough said the library was not closing, but moving to a new building just a stone’s throw away from the current site to Lancaster Road.&#34;","2016/04/more-remote-controlled-libraries-and-digital-trends.html"],["Lambeth","Thu, 21 Apr 2016 21:28:59 +0000","Lambeth – Lambeth Council Leader continues to mislead residents with confusing information about public libraries – Brixton Buzz. Lambeth council leader claims &#34;Of our ten libraries, two of them, Carnegie and Minet, have closed temporarily but they will reopen next year with books, study space and computers.&#34;&#34; … but article says &#34;The Carnegie and Minet will not re-open as libraries. Under the plans of the Nu Labour group, both will re-open as book-ish gyms.&#34; Plus Peck has ignored the fact that her Labour Council is also planning to shut the Tate South at Vauxhall, and the Durning library in Kennington.&#34;","2016/04/more-remote-controlled-libraries-and-digital-trends.html"],["North Somerset","Thu, 21 Apr 2016 21:28:59 +0000","North Somerset – Libraries launch new scheme to help young people – Cheddar Valley Gazette. &#34;At a time when one in ten young people have a diagnosable mental health issue, North Somerset Council‘s Library Service is launching a scheme to support them with expert endorsed books available to borrow for free.&#34;","2016/04/more-remote-controlled-libraries-and-digital-trends.html"],["West Sussex","Thu, 21 Apr 2016 21:28:59 +0000","West Sussex – Phone lines down at schools and libraries in Bognor and Chichester – Bognor Observer. &#34;Technical problems have seen phone lines go down at a number of schools, libraries and fire stations today. Residents are being thanked for their patience during a technical glitch affecting the County Council’s Contact Centre in Bognor Regis.&#34;","2016/04/more-remote-controlled-libraries-and-digital-trends.html"],["Worcestershire","Thu, 21 Apr 2016 21:28:59 +0000","Worcestershire – Opening hours face the chop at Wyre Forest libraries in £1m cutbacks – Evesham Journal. &#34;opening hours are set to be slashed across Worcestershire – with Stourport, Kidderminster and Bewdley libraries all to be hit by cuts. The controversial proposals will mean seventeen libraries across the county will be affected with opening times reduced by a total of 78.5 hours a week. In a leaked email seen by the Shuttle’s sister newspaper, the Worcester News, Worcestershire County Council could axe library jobs, introduce &#34;unstaffed periods&#34; inside the buildings and increase library fees as part of a fresh plan to save £1 million&#34;","2016/04/more-remote-controlled-libraries-and-digital-trends.html"],["North Yorkshire","Thu, 21 Apr 2016 21:28:59 +0000","North Yorkshire – Picnic in Iraq author continues his tour of Craven libraries – Craven Herald. &#34;Philip Caine will speak about his life and debut novel, Picnic in Iraq, at the village library next Thursday, April 28. It is the latest stop on his library tour.&#34;","2016/04/more-remote-controlled-libraries-and-digital-trends.html"],["Birmingham","Sun, 24 Apr 2016 19:42:39 +0000","Birmingham – Shakespeare Family Day – Library of Birmingham. Various free events listed.","2016/04/a-few-good-nights-to-be-a-librarian.html"],["Brent","Sun, 24 Apr 2016 19:42:39 +0000","Brent – Brent Libraries Bucking National Decline – James Powney;s Blog. &#34;You can see Brent’s figures are surprisingly unaffected by the closure of six libraries in October 2011.  The seven day opening hours and other changes offset any fall, and subsequently visit numbers took off in a really remarkable way, bringing Brent to the highest point for which I have a record.  The black line shows the national falling off which has been going on since at least 2005.  It is shorter as the 2015/16 figures have not been collated yet.  Turning to book loans, there is a similar picture.  The Brent rise is much less marked, but the national decline is similar.&#34;","2016/04/a-few-good-nights-to-be-a-librarian.html"],["Bristol","Sun, 24 Apr 2016 19:42:39 +0000","Bristol – Five Bristol libraries face closure next Thursday due to strike action – Bristol Post. Strike due to library workers being forced to take on new working hours, more spread out, which mean it is far harder to take on additional part time work in order to make ends meet.","2016/04/a-few-good-nights-to-be-a-librarian.html"],["Cambridgeshire","Sun, 24 Apr 2016 19:42:39 +0000","Cambridgeshire – Huntingdonshire libraries face cut in opening hours as part of savings drive – Hunts Post. &#34;The county council needs to save another £500,000 from the library service in Cambridgeshire in the current financial year, having already made £2.5million in savings since 2012, and so launched a review into opening hours in January. The review ran for more than a month and included a survey asking people whether they would be in favour of cutting the opening hours of some of the county’s main libraries – including in St Neots, Huntingdon, and St Ives.&#34;","2016/04/a-few-good-nights-to-be-a-librarian.html"],["Devon","Sun, 24 Apr 2016 19:42:39 +0000","Devon – Libraries Unlimited Launch on World Book Night – Libraries Unlimited. &#34;Libraries Unlimited, a staff and community-owned social enterprise, took over the running of 50 libraries across Devon from April 1st. They are pleased to be welcoming local partners, authors and community groups to learn more about their mission & development plans for improving and extending services provided by the libraries and to celebrate what is the 6th Annual Celebration of reading and books across the UK – World Book Night.&#34; .. &#34;Culture Minister Ed Vaizey  says , &#34;Libraries remain important to communities, not only as places to borrow books but as spaces where people can access a wide variety of information and services. Alternative governance models such as community co-operatives, mutuals and social enterprises can help maintain these important local services and put expert staff and communities at the forefront of decision making  I wish Libraries Unlimited great success as they start their new role in running libraries in Devon.&#8230;","2016/04/a-few-good-nights-to-be-a-librarian.html"],["Glasgow","Sun, 24 Apr 2016 19:42:39 +0000","Glasgow – Glasgow’s homeless to receive gift of reading – Evening Times. 50 World Book Night books to be donated to people in homeless shelters.","2016/04/a-few-good-nights-to-be-a-librarian.html"],["Lancashire","Sun, 24 Apr 2016 19:42:39 +0000","Lancashire – Community bid to save the libraries – Lancashire Evening Post. &#34;Deputy leader Alan Vincent, together with Wyre and County Coun Vivien Taylor, Shaun Turner and Howard Ballard travelled to York to meet with the chief executive Fiona Williams, head of the Community Interest Company which has run York Library Service for the past two years. The meeting was for the councillors to examine the way in which the service is operated and to see how Libraries could be run at lower cost to the tax payer without having to close large numbers of community hubs. Coun Vincent said: &#34;York spun its library service into a Community Interest Company two years ago making an immediate 20 per cent saving on cost with more to come.&#34;","2016/04/a-few-good-nights-to-be-a-librarian.html"],["Enfield","Sun, 24 Apr 2016 19:42:39 +0000","Enfield – End of an era for libraries in the borough – North London Newspapers. &#34;Decades of local authority provision of a comprehensive library service throughout the borough ended this month as the first &#34;community library partnership&#34; was announced. Ridge Avenue Library, at the corner of Church Street and Ridge Avenue in Bush Hill Park is now run by West Lea School who are based in Haselbury Road, Edmonton.&#34; … &#34;According to Micahel Hardyman, resident of Bush Hill Park and user of the John Jackson library in Agricola Place, a similar situation has occurred in that library, which he believes has impacted on the quality of service. He told The Advertiser: &#34;It has become apparent that if volunteers only are present the service offered is poorer because they only have limited access to the IT system.&#34;","2016/04/a-few-good-nights-to-be-a-librarian.html"],["Worcestershire","Sun, 24 Apr 2016 19:42:39 +0000","Worcestershire – Library opening hours in Redditch and Bromsgrove to face the chop in £1m cutbacks – Bromsgrove Advertiser. &#34;The controversial proposals will mean seventeen libraries across the county will be affected with opening times reduced by a total of 78.5 hours a week. In a leaked email seen by the Advertiser’s sister newspaper, the Worcester News, Worcestershire County Council could axe library jobs, introduce &#34;unstaffed periods&#34; inside the buildings and increase library fees as part of a fresh plan to save £1 million.&#34;","2016/04/a-few-good-nights-to-be-a-librarian.html"],["Newcastle","Sun, 24 Apr 2016 19:42:39 +0000","Newcastle – Internet giant Google to open ‘digital garage’ in Newcastle City Library – Chronicle. &#34;The pop-up facility will open today at Newcastle City Library and will provide one-to-one training and digital masterclasses five days a week.&#34; … &#34;Chi Onwurah, MP for Newcastle Central and Shadow Minister for Culture and the Digital Economy, said: &#34;Newcastle’s future economy will be digitally driven, I want everyone to be able to benefit from the fantastic opportunities digital is bringing so I urge all local businesses to take full advantage of the new Google Digital Garage, which offers free training and advice from online experts.&#34;&#34;","2016/04/a-few-good-nights-to-be-a-librarian.html"],["Bridgend","Tue, 26 Apr 2016 20:18:31 +0000","Bridgend – Books the height of Roald Dahl on show across Bridgend Libraries for summer reading scheme – Wales Online. Piles of book by Dahl, who was six foot three, are on display.","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Northern Ireland","Tue, 26 Apr 2016 20:18:31 +0000","Northern Ireland – Want to learn something new? – Coleraine Times. &#34;Libraries will host a series of free events to help your health, confidence and career and have a positive effect on your family, friends and colleagues. Events will cover a diverse range of subject such as art, crafts, local history, eBooks, eMagazines and IT sessions. Building on the success of 24 years of Adult Learners’ Weeks, the Festival of Learning (www.festivaloflearning.org.uk) is a national celebration of lifelong learning – because learning changes lives. &#34;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Brighton and Hove","Tue, 26 Apr 2016 20:18:31 +0000","Brighton and Hove – Phelim Mac Cafferty: Hove Library is a treasured cultural asset for us all – Brighton and Hove Independent. &#34;Despite the Labour councillors ignoring the petition to save the building at the last full council meeting, the petition continues to be signed and the campaign to save the building continues to grow. It is a sign of the passion residents have for our library and its impressive history. I have not received more correspondence on a single issue from residents than on Hove’s treasured Carnegie Library.&#34; … &#34;The business plan has us believe that flogging the purpose-built Carnegie library would make a good restaurant while the upstairs would be turned into flats. Why would a buyer risk the potential cost of dealing with the listed interior of the building as well as the £750k of urgent repairs that we are told the building needs? (despite the last survey stating the library is &#34;in good serviceable condition.&#34;)&#34;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Sheffield","Tue, 26 Apr 2016 20:18:31 +0000","Sheffield – Volunteers put in £1m of time running Sheffield libraries – Sheffield Telegraph. &#34;Fifteen of the city’s public libraries are now volunteer-run, and about 800 people have given up their time to help keep them open since Sheffield Council stepped back about 18 months ago. The authority said it could no longer run the libraries because it needed to save £1.6m from its library services budget after a 50 per cent cut in government funding.&#34;.  Volunteer says &#34;&#34;We have had some excellent help from the council, and succeeded in a lot of local fundraising, but there are still some areas in which we are looking to them for support, for example long-term leases and continued inclusion in the delivery system that transports books around the city.&#34; … &#34;Teams at the 15 volunteer-run libraries have come up with an range of ideas to try to bring in more visitors. Alongside book, DVD and CD loans and computer access, libraries now offer film clubs, special events and festivals, and games groups. They have also introd&#8230;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Staffordshire","Tue, 26 Apr 2016 20:18:31 +0000","Staffordshire – Campaigners ready to hand in Lichfield Library petition to Staffordshire County Council – Lichfield Live. &#34;Staffordshire County Council has unveiled the proposals to switch the facility to St Mary’s in the Market Square, with the current site at The Friary redeveloped as residential accomodation. A Save Lichfield Library petition was set up by Robert Pass, chair of the Lichfield and Burntwood branch of the Green Party calling on the authority to hold a public consultation. More than 6,300 signatures have ben collected – enough to trigger a fresh debate at the council.&#34;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Devon","Thu, 28 Apr 2016 20:20:46 +0000","Devon – Okehampton Library takes part in Libraries Unlimited launch – Okehampton Times. &#34;Last Saturday, the organisation held a @Librariesunltd selfie day social media campaign, urging people to take selfies in their local library. Among those to take part in Okehampton was Cllr Kevin Ball. The library’s friends group received a grant from Cllr Ball’s locality budget for a projector screen, stand and picture book box, which he got the chance to look at during his visit.","2016/04/taking-part-and-polish-train-station-libraries.html"],["Brighton and Hove","Tue, 26 Apr 2016 20:18:31 +0000","Brighton and Hove – Plans to merge Hove library with its museum have been put on hold – Juice Brighton. &#34;The issue was due to be discussed at council committee on Thursday as the libraries plan was put forward to councillors. But in a last minute decision, council leader Warren Morgan says the decision has been deferred&#34; … &#34;Throughout this process, senior officers from the libraries team have answered all of the points and queries put forward by councillors from all Groups, and have tabled a twenty five page business case setting out the financial case for the Libraries Plan as a whole. &#34;However I am keen that further time is given for exploration of the financial options involved if that is what is needed to secure a consensus.&#34;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Bristol","Thu, 28 Apr 2016 20:20:46 +0000","Bristol – Library assistants go on strike – Bristol 247. &#34;Bristol librarians gathered outside libraries across the city on Thursday as they went on strike to protest against altered shift patterns. Outside Bedminster library, striking library staff cheerfully held up signs saying, &#34;Honk for Libraries&#34; and &#34;You know things are messed up when Librarians start marching.&#34; Although they declined to comment without a union representative on hand (&#34;I think they’re afraid of what we might say,&#34; one woman joked), the assistants passed out fliers to passersby with information about the strike and tips on how to support library assistants. The fliers, published by public service union Unison, detail how the shifts negatively impact library assistants by requiring them to work shifts &#34;over more days, for fewer hours at a time&#34;","2016/04/taking-part-and-polish-train-station-libraries.html"],["Bristol","Tue, 26 Apr 2016 20:18:31 +0000","Bristol – Strike to force all Bristol libraries to close for one day – Western Daily Press. &#34;All Bristol’s libraries will be closed on Thursday (April 28) due to strike action called by Unison. Library Assistants have taken the decision to strike over a dispute about new shift patterns due to revised opening hours which have been in place since April 4.&#34; … &#34;Bristol City Council has said the new hours were implemented following a comprehensive consultation with the public, who highlighted the importance of access to their local library and their preferred hours of opening&#34; see also Bristol’s libraries will be closed on Thursday due to strike action – Bristol Post. &#34;The 95 part time library assistants now have to work shorter hours but more days – including every Saturday – which increases their travel costs and wipes out any chance of taking a second job to make up their wages. Unison says the library assistants are paid from £7.25 upwards but the council claims they are paid between £9.18 and £10.23 an hour and are&#8230;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["North Somerset","Tue, 26 Apr 2016 20:18:31 +0000","North Somerset – Libraries and children’s centres could be located under one roof as part of council cash saving plan – Bristol Post. &#34;Cash strapped North Somerset Council – tasked with shaving an additional £8.5 million off its budget over the next year – is drawing up options to co-locate some of its services. The authority currently either owns or leases 41 buildings across the district to house its libraries and children’s centres. The changes could see children’s centres and libraries come under one roof, with some perhaps being moved into existing leisure centres. The council currently operates 15 children’s centres across the district as well as 13 libraries and one mobile library. The changes would come into force over three years and save the authority an estimated £500,000.&#34;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Sheffield","Tue, 26 Apr 2016 20:18:31 +0000","Sheffield – They did so much more – Sheffield Star / Letters. &#34;Informal social work, such as providing social interaction for the elderly and vulnerable, educating and entertaining young and old people, promoting literacy and helping people find employment were among the many important tasks to society they carried out. The dramatic fall in visits to the libraries in which they used to work, since the staff left, indicates that library users have voted with their feet&#34;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Lambeth","Thu, 28 Apr 2016 20:20:46 +0000","Lambeth – Saving my library card in the hope of better times – Secret Life of God. &#34;On 31st March, Lambeth ‘decommissioned’ UNJL and made all its staff redundant. The service is to become The Crystal Palace Community Learning Hub, with (some of?) its books available for loan on one of its two floors and no dedicated librarians. (When I first published this blog yesterday, this was supposed to happen this Sunday, 1st May, but it’s since been announced the transfer will happen on 1st July.) I won’t bore you with all the twists and turns that led up to this situation, although as a former member of the campaign to save UNJL and the trust which will run the hub, I know quite a bit of the background. The library’s change of fortunes is part of the now notorious decision by Lambeth Council to turn some of the borough’s libraries into gyms, which led to the recent nine-day occupation of Carnegie Library in south London&#34;","2016/04/taking-part-and-polish-train-station-libraries.html"],["Lancashire","Thu, 28 Apr 2016 20:20:46 +0000","Lancashire – Political row over libraries protest in Wyre – Fleetwood Weekly News. &#34;Wyre Conservative councillors are calling on Lancashire County Council not to carry out its plans to close more than half the county’s branches. There are fears that libraries in Wyre could be among 40 of Lancashire’s 74 branches to close later this year as a result of huge savings needed.&#34;","2016/04/taking-part-and-polish-train-station-libraries.html"],["Sheffield","Thu, 28 Apr 2016 20:20:46 +0000","Sheffield – Listed Walkley Library in Sheffield to house bar – BBC. &#34;Part of a Grade II-listed library in Sheffield will become a cafe bar under plans approved by the council. The Walkley Library building, on the corner of South Road, will continue to house a library. But True North Brew Company, which owns several pubs in the city including the York in Broomhill, plans to renovate and extend the 1904 building to accommodate a bar. The plans were passed by Sheffield City Council on Monday. Chris Reece, chair of the Walkley Carnegie Library charity, said it had been run by volunteers since November 2014.&#34;","2016/04/taking-part-and-polish-train-station-libraries.html"],["Cheshire West and Chester","Tue, 26 Apr 2016 20:18:31 +0000","Cheshire West and Chester – Giving an Author Talk – Do You Write Under Your Own Name? / Martin Edwards. &#34; am a big fan of libraries,and I’m glad that those in Cheshire, like those in Nottinghamshire I visited recently, are coping well despite the severe financial pressures. Much depends on the initiative and enterprise of the staff, and those I’ve met in both counties are doing a great job in adapting to the brave new world in which libraries now exist.&#34;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Cornwall","Thu, 28 Apr 2016 20:20:46 +0000","Cornwall – Questions over library’s future rumble on, as council learns of cost implications – Cornish and Devon Post. &#34;Launceston library’s building could cost the town council hundreds of thousands of pounds if the running of it was devolved from Cornwall Council, a meeting heard last week. At last Tuesday’s meeting of Launceston Town Council, a presentation was given about the financial implications of the town council taking over Launceston library. The town council had previously agreed to commission business consultancy ‘Perfect Moment’ to carry out research to help the council in considering the future of the library at a cost of around £11,000. The report looked at the financial implications of the town council taking over Launceston library, and Kevin Brownridge of Perfect Moment gave a presentation to councillors and members of the public present at the meeting last week.&#34;","2016/04/taking-part-and-polish-train-station-libraries.html"],["Plymouth","Thu, 28 Apr 2016 20:20:46 +0000","Plymouth – Plymouth’s new library to stage Shakespeare play – Herald. &#34;The library opened in its new home, on the corner of Armada Way and Mayflower Street, in March 2016. And on Saturday, April 30, it will host the Librarian Theatre (below), a new company travelling the country creating shows based on classic plays and stories and already praised by top writers such as Margaret Atwood&#34; … &#34;The actors adapt the plays to be performed between the bookshelves at libraries and bookshops, and their first show, The Book’s The Thing, is described as a &#34;rapid re-telling&#34; of Shakespeare’s famous tragedy Hamlet – only with a woman in the central role.&#34; … &#34;They are a not-for-profit organisation who aim to work alongside the library sector to deliver accessible, affordable and professional quality theatre to local communities&#34;","2016/04/taking-part-and-polish-train-station-libraries.html"],["East Riding of Yorkshire","Tue, 26 Apr 2016 20:18:31 +0000","East Riding of Yorkshire – Free WiFi at East Riding libraries – Pocklington Post. &#34;Customers visiting East Riding libraries, including the ones in Pocklington, Market Weighton and Stamford Bridge, can get online for free. East Riding Council has announced that all its branches now offer WiFi. The authority successfully secured a £61,000 grant from Arts Council England to fund the installation of the WiFi network in its library branches.&#34;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["St Helens","Tue, 26 Apr 2016 20:18:31 +0000","St Helens – St Helens Libraries launch scheme to support youngsters with mental health issues – St Helens Star. &#34;Part of a national scheme, Reading Well will provide 13 to 18-year-olds with quality information, support and advice on a wide-range of mental health issues including anxiety, depression, eating disorders and self-harm, as well as difficult life pressures such as bullying and exams. &#34;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Oldham","Tue, 26 Apr 2016 20:18:31 +0000","Oldham – Popular Live@thelibrary returns to Oldham Library with exciting new season – Oldham Libraries (press release). &#34;Discover a world of drama, poetry and storytelling at Oldham Library as the popular Live@theLibrary returns for a new season. Oldham Council Libraries is bringing an exciting and jam-packed three-month programme of live events to the borough – taking audiences on an adventure of laughter, fun and theatrical drama with new work by theatre companies and authors. Live@theLibrary – which takes place from May to July – includes Richard Burton’s nephew, Guy Masterson in Under Milk Wood, best-selling crime writer Peter Wood and comedienne Jackie Hagan.It also features a feast of children’s theatre including Roald Dahl’s The Twits and Walter Lemonface – a show combining live animation with music and storytelling. Hans Christian Andersen’s enchanting stories The Nightingale and The Ugly Duckling will also be performed.&#34; More details here.","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Powys","Tue, 26 Apr 2016 20:18:31 +0000","Powys – Have your say on Powys libraries as £250,000 is looking to be saved – County Times. &#34;People  will be able to have their say on the future of the county’s libraries with £250,000 savings earmarked by April 2019. With Powys County Council (PCC) needing to save £27 million in the next three years, the council is appealing to users, residents, businesses and voluntary groups on how best to deliver services. The current proposal is that the six main libraries – Ystradgynlais, Brecon, Llandrindod, Machynlleth, Newtown and Welshpool – and the two mobile library services for North and South Powys form the cornerstone of the service&#34;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Waltham Forest","Tue, 26 Apr 2016 20:18:31 +0000","Waltham Forest – Interactive Leytonstone Library event puts the fun back into reading – Guardian Series. &#34;An interactive event featuring talking books and moving shelves hopes to change the idea that no fun can be had in libraries. The Librarian by Inspector Sands event for children over four is heading to both Leytonstone Library, in Church Lane, and Hale End Library, in Castle Avenue, Highams Park.&#34;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Swindon","Tue, 26 Apr 2016 20:18:31 +0000","Swindon – D-day looming for views over Swindon’s libraries – Swindon Advertiser. &#34;Save Swindon’s Libraries are urging residents to get all submissions on the library service in to Swindon Borough Council by the deadline of April 29. Sarah Church, chairman of the Save Swindon’s Libraries campaign, said: &#34;It is vital that all library users tell the council exactly what they need in a library service. We are encouraging individual users, friends groups, readers’ groups, and any other bodies of residents to submit their views to the council this week.&#34; … &#34;The campaign continues to fight the decision to cut 60 percent of the libraries budget by 2020, although £300,000 has already disappeared from the service this year. &#34;","2016/04/cuts-in-north-somerset-a-strike-in-bristol-and-petitions-over-library-moves.html"],["Brighton and Hove","Thu, 28 Apr 2016 20:20:46 +0000","Brighton and Hove – Labour suffer setback in Hove Library sell-off plans in face of Green and Conservative opposition – Argus. &#34;Green councillors have forced controversial plans to close the historic Hove Library building to be put on hold. Councillors were due to vote on the business case for the sale of the 1908 Andrew Carnegie building in Church Road, Hove, tomorrow but the agenda item was pulled yesterday afternoon. The proposals were set to be defeated after a Green amendment calling to put the plans on hold received backing from the Conservatives. Green councillor Ollie Sykes said the business case for selling off the grade II listed building to fund the creation of a new cultural centre with a library 400 yards further west at Hove Museum was riddled with &#34;flaws and inconsistencies&#34;.&#34;","2016/04/taking-part-and-polish-train-station-libraries.html"],["Harrow","Thu, 28 Apr 2016 20:20:46 +0000","Harrow – Outgoing mayor says the voluntary sector is key to Harrow’s future – Harrow Times, &#34;Cllr Suresh also said Harrow library service is also benefitting from the help of volunteers after &#34;a lack of funding to employ people in libraries&#34;. Speaking of what he thought should be Harrow’s priorities going forward, he said: &#34;The voluntary sector in Harrow needs more attention and constant monitoring and training.&#34;","2016/04/taking-part-and-polish-train-station-libraries.html"],["Lancashire","Thu, 28 Apr 2016 20:20:46 +0000","Lancashire – New digital library service has launched – Lancashire Libraries. &#34;BorrowBox is an online application allowing library members to download e-books and audiobooks straight to their smartphones, iPads, tablets, laptops or computers. The availability of this free service means that customers can browse, download and read items 24 hours a day, seven days a week…&#34;","2016/04/taking-part-and-polish-train-station-libraries.html"],["Southampton","Thu, 28 Apr 2016 20:20:46 +0000","Southampton – Southampton’s Burgess Road library reopens thanks to volunteers – Romsey Advertiser. &#34;instead of closing for good, Burgess Road Library in Southampton has now reopened under new management. The library was one of five faced with potential closure after the city council withdrew its funding. However this week the library is back open and running the same activities enjoyed by hundreds of residents under a team led by volunteers and a local church. Christ Church Southampton has taken over the management of the facility from the council and it reopened to the public this week.&#34;","2016/04/taking-part-and-polish-train-station-libraries.html"],["Lambeth","Thu, 28 Apr 2016 20:20:46 +0000","Lambeth – Another Lambeth Council library U-turn as Labour group agrees to keep librarians at Upper Norwood – Brixton Buzz. &#34;Lambeth Council has undertaken yet another U-turn over the controversial libraries policy. The Labour administration has now announced that the Upper Norwood Joint Library will retain library staff, with 35 hours of provision provided per week. The library will be managed by the Upper Norwood Library Trust, with £85,000 funding from the Council. The original Culture 2020 proposals were for the library to be funded using the money raised by the sale of other libraries.&#34; … &#34;It raises questions as to why a similar model can’t be put in place at the Carnegie and Minet – both of which are under threat of becoming book-ish gyms.&#34;","2016/04/taking-part-and-polish-train-station-libraries.html"]]