[["Leicestershire","Thu, 01 Oct 2015 21:34:50 +0000","Leicestershire – Community groups on course to take over libraries – ITV. &#34;Community groups are on course to take over the running of more than 30 county council libraries in Leicestershire within the next six months. &#34;","2015/10/electric-dreams-digital-inclusion-and-uncertainties.html"],["Lincolnshire","Thu, 01 Oct 2015 21:34:50 +0000","Lincolnshire – New era for libraries – Lincolnshire Council. &#34;Volunteers are now at the heart of Lincolnshire’s library service, giving communities the chance to do things their own way. County libraries have entered an exciting era as plans for a new-look service become reality.&#34;.  30 libraries have lost paid staffing and volunteers have taking them over to avoid them closing: &#34;All the groups receive ongoing professional support and over £5,000 a year towards running costs. One-off grants of up to £15,000 are also available for changes to buildings or equipment&#34; … &#34;Although the council continues to run some &#34;core&#34; library services at the moment, that could change following an approach by a third-sector organisation. That has required us to put those services – including supporting the hubs – out to competitive procurement, meaning an external organisation could take them over.&#34;","2015/10/electric-dreams-digital-inclusion-and-uncertainties.html"],["Leicestershire","Thu, 01 Oct 2015 21:34:50 +0000","Leicestershire – Uncertainty remains over future of four closure-threatened Leicestershire libraries – Leicester Mercury. &#34;The libraries in Braunstone Town, Mountsorrel, Narborough and Kirby Muxloe may shut as part of cost cutting plans by Leicestershire County Council. Bosses at County Hall say they have been able to reach agreements that will see 32 smaller county libraries managed by volunteers leaving just four at risk of closure. They are looking at replacing the four libraries with a mobile service.&#34; … &#34;Braunstone Town Council says it is ready and willing to run the library. Town council leader Nick Brown said: &#34;Before the deadline we submitted a proposal which we think did meet their criteria. &#34;Either through a complete miscommunication or intransigence nothing happened.&#34; see also Cabinet 7 October 2015 Future strategy for the delivery of library services: report of the director of adults and communities.","2015/10/electric-dreams-digital-inclusion-and-uncertainties.html"],["Lincolnshire","Thu, 01 Oct 2015 21:34:50 +0000","Lincolnshire – Proposal to save Deeping Library is rejected – Rutland and Stamford Mercury. &#34;An alternative proposal to keep Deepings Library open with paid council staff has failed, leaving its future in the hands of volunteers. Lincolnshire County Council and South Kesteven District Council spent the summer discussing a plan backed by Deepings MP John Hayes (Con) to save the library in Market Deeping from closure.&#34; … &#34;The proposal was to move the two district council staff from the Deepings Community Centre to the library, with the county taking on one of the salaries. This would have allowed the library to stay open with paid staff in a similar operation to the community access point at Bourne Corn Exchange. The proposal was put forward after the county council pulled the funding from two thirds of its libraries, including Deepings.\nBut after months of talks it was revealed on Wednesday that the proposal would not go forward.&#34;","2015/10/electric-dreams-digital-inclusion-and-uncertainties.html"],["Reading","Thu, 01 Oct 2015 21:34:50 +0000","Reading – Libraries in Reading: cuts of £600,000 to be made – Get Reading. &#34;Every branch library in Reading – apart from Central Library- will come under scrutiny as the council searches for £600,000 worth of cuts. Reading Borough Council is expected to launching a six-week public consultation from October 12 to November 23 asking people how they use the libraries and what they want from them. Leader of the council Councillor Jo Lovelock was at pains to point out today, Wednesday, September 30, there was &#34;no blueprint hidden away in the council&#34; and there were no concrete proposals for any of the libraries yet.&#34; see also Reading Council plans £600k cut to library service – BBC.","2015/10/electric-dreams-digital-inclusion-and-uncertainties.html"],["Staffordshire","Thu, 01 Oct 2015 21:34:50 +0000","Staffordshire – Libraries handed over to save cash – Stoke Sentinel.","2015/10/electric-dreams-digital-inclusion-and-uncertainties.html"],["Sheffield","Thu, 01 Oct 2015 21:34:50 +0000","Sheffield – Sheffield libraries branch out a year on from handover – Star. &#34;&#34;While volunteers cannot ever fully replace the work done by professional, qualified librarians, libraries remain important local, social spaces,&#34; said Bob, of the Stannington and District Library Group.&#34; … &#34;A year has now passed since community groups in the affected areas – including Broomhill, Totley, Upperthorpe and Walkley, as well as Stannington – first picked up the keys to their libraries. Thanks to their efforts, and no doubt with some relief, the city council is able to report that no facilities have closed, despite needing to save £1.6m from its library services budget by next year&#34;","2015/10/electric-dreams-digital-inclusion-and-uncertainties.html"],["Anglesey","Sun, 18 Oct 2015 20:16:41 +0000","Anglesey – Anglesey Council seeks views on possible library closures and service changes – News North Wales. &#34;The County Council launched a consultation process on Monday as part of a review of its Library and Information Service which could see opening hours cut or some of its 10 current libraries closed. The authority says the aim is to ensure a library service which is fit for the 21st century and meets statutory duties, whilst also responding to the significant financial pressures now faced by the council.&#34;","2015/10/its-not-alright-on-the-wight.html"],["Cheshire West and Chester","Thu, 15 Oct 2015 20:32:36 +0000","Cheshire West and Chester – Cultural services under review in West Cheshire  – Chester Chronicle. The consultation is now in progress and will continue until Wednesday, December 2. Background information on each of the services is included in the consultation document and questionnaire as well as their aspirations for working differently in the future. Three potential options for the future are also explained. These are that the council continues to provide the services, that a wholly council-owned company is set up under the council’s direction or an independent social enterprise/charitable organisation could be established which could benefit from the opportunities that arise from having charitable status such as gift aid.&#34;","2015/10/norfolking-libraries.html"],["Hounslow","Thu, 15 Oct 2015 20:32:36 +0000","Hounslow – Consultation on the future of parks and libraries – Brentford TW8. &#34;At the heart of the consultation exercise is a draft strategy that sets out four objectives: to modernise the borough’s library service; to enhance local parks and open spaces; to support residents to be more active; and to celebrate Hounslow’s cultural make-up and rich heritage.&#34; … &#34;The strategy proposes a shift towards online and digital services. And, for libraries, it also refers to the need to reach out to more residents since, while the Chiswick, Feltham and Hounslow branches remain busy, overall use of libraries has dropped by 20 per cent in the past five years.&#34;","2015/10/norfolking-libraries.html"],["Fife","Tue, 13 Oct 2015 20:50:20 +0000","Fife – Lundin Links community comes together for library demo – Fife Today. &#34;…campaigners believe shutting Lundin Links will conserve less than £10,000 a year. Local groups turning out for Thursday’s community gathering included Largo Community Choir, Largo Mums ‘n’ Tots and Largo Preschool Playgroup. Backed also by award-winning children’s author, Chae Strathie, who lives in Lundin Links, they are determined that Fife Council should listen to the strongly-held views of the importance of library to community life.&#34;","2015/10/lament-for-lambeth.html"],["Lambeth","Tue, 13 Oct 2015 20:50:20 +0000","Lambeth – Local library campaigner criticises Lambeth Council for playing ‘political football’ with public service – Brixton Buzz. &#34;Following the claims by Kate Hoey MP that the mini-me leisure centres are &#34;obviously ripe for a judicial review,&#34; Robert Gibson of the Upper Norwood Library Campaign has stated that the sham consultation passed by Cabinet on Monday evening is open to a legal challenge.&#34;","2015/10/lament-for-lambeth.html"],["Anglesey","Sun, 11 Oct 2015 19:03:08 +0000","Anglesey – Holyhead Market Hall library revamp bid takes further step – Daily Post. &#34;Plans have been submitted to transform a dilapidated market hall into a library. Anglesey Council have submitted plans to safeguard the future of Holyhead’s Market Hall, which has been in a state of disrepair for many years.&#34; … &#34;Councillor Kenneth Hughes, education and libraries portfolio holder, said: &#34;This project will strengthen Anglesey Library Service’s ability to offer high-quality facilities for the people of Holyhead and the surrounding area, whatever they are looking for – from books and films, access to computers and tablets, information sources and children’s activities. &#34;The Library Service is undergoing a detailed review to ensure that libraries are able to deliver services in innovative ways making the best use of the available resources. &#34;This project will be central to any future delivery proposals.&#34;","2015/10/not-so-bright-in-brighton.html"],["Fife","Sun, 11 Oct 2015 19:03:08 +0000","Fife – Protest against Lundin Links Library closure – Chronicle. &#34;The library is one of 16 facing the axe under plans to save Fife Council cash, but members of Largo Community Choir, Largo Mums ‘n’ Tots and Largo Pre-school Playgroup were among those railing against the proposals. Local resident Heather Paterson said the library does not fulfil the criteria for closure set out by the Fife Cultural Trust, stressing that it is performing well, is in a suitable building and offers good value for money.&#34;","2015/10/not-so-bright-in-brighton.html"],["Barnet","Thu, 08 Oct 2015 21:34:03 +0000","Barnet – Council workers stage strike over job fears – Barnet and Whetstone Press. &#34;Members of the Unison union took to the picket lines across Barnet with strikers protesting at East Finchley Library in East Finchley High Road, the council refuse depot at Bittacy Hill in Mill Hill East yesterday (Wednesday October 7.) Later they joined a rally outside council offices at Barnet House in High Road, Whetstone. Earlier in the day Shadow Chancellor John McDonnell joined striking council workers at the council refuse depot&#34;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Bradford","Thu, 08 Oct 2015 21:34:03 +0000","Bradford – People urged to volunteer to help run district’s museums and libraries – Telegraph and Argus. &#34;… with budgets dwindling, volunteers have also played an increasingly important role in the district’s  libraries. Libraries at Wrose, Denholme, Wilsden and Addingham have all stayed open, thanks to members of the community stepping forward to run them without pay&#34;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Lewisham","Thu, 08 Oct 2015 21:34:03 +0000","Lewisham – Lewisham Council is consulting on options for the future of the libraries in a bid to cut costs – This is Local London. Consultation and cuts described.","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Brighton and Hove","Sun, 18 Oct 2015 20:16:41 +0000","Brighton and Hove – Library could be sold for £1m after merger with Hove Museum – Brighton and Hove Independent. &#34;Hove Library, a Grade 2 listed building, could be fetch as much as £1 million under plans to integrate the library into a new &#34;cultural centre&#34; in an extended Hove Museum.&#34;","2015/10/its-not-alright-on-the-wight.html"],["Hertfordshire","Sun, 18 Oct 2015 20:16:41 +0000","Hertfordshire – The Unlikely Pilgrimage of a Hemel Book Group – Hertfordshire Council. &#34;After reading The Unlikely Pilgrimage of Harold Fry, members of a Hemel walking reading group made their own journey through the old town and down the River Gade, while discussing the plot and themes of Rachel Joyce’s novel. Meeting at Hemel Library’s temporary base in the Civic Centre, the group of 14 departed at 10am for an hour long walk through Hemel. Participant Grace Brett really enjoyed the event: &#34;I enjoy walking very much, and the fact that the walk was connected to this book made it even more interesting. I spoke to lots of people I’d never met before; it was great to compare our thoughts about the book.&#34;&#34;","2015/10/its-not-alright-on-the-wight.html"],["Kirklees","Sun, 18 Oct 2015 20:16:41 +0000","Kirklees – Labour and Lib Dems row over library futures – Batley and Birstall News. &#34;Kirklees Council’s recent ruling on the future of libraries in the area has been called in for scrutiny by the Liberal Democrat group.&#34; … &#34;Coun Kath Pinnock told the Guardian that the Lib Dems were &#34;dissatisfied&#34; with the level of information given to Cabinet about the decision. &#34;Beneath the headline that 24 of the 26 libraries would remain open were huge changes which will put the futures of many of them in jeopardy,&#34; she said.&#34;","2015/10/its-not-alright-on-the-wight.html"],["West Berkshire","Sun, 18 Oct 2015 20:16:41 +0000","West Berkshire – Council warns of £10.6m cuts to come – Newbury Today. &#34;Although Mr Lundie declined to answer specific questions about what other services would be at risk, he said that it would be looking at &#34;libraries, children’s centres, and well-funded organisations like Mencap&#34;.&#34;","2015/10/its-not-alright-on-the-wight.html"],["Wrexham","Thu, 15 Oct 2015 20:32:36 +0000","Wrexham – 20% Council Funding Cut For Wrexham Theatre – Wrexham.com. &#34;Options to increase footfall through the building and develop its ‘community central focus’ included moving the Rhos Library into the facility, with the idea initially mooted last year during a debate on the future of libraries across the county borough. However speaking at the Executive Board this week, Cllr Jones said that due to the Stiwt being a listed building and its internal limited structures would result in a ‘compromised’ library service.&#34;","2015/10/norfolking-libraries.html"],["Lambeth","Tue, 13 Oct 2015 20:50:20 +0000","Lambeth – Kate Hoey MP criticises Lambeth Labour after Cabinet agrees to convert three libraries into gyms – Brixton Buzz. &#34;Kate Hoey MP has criticised Lambeth Council’s decision to convert three libraries into gyms, and to sell off the site of the Waterloo library. The Labour MP for Vauxhall has written to the Labour Cabinet at the Town Hall questioning the legality of the decision that was passed during a rowdy Cabinet meeting at Dunraven School on Monday evening&#34;","2015/10/lament-for-lambeth.html"],["Lambeth","Tue, 13 Oct 2015 20:50:20 +0000","Lambeth – No gyms, Jim! say protesters – Brixton Blog. &#34;More than 200 people packed into the assembly hall of Dunraven School in Streatham and several times interrupted proceedings with shouting and jeers, while the excluded protesters – who were eventually admitted – could be heard banging on the door. At one point, as cllr Jim Dickson was speaking, they broke into a chant of &#34;No gyms, no gyms&#34;. As well as dozen or more opponents of the scheme, who made detailed and emotional comments on how the changes to Lambeth’s libraries would affect their communities, Helen Hayes. MP for Dulwich and West Norwood, spoke at the meeting. Herne Hill’s Carnegie library in her constituency is one of those affected. She said she fully recognised the problems that massive cuts in government grants posed for the council and for the most vulnerable people in the community who relied on it.&#34;","2015/10/lament-for-lambeth.html"],["Cheshire West and Chester","Sun, 11 Oct 2015 19:03:08 +0000","Cheshire West and Chester – Cheshire West librarian receives national award  – Chester Chronicle. The awarding of an honorary CILIP fellowship to Ian Anstice [Yes, me – Ed.] is reported. See also Winsford librarian awarded Honorary Fellowship – Winsford Guardian.","2015/10/not-so-bright-in-brighton.html"],["Lambeth","Thu, 08 Oct 2015 21:34:03 +0000","Lambeth – Dawn of the Zombie Library – (Email from Laura Swaffield, chair of the Library Campaign but also a Lambeth resident). &#34;Londoners are set to be reluctant pioneers of a scary new concept – the public library with no staff at all. On 12 October, Barnet and Lambeth councils will both meet to discuss schemes to save public libraries – by making them much smaller, and expecting users to shift for themselves. Opposition to the scheme is strong in both boroughs … I’ve seen some dreadful ideas in my time, but this is a whole new horror. All five libraries under threat are packed all day with free activities for all ages. With no staff, all this will go. They’ll be zombies – they’ll look a bit like libraries, but they will be dead. And there will be nobody to safeguard children, help people use the computers or find information. Older people, disabled people, those with little English – in a deprived borough like Lambeth there’s a long list of people who often need support using a library. They are betraying the vulnerable people &#8230;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Lambeth","Thu, 08 Oct 2015 21:34:03 +0000","Lambeth – Unison condemns proposal to turn libraries into ‘gyms’ – BookSeller. &#34;Lambeth Unison has condemned Lambeth Council plans to keep three libraries open by turning them into health centres.&#34; … Council says &#34;&#34;Not everyone will welcome these proposals and there will be some job losses and changes to services,&#34; she said. &#34;But by using much loved community buildings more imaginatively, Carnegie, Minet and Tate South Lambeth have a more secure future. It means overall, much longer opening hours and a wider range of facilities and activities, including books and study space.&#34;&#34;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Brighton and Hove","Sun, 18 Oct 2015 20:16:41 +0000","Brighton and Hove – Warren Morgan: We cannot afford to keep Hove Library in current form – Brighton and Hove Independent. &#34;The building is listed, but is very costly to run – in terms of repairs, maintenance, and staffing. We simply can’t afford to keep the library going in its current form. Most users live on the other side of Sackville Road, so it makes sense to move the service closer to them and make full use of the museum, its grounds, and café on new Church Road. It will need to be extended, but in the long term the costs will be much lower.&#34; … &#34;Today we should be focusing on services, not buildings, on making a difference to people’s lives through culture and learning, not preserving symbols of civic importance. We need a library service, not a collection of ageing buildings we can’t maintain, to ensure that libraries are as valued by future generations as they have are by ours.&#34; See also Hove Library could open in museum building as early as 2017 – Brighton and Hove News. .","2015/10/its-not-alright-on-the-wight.html"],["Haringey","Sun, 18 Oct 2015 20:16:41 +0000","Haringey – Campaigners Are Worried For The Future Of A Treasured London Library – BuzzFeed News. &#34;Following the closure, a statement from Haringey council said there would be &#34;no reduction to the library services on offer&#34;. A campaign group, Friends of Marcus Garvey Library, believes this to be an &#34;outright lie&#34;. They are concerned that when the library reopens in 2016, there will be a significant reduction in space, fewer books, and that the shared space with council services will cause disruption to library users, especially children. The Marcus Garvey Library is situated in the fifth most ethnically diverse borough in the country, and almost two-thirds of the borough’s residents come from an ethnic minority background. Haringey is also the fourth most deprived borough in London, with 1 in 3 children living in poverty. And although the Marcus Garvey Library was in some ways like any other local community library, to many residents it was also something much more profound.&#34;","2015/10/its-not-alright-on-the-wight.html"],["Norfolk","Thu, 15 Oct 2015 20:32:36 +0000","Norfolk – Norfolk County Council budget cuts could see libraries close – BBC. &#34;Almost 60% of libraries in Norfolk could close as county council bosses look to save £111m over the next three years. The plans, which are in their early stages, could see 27 of the county’s 47 libraries shut by 2018-19. The closures are expected to save £1.59m and are part of proposals to shave 25% from the authority’s overall budget. The council said a final decision had yet to be made. An internal report concluded that if the closures went ahead, the libraries service would be unable to guarantee &#34;high levels of support for literacy, information, learning and early help&#34;.&#34; See also online survey Help us to imagine the future of Norfolk’s library service and  Re-imagining Libraries.","2015/10/norfolking-libraries.html"],["Bristol","Tue, 13 Oct 2015 20:50:20 +0000","Bristol – Specialist firm completes Bristol Central Library archive relocation – Bdaily. &#34;Chorley-based specialist removals provider, Andrew Porter Limited, has completed the relocation of more than five kilometres of files and books from Bristol Central Library. The collection occupied a total of 5,728 metres of shelving in the archive of the city’s historic public library.  Eight staff and three vehicles from Andrew Porter Limited, headquartered on Huyton Road, Adlington, spent four weeks carefully moving the archive from the Grade I listed building on College Green to its new home at the nearby B Bond warehouse.&#34;","2015/10/lament-for-lambeth.html"],["Lambeth","Tue, 13 Oct 2015 20:50:20 +0000","Lambeth – Waterloo Library closure rubber-stamped by Lambeth cabinet – London SE1. &#34;Lambeth’s library service will lose around a quarter of its staff under the cost-cutting plans approved by the borough’s Labour cabinet on Monday night.&#34;","2015/10/lament-for-lambeth.html"],["Birmingham","Sun, 11 Oct 2015 19:03:08 +0000","Birmingham – Police called in as students stage sit-in protest at Library of Birmingham – Birmingham Mail. &#34;West Midlands Police was called to the library as Defend Education Birmingham protested against opening hour and staffing cuts &#34; … &#34;As the library attempted to close its doors yesterday, a group of 30 activists from campaign group Defend Education Birmingham took over the building in what they described as &#34;a festival of protest&#34;.&#34; … &#34;The sit-in, which lasted until late into the evening, came after a rally was held earlier in the day outside the library in Centenary Square, which saw more than 150 people speaking out against the cuts.&#34;","2015/10/not-so-bright-in-brighton.html"],["St Helens","Sun, 11 Oct 2015 19:03:08 +0000","St Helens – Bid to expand St Helens’ mobile library scheme – Reporter. &#34;Library bosses are planning on expanding their home delivery service by recruiting a new team of volunteers. They say the new scheme will provide a more personal provision for the housebound.&#34; … &#34;Currently, the service is run by just one paid member of the libraries team who has to provide the mobile library facility for 231 people.&#34;","2015/10/not-so-bright-in-brighton.html"],["Kirklees","Thu, 08 Oct 2015 21:34:03 +0000","Kirklees – Controversial Kirklees library shake-up to go under spot light – Huddersfield Daily Examiner. &#34;Liberal Democrat councillors unhappy with the decision have now requested it be looked at again by the council’s scrutiny committee.&#34; … &#34;The Lib Dems’ call in lists a number of concerns with the decision making process. They include: no evidence to support the chosen opening hours for libraries, no consideration to the geographical spread of libraries, no criteria given about the expectations of those who volunteer and no justification on how libraries were classed as town or community.&#34; see also Decision on library closures ‘called in’ for further scrutiny – Telegraph and Argus.","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Lambeth","Thu, 08 Oct 2015 21:34:03 +0000","Lambeth  – MP Reed ‘committed’ to funding for Upper Norwood Library – Inside Croydon. &#34;Steve Reed OBE, the MP for Croydon North, has sent the Save the Upper Norwood Library campaign a supportive message as the campaigners try to stop the &#34;decommissioning&#34; of their library services as part of Lambeth Council’s scheme to close half of that borough’s public libraries.&#34; … &#34;Reed’s intervention is highly significant because, before becoming an MP in 2012, he had been leader of Lambeth Council, and many of those councillors now implementing the &#34;co-operative&#34; council’s policies are his former colleagues whose careers he helped to develop&#34;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Lambeth","Thu, 08 Oct 2015 21:34:03 +0000","Lambeth – Norwood Society calls for protest against library closure – Inside Croydon. &#34;Anticipating a larger than usual turnout, Lambeth Council has switched Monday’s meeting to Dunraven School in Streatham, where it will discuss, and doubtless then rubber-stamp in its usual &#34;co-operative&#34; manner, its proposals to close half of the borough’s libraries – including the &#34;decommissioning&#34; of Upper Norwood Library, which it has run jointly with Croydon for more than a century.&#34;… &#34;&#34;The Library Trust has negotiated a temporary agreement until April 2016, but the withdrawal of guaranteed funding from Lambeth and Croydon brings into question the viability of these plans. We see our library as a ‘town centre’ library which should be funded accordingly.&#34;&#34;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Northamptonshire","Thu, 08 Oct 2015 21:34:03 +0000","Northamptonshire – Children’s centres fear ‘lost generation’ of families after loss of kids’ sessions in Northamptonshire – Northampton Chronicle. &#34;a damning report written by Healthwatch Northamptonshire suggests the scheme is in trouble with libraries seemingly suffering from a lack of ‘staff, volunteers, space, facilities and expertise’ to carry out the open sessions. But by far the most concerning line was that children’s centre staff revealed they are worried about a &#34;lost generation&#34; of families needing early help. Healthwatch believes there could now be three groups of families. There are a small group who use library under fives services and a group of targeted families who use children’s centres. But a third, larger group which now accesses neither service is the issue. They previously relied on the informal network of support built up through the activities at children’s centres. Activities to which they are now &#34;effectively being denied access.&#34;&#34;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Buckinghamshire","Sun, 18 Oct 2015 20:16:41 +0000","Buckinghamshire – Sir Terry Wogan drops in to open Burnham Library Arts Festival – Burnham Advertiser. &#34;Sir Terry Wogan officially opened the second Burnham Library Arts Festival in his capacity as patron of the Windsor Lane library. The presenter was on hand on Friday to present prizes to the winners of the competitions which have been running over the past month, as well as to welcome supporters of the festival.&#34;","2015/10/its-not-alright-on-the-wight.html"],["Lewisham","Sun, 18 Oct 2015 20:16:41 +0000","Lewisham – Why a community library ISN’T the answer for Manor House – by Patricia Richardson, Secretary, Users and Friends of Manor House Library – Lee Green. &#34;If this is a consultation, it’s time the definition was changed, because it seems we are back to Alice in Wonderland, where words meant what the Red Queen wanted them to mean.  Sir Ian Mills advised that the devil would be in the detail, but we have no detail. &#34;","2015/10/its-not-alright-on-the-wight.html"],["Lewisham","Thu, 15 Oct 2015 20:32:36 +0000","Lewisham – Community Libraries- The Blackheath Story – Hither Green. &#34;Age Exchange staff manage a team of 22 regular volunteers, and together they keep the library open full time, 9 hours a day, 56 hours a week. This breaks down to 16 shifts (3hr stints) per week which takes a serious amount of effort.  While the entire village may have protested the ending of Lewisham’s library service provision, Blackheath mostly has its retired community to thank for keeping the treasured service running. Students and young parents also number amongst the volunteers, slipping in shifts where they can.&#34;","2015/10/norfolking-libraries.html"],["Barnet","Tue, 13 Oct 2015 20:50:20 +0000","Barnet – Future of Barnet’s library service referred to full council – This is Local London. &#34;Protesters gathered outside Hendon Town Hall tonight, joined by a brass band, as Barnet Council’s children, education, libraries and safeguarding (CELS) committee met to discuss the cuts. &#34; … &#34;Cllr Thompstone said he had received a number of emails from residents which showed a &#34;great appetite for volunteering&#34;, and said there would be further public consultation. &#34;","2015/10/lament-for-lambeth.html"],["Lewisham","Sun, 11 Oct 2015 19:03:08 +0000","Lewisham – Budget Cuts: Only 3 professional Libraries for Lewisham? – Hither Green. &#34;As several local residents have pointed out on social media, the Council’s online ‘Consultation’ about proposed Library cuts does not list an option for keeping our libraries open and professionally staffed. It appears residents are being asked to rubber stamp harmful, swingeing cuts under the guise of community consultation.&#34; … &#34;Community library volunteers work  hard but opening hours are hard to guarantee and the libraries struggle financially, continually appealing for donations of money, books and equipment. Is this to be the fate of Torridon and Manor House Libraries?&#34;","2015/10/not-so-bright-in-brighton.html"],["Shropshire","Sun, 11 Oct 2015 19:03:08 +0000","Shropshire – D-Day for dozens of Shropshire libraries – Council to vote on futures – Shropshire Star. &#34;Shropshire Council’s cabinet will vote on the proposals that are intended to save £1.1 million from the authority’s £2.9 million libraries budget. If approved it will see 12 of the county’s smaller libraries offered to community groups.&#34; … &#34;Michael Green of the Shropshire Libraries Yes Campaign, described the proposals as &#34;philistine-ism&#34;. He said: &#34;We believe that the libraries should remain in council hands, not that that makes them any safer but at least it means they are within the control of an accountable group, not something which people have no control over.&#34;","2015/10/not-so-bright-in-brighton.html"],["Gateshead","Thu, 08 Oct 2015 21:34:03 +0000","Gateshead – New home for Chopwell Library hit by council’s £20m cost cutting programme – Chronicle. &#34;Chopwell Library will relocate to the children’s centre at Chopwell Primary School, saving the council £19,000 a year &#34; … &#34;The move will cost the council £129,250 to adapt the Children’s Centre and create a new library area but is set to save Gateshead Council £19,000 a year. Despite being housed at a school, both the children’s centre and library would have separate entrances. Councillors were told police based next to the library are also set to leave the site in Derwent Street to a base in the nearby fire station.&#34;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Leicestershire","Thu, 08 Oct 2015 21:34:03 +0000","Leicestershire – Barwell’s community library plan is written off  – Hinckley Times. &#34;The decision came at the latest meeting of the Barwell Community Library Group. Sandra Bates, from the group, said they just hadn’t been able to make the figures stack up. She explained: &#34;Barwell Library is inside the George Ward Centre which has got a cafe and has several lettings rooms. Typically groups taking over libraries are thinking of putting in a cafe and renting out back rooms. In Barwell there is no opportunity to do that because it already exists. &#34;So regrettably we decided the running costs were going to be such that we could not envisage a way to raise the funds needed to keep the library going. It is a real shame and we really did not want to pull out. We are hoping someone else will come forward with a new idea.&#34;&#34;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Isle of Wight","Sun, 18 Oct 2015 20:16:41 +0000","Isle of Wight – Libraries review: outcome of consultation – Isle of Wight Council. &#34; 74.4 % of respondents said they would use a partnership run library. However, many respondents said they would use such a library only if there was no other choice. &#34; … &#34;As part of its budget strategy Full Council committed to a budget saving target of £140,000 for 2015/16 and a full yearly saving of £280,000 from 2016/17 ongoing, to be delivered from changes to the library service. To achieve this, the service delivery needs to change&#34; … Cowes, Freshwater and Ventnor to be run with support from town council. Cuts in opening hours and mobile library service. £280k cut 2016/17 ongoing.","2015/10/its-not-alright-on-the-wight.html"],["Leicestershire","Sun, 18 Oct 2015 20:16:41 +0000","Leicestershire – Community library secured for Rothley  – Loughborough Echo. &#34;The grand opening will be on Saturday, October 17 and BBC East Midlands Today presenter Anne Davies is expected to attend alongside Betty Roberts who was one of the library’s first ever volunteers&#34; …&#34;Rothley library is one of the 27 community run libraries that Voluntary Action Leicestershire (VAL) has supported over the past seven months.&#34; … &#34;&#34;I registered with VAL in autumn 2014 and our small group of four was languishing along until the day when a VAL development officer rang me up and asked where we were in attempts to save our local library. From that day we have never looked back.&#34;","2015/10/its-not-alright-on-the-wight.html"],["Lambeth","Tue, 13 Oct 2015 20:50:20 +0000","Lambeth – Oasis sets out plan for Waterloo’s temporary library – London SE1. &#34;Now [Christian charity] Oasis has published a few new details on its website. &#34;The current redevelopment of the Oasis Centre will create a large amount of community space and it was agreed with Lambeth Council that this would provide an excellent temporary solution to the challenge caused by the closure of Lower Marsh library, while work is continuing on the process of planning for the new permanent community provision,&#34; said Oasis in a statement.&#34;","2015/10/lament-for-lambeth.html"],["Reading","Tue, 13 Oct 2015 20:50:20 +0000","Reading – Reading libraries: have your say on the future of the service – Get Reading. &#34;The first phase of the consultation runs until Monday, November 23. Reading Borough Council is having to cut £39 million from its spending over the next three years and it is looking at the way library buildings are being used to see if savings can be made. This might mean moving other services into an under-used library building – as has been seen at Reading Central Library which now houses a number of employment and community services on its top floor – or moving library services to another location.&#34;","2015/10/lament-for-lambeth.html"],["Fife","Thu, 08 Oct 2015 21:34:03 +0000","Fife – Crail hopes library won’t reach the end – Fife Today. &#34;Some of the youngest – as well as the most regular – users of Crail’s library service are joining a campaign to combat the facility’s closure. It’s hoped words and pictures from pupils at Crail Primary School will lend some weight to the crusade, which is being led by Crail Community Council.&#34;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Lambeth","Thu, 08 Oct 2015 21:34:03 +0000","Lambeth – Fury over Lambeth’s libraries’ plan – South London Press. &#34;trade union Unison accused the council of selling-off its library service. A spokesman said: &#34;These proposals will be a disaster for Lambeth residents and we want the council to abandon them. &#34;Libraries have always been there as a second chance for people to access information and books to further their learning and have been referred to as the street corner university. We had 1.3million visitors last year which really should be celebrated but the council seems to be playing it down. &#34;There is money available and that should be reinvested into the libraries to keep them open.&#34;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Norfolk","Sun, 18 Oct 2015 20:16:41 +0000","Norfolk – More than half of Norfolk’s libraries could close under sweeping county council budget cuts – Lynn News. &#34;Each department at the council has been asked to show how it could provide services with only 75 per cent of its current funding to help the authority plug its funding gap. However, council officers have stressed that proposals being put forward would be ‘worst-case scenario’ cuts, as a 16 per cent budget saving would be enough to save the £111 million.&#34; … &#34;A report to go before the meeting says if the number of libraries was cut from 47 to 20, the service would have to transfer to communities to operate. But it warns that the service would then be unable to guarantee &#34;high levels of support for literacy, information, learning and early help&#34;.&#34; see also Budgets cuts could see 60% of Norfolk’s libraries close – BookSeller.","2015/10/its-not-alright-on-the-wight.html"],["Shropshire","Sun, 18 Oct 2015 20:16:41 +0000","Shropshire – Closed doors fears raised over Shropshire libraries – Shropshire Star. &#34;Hannah Fraser, Liberal Democrat councillor for Shrewsbury’s Abbey ward, has criticised Shropshire Council policy, which allows for the closure of individual libraries to be confirmed at cabinet decision-making sessions, which are not open to the public.&#34;","2015/10/its-not-alright-on-the-wight.html"],["Fife","Thu, 15 Oct 2015 20:32:36 +0000","Fife – New Glenrothes chairman calls for end to ‘squabbling’ and ‘point-scoring’ – Fife Today.  &#34;Cllr Brown now wants the committee to forge closer links with community groups, residents and young people and said there needed to be a sharper focus on local issues, most notably the threat of library closures. &#34;Glenwood library is a great example of somewhere that is at the heart of the community and should be a hub for the whole area,&#34; Cllr Brown.&#34;","2015/10/norfolking-libraries.html"],["Lincolnshire","Thu, 15 Oct 2015 20:32:36 +0000","Lincolnshire – Volunteer crisis – Save Lincolnshire Libraries. Lists libraries closed due to council cuts and lack of volunteers, details reasons in each case.","2015/10/norfolking-libraries.html"],["Herefordshire","Tue, 13 Oct 2015 20:50:20 +0000","Herefordshire – Library is badly missed – temporary arrangement needed – Hereford Times. &#34;Hereford Library has been closed for two weeks and is likely to remain so for at least another 10 weeks&#34; … &#34;Around 45% of the people of the county have been deprived of their library services as a result. The whole county has been deprived of the benefits of their central library. This situation demands the speediest possible measures for its amelioration. We cannot leave these people without access to the many services provided by the Broad Street library. &#34; … &#34;As a matter of urgency, the main auditorium at the Shirehall should be considered for setting up this temporary library. There is already a long tradition of using this building to accommodate other library functions.&#34;","2015/10/lament-for-lambeth.html"],["Vale of Glamorgan","Tue, 13 Oct 2015 20:50:20 +0000","Vale of Glamorgan – Rhoose residents go to High Court to oppose library closure – Barry and District News. &#34;The Save Rhoose Library campaign group have instructed one of Wales’ leading experts in Administrative and Public law, Michael Imperato of Watkins and Gunn Solicitors to help secure legal aid and pursue a judicial review. The basis of their complaint is a claim that the council’s consultation was &#34;flawed&#34; and unlawful. Michael Imperato has acted for individuals and campaign groups in a number of high profile judicial review cases against national and local government in Wales over the last few years.&#34;","2015/10/lament-for-lambeth.html"],["Brighton and Hove","Sun, 11 Oct 2015 19:03:08 +0000","Brighton and Hove – Historic Hove Library facing new closure threat – Argus. &#34;The Argus understands plans are being drawn up to close the grade II listed building to the public in 2017 and move the resources to nearby Hove Museum as part of a major review of the city’s library services. Smaller branch libraries are also said to be at risk of closure and unions have warned of the prospect of cuts to opening hours at other branches around the city. The move, which is set to provoke a strong opposition campaign similar to 2003’s Save Hove Library campaign, comes as the council attempts to make £25 million of savings in the upcoming 2015/16 budget. &#34; … &#34;Among libraries thought to be at risk of reduction or closure include Westdene Library with Westdene Primary School taking on the building. Hollingbury Library is also being considered for a merger with Hollingbury Children’s Centre.&#34;","2015/10/not-so-bright-in-brighton.html"],["North Yorkshire","Sun, 11 Oct 2015 19:03:08 +0000","North Yorkshire – Libraries: how to get involved – Wetherby news. &#34;The sessions will include information about the outcomes of North Yorkshire County Council’s public consultation on the future of its library service; how it affects individual local libraries; and how residents can become involved as volunteers at their library&#34;","2015/10/not-so-bright-in-brighton.html"],["Brighton","Thu, 15 Oct 2015 20:32:36 +0000","Brighton – Council Leader Warns City’s Finances Are In Crisis – Juice Brighton. &#34;We are putting forward plans to make libraries community hubs, open seven days a week in buildings that are fit for purpose, affordable to run and at the heart of their neighbourhoods. The current home of Hove Library is costly and unsuitable for modern library services, so we are proposing to move it to Hove Museum where it will make better use of the space in a better location for Hove residents.&#34;","2015/10/norfolking-libraries.html"],["Fife","Thu, 15 Oct 2015 20:32:36 +0000","Fife – 2000 views on one decision over libraries – Fife Today. &#34;campaigners against the closure of Kinghorn Library have held a number of drop in events to inform and encourage local people to make their views known, with a ‘read in’ event planned for Saturday&#34; … &#34;One non-political group, comprising members of Kinghorn Community Council, local councillors, the parish church minister, academics, teachers and others held an event in Kinghorn Primary School last week with an information stand to let people know what exactly is proposed.&#34;","2015/10/norfolking-libraries.html"],["Lambeth","Thu, 15 Oct 2015 20:32:36 +0000","Lambeth – Residents left angered after being unable to access Lambeth Council Cabinet meeting with libraries dominating the agenda – Brixton Buzz.&#34;This was always going to be a busy meeting with the recommendations from the Cultural Consultation being head-nodded through by the Cabinet&#34;","2015/10/norfolking-libraries.html"],["Lambeth","Tue, 13 Oct 2015 20:50:20 +0000","Lambeth – Lambeth approves ‘omni-shambles’ libraries closure plan – Inside Croydon. &#34;This means a statutory provision will be replaced with a &#34;neighbourhood service&#34; that will include Wifi, computers, study space, and reduced book stock. Books will be borrowed in a self-service system. Staff will visit but not be permanently stationed there.&#34; … &#34;strange unaccountable and unaccounted hotch-potch approach shrouded by toxic spin and a lack of transparency.&#34;&#34;","2015/10/lament-for-lambeth.html"],["Lambeth","Tue, 13 Oct 2015 20:50:20 +0000","Lambeth – Writer Toby Litt rallies against Lambeth’s library cuts – Brixton Blog.  &#34;Toby Litt, a Lambeth resident, writer and lecturer in Creative Writing at Birkbeck College, has written an open letter imploring  Councillor Jane Edbrooke to reconsider Lambeth’s proposed drastic cuts to library services. &#34; … &#34;In his letter Toby Litt quotes his recent interview with author Neil Gaiman, published by the Guardian: &#34;Here’s what I found the most persuasive thing he said – ‘For me, closing libraries is the equivalent of eating your seed corn to save a little money.’&#34; He goes on to state Lambeth’s Council’s &#34;greater responsibility for the long-term future of Lambeth&#34; urging them to consider the impact of decisions and cuts which will very seriously undermine them.&#34;","2015/10/lament-for-lambeth.html"],["Lambeth","Thu, 08 Oct 2015 21:34:03 +0000","Lambeth – Protest plans over library changes – South London Press. &#34;Friends of Lambeth Libraries, residents and trade unions plan to protest outside Dunraven School in Streatham at 7pm on Monday evening as councillors meet to discuss plans to reorganise the borough’s libraries. In the council’s Culture 2020 report to be presented at the meeting it states &#34;maintaining the current service is not an option&#34;. Campaign groups have described the plans as an &#34;act of vandalism&#34; accusing the council of selling off the library service.&#34;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Lincolnshire","Thu, 15 Oct 2015 20:32:36 +0000","Lincolnshire – Community library for Holbeach to open soon – Spalding Today. &#34;Holbeach is expected to see its new-style, volunteer-run library open during the last week of October. More than 30 volunteers have come forward and county councillor Nick Worth, Lincolnshire’s executive member for libraries, is delighted there’s been such an enthusiastic response.&#34; … &#34;Holbeach volunteers have already completed two training sessions, on health and safety and equality and diversity, and the next will give them more direct training on running the library and its simple computer system, Spydus Light, which enables people to order books but doesn’t give volunteers access to confidential data.&#34;","2015/10/norfolking-libraries.html"],["Shropshire","Thu, 15 Oct 2015 20:32:36 +0000","Shropshire – Court vow over Shropshire libraries battle – Shropshire Star. &#34;Opponents, who branded the move an &#34;abdication&#34; of Shropshire Council’s responsibility, today said they had taken legal advice. Twelve libraries could close in the near future unless community groups come forward to take over their running. Another six large face a review of their management with a view to offloading them.&#34; … &#34;Shropshire Libraries Yes campaigner, Michael Green, warned councillors at the meeting that the decision could now face a legal challenge and called for talks. He said: &#34;We are not prepared to stand by while our library service is disassembled. We have taken advice from a leading public administration lawyer. There is a high likelihood of our being granted a judicial review under legal aid.&#34;&#34;","2015/10/norfolking-libraries.html"],["Leicestershire","Tue, 13 Oct 2015 20:50:20 +0000","Leicestershire – Saving our Libraries – Leicester Mercury. Letter suggests charging per issue: &#34;could help to pay staff wages, and it’s nothing really for what you get in return&#34;","2015/10/lament-for-lambeth.html"],["Brent","Sun, 11 Oct 2015 19:03:08 +0000","Brent – Library campaigners win battle to return axed Barham Park library home – Brent and Kilburn Times. &#34;Cracking open champagne, Friends of Barham Park Library were awarded a 15 year lease to run their services back in Harrow Road, in the lounge room of their old building. Yesterday, in a tense meeting at Brent Civic Centre in Engineers Way, Wembley, Friends of Barham Library went head to head with Pivot Point, a private community development group for Lounge room contract. With two cabinet members, Cllr James Denselow and Cllr Eleanor Southwood voting for FoBL and two councillors voting for Pivot Point, Cllr Margaret McLennan and Cllr Krupesh Hirani, it was up to Cllr Michael Pavey, chair of the Barham Trust Committee to decide the casting vote. Cllr Pavey said the &#34;shambolic process&#34; had taken far too long adding: &#34;I acknowledge the strength of all the applications, particularly with Pivot Point.&#34; He added his choice came down to the strength of the interviews: &#34;Friends of Barham Library continue to show p&#8230;","2015/10/not-so-bright-in-brighton.html"],["Lewisham","Sun, 11 Oct 2015 19:03:08 +0000","Lewisham – Job losses inevitable under proposed library cuts – East London Lines. &#34;According to the savings report, staff wages are the highest expense in the library budget accounting for 80 per cent at £3,105,800. Aileen Buckton, executive director of Community Services Lewisham, explained at the consultation: &#34;You can’t save £1 million without it impacting on staff.&#34;&#34; … &#34;Chris Flood, a former Lewisham councillor for Telegraph Hill ward, said: &#34;I think the consultation was a rubber stamping exercise, they come with a predetermined decision and asking the public how they can make the cuts. We should be growing the economy, creating jobs and should not be in the process of making people redundant.&#34;&#34;","2015/10/not-so-bright-in-brighton.html"],["Fife","Thu, 08 Oct 2015 21:34:03 +0000","Fife – Encouraging response to Fife library closure consultation – Courier. &#34;More than 2,000 people have taken part in a consultation about controversial proposed changes to Fife’s library services. With just over four weeks left until the consultation closes, Fife Council is encouraging more people to have their say.&#34;","2015/10/library-campaigners-pragmatists-or-believers-which-one-best-describes-you.html"],["Birmingham","Tue, 20 Oct 2015 21:57:22 +0000","Birmingham – Library of Birmingham to undergo £2m conversion – Birmingham Post. &#34;Facelift for landmark Birmingham building two years after it opened to accommodate Brasshouse Language Centre &#34;…&#34;The relocation of the Brasshouse Language Centre from Sheepcote Street, which was announced earlier this year, will see the £188 million library open to the public for longer following a dramatic cut in its hours, from 73 down to 40.&#34; … &#34;the first floor conference rooms and study areas will be converted into 24 classrooms for the language school. The £2.1 million cost will be borrowed by the city council and the debt repaid when the existing Brasshouse site near Brindleyplace is sold.&#34; … &#34;The move means the library will be open to the public from 9am to 9pm weekdays, including an express book borrowing service.&#34;","2015/10/oxfordshire-cornwall-and-my-goodness-its-the-library-of-birmingham-again.html"],["Kirklees","Tue, 20 Oct 2015 21:57:22 +0000","Kirklees – Future of Kirkburton library set to be decided this week – Huddersfield Daily Examiner. &#34;The Tories say the Greens want to shut down the children’s section, but the Greens say they want to extend the whole library&#34; … &#34;If approved this would see the library run by one council employee backed by community volunteers.&#34;","2015/10/oxfordshire-cornwall-and-my-goodness-its-the-library-of-birmingham-again.html"],["Cornwall","Tue, 20 Oct 2015 21:57:22 +0000","Cornwall – Face to Face Service – Alternative Service Delivery of Library and One Stop Shops – Cornwall County Council. £1.8m cut to service, with preferred option being to transfer libraries to other town or parish councils/volunteers.","2015/10/oxfordshire-cornwall-and-my-goodness-its-the-library-of-birmingham-again.html"],["Oxfordshire","Tue, 20 Oct 2015 21:57:22 +0000","Oxfordshire – CUTS: Leader says plans to save £50m across Oxfordshire are a worst case scenario but he admits majority will go through – Oxford Times. &#34;Ian Hudspeth said people in Oxfordshire would now be asked to choose where the axe should fall, as the local authority revealed it was reviewing mobile libraries, arts funding, homeless support services, road gritting and even electronic bus stop signs in a bid to slash its budget by almost 10 per cent. &#34;","2015/10/oxfordshire-cornwall-and-my-goodness-its-the-library-of-birmingham-again.html"],["Cornwall","Tue, 20 Oct 2015 21:57:22 +0000","Cornwall – Future for Cornwall’s Libraries – Pirate FM. &#34;A report on the future of the library and one stop shop service in Cornwall will be considered by the Council’s Communities Policy Advisory Committee (PAC) on 27 October 2015. This as officials look at how to save £1.8m from the budget thanks to cuts. It has put together a report showing how libraries and One Stop Shops could be transferred to other organisations like town or parish councils or other community organisations.&#34;","2015/10/oxfordshire-cornwall-and-my-goodness-its-the-library-of-birmingham-again.html"],["Coventry","Tue, 20 Oct 2015 21:57:22 +0000","Coventry – Earlsdon residents unite to in effort to save library from closure – Coventry Telegraph. &#34;More than 50 people waved placards in a protest outside Earlsdon Library – one of the 17 across the city earmarked for closure under radical plans to save millions of pounds.&#34;","2015/10/oxfordshire-cornwall-and-my-goodness-its-the-library-of-birmingham-again.html"],["Herefordshire","Tue, 20 Oct 2015 21:57:22 +0000","Herefordshire – No date for completion of asbestos removal work at Hereford library – Hereford Times. &#34;the authority has said this week said that the removal of the asbestos has yet to begin, adding it has no completion date. &#34;The safety of users and staff of the services is our most important consideration, and the implications of managing asbestos at the building needs to be carefully considered,&#34; the council said on its website. &#34;As traces of asbestos have been found at the venue, it is in the best safety interest to remove it completely, which will be started as soon as possible. &#34;As yet we have not been given a date as to when those works will be completed.&#34;&#34;","2015/10/oxfordshire-cornwall-and-my-goodness-its-the-library-of-birmingham-again.html"],["Leicestershire","Tue, 20 Oct 2015 21:57:22 +0000","Leicestershire – New community-run library opens – Loughborough Echo. &#34;Last year, Leicestershire County Council decided to invite 36 communities to manage libraries or risk closure, as part of the library service’s £800,000 savings. &#34; … &#34;Rothley community came out in force to support the opening of its new volunteer-run library on Saturday, October 17. The local Scout group and Rothley Community Gospel Choir joined crowds of residents as BBC East Midlands Today presenter Anne Davies officially opened the Mountsorrel Lane facility.&#34;","2015/10/oxfordshire-cornwall-and-my-goodness-its-the-library-of-birmingham-again.html"],["Oxfordshire","Tue, 20 Oct 2015 21:57:22 +0000","Oxfordshire – Libraries/Cultural Services – Oxfordshire County Council. &#34;Retention of all 43 libraries (22 core and 21 community libraries) but provide service redesign and changes internally to provide savings, including: A) Reduction of book fund. B) Closure of all mobile libraries; 4 general service library vehicles and 2 children’s service vehicles. C) Library Service management and staffing reorganisation in conjunction with the Council’s Customer Service Centre and ICT function over the next two years. D) Retendering of the Library Management Information system.&#34; £1m cut by 2018/19. &#34;This will lead to a reduction in the current Library staffing establishment coupled with the deployment of Customer Service Advisers from County Hall to libraries and other County Council buildings&#34;","2015/10/oxfordshire-cornwall-and-my-goodness-its-the-library-of-birmingham-again.html"],["Oxfordshire","Tue, 20 Oct 2015 21:57:22 +0000","Oxfordshire – Oxfordshire County Council proposes £50m cuts – BBC. &#34;The council is looking at more than 90 savings options, including cutting funding for homelessness services, seven health and wellbeing centres and reducing the amount spent on gritting roads. Four mobile libraries could also shut, although child protection is not included in the options.&#34;","2015/10/oxfordshire-cornwall-and-my-goodness-its-the-library-of-birmingham-again.html"],["Shropshire","Tue, 20 Oct 2015 21:57:22 +0000","Shropshire – Albrighton Parish Council set to aid library and pool – Shropshire Star. &#34;Albrighton Parish Council has agreed in principle to move into the library and help run it, as well as offering financial support for the pool. Shropshire Council voted to save £1.1 million from the authority’s £2.9 million libraries budget during a meeting on Wednesday in Shirehall.&#34; … &#34;Mr Woodman said the parish council was confident of getting some financial support from central government to make some changes to the layout of the library. He said some necessary changes included moving the children’s section to the back of the library with parish council offices at the front.&#34;","2015/10/oxfordshire-cornwall-and-my-goodness-its-the-library-of-birmingham-again.html"],["Barnet","Thu, 22 Oct 2015 21:44:36 +0000","Barnet – Anger as library cuts passed – This is Local London. &#34;Councillors were accused of being &#34;morally bankrupt&#34; as they voted for cuts to Barnet’s library service. The plans, which will see libraries remain open – but scaled back, with 46 per cent of staff sacked and four run by volunteers – were passed after a heated debate in Hendon Town Hall this evening (October 20).&#34; … &#34;John Burgess, branch secretary of Barnet Unison, said members were &#34;disgusted&#34; at volunteers replacing professional librarians. &#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Lambeth","Thu, 22 Oct 2015 21:44:36 +0000","Lambeth – Library campaigners plan protest march from Brixton to Stockwell to greet Cabinet member at her ‘book-ish gym’ – Brixton Buzz. &#34;ibrary users in Lambeth are being asked to join a protest on 7 November to help campaign against the bonkers decision to turn three local libraries into mini-me gyms. A march is setting off at 10:30am from Windrush Square to the Tate South library along South Lambeth Road. The end destination is significant – this is where Cabinet member Cllr Jane Edbrooke will be holding one of her ward surgeries during the morning. We are not sure where Cllr Edbrooke will be able to hold these in future if she succeeds in her heavily criticised plans to turn the Tate South and two other libraries into book-ish gyms.&#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Leicestershire","Thu, 22 Oct 2015 21:44:36 +0000","Leicestershire – New community-run library opens – Loughborough Echo. &#34;The Rothley community came out in force to support the opening of its new volunteer-run library on Saturday, October 17. The local Scout group and Rothley Community Gospel Choir joined crowds of residents as BBC East Midlands Today presenter Anne Davies officially opened the Mountsorrel Lane facility.&#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Dudley","Thu, 22 Oct 2015 21:44:36 +0000","Dudley – Dudley Council set to create a mutual to run libraries and associate services – Halesowen News. &#34;Dudley Council is planning to hive off the borough’s libraries, archives and adult learning into a new organisation. The  cabinet is expected to agree the creation of an employee-led mutual to run the services from next April, as part of a five year plan, when it meets next Wednesday.&#34; … &#34;If agreed, the plans will go out for a three-month public consultation to find out what people want from their libraries, archives and adult learning services. There will also be consultation with staff, unions and other stakeholders. The mutual will see all libraries, library links and the archive service remain open, but with increased customer self-service and reduced staff time.&#34; … &#34;The spokesman said the plans will enable the combined service to bid for new money and grow the business with less reliance on council funding, which means a council saving of 11 per cent in 2016/17 rising to 30 per cent by 2017/18. &#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Northern Ireland","Thu, 22 Oct 2015 21:44:36 +0000","Northern Ireland – First female librarian takes charge at Belfast’s Linen Hall  – Irish News. &#34;Samantha McCombe is the Linen Hall’s 22nd librarian and completes the first-ever, all female senior team alongside director Julie Andrews, deputy librarian Monica Cash, and finance manager Karen Law.&#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Ealing","Thu, 22 Oct 2015 21:44:36 +0000","Ealing – Plan for new West London council offices and library – Construction Enquirer. &#34;Ealing Council is moving ahead with plans to appoint a development partner to build smaller replacement office accommodation for the council and a new library. The existing council head offices in Ealing Broadway will be demolished to make way for new homes. The council’s Perceval House offices are now a valuable asset and the council is seeking to unlock the site’s potential by redeveloping it for housing, commercial space and replacement council facilities.&#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Harrow","Thu, 22 Oct 2015 21:44:36 +0000","Harrow – Council accused of ‘stringing along’ library campaigners – Harrow Times. &#34;Campaigners hoping to save North Harrow library, which saw its shutters pulled down earlier this year thanks to council cuts, say they feel it is unlikely it will reopen this year.  Members of the North Harrow Community Partnership and library supporters submitted a business plan to Harrow Council in a bid to reopen the library as a community-run centre, which the council had said they were seriously considering.&#34; … &#34;But months down the line, the shutters remain pulled and the door remains closed – leaving campaigners wondering if it will ever be reopened. &#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Kirklees","Thu, 22 Oct 2015 21:44:36 +0000","Kirklees – Cash-strapped Kirklees Council gifts Mirfield Community Centre and Kirkburton Library to residents’ groups  – Huddersfield Daily Examiner. &#34;Two threatened village hubs are now safe in the hands of their communities.&#34; … &#34;the leasehold for Kirkburton Library has been handed over to Kirkburton Parish Council (KPC). The library’s future had been contested between Green and Conservative members of the parish council. But now Kirklees Cabinet members have agreed to give the building and its grounds to KPC. As part of the deal the building itself will be loaned back to Kirklees Council at nil rent over five years so it can remain as a functioning library. It will be run by one council employee, backed by community volunteers. Kirkburton Councillor John Taylor said: &#34;I fully support this asset transfer and look forward to working with the officers and councillors to make this a valuable asset for the people of Kirkburton.&#34;&#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Kirklees","Thu, 22 Oct 2015 21:44:36 +0000","Kirklees – Mobile book service cuts put 88 jobs at risk in libraries shake-up – Telegraph and Argus. &#34;More than 80 library staff are to lose their jobs under cost-cutting plans approved by Kirklees Council. Members of the Cabinet yesterday approved plans to withdraw the six-vehicle mobile library service and reduce the number of full-time equivalent staff by 88. The job reductions could affect more than 100 people as many library staff are in part-time positions.&#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Kirklees","Thu, 22 Oct 2015 21:44:36 +0000","Kirklees – Poet supports campaign to save Kirklees libraries – Telegraph and Argus. &#34;Mr Armitage, who is from Huddersfield, said: &#34;I wholeheartedly support all efforts to save the libraries in Kirklees, especially those in outlying communities. &#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Newham","Thu, 22 Oct 2015 21:44:36 +0000","Newham – Extended opening hours for Newham’s libraries – Newham Recorder. &#34;Currently, the council’s main libraries stay open until 8pm just one or two nights a week, but from November, this will extend to every day apart from Sunday. The later opening times will allow as many people as possible to take advantage of the facilities on offer and provide the opportunity for libraries to host more activities and initiatives.&#34; … &#34;While national library usage decreased by around five per cent last year, Newham saw an increase of the same amount. The extension to opening hours, which is being covered through the service’s existing budget, is expected to further boost their use.&#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Leicestershire","Thu, 22 Oct 2015 21:44:36 +0000","Leicestershire – Mercury Mailbox: I’m incensed by library’s closure – Leicester Mercury. &#34;I am incensed as I have just been advised that the Braunstone Town Library is to be closed and replaced with a mobile library van. How can the chairman of the libraries accept the recommendation of his officers to run Glenfield library, with a population of around 9,000, entirely at the Leicestershire County Council’s expense and yet to close Braunstone Town Library, with a population of around 17,000, despite a Braunstone Town Council offer to run the service with considerable savings? I was so concerned about the closure and that none of the financial details have been disclosed of how the county council made its decision to close our library, that I have arranged a public meeting for the evening of November 17 at Braunstone Civic Centre from 7pm.&#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Lewisham","Thu, 22 Oct 2015 21:44:36 +0000","Lewisham – Leave our library alone – South London Press. &#34;At a meeting on Monday, residents and businesses in Forest Hill slammed the decision saying it would be a &#34;massive loss&#34; to the town centre. Pauline Wright who runs Sugar Mountain in Dartmouth Road, said: &#34;I know the council has to make cuts but if our library is handed over to volunteers we may see it closed in six months or a year’s time.&#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Northern Ireland","Thu, 22 Oct 2015 21:44:36 +0000","Northern Ireland – Library staff ‘living in a constant state of uncertainty’ – Belfast Telegraph. &#34;Seven years of redundancies and stringent budget cuts have left stressed out frontline workers facing a barrage of complaints from dissatisfied customers, MLAs were told. Irene Knox said: &#34;We are almost living in a constant state of uncertainty.&#34; Since its formation in 2009, Libraries NI has lost 114 employees through voluntary redundancies rolled out every year.&#34; …&#34;A further 19 people are expected to leave through the civil service voluntary exit scheme, vastly reducing resources for essential programming dedicated to children and heritage. &#34; … &#34;It was also revealed that spending on stock had been slashed from £3.4 million four years ago to £2.7 million this year. A further £50,000 in-year reduction had meant libraries had missed out on some recent publications – adding to the dissatisfaction of users.&#34; see also Northern Ireland libraries: Fewer staff will affect service to public – BBC.","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Oxfordshire","Thu, 22 Oct 2015 21:44:36 +0000","Oxfordshire – ‘County’s library service faces being suffocated by cutbacks’ – Herald. &#34;Proposals to save £1m by closing all five mobile libraries in the county, cutting the fund for books and reducing library staff were among £52.5m of possible savings suggested by Oxfordshire County Council on Tuesday. But Friends of Grove Library group member Eoin Garland warned the cuts would have a devastating effect and said he was concerned libraries would end up without staff.&#34; see also ‘Tell us where to cut services’ says council – Banbury Guardian.","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Lincolnshire","Thu, 22 Oct 2015 21:44:36 +0000","Lincolnshire – County Council to seek legal costs from Save Lincolnshire Libraries after High Court challenge – Lincolnshire Echo. &#34;Lincolnshire County Council is consulting its lawyers to see if it can claim costs from campaigners who challenged its shake-up of library services.&#34; &#34;the judge has refused permission on all grounds, meaning that none of the arguments put forward had any legal merit and there was effectively no case to answer.&#34; see also Lincolnshire County Council seek recovery of £350,000 costs after High Court libraries ruling – Louth Leader and  Lincolnshire County Council blames campaigners for £350k libraries legal challenges bill – Lincolnite and Council to seek costs for campaigners’ failed libraries challenge – Lincolnshire County Council.","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Shropshire","Thu, 22 Oct 2015 21:44:36 +0000","Shropshire – Ex-mayor in plea over future of Whitchurch library – Shropshire Star. &#34;Former town mayor Rob Hewson has called on Whitchurch Town Council not to discuss plans for the town’s library behind closed doors. He today said it should be up to residents to decide what happens to the facility.&#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Reading","Thu, 22 Oct 2015 21:44:36 +0000","Reading – Hands off Tilehurst Library say petitioners  – Get Reading. &#34;&#34;Hand’s off Tilehurst Library&#34; was the simple message to Reading councillors last night. Former councillor Peter Beard handed in a petition to Reading Borough Council on Tuesday, October 20. It had nearly 1,000 signatures which emphasised the value of Tilehurst Library.&#34; Labour council says &#34;&#34;In spite of our aspirations for Reading’s library service, cuts to Government grant funding received by local authorities have undermined the ability of Reading Borough Council to continue to deliver library services in the way we have done in the past.&#34;&#34;","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Lincolnshire","Thu, 22 Oct 2015 21:44:36 +0000","Lincolnshire – County Council to seek legal costs from Save Lincolnshire Libraries after High Court challenge – Lincolnshire Echo. &#34;Lincolnshire County Council is consulting its lawyers to see if it can claim costs from campaigners who challenged its shake-up of library services.&#34; &#34;the judge has refused permission on all grounds, meaning that none of the arguments put forward had any legal merit and there was effectively no case to answer.&#34; see also Lincolnshire County Council seek recovery of £350,000 costs after High Court libraries ruling – Louth Leader and  Lincolnshire County Council blames campaigners for £350k libraries legal challenges bill – Lincolnite and Council to seek costs for campaigners’ failed libraries challenge – Lincolnshire County Council.","2015/10/lincolnshire-goes-for-campaigners-wallets-and-dudley-goes-mutual.html"],["Cambridgeshire","Tue, 27 Oct 2015 21:13:44 +0000","Cambridgeshire – Cambridgeshire County Council to axe mobile library, cut payments for school crossing patrols, cut bus subsidies, make the elderly pay more for care – but will keep at you to stop smoking – Wisbech Standard. &#34;Withdraw funding from some libraries and seek community assistance to run them this is in addition to reducing opening hours of retained libraries to save £375,000 over two years. Removal of the mobile library service to save £160,000 over two years&#34; see also &#34;Colossal and cruel&#34; county council cuts – libraries, children’s centres and social services at risk – Cambridge News.","2015/10/all-the-library-news-that-we-know-about-it.html"],["Isle of Wight","Tue, 27 Oct 2015 21:13:44 +0000","Isle of Wight – Stark message from Isle of Wight Council over libraries – Isle of Wight County Press. &#34;The authority hopes to run three of its six libraries, Cowes, Freshwater and Ventnor, in partnership with town and parish councils, sharing the responsibility for staffing, costs and buildings maintenance. Should they fail to take on the mantle, however, further cuts could be on the cards. According to a report due to go before the Isle of Wight Council executive tomorrow (Tuesday): &#34;If negotiations with the town and parish councils fail to deliver a partnership-based service by April, 2016, this could result in a considerable reduction of library services in the town or village affected as the council needs to consider alternative forms of delivery and adjust opening hours.&#34;&#34;","2015/10/all-the-library-news-that-we-know-about-it.html"],["Worcestershire","Tue, 27 Oct 2015 21:13:44 +0000","Worcestershire – Date finally announced for Bromsgrove Library move – Evesham Journal. &#34;The building which is currently housed on Stratford Road, was due to close its doors in the middle of September, and move over to its new home in the multi-million pound Parkside hub, to open at the beginning of October, but Worcestershire County Council put the move on hold at the last minute, citing ‘technical problems’. However the Library’s official Facebook page released an announcement this week to say that the library will be closing the Stratford Road building on Saturday, November 14 at 4pm, and re-opening in its new home on Monday, November 30 at 9am.&#34;","2015/10/all-the-library-news-that-we-know-about-it.html"],["Cornwall","Tue, 27 Oct 2015 21:13:44 +0000","Cornwall – Report on future of libraries – Cornish Times. &#34;Cornwall Council is faced with making major cuts and has been looking at a number of different ways in which the service could be provided. The council’s communities policy advisory committee will be discussing the report next week and it will also be presented to the council’s Cabinet on November 4. The report summarises the work undertaken so far, following public consultation, on the options for transferring or devolving the operation of individual libraries and one stop shops to town councils or community organisations.&#34;","2015/10/all-the-library-news-that-we-know-about-it.html"],["Leicestershire","Tue, 27 Oct 2015 21:13:44 +0000","Leicestershire – Braunstone Town library: Public meeting called to discuss the future of the library – Leicester Mercury. Library will be replaced by a mobile library if volunteers or local council do not step in.","2015/10/all-the-library-news-that-we-know-about-it.html"],["Dorset","Tue, 27 Oct 2015 21:13:44 +0000","Dorset – Libraries told: ‘Stop buying new books so we can save cash’ – Dorset Echo. &#34;Libraries across Dorset have been told not to purchase any new books until March 2016, although orders for Christmas bestsellers have already been placed. &#34; … &#34;&#34;The Library Service is being asked to contribute the remaining resources budget to meet this need which works out around 5 per cent, £25,000, of our total resources budget for the financial year 2015/16, £541,000.&#34; … &#34;&#34;There are no known plans to reduce the library book fund in the next financial year, April 2016 –March 2017, at this time.&#34;&#34;","2015/10/all-the-library-news-that-we-know-about-it.html"],["Isle of Wight","Tue, 27 Oct 2015 21:13:44 +0000","Isle of Wight – Changes to library service to be considered by leading councillors – On the Wight. &#34;Library users in Cowes, Freshwater and Ventnor will be keeping their fingers crossed tonight as the Executive members consider recommendations on proposed changes to their libraries.&#34; … &#34;Ventnor Town Council, which contains two deprived wards, have said they believe the library should remain staffed by two members of staff. The paper indicates they are willing to commit to the full year running costs of the building from 1 April 2016, but have not allocated budget for making the building fit for purpose. &#34;","2015/10/all-the-library-news-that-we-know-about-it.html"],["Lambeth","Tue, 27 Oct 2015 21:13:44 +0000","Lambeth – Lambeth Council cobbles together library-lite FAQs in attempt to justify book-ish gyms – Brixton Buzz. &#34;A document has been published for residents, as well as being emailed to all members of the Labour group to make sure that everyone is clear on the local party line. Cllr Jane Edbrooke’s decision to accept the bail out by Greenwich Leisure Ltd has proven to be quite a tough sell – both for residents and internally within the local Labour group. But if anyone wants to understand the stated reasons as to why libraries are closing and yet more gyms are opening, then you can read the carefully worded Lambeth guide over here.&#34; … &#34;Lambeth Council isn’t creating the library-lites to improve people’s health; it is doing this because the ‘Co-operative Council’ likes to worth with large scale organisations like GLL, rather than work with residents who might raise endless pesky questions.&#34;","2015/10/all-the-library-news-that-we-know-about-it.html"],["Reading","Tue, 27 Oct 2015 21:13:44 +0000","Reading – Hands off Tilehurst Library say petitioners – Get Reading. &#34;Former councillor Peter Beard handed in a petition to Reading Borough Council on Tuesday, October 20. It had nearly 1,000 signatures which emphasised the value of Tilehurst Library.&#34;.  Council says &#34;&#34;In spite of our aspirations for Reading’s library service, cuts to Government grant funding received by local authorities have undermined the ability of Reading Borough Council to continue to deliver library services in the way we have done in the past.&#34;&#34;","2015/10/all-the-library-news-that-we-know-about-it.html"],["Norfolk","Tue, 27 Oct 2015 21:13:44 +0000","Norfolk – Norfolk County Council abandons £50m worth of cuts – EDP. &#34;possible cuts to services across Norfolk, including mass closures of libraries and fire stations, have been abandoned.&#34; … &#34;Among those proposals abandoned was one which could have seen 27 of Norfolk’s 47 libraries shut to save £1.6m &#34; see also Protests over proposed cuts to council services in Norfolk – ITV.","2015/10/all-the-library-news-that-we-know-about-it.html"],["Camden","Thu, 29 Oct 2015 22:02:19 +0000","Camden – Council chiefs say Jimmy Savile and Rolf Harris books will be kept on library shelves – and it’s up to readers if they want to borrow them – Camden New Journal. &#34;The Town Hall has several copies of Harris’s book Buster Fleabags – a memoir about a dog he had while growing up in Western Australia – available for loan across six branches. It is also stocking Jim’ll Fix It host Savile’s autobiography, As It Happens, at Swiss Cottage. Leisure chief Councillor Abdul Hai said it was not up to Camden to censor books that had not been banned, and the council was acting in line with other local authorities&#34;","2015/10/investment-in-hillingdon-milton-keynes-and-scotland.html"],["Fife","Thu, 29 Oct 2015 22:02:19 +0000","Fife – Library campaigners urge locals to have their say – Fife Today. &#34;Campaigners fighting to save four Glenrothes libraries from possible closure are urging people to have their say while they still have a chance. A public consultation allowing people from across Fife to give their opinions on Fife Cultural Trust’s proposals to close 16 library facilities, ends on November 6.&#34; 2000 have responded so far.","2015/10/investment-in-hillingdon-milton-keynes-and-scotland.html"],["Doncaster","Thu, 29 Oct 2015 22:02:19 +0000","Doncaster – Doncaster’s empty spaces transformed into literacy hubs – South Yorkshire Times. &#34;As part of a partnership campaign to boost reading and writing levels in the town, a temporarily empty shop unit in the town centre Waterdale Shopping Centre provided by St Modwen, vacant space in the Springwell Centre, Denaby, and Re-Read Askern Community Library will be turned into pop-up book shops&#34; … &#34;The scheme is supported by Doncaster Libraries, Doncaster Book Award and Children’s University. The pop-up shops aim to inspire a love of reading and raise awareness of the importance of literacy skills. Visitors will also be able to pick up free books provided by the pop-up shops organiser, Re-Read. &#34;","2015/10/investment-in-hillingdon-milton-keynes-and-scotland.html"],["Hillingdon","Thu, 29 Oct 2015 22:02:19 +0000","Hillingdon – Yiewsley Library is back in Hillingdon Council hands – Get West London. &#34;Yiewsley Library, now back in the council’s hands, is a &#34;great opportunity&#34;, says Councillor. Conservative-led Hillingdon Council have bought back the leasehold of the library, reversing the actions of the Labour group 40 years ago.&#34; …&#34;&#34;The rental and the cost of the investment made it financially very viable, as well as opening up a tremendous potential going forwards. &#34;Depending on what happens with the gym, which we hope we can continue for a long time, there are other opportunities for that site in time. Trenic Gym is the current tenant above the library facility, which will now pay rent to the council, instead of Legal and General, who bought a 120 year lease in 1973.&#34;","2015/10/investment-in-hillingdon-milton-keynes-and-scotland.html"],["Leicestershire","Thu, 29 Oct 2015 22:02:19 +0000","Leicestershire – Mobile library plan is mooted for Barwell  – Hinckley Times. &#34;Barwell had been progressing with a community take-over but the group had to pull out after failing to find ways to make the branch financially viable&#34; … &#34;The consultation is one of four in the county in places where no group has come forward with a viable business case to take over the local library, currently located in the George Ward Centre.&#34;","2015/10/investment-in-hillingdon-milton-keynes-and-scotland.html"],["Milton Keynes","Thu, 29 Oct 2015 22:02:19 +0000","Milton Keynes – Bletchley Library gets £529,000 investment. Should it be new base local police? – One MK. &#34;The future of Westfield Road library in Central Bletchley is secure following a decision by Milton Keynes Council on September 14 to invest over half a million pounds in the popular library. The work to the library will see it being modernised to improve the use of the existing space and to create room for other organisations to operate from the library. One option being considered is with the proposed closure of the Bletchley Police Station could the Library offer a new base for the police service. &#34; … &#34;The funding for the improvements to the library comes from the capital budget and from planning gain.&#34;","2015/10/investment-in-hillingdon-milton-keynes-and-scotland.html"],["Sheffield","Thu, 29 Oct 2015 22:02:19 +0000","Sheffield – Library Stories – &#34;In 2015 Library Stories started a citywide conversation, to discover how libraries are used and valued in Sheffield today&#34;. Projects which collects and collates what the public think of libraries.","2015/10/investment-in-hillingdon-milton-keynes-and-scotland.html"],["Oxfordshire","Thu, 29 Oct 2015 22:02:19 +0000","Oxfordshire – Library service will be brought closer to home – Oxford Times. &#34;Oxfordshire County Council wants to make sure more elderly and housebound people are able to borrow books by improving its home library service, used by 233 customers last year. The authority also plans to bring more council services into libraries in the county so people can get help and assistance in their community rather than having to travel to Oxford or Banbury.&#34; … &#34;It hopes the growth in the home library service can offset the possible closure of the county’s mobile libraries as part of budget cuts in the coming years. &#34;","2015/10/investment-in-hillingdon-milton-keynes-and-scotland.html"]]