[["Barnet","Mon, 02 Jan 2017 13:06:06 +0000","Barnet – Barnet Council announced NW7 Hub and Kisharon among partners in major library services changes – Times series. &#34;Through the first half of 2017, the council will be transforming its libraries throughout the borough in order to save £2.2 million as part of a wider programme of spending cuts. Following a procurement process, community service NW7 Hub will operate Mill Hill library, which is currently closed until the week of January 9 2017. The closure will allow the council to put changes in place which will see libraries shrunk to create space for private renting and, most controversially, a reduction in the number of staffed hours at some libraries.&#34;","2017/01/honours-and-the-year-in-review.html"],["Birmingham","Mon, 02 Jan 2017 13:06:06 +0000","Birmingham – Cuts – Peter Ashton’s Blog. &#34;… as I was answering the questions in that consultation I realised this isn’t about libraries. It’s about the city we want to live in. And the idea of a city that we maybe had a decade ago is not going to exist soon. The problem is, with these piecemeal proposed changes, we might not notice until it’s too late, if it’s not too late already. I understand the desire to reduce a service rather than close it completely, but this does more harm than good. The reduced service becomes normalised and then it can be reduced again, until there’s nothing left. And a reduced service by definition is used less, because it’s available less, so its relevance to the community goes down and cutting it further doesn’t feel so bad.&#34;","2017/01/honours-and-the-year-in-review.html"],["Devon","Mon, 02 Jan 2017 13:06:06 +0000","Devon – Exeter library boss among those from Devon to receive New Year Honour – Exeter Express and Echo.","2017/01/honours-and-the-year-in-review.html"],["Durham","Mon, 02 Jan 2017 13:06:06 +0000","Durham – Newton Aycliffe Library Reopens in Leisure Centre – Newton News. &#34;Newton Aycliffe Library has reopened to the public with a new look in a new location.The library’s bright and modern new base, within the town’s leisure centre on Beveridge Way, includes sections for teenagers and children, a study area and updated computer facilities.It also offers a wide selection of current and classic titles as well as e-books and e-mags. Free WiFi is available throughout the building.The move from the library’s former base is part of a wider £1 million scheme being carried out by Durham County Council to help regenerate the town centre.It has involved refurbishing a number of shop units adjoining the leisure centre and creating a shared entrance for the library and leisure centre.&#34;","2017/01/honours-and-the-year-in-review.html"],["Essex","Mon, 02 Jan 2017 13:06:06 +0000","Essex – Essex Libraries’ Big Friendly Read hailed a success – Essex TV. &#34;A third of all Essex children aged between six and 10 took part in this year’s Big Friendly Read, it has been announced.&#34;","2017/01/honours-and-the-year-in-review.html"],["Lancashire","Mon, 02 Jan 2017 13:06:06 +0000","Lancashire – Fulwood library is on the market – and it’s not cheap – Blog Preston. &#34;Commercial property consultants HDAK have been instructed to list the building for sale – understood to be going on the market for more than £475,000. Martin Ainsworth who is in charge of sales and lettings for the consultants said: &#34;I think they wanted to avoid any doubts. It is very much for sale, no lettings, no nothing, it’s for sale. &#34;I think we will get a lot of interest because of its location. Obviously parking and access will be the main issue but as we’ve seen with Costa moving nearby it’s something that can be overcome.&#34;","2017/01/honours-and-the-year-in-review.html"],["Lancashire","Mon, 02 Jan 2017 13:06:06 +0000","Lancashire – JK Rowling, Danielle Steel and James Patterson books among 48,000 missing items from libraries – Lancashire Telegraph. &#34;A Freedom of Information request has revealed thousands of items have been missing for more than six months. &#34;","2017/01/honours-and-the-year-in-review.html"],["Lancashire","Mon, 02 Jan 2017 13:06:06 +0000","Lancashire – Realising Lancashire Libraries’ vision – PanLibus. A look at wireless printing.","2017/01/honours-and-the-year-in-review.html"],["Lancashire","Mon, 02 Jan 2017 13:06:06 +0000","Lancashire – Regenerated Libraries – Lancashire County Council. &#34;Since 2008 almost half of Lancashire’s 74 libraries have been modernised as part of the &#34;Regenerate&#34; and &#34;Youth Space&#34; programmes. County Councillor David Smith, lead member for community services said: &#34;I’m very pleased to say that we’ve avoided library closures here in Lancashire and are continuing to invest in our service wherever we can.&#34; [Many of these libraries are now closed, converted or in process of being sold off – Ed.]","2017/01/honours-and-the-year-in-review.html"],["Lancashire","Mon, 02 Jan 2017 13:06:06 +0000","Lancashire – Village library goes up for sale – Visitor. &#34;Bolton-le-Sands library is being put up for sale by the county council after it failed to find a community group to run it&#34;","2017/01/honours-and-the-year-in-review.html"],["Lancashire","Mon, 02 Jan 2017 13:06:06 +0000","Lancashire – Six former libraries up for sale in Lancashire – BBC. &#34;The libraries affected are in Barrowford, Bolton-le-Sands, Earby, Freckleton, Fulwood, and Whalley. The buildings are the first to be sold in a move by Lancashire County Council (LCC) to raise money.&#34; … &#34;The situation is being monitored by the Department for Culture, Media and Sport which said that local authorities have a statutory duty to provide a comprehensive and efficient library service. &#34;","2017/01/honours-and-the-year-in-review.html"],["Leeds","Mon, 02 Jan 2017 13:06:06 +0000","Leeds – &#34;Perfect storm’ for Leeds libraries as visitor numbers plummet – Yorkshire Evening Post. &#34;…footfall has fallen by nearly a third across Leeds since 2005, an investigation by the YEP can reveal. The figures, released through Freedom of Information requests, show that there were 2.9 million library visits recorded in the year to March 2016, compared to four million in 2005. &#34;","2017/01/honours-and-the-year-in-review.html"],["Lincolnshire","Mon, 02 Jan 2017 13:06:06 +0000","Lincolnshire – New library set to open in Wainfleet – Skegness Standard. &#34;Volunteers are preparing to open the doors to a community hub which incorporated the new Magdalen Library in Wainfleet. It will replace the mobile service that has served Wainfleet previously and opens to the public on Tuesday. The library will be the 35th community hub to open in Lincolnshire, bringing Lincolnshire’s total number of libraries and community hubs to 50.&#34;","2017/01/honours-and-the-year-in-review.html"],["North Yorkshire","Mon, 02 Jan 2017 13:06:06 +0000","North Yorkshire – Group dedicated to saving three libraries needs more than 100 volunteers in order to save the services from closure – Northern Echo. &#34;The Catterick, Richmond and Colburn Community Libraries (CRACCL) was set up earlier this year and is the first group to attempt to take over the running of three libraries – but it needs more than 100 volunteers in order to make it a success. Philip Wicks, chairman of CRACCL, said although there are already nine other community-run libraries within North Yorkshire, CRACCL is the first to attempt to run three with the same group of volunteers from April 1.&#34;","2017/01/honours-and-the-year-in-review.html"],["North Yorkshire","Mon, 02 Jan 2017 13:06:06 +0000","North Yorkshire – Volunteers sought to keep Cross Hills Library open – Craven Herald. &#34;The Cross Hills site is among 20 in North Yorkshire due to become community-managed next April. But county council bosses warn that if no-one comes forward, the facility could close. Now a major campaign has been launched to recruit volunteers to help with a range of tasks, from assisting customers to running children’s story times.&#34;","2017/01/honours-and-the-year-in-review.html"],["Nottingham","Mon, 02 Jan 2017 13:06:06 +0000","Nottingham – The Truth About Nottingham Central Library’s Redevelopment – Left Lion. &#34;Cllr David Trimble stated that it was a high probability that the library would remain on Angel Row, but they do have an alternative site in mind if this plan doesn’t come to fruition. He was also keen to point out that it was a land deal and not a property deal, and that after thirty years, the property’s lease would revert back to the City Council, meaning they will not be losing out on important city centre space.&#34;","2017/01/honours-and-the-year-in-review.html"],["Sheffield","Mon, 02 Jan 2017 13:06:06 +0000","Sheffield – Sheffield’s 82-year-old Central Library under threat due to cuts – World Socialist Web Site. &#34;This record demonstrates that the Labour authority has repudiated the defence of one of the few remaining free services available to the public. What is being taken away will never be restored. Hence, the well-found scepticism in council’s assurances that it will use proceeds from the business rates on a five-star hotel to fund a new purpose built library &#34;elsewhere&#34; in the city centre.&#34;","2017/01/honours-and-the-year-in-review.html"],["Staffordshire","Mon, 02 Jan 2017 13:06:06 +0000","Staffordshire – Silverdale Library relaunched as enterprise centre – Stoke Sentinel. &#34;Taking on the High Street facility is not-for-profit firm Business Enterprise Support (BES), which is going to re-launch the library as an enterprise hub. But a dedicated area for books will remain with volunteers now needed to help oversee the range of new services planned.&#34;","2017/01/honours-and-the-year-in-review.html"],["Surrey","Mon, 02 Jan 2017 13:06:06 +0000","Surrey – Rising Population That Finally Forced Guildford To Open A Public Library – Guildford Dragon. Comprehensive look at the development of libraries in Guildford.","2017/01/honours-and-the-year-in-review.html"],["Swindon","Mon, 02 Jan 2017 13:06:06 +0000","Swindon – Swindon library closures show consequences of squeezed council funds – Unison. &#34;&#34;With only five libraries left, Swindon will lose the expertise and experience of staff, and the service will be harder to access for older people or those with young children – exactly the groups who benefit most from a high quality public library system. &#34;Do we want to see Swindon left with three times as many people per library as the national average? Local people rightly expect a decent level of public services, but the government’s failure to properly fund councils has resulted in a threadbare net of services struggling to deal with people’s needs.&#34;","2017/01/honours-and-the-year-in-review.html"],["Vale of Glamorgan","Mon, 02 Jan 2017 13:06:06 +0000","Vale of Glamorgan – Recently established community library has £7000 annual budget for new books – Penarth Times. &#34;Dinas Powys Library, which was handed over by the Vale council to the Dinas Powys Library and Activity Centre (DPLAC) group in November, has received a fresh stock of books in time for the new year. The library, which is located in Fairoaks adjacent to Dinas Powys Primary School, now has around 40 volunteers fully operating the library. It became the third library in the Vale to become community run as part of the Vale council’s plans to establish five such facilities in the county.&#34;","2017/01/honours-and-the-year-in-review.html"],["Warrington","Mon, 02 Jan 2017 13:06:06 +0000","Warrington – Deputy council leader sides with MP Helen Jones amid row over library closure proposals – Warrington Guardian. &#34;Cllr Matt Smith (LAB – Culcheth, Glazebury and Croft) and Cllr Diana Bennett (LAB – Poulton North) have spoken out in support of the stance taken by the Warrington North MP after LiveWire bosses criticised her for refusing to meet with them. They are joined in their criticism of the way the recent consultation into the future of library services has been carried out by deputy council leader Cllr Graham Friend&#34;","2017/01/honours-and-the-year-in-review.html"],["Warrington","Mon, 02 Jan 2017 13:06:06 +0000","Warrington – ‘I am incredulous’ – executive board member responsible for libraries slams MP – Warrington Guardian. &#34;A decision on the town’s libraries is due in the new year. It follows LiveWire’s consultation into plans to shut some libraries and moved them into hubs, during which it met with Warrington South MP Mr Mowat. But Cllr Tony Higgins, executive board member for leisure, community and culture, criticised the politician. He said: &#34;I am incredulous that, following the meeting David Mowat had with LiveWire, as the executive board member responsible for libraries, I am still waiting for him to make contact.&#34;&#34;","2017/01/honours-and-the-year-in-review.html"],["West Berkshire","Mon, 02 Jan 2017 13:06:06 +0000","West Berkshire – Are you prepared to pay more council tax to keep West Berkshire libraries open? – Reading Chronicle. &#34;West Berkshire Council ran a Library Service Review over the summer to identify ways of plugging a major funding gap and preventing the possible closure of a number of libraries in the area. Now the council is hoping to harness the enthusiasm and goodwill of local communities to help meet the shortfall, and raise £150,000. The council has already been in discussion with Parish and Town Councils, as well as community groups and local organisations about how they want to be involved in shaping the future of West Berkshire libraries.&#34;","2017/01/honours-and-the-year-in-review.html"],["West Dunbartonshire","Mon, 02 Jan 2017 13:06:06 +0000","West Dunbartonshire – Clydebank libraries offer new skills and sessions to welcome 2017 – Clydebank Post. For the youngest residents, bookbug sessions of about 30-40 minutes for babies, toddlers and their parents and carers start Monday, January 9. Songs, action rhymes and sharing stories are the main sources of fun….&#34;","2017/01/honours-and-the-year-in-review.html"],["Worcestershire","Mon, 02 Jan 2017 13:06:06 +0000","Worcestershire – Worcestershire residents encouraged to use libraries in the new year – Worcester News. &#34;Cllr Lucy Hodgson, cabinet member for localism and communities, said: &#34;Libraries across Worcestershire are open 875.5hrs each week offering a huge range of free services, with many libraries opening on certain evenings and The Hive being open seven days a week. &#34;","2017/01/honours-and-the-year-in-review.html"],["Bath and North East Somerset","Thu, 05 Jan 2017 21:06:22 +0000","Bath and North East Somerset – Bath and North East Somerset Council to ‘save’ £49 million by 2020 putting 150 jobs at risk – Somerset Live. &#34;As many as 150 jobs are at risk as the council makes cuts to achieve the savings including 25 in the library sector.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Birmingham","Thu, 05 Jan 2017 21:06:22 +0000","Birmingham – Labour and Lib Dems pulling together to save Sutton Coldfield Library – Sutton Coldfield Local News. &#34;Labour and Liberal Democrats in Sutton Coldfield have joined forces in campaigning against the closure of the Royal Town’s library. While each of the parties has its own petition against the closure, they have agreed a coordinated approach to presenting these to Birmingham City Council at their forthcoming Council meeting on Tuesday 10th January, along with a third petition from Unison&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Birmingham","Thu, 05 Jan 2017 21:06:22 +0000","Birmingham – Public views on BCC’s proposed new model for community libraries – Library Lobby. &#34;During the public consultation period so far, we have visited all of the community libraries to obtain the views of users and library staff. In addition we had many inputs to our social media and responses to items on our website and mailing lists. We attended, and contributed to, the four BCC public consultation meetings and some of the briefing sessions in individual libraries. We held a public meeting in October. This note summarises the key points arising from these and other inputs&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Bradford","Thu, 05 Jan 2017 21:06:22 +0000","Bradford – Army of volunteers make a success of community library – Telegraph and Argus. &#34;Jim Dowzall runs Idle’s community library at the age of 82 with a team of 26 part-timers who he brought together. The library opened in March at the Wright Watson Enterprise Centre and operates two-and-a-half-days a week. And it is going from strength to strength while other Bradford libraries face uncertain futures because of Council cutbacks, Mr Dowzall said.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Brighton and Hove","Thu, 05 Jan 2017 21:06:22 +0000","Brighton and Hove – Cuts to book fund pose new threat to Hove library warn campaigners – Argus. &#34;Former Green councillor Christopher Hawtree has said that a quarter reduction in the budget for library books poses a new threat to the future of the Carnegie less than six months after it&#34; was threatened with closure.","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Coventry","Thu, 05 Jan 2017 21:06:22 +0000","Coventry – Unison calls for halt to Coventry council closure plan for libraries, youth clubs and children’s centres – Coventry Observer. &#34;A three-month consultation period ended last month and key decisions are set to be taken from this month when the universal youth service is set to end. Unison the union, which represents thousands of council workers, has issued a statement saying ‘fundamental questions have not been answered’&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["East Riding of Yorkshire","Thu, 05 Jan 2017 21:06:22 +0000","East Riding of Yorkshire – Revealed: how many still use our libraries – Pocklington Post. &#34;Statistics obtained by the Pocklington Post via the Freedom of Information Act found that 58,890 members of the public used the library service between April 2010 and March 2011. This figure rose to 63,263 between 2015-16 – an increase of seven per cent. Pocklington joins both Stamford Bridge and South Cave libraries in having an improvement in footfall in the past six years. Darren Stevens, head of culture and information, said: &#34;We know that the numbers of library users have held up well, and following our recent review, the council has shown its commitment to libraries by deciding to keep all branches open. However we would accept that the usage numbers we are quoting are estimates.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Edinburgh","Thu, 05 Jan 2017 21:06:22 +0000","Edinburgh – The Girl on the Train tops Edinburgh Libraries lending lists – Edinburgh Reporter. &#34;In Edinburgh the library service has just counted up the most borrowed books of 2016, and it turns out we like crime and mystery best of all. And whether it is in book form or as an electronic download, The Girl on the Train tops both polls. Scottish writers feature in the top ten with Peter May and Ian Rankin sitting alongside Stuart MacBride. Culture and Sport Convener, Councillor Richard Lewis, said: &#34;It’s always fascinating to discover which fiction titles the public choose to withdraw from our libraries the most, and this year it’s a good mix – though featuring some of the country’s familiar favourites like Ian Rankin and J.K. Rowling (aka Robert Galbraith).&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Essex","Thu, 05 Jan 2017 21:06:22 +0000","Essex – Book spending by Essex Libraries halves in five years – Herts and Essex Observer. &#34;A Freedom of Information request to Essex County Council revealed that only £935,670 was spent in 2015-16, compared to £1,708,349 in 2010-11. County-wide library membership also reduced, from 309,276 to 259,192. Author Ajay Ahuja, who grew up in Harlow attending Stewards Academy and Harlow College, said a library book had changed his life. &#34;When I was at Harlow College we used to spend time in the library, and there was a book I took out that pretty much changed my life,&#34; he said.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Glasgow","Thu, 05 Jan 2017 21:06:22 +0000","Glasgow – Glasgow library-based cancer support service reaches milestone – Evening Times. &#34;More than 10,000 attendances have now been recorded at the city-wide Macmillan @ Glasgow Libraries outreach programme since it launched in 2012. Offering emotional and practical support to people affected by cancer, the service operates across the city’s 32 community libraries and the Mitchell. Janice Preston, Head of Services in Scotland at Macmillan Cancer Support, said: &#34;The Macmillan support services have been a real lifeline to many people affected by cancer in Glasgow since the link-up with libraries launched.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Herefordshire","Thu, 05 Jan 2017 21:06:22 +0000","Herefordshire – Hereford library to re-open – Hereford Times. &#34;Library will re-open later this month more than a year after being closed following an asbestos scare. The library and museum in Broad Street which was closed in September 2015 will re-open on January 31, following the phase one completion of building work. Customers can look forward to a refreshed ground floor interior, including new meeting rooms and accessible public toilets. Further work on the development of the building will follow. The county library will also welcome WISH (Wellbeing Information and Signposting for Herefordshire) which will operate from the main library when it reopens.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Lancashire","Thu, 05 Jan 2017 21:06:22 +0000","Lancashire – Anger as Whalley library goes on the market – 2BR. &#34;The announcement has prompted an angry response from the residents of Whalley and Billington. It has struck everyone as not only incredibly crass but is regarded by many people as thoroughly duplicitous behaviour by Lancashire County Council trying to bury the announcement at a time when they hoped no-one would be watching out for it&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Lancashire","Thu, 05 Jan 2017 21:06:22 +0000","Lancashire – Earby Library to go up for sale – Craven Herald and Pioneer. &#34;Mr Hartley said: &#34;Earby is geographically separate from everyone else, and as bus services aren’t what they used to be we need a centre for the local population and surrounding villages.&#34; Last year, it had been mooted that the New Road Community Centre would be considered as a possible location for a new Earby Library. &#34;Those discussions never happened,&#34; said Mr Hartley. &#34;We offered to accommodate the library, but that offer hasn’t been taken up.&#34;&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Lancashire","Thu, 05 Jan 2017 21:06:22 +0000","Lancashire – Fury over ‘duplicitous’ timing of Whalley Library sale announcement – Lancashire Telegraph. Councillors &#34;have condemned Lancashire County Council’s decision to sell Whalley Library and the timing of its announcement late on the Friday before New Year. The decision to axe the building, which saw a footfall of more than 3,000 people a month, has been branded ‘duplicitous behaviour’ by ward councillor Ged Mirfin. Cllr Mirfin, who co-chairs the Save Whalley Library Group, said: &#34;The announcement has prompted an angry response from the residents of Whalley and Billington.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Lancashire","Thu, 05 Jan 2017 21:06:22 +0000","Lancashire – Hands off our library – 2BR. Local councillor says &#34;Not only should this just be a library, but it could be used as a service centre. &#34;It may well still be utilised for education purposes, and I know that Whalley School are interested, so we’ll have to pursue that and see where it takes us. &#34;There is a thought of it being used perhaps as a nursery, as a feeder nursery school particularly for Whalley Primary School which is short of space. &#34;If indeed this is sold, particularly for some commercial purpose, then that would be devastating for this area, it’s such a great facility.&#34;&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Lancashire","Thu, 05 Jan 2017 21:06:22 +0000","Lancashire – ‘I’m absolutely incandescent’ – Lancashire County Council puts former libraries up for sale – Lancashire Telegraph. &#34;Ribble Valley MP Nigel Evans said: &#34;I’m absolutely incandescent. &#34;The consultation process should be carried out afresh. &#34;The voices of the people in Whalley have been completely ignored.&#34; The council said it is being faced with a ‘difficult’ budget position and is having to make ‘huge’ savings. Cllr Mike Goulthorp, who represents Earby on Pendle Council, said: &#34;It’s unfortunate we have not be able to get any community response.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Northamptonshire","Thu, 05 Jan 2017 21:06:22 +0000","Northamptonshire – A healthy, happy, connected community: it starts in the library – Libraries Taskforce. &#34;More than simply a place to borrow and read books, libraries have transformed into vibrant community hubs. A place where people find out about – and access – community services, learn new skills and connect with others. A place that silently combats social isolation, helps people find work, facilitates community groups and connects students with the latest in research. Libraries are vibrant, multifaceted places. Each one constantly evolving and reinventing to become more relevant than ever. In Northamptonshire, we are aiming to take this up a level. Given the idea behind First for Wellbeing is to build up a true community of local wellbeing experts and services, it is only fitting that libraries take the role of our physical and spiritual ‘home’ – or 36 ‘homes’, for that matter. Libraries are now used to hold meetings, community events and adult learning courses. More often than not, our wellbeing advisors will use libraries &#8230;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["North Yorkshire","Thu, 05 Jan 2017 21:06:22 +0000","North Yorkshire – Bilton Library forced to close temporarily after &#34;major&#34; overnight flood – Harrogate Advertiser. &#34;Greta Knight, chair of Trustees at the Library, said she was close to tears when she saw the damage and the library would be closed until January 16 at the earliest. She said: &#34;Water has been pouring out from the boiler non stop from last night until 7.30 this morning and the library has taken the brunt of the damage.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Staffordshire","Thu, 05 Jan 2017 21:06:22 +0000","Staffordshire – Silverdale Library relaunched as enterprise centre – Sentinel. &#34;Taking on the High Street facility is not-for-profit firm Business Enterprise Support (BES), which is going to re-launch the library as an enterprise hub.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Staffordshire","Thu, 05 Jan 2017 21:06:22 +0000","Staffordshire – Watch: Library is still important to Burton as councils across the country cut funding – Burton Mail. &#34;Library users in Burton were not surprised to hear that library funding had been cut across the country but still believe it is a valuable asset. Roger Easton, from Burton, who is over 70, said: &#34;I personally don’t use it very often but my wife brings our granddaughter here for the story-telling and nursery rhyme sessions. She is 15 months old and she really enjoys it. &#34;If you come on a Tuesday or Friday you will see lots of parents and children enjoying themselves. My granddaughter is a member of the library and there is no penalty if she returns it late or has an accident. They also give out a free pack to children.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Suffolk","Thu, 05 Jan 2017 21:06:22 +0000","Suffolk – Library users urged to support Suffolk Libraries by paying their fines and returning overdue books – EADT. &#34;Book borrowers who have failed to return overdue titles or racked up fines are being urged to return books to libraries in Suffolk and pay their debt, as more than £200,000 of fines remains unpaid.&#34; … &#34;Fines are 13p per day for overdue adult books, and 1p per day for children’s books. The maximum overdue charge on an adult book is £6.37, while the nominal charge for overdue children’s books is designed to promote responsibility among younger readers. &#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Swindon","Thu, 05 Jan 2017 21:06:22 +0000","Swindon – Library lessons on internet use – This Is Wiltshire. &#34;Swindon Libraries are once again offering their popular computer courses and are encouraging residents of all ages from across the town to sign up for their latest courses beginning this month. The library service is running free computer courses during January for people who would like to learn how to use the internet. Those taking part can either use their own laptop or one of the library computers to learn how to use a search engine, find information on health matters or learn how to pay bills online.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Torfaen","Thu, 05 Jan 2017 21:06:22 +0000","Torfaen – Councillors to consider proposed £250k cuts to Torfaen’s library service – Free Press. &#34;In March 2016, Torfaen County Borough Council agreed measures to address a project shortfall of £26 million in its budget from 2016 – 2019. As part of these cuts, £250,000 was outlined for all three of the borough’s libraries — Blaenavon, Cwmbran and Pontypool. In a lengthy public consultation, which closed on Sunday, December 18, the public were invited to give feedback on three options that would help save the required £250k.&#34; … &#34;The report also states that if a library were to close as part of proposals, Welsh Government may choose to &#34;claw back&#34; a percentage or all of the funding. This could affect grants for the three libraries including Blaenavon’s £100,000, Pontypool’s £300,000 and Cwmbran’s £80,000.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Warrington","Thu, 05 Jan 2017 21:06:22 +0000","Warrington – Politicians furious at plans to close library next to school without enough books – Warrington Guardian. &#34;… politicians are calling on LiveWire to save Padgate Library after an Ofsted report found a neighbouring school does not have enough books. Inspectors ordered University Academy Warrington on Insall Road to improve after a visit in November, when Ofsted said the school lacked a proper library. arrington North MP Helen Jones has been highly critical of plans to shut nine libraries across the town, including Padgate Library which sits next to the school. The Labour politician said: &#34;This situation is fast becoming like something from Alice in Wonderland.&#34;","2017/01/libraries-minister-goes-to-lancashire-but-will-he-intervene.html"],["Anglesey","Mon, 09 Jan 2017 20:20:28 +0000","Anglesey – Holyhead market hall’s £2.4m refurbishment to begin – BBC. &#34;After securing £2.4m of Heritage Lottery Fund cash, the council plans to create a library and business hub. Following an ownership row, the council took it over in July 2016 and has announced work will start in January. Originally, the building housed assembly rooms and a court. However, it passed into private ownership about a decade ago and concerns were raised about its deteriorating condition as it fell into disrepair.&#34; see also Holyhead Market Hall restoration set to begin – Anglesey Council.","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Bath and North East Somerset","Mon, 09 Jan 2017 20:20:28 +0000","Bath and North East Somerset – More than 1,500 people sign petition to save Bath Central Library – Bath Chronicle. &#34;The council has promised to offer a &#34;modernised&#34; library in a move which would save £800,000 a year. But those behind a Change.org petition believe a new library will offer &#34;the bare minimum.&#34; Parent Vishaka Robinson said moving the space would risk &#34;losing an incredibly valuable resource.&#34; Mrs Robinson, a mum of two, uses the library in the Podium above Waitrose at least three times a week.&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Bath and North East Somerset","Mon, 09 Jan 2017 20:20:28 +0000","Bath and North East Somerset – Save Bath Central Library – Change.org. &#34;The new library will save BANES Council £800,000 a year and they will ‘Uphold [their] statutory duty for the provision of library services’. In layman’s terms they will do the bare minimum to ensure the public have access to library facilities. If you could create a beautiful, functional, multi-use space, what do you think it would look like? Bath Central Library. It’s already here, upstairs in The Podium, right in the centre of our town.&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Brent","Mon, 09 Jan 2017 20:20:28 +0000","Brent – Pop-up library launches in Kilburn Station – Brent and Kilburn Times. &#34;The new book exchange corner was launched in Kilburn Station on the Jubilee Line on Thursday thanks to collaboration between Cricklewood Library campaigners, Mapesbury Residents Association (MapRA), Transport for London (TfL) and Brent Council.&#34;. Twelve shelves of books.","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Camden","Mon, 09 Jan 2017 20:20:28 +0000","Camden – Open access libraries go live on Tuesday 10 January – Camden Council. &#34;Over the past few months we have been installing open access technology at five Camden libraries. We will begin using this open access system from Tuesday 10 January. This means that you will need to use your library card and PIN number to enter the following libraries before 12 noon from Monday to Saturday:&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Essex","Mon, 09 Jan 2017 20:20:28 +0000","Essex – Friends groups to launch in Essex libraries – Essex Council. &#34;Two libraries in North Essex will pilot newly created ‘Friends Groups’ ahead of a roll out across the county. Made up of local residents who have an interest in helping to develop their local libraries, the groups will be supported by Essex County Council with the remit of working alongside library staff, and supporting the library offer within their local areas.\nThe first two pilot schemes will be launching in West Mersea and Sible Hedingham. Cllr Anne Brown, Cabinet Member responsible for libraries at Essex County Council said: &#34;This is all about getting the community more involved in their local library. It is an idea that has worked well in other parts of the country, with the groups taking on projects, developing and running events and activities and also gaining funding, not available to us, to invest in equipment.&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Flintshire","Mon, 09 Jan 2017 20:20:28 +0000","Flintshire – Ground Breaking Flintshire Leisure and Library Services to be First in Wales – Business News Wales. &#34;Turnout was 92.5% among leisure and library employees and they gave a resounding 90% yes to the proposals to set up a Community Benefit Society to deliver leisure and library services from 1 July 2017. This followed a Council decision to agree to the establishment of the new organisation to manage the services from July 2017. This is a first for Wales and one of only a handful of organisations to run services such as these in the whole of the UK. The business plan shows that in the first full year, over £500,000 of savings can be made to the service operation while Flintshire County Council is making a capital investment of almost £1m to improve leisure and library buildings, play areas and artificial pitches in the county.&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Gloucestershire","Mon, 09 Jan 2017 20:20:28 +0000","Gloucestershire – Your letters: ‘Why can’t children be quiet? They are ruining our libraries’ – Gloucestershire Live. &#34;The children apparently mainly come from local schools. Is this a reflection on school discipline? Their behaviour certainly raises questions about their parenting. Should the parents be held to account? Perhaps the Government should be held to account for their austerity policy? The youth facility in Gloucestershire has been decimated because we are paying for the problems caused by the banking world and the need to reduce taxation on the one per cent who have obscene wealth. What is certain is that, as that adult said, ‘it is not right’ the way they behave in the library.&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Hampshire","Mon, 09 Jan 2017 20:20:28 +0000","Hampshire – Fareham Library to be Modernised – About My Area. &#34;The library in Osborn Road will be closed temporarily for the works as part of a commitment made within the Library Strategy to reinvest £500,000 a year from the Book Fund until 2020 into library buildings and technology. Councillor Andrew Gibson, the County Council’s Executive Member for Culture, Recreation and Countryside, said: &#34;The new and refurbished facilities will add so much more to Fareham Library, which plays a vital role in the local community and offers so many valuable services to residents. It is important that we invest in our buildings and meet the changing demands of customers and make the most of emerging technology. During the temporary closure, customers at Fareham will be given extended loan periods for their books, as well as the usual option to use services online or from neighbouring libraries to help avoid any inconvenience.&#34;&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Lancashire","Mon, 09 Jan 2017 20:20:28 +0000","Lancashire – Fury as village library goes on the market – Clitheroe Advertiser. &#34;Coun. Ged Mirfin, who represents Billington, Brockhall and Old Langho and who is also one of the joint leaders of the Save Whalley Library Campaign, said: &#34;The announcement has prompted an angry response from the residents of Whalley and Billington. &#34;It has struck everyone as not only incredibly crass, but is regarded by many people as thoroughly duplicitous behaviour by Lancashire County Council trying to bury the announcement at a time when they hoped no-one would be watching out for it.&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Lancashire","Mon, 09 Jan 2017 20:20:28 +0000","Lancashire – Tory MP complains after cuts his party made hit council services – Morning Star. &#34;The Library Campaign’s Laura Swaffield said the council was &#34;demonstrating contempt&#34; in putting the library buildings on sale while the government is supposed to be investigating. There are also fears that residents will have to foot the bill if the council is forced to reverse its plans. Ms Swaffield added: &#34;The scale of the devastation planned in Lancashire would have been a sensation a couple of years ago. Now it’s becoming commonplace.&#34; see also Minister called in after libraries cull  – Morning Star.","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Milton Keynes","Mon, 09 Jan 2017 20:20:28 +0000","Milton Keynes – Project Manager for the ‘Sharing Libraries’ Project – Contracts Finder. &#34;Milton Keynes Council (MKC) seek a Project Manager to lead the ‘Sharing Responsibilities for Libraries’ project (Year Two) which involves developing and implementing new ways of operating at 9 libraries across Milton Keynes. The Project Manager will develop and manage the project which will include stakeholder engagement, public consultation and the development of a detailed delivery plan for all libraries and each library. The Project Manager will work one day per week in Milton Keynes for twelve months (Feb 2017 – Feb 2018).&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Sandwell","Mon, 09 Jan 2017 20:20:28 +0000","Sandwell – Sandwell libraries proving just the ticket – Sandwell Council. &#34;An army of volunteers and a packed programme of activities have put Sandwell libraries among the best in the country according to recent figures. The borough came third out of 36 metropolitan authorities for the number of books borrowed and with more than 1.7 million people through the doors, it had the fourth highest number of visits. Figures for 2015-16 released by the Chartered Institute for Public Finance and Accountancy (CIPFA) also show Sandwell had the fifth highest use of computers and was the tenth highest for enquiries. And it had the second highest number of volunteers after recording 16,820 volunteer hours during the year.  &#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Somerset","Mon, 09 Jan 2017 20:20:28 +0000","Somerset – Commissioning outcomes – Libraries Taskforce. &#34;We have talked a lot – a huge amount actually as one of the difficulties was that, rightly or wrongly, very little was understood about library services and why we do what we do. And securing greater empathy and understanding about all our activities – from the Knit & Natter groups through to our UKOnline provision – needed time. Never underestimate how much time is required to do this.&#34;.  Library service is now more fully integrates with council aims and works strategically to solve problems.","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Staffordshire","Mon, 09 Jan 2017 20:20:28 +0000","Staffordshire – Kinver MP Gavin Williamson whips community library into shape at official opening – Evesham Journal. &#34;Although the building and its maintenance will remain the responsibility of Staffordshire County Council, the historic library in Vicarage Drive is now managed and staffed by fully trained local volunteers. The move comes after Staffordshire County Council decided to delegate responsibility for a number of libraries throughout the county to the public, leading to a group known as Kinver Community Library Limited (KCLL) formed to take care of day-to-day operations.&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Staffordshire","Mon, 09 Jan 2017 20:20:28 +0000","Staffordshire – ‘We need to look after our libraries’ – Burton Mail / Letters. Spending on this vital service should be maintained.","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Surrey","Mon, 09 Jan 2017 20:20:28 +0000","Surrey – Surrey County Council looking into possibility of having other services in libraries – Get Surrey. &#34;The council’s comments come after a suggestion libraries need coffee shops, post offices and NHS service links to survive … we are always looking at the possibility of incorporating other services into our libraries and already share some of our premises with Citizens Advice Bureaus while also advertising public health campaigns.&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Swindon","Mon, 09 Jan 2017 20:20:28 +0000","Swindon – Fresh hope for future of threatened Walcot library – Swindon Advertiser. Library may be replaced by computer training centre and book-collection point. &#34;The strategy would see the Sussex Place unit, which the Walcot Shop and Community Library moved into just over a year ago, become an IT training hub where volunteers would teach jobseekers and the elderly how to best utilise the web. They also hope the new strategy will appeal to ‘silver surfers’, elderly residents who may benefit from using the internet for such things as online shopping or paying bills. Along with the training centre, the space would act as a library book pick up and drop off point, and serve as a public meeting place for local groups.&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Thurrock","Mon, 09 Jan 2017 20:20:28 +0000","Thurrock – Arson attack on East Tilbury library – Your Thurrock. &#34;Initial reports were of a car on fire, but once on the scene firefighters reported that a car had reversed through the front doors of a commercial building and was alight inside the building. The building was 25% alight and 100% smoke logged. Firefighters quickly reassessed the incident and worked to extinguish it by 5.29am. The building, which mainly contained books, has suffered both smoke and fire damage and many of the books inside have been destroyed.&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Thurrock","Mon, 09 Jan 2017 20:20:28 +0000","Thurrock – Fears &#34;priceless&#34; Bata Collection could have been destroyed in arson attack at East Tilbury library – Your Thurrock. &#34;The Bata Collection houses artefacts relating to the Bata Factories at East Tilbury from the thirties to the present day. Visitors from all over the world regularly come to the collection housed at the library. Chair of The Bata Reminisence Centre. Mike Tabard said: &#34;These are too early days to establish what has happened. We are speaking to all the relevant authorities and only after that will we be able to assess the damage.&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Torfaen","Mon, 09 Jan 2017 20:20:28 +0000","Torfaen – Library service cuts recommended by Torfaen council – South Wales Argus. &#34;Two libraries could have their book loan services reduced to just two-and-a-half days per week. As part of a £250,000 savings exercise for the 2017/2018 financial year, agreed by Torfaen council last March, the library services in Blaenavon and Pontypool will be reduced. Cwmbran library will also have a reduced service of four days, with all three libraries using self service facilities as part of the proposals. Members of the scrutiny committee narrowly supported the proposal yesterday, with four members voting in favour of the plans.&#34;","2017/01/refurbishments-a-new-libraryleisure-trust-and-pin-only-camden-mornings.html"],["Bath and North East Somerset","Sun, 15 Jan 2017 19:19:16 +0000","Bath and North East Somerset – Fight over the future of Bath Central Library – ITV. &#34;It’s a purpose-built library for the people of Bath in the heart of the city. But now the council wants to move it to another building as part of cost-cutting measures. It’s something that’s upset many residents and authors, who say it will result in a vital community hub being lost.&#34;&#34; Includes video interview with library campaigner.","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Bath and North East Somerset","Sun, 15 Jan 2017 19:19:16 +0000","Bath and North East Somerset – Modernising library services in Bath and Midsomer Norton – Bath and North East Somerset Council. &#34;Following the success of the joint library and One Stop Shop in Keynsham, plans have been announced that will also see Bath’s Central Library and Midsomer Norton Library modernised to reflect the changing way people use the library service.&#34; … &#34;Councillor Martin Veal (Conservative, Bathavon North), Bath & North East Somerset Council’s Cabinet Member for Community Services, said: &#34;The plans we are putting forward will ensure that B&NES residents have access to a modern library service which is both sustainable for the future and fits with the way in which people are now using library services.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Bath and North East Somerset","Sun, 15 Jan 2017 19:19:16 +0000","Bath and North East Somerset – Volunteers and parish councils could be asked to take on running of Bath libraries – Bath Chronicle. &#34;There are already four community-run libraries, three of these being Larkhall, Combe Hay and Southside and it is community-led approaches which have been identified as a way of alleviating the cash-strapped council.&#34; … &#34;The spokesman said: &#34;We have been discussing options and have asked for communities to consider a variety of community-led library approaches. These range from parish councils taking on the library function to volunteer groups being set up to take on this role.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Birmingham","Sun, 15 Jan 2017 19:19:16 +0000","Birmingham – 6,500 sign petitions against closure of Sutton Coldfield’s library – Birmingham Mail.","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Birmingham","Sun, 15 Jan 2017 19:19:16 +0000","Birmingham – Thousands back ‘Save Sutton Coldfield Library’ campaign as petitions go to Birmingham City Council – Royal Sutton Coldfield Observer. &#34;Sutton Coldfield resident and Library Lobby campaigner Zoe Toft said: &#34;I was delighted to see four petitions presented in support of Birmingham libraries and opposing the proposed cuts – over 6,500 signatures show that people really care and value their local libraries and I hope Birmingham City Council (BCC) will hear their voices. &#34;I’m very grateful to all the volunteers who put in hours of their own time to collect the signatures and talk to their fellow residents about the proposed library cuts. Seeing the community come together over this has been something to take great heart from.&#34;&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Brighton and Hove","Sun, 15 Jan 2017 19:19:16 +0000","Brighton and Hove – Children to be fined for late library books – Argus. &#34;It was agreed last night to raise income from children who are behind with their library books but the move could cause parents to discourage their youngsters from using libraries, a councillor has warned. onservative councillor Garry Peltzer-Dunn called on the council to rethink plans which would see children charged late fees for the first time in nine years. But Cllr Peltzer-Dunn, who said there should be &#34;no obstruction&#34; to reading for young people in the city, was unsuccessful with an amendment to drop the plans as it was voted down by Labour councillors.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Cardiff","Sun, 15 Jan 2017 19:19:16 +0000","Cardiff – How the people of Rumney have saved their library – twice – Wales Online. &#34;One of the most vocal groups was Community Action for Rumney Library (CARL). While the Labour-run council backed down on their hugely controversial plans, there were still worries about preserving library provision. In summer 2015, the council began work on a new hub. But the campaigners from CARL were adamant they wanted their building to remain open. Along with Rumney Forum, they asked people what they wanted to see, with the most commonly suggested items being for a community space and coffee shop.&#34; … &#34;Inside will be Wales’s first Library of Things – where people borrow items instead of books – as well as a book library, coffee shop, play area for under five’s and rooms for hire.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Coventry","Sun, 15 Jan 2017 19:19:16 +0000","Coventry – ‘I hate those who destroy healthy trees’ – Coventry Telegraph. &#34;Earlsdon is the third most used of the district libraries with 123,555 visitors compared with 111,181 at Tile Hill and 100,479 at Stoke, yet both of these libraries would continue to be run by the council as &#34;core libraries&#34;. The proposals also envisage maintaining a further five libraries (all with far fewer visitors than Earlsdon) as ‘partnership libraries’ run by a mixture of council employees and volunteers.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Croydon","Sun, 15 Jan 2017 19:19:16 +0000","Croydon – Councillor has had 300 books taken from book ‘exchange’ – Inside Croydon. 300 books simply taken from Little Free Library and not replaced. &#34;. The book &#34;exchange&#34; on Surrey Street is just a couple of minutes’ walk from the Croydon Central Library, which has an established system of exchanging books and other media, which has stood the test of time. And which usually ensures that its books are indeed returned for the use of others.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Darlington","Sun, 15 Jan 2017 19:19:16 +0000","Darlington – Darlington’s future library plans detailed as councillors prepare to approve closure of Crown Street building – Northern Echo. &#34;The closure of the historic Crown Street Library and the £1.7m relocation of many of its resources will usher in a new era for the town’s library services, according to a report from Darlington Borough Council (DBC). &#34; … &#34;If proposals are approved by council members, Darlington’s mobile library will close, Cockerton Library will be community-run and the town’s central library will be relocated from Crown Street to the Dolphin Centre. &#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Darlington","Sun, 15 Jan 2017 19:19:16 +0000","Darlington – Library Service – Darlington Council. &#34;Storage of library books and the Local Studies resource will be within the Dolphin Centre, Bennet House adjoined to the Dolphin Centre and office accommodation on Beaumont Street within the Multi Storey Car Park.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Fife","Sun, 15 Jan 2017 19:19:16 +0000","Fife – Papers axed at Fife libraries – Fife Today. &#34;Libraries in Fife are to drastically cut back the number of newspapers they stock each day, reducing to just a single daily paper and one weekly. The service previously in place meant that libraries offered a wide range of local and national newspapers to visitors, but the latest cutbacks will mean that in some libraries only a single local weekly will be available.&#34;&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Lancashire","Sun, 15 Jan 2017 19:19:16 +0000","Lancashire – County council and Westminster have &#34;wrecked&#34; our library service – Pendle Today. &#34;Regular users of Burnley Central Library’s community history section have slammed Lancashire County Council for closing it and transferring the service to &#34;a small corner of the library&#34;.  Burnley’s main library, in Grimshaw Street, closed the doors of its reference section, which occupied the whole of the basement, at Christmas to the shock of many who have used it including students and pensioners.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Lancashire","Sun, 15 Jan 2017 19:19:16 +0000","Lancashire – Former Library, 294 Garstang Road, Fulwood, Preston PR2 9RX – HDAK. &#34;On behalf of Lancashire County Council. Purpose built former library premises suitable for retail, restaurant, office or medical use.&#34; Fulwood Library still for sale, regardless of the library minister’s visit, although the sale does include a &#34;clawback clause&#34; of 50% of any profits from the site if it is resold.","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Lancashire","Sun, 15 Jan 2017 19:19:16 +0000","Lancashire – Hurry up call in battle to save libraries – Blackpool Guardian. &#34;The bids, by Thornton Gala Committee and UR Potential respectively, remain with County Hall officials. But Coun Kay is concerned the clock is ticking and those groups who have been lined up to use the centres could begin to look elsewhere. She said: &#34;We need answers. They have made a decision on some but it is a drip, drip, drip. &#34;We have groups lined up not only to take over the libraries but to use them.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Lancashire","Sun, 15 Jan 2017 19:19:16 +0000","Lancashire – Libraries minister visits Lancashire over cuts – BookSeller. &#34;The DCMS declined to comment on the meeting when asked by The Bookseller, saying it was a &#34;private&#34; affair, but added that the minister’s visit was &#34;to discuss and question the authority’s existing and future plans for its library service&#34; and meet local representatives who had concerns about a library’s closure. Wilson also met with representatives to discuss the closure and impending sale of Whalley Library, which was put up for sale after the council failed to find voluntary groups to run it.&#34; see also Lancashire – It might not be the end for Whalley Library – 2BR..","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Lancashire","Sun, 15 Jan 2017 19:19:16 +0000","Lancashire – Minister meets leader about libraries’ future – Blackpool Gazette. &#34;County Coun Jenny Mein was cautiously hopeful that some extra funding may be available following a visit by minister Rob Wilson.&#34; … &#34;The VIP visit followed a call by Ben Wallace, Wyre and Preston North MP for the Government to intervene and &#34;call in&#34; the council closures and investigate whether it is meeting its legal obligations under the Public Libraries and Museums Act 1964. &#34; … &#34;A Department of Culture spokeswoman said the visit was: &#34;to discuss and question the authority’s existing and future plans for its library service&#34; and meet local representatives concerned about a library closure.&#34;.  [Council says everything is great despite all evidence to contrary – Ed.]. see also Minister visits Lancashire to investigate library closures – Lancashire Evening Post.","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Lancashire","Sun, 15 Jan 2017 19:19:16 +0000","Lancashire – Ministerial Visit sets precedent – LinkedIn. &#34;It was the first investigatory visit by a Government Minister under the terms of the 1964 Public Libraries and Museums Act introduced by the Labour Government of Harold Wilson in order to promote Public Education. Under the Act Local authorities have a statutory duty to provide a comprehensive and efficient library service for all persons’ in the area that want to make use of it. Rob Wilson described the investigatory visit as &#34;groundbreaking&#34; and that it was &#34;the first occasion a Government Minister had had to carry out an investigatory visit to a single public library where a decision had been taken to close it and put it up for sale.&#34; Rob Wilson communicated to the attended participants that the Save Whalley Library Campaign and Ribble Valley Borough Council through their extensive campaigning to keep Whalley Library open and the official complaint set out in a Letter about how the consultation process was handled by Lancashire County Council sent by the&#8230;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Lancashire","Sun, 15 Jan 2017 19:19:16 +0000","Lancashire – Support Silverdale Library – Facebook. Confirmed that Silverdale will go volunteer.","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Lancashire","Sun, 15 Jan 2017 19:19:16 +0000","Lancashire – Why are our libraries closing? – 2BR. &#34;First, the announcement of the sale of Whalley Library, which occurred just before New Year’s Eve. Also, we’re very grateful to Nigel Evans MP who has reacted so swiftly to make Rob Wilson aware of the impact of the sale of the library going forward. &#34;County Councillor Albert Atkinson wrote to Rob Wilson pointing out that if the library was sold that is it, that is effectively us as a community losing any access to the library building.&#34;&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Lincolnshire","Sun, 15 Jan 2017 19:19:16 +0000","Lincolnshire – Volunteers needed for new Holbeach library – Spalding Today. &#34;The library, currently in Church Street, will be moving into a new home as part of a major project by Lincolnshire Co-op to create a hub of community facilities on the site of its food store in Fleet Street. The new library will have a stock of over 4,000 books. These are provided by Greenwich Leisure Limited, which is a staff-owned co-op and the UK’s largest leisure charitable social enterprise responsible for managing libraries across Lincolnshire on behalf of Lincolnshire County Council&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Manchester","Sun, 15 Jan 2017 19:19:16 +0000","Manchester – Citywide libraries survey reveals progress – MancLibraries Blog. &#34;The Public Library Users Survey was carried out across Manchester’s 22 public libraries over a one-week period in October 2016. 93.3 per cent of 4,750 people surveyed gave their local library an overall rating of either ‘good’ or ‘very good’ – a 4.5 per cent increase on the result of the last survey in 2012.  It is the highest overall satisfaction figure recorded since Manchester-wide library surveys were first conducted in 2002.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["North Yorkshire","Sun, 15 Jan 2017 19:19:16 +0000","North Yorkshire – North Yorkshire library could close this year without volunteers – Darlington and Stockton Times. &#34;Stokesley Library will close this year unless more volunteers step forward to help run it. It is one of 21 North Yorkshire libraries due to be handed over to the community in spring after the county council announced it could no longer afford to run them due to budget cuts. But the community charitable group in the process of being registered to take over the running of Stokesley Library says it is in desperate need of more volunteers to avoid the resource being closed. North Yorkshire County Council ends its management of the centre in March/April.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["North Yorkshire","Sun, 15 Jan 2017 19:19:16 +0000","North Yorkshire – YP Letters: Cameron and Osborne to blame for library woes – Yorkshire Post. &#34;The main reason that our public libraries are suffering today is because of one government – the Tory dominated coalition of 2010-2015 – and two men, David Cameron and George Osborne. whose savage cuts and careless economic policies set in motion this current and ultimately avoidable scenario, a scenario ignored unfortunately by the present Tory administration led by Theresa May. They are the ones who should hang their heads in shame when fingers are pointed and people say what happened?&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Sandwell","Sun, 15 Jan 2017 19:19:16 +0000","Sandwell – Banish Blue Monday with Sandwell libraries – Sandwell Council. &#34;Sandwell libraries are running lots of inspiring events from 16-23 January to encourage positive thinking on what has been identified as one of the most miserable days of the year. Events include well-being sessions, gentle yoga, catching a classic comedy film, relaxing with a Reiki taster session or simply sitting back and enjoying a cup of tea with toast and a natter&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Sandwell","Sun, 15 Jan 2017 19:19:16 +0000","Sandwell – Volunteers and activities put Sandwell libraries among the best in country – Express and Star. &#34;The borough came third out of 36 metropolitan authorities for the number of books borrowed and, with more than 1.7 million people through the doors, it had the fourth highest number of visits. Figures for 2015-16 released by the Chartered Institute for Public Finance and Accountancy also show Sandwell had the fifth highest use of computers and was the tenth highest for inquiries. It had the second highest number of volunteers after recording 16,820 volunteer hours during the year.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Sheffield","Sun, 15 Jan 2017 19:19:16 +0000","Sheffield – Library visits in decline across Sheffield, but one branch is bucking the trend – Star. &#34;Visitors to Sheffield’s council-run libraries have plummeted by a quarter in the last two years, but there is one branch which is bucking the trend. Highfield Library welcomed 67,596 people through its doors in the 2015/16 financial year, eight per cent more than in 2013/14.&#34;… &#34;During the same period, footfall at Sheffield Central Library’s lending department slumped by a third, from 298,267 to 198,907. Most council-managed libraries in the city saw at least a 20 per cent drop in visitors, and the picture is a similarly gloomy one for libraries in much of the country&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Sunderland","Sun, 15 Jan 2017 19:19:16 +0000","Sunderland – Have your say on the future shape of library services – NE Connected. &#34;The number of people visiting libraries in the city has halved in the last four years. At the same time the number of people accessing services digitally is continuing to rise. This reflects the situation nationally with fewer people using traditional library services.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Swindon","Sun, 15 Jan 2017 19:19:16 +0000","Swindon – £81k cash bid to boost library reach – Swindon Advertiser. &#34; successful, the bid for £81,000 would be used to deliver Libraries Unbound, a project aimed at taking modular and flexible library services to communities in place of static libraries. The borough’s libraries strategy, which will see the number of council-funded libraries reduced from 15 to just five, also cut the funding for Swindon’s mobile library service.&#34; [It’s very unclear what the new scheme would actually be – Ed.]","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Swindon","Sun, 15 Jan 2017 19:19:16 +0000","Swindon – Library campaigners call for minister to step in – Swindon Advertiser. &#34;Library campaigners are calling on the government’s libraries minister to visit Swindon and intervene in plans to cut the town’s library service &#34;before it’s too late&#34;. The Save Swindon’s Libraries campaign has now submitted representations to the Department for Culture, Media and Sport over what they see as a flawed consultation and unsatisfactory proposal from Swindon Borough Council. Similar representations from campaigners in Lancashire led the minister, Rob Wilson MP, to visit the area in person earlier this week.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Torfaen","Sun, 15 Jan 2017 19:19:16 +0000","Torfaen – Torfaen libraries threatened with 2.5 day service reduction – BookSeller. &#34;Two libraries in Torfaen, Wales, could see their book loan services reduced to just two-and-a-half days per week in order to help make £250,000 worth of savings, the South Wales Argus has reported. As part of a savings exercise for the 2017/2018 financial year, Torfaen Council has proposed to reduce the library services in Blaenavon and Pontypool to two-and-a-half days and to reduce Cwmbran library service to four days. The proposals would see all three libraries using self service facilities.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Warrington","Sun, 15 Jan 2017 19:19:16 +0000","Warrington – Library campaigners angry after LiveWire introduces new membership scheme – Warrington Guardian. &#34;New membership options introduced by LiveWire, which mean residents have to sign up for leisure facilities when they apply for a library card, have left protestors angry. LiveWire, which runs both libraries and gyms, has replaced their membership scheme with three new options – starter, saver and select. To join a library, people must sign up for the free ‘starter’ package which gives them a dual libraries and leisure card. The card also includes a three day gym trial and other offers.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Warrington","Sun, 15 Jan 2017 19:19:16 +0000","Warrington – No libraries to close in Warrington – Warrington Worldwide. &#34;… All libraries will remain open in some form, including the main central library which will also become a heritage hub. Plans to relocate the library to Golden Square have been dropped. While the findings of the draft consultation document have still got to be rubber stabbed and presented to the borough council’s Executive Board next month (February), all existing areas served by a library will continue to have a library, while locker schemes will be introduced in the Westy, Fairfield and Howley areas, where there is currently no library provision, while Great Sankey and Bewsey and Dallam will gain library services via new community hubs. If the Executive Board approve the proposals which follow a public consultation by library operators LiveWire, Warrington will see an increase from 11-13 physical library sites, plus two with lockers. While some savings will be achieved it is not expected to be the full £300,000 being sought by the council.&#34;","2017/01/an-inspector-calls-in-lancashire-probable-u-turn-in-warrington-and-open-in-eire.html"],["Barnet","Tue, 17 Jan 2017 20:30:56 +0000","Barnet – Barnet Council announces relocation of East Barnet library to Victoria Recreation Ground – Borehamwood Times. &#34;East Barnet library will be shrunk and moved to a new home as Barnet Council continues its upheaval of library services across the borough. The policy and resources committee voted last week to spend £500,000 on turning the library into New Barnet library, which will be located at Victoria Recreation Ground. It will share the site with leisure and café facilities as a partnership library run by Inclusion Barnet from April 2017. East Barnet library is currently closed until February 25 as a series of design changes are made as the council moves to save money on library services.&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Bath and Northeast Somerset","Tue, 17 Jan 2017 20:30:56 +0000","Bath and Northeast Somerset – Hundreds of protesters demonstrate against council plan to move Bath Central Library – Bath Chronicle. 150 protesters. &#34;Library employees and volunteers were joined by parents, children and some councillors for the demonstration. Bath and North East Somerset Council has proposed moving the current facility above Waitrose into Lewis House on Manvers Street by next year, with the space to be rented out for other means. But protest organiser Dionne Pemberton told ITV News: &#34;First of all, it’s not just a question of moving. If it was moving like for like, just a few blocks away, that’s not a big deal.&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Enfield","Tue, 17 Jan 2017 20:30:56 +0000","Enfield – Volunteers urgently needed across Enfield libraries – North London Newspapers. &#34;There is a shortage of volunteers across the 13 libraries in the borough and Enfield council is asking more residents to devote just a few hours a week. They have launched a recruitment drive as part of their Enfield Heroes Campaign to attract more volunteers to the scheme.&#34; … &#34;Following the restructuring of library services the Council has designated Enfield Town, Edmonton Green, Palmers Green and Ordnance Unity as flagship libraries which will offer a range of services alongside community based activities. The other 13 in the borough have been designated as community libraries and will be sharing their premises with organisations to bring in extra revenue and share costs.&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Hackney","Tue, 17 Jan 2017 20:30:56 +0000","Hackney – Hackney councillor Jon Burke wants libraries to lend out power tools and kitchen appliances – Hackney Citizen. &#34;Councillor Jon Burke, the cabinet member in charge of library services, said the scheme would mean people would not have to buy their own devices, thereby cutting waste and the cost of living. He said he wanted to launch the service as soon as possible and suggested residents could donate their possessions, which would then be safety checked before being put into circulation for the common good. In the case of particularly popular types of item, the council could buy multiples to meet demand, he said. Cheerleaders for capitalism might argue such endeavours reduce consumer choice, however, and could potentially harm the economy and reduce VAT tax receipts.&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Hertfordshire","Tue, 17 Jan 2017 20:30:56 +0000","Hertfordshire – New £15m home for Dacorum Borough Council and library officially opens in Hemel Hempstead – Hemel Today. &#34;The Forum, a new hub which will also house voluntary services and a new library, is a key feature of the council’s Hemel Evolution scheme which is redeveloping the town centre… The temporary Hemel Hempstead Library, located in the old Civic Centre, closed for the final time on Sunday – while Dacorum Borough Council vacated the same building on Friday.  Both have now moved to the new hub, which is next door on the corner of Marlowes and Combe Street, with the council’s voluntary partners moving in at the end of January.&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Norfolk","Tue, 17 Jan 2017 20:30:56 +0000","Norfolk – Norfolk council tax set to rise 4.8% this year – BBC. &#34;The authority will still have to cut spending by £44m this year, mostly through administrative savings. It says there will be very few job losses and no cuts to services like libraries or fire stations.&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Kent","Tue, 17 Jan 2017 20:30:56 +0000","Kent – Kent County Council Libraries Registration and Archives – Internal commissioning: Delivering better outcomes for the people of Kent – Libraries Taskforce. &#34;fully integrated with the Kent Archives and Registration service meaning we offer seamless access to customers to a wide range of services.&#34; … &#34;A service specification has been developed that aligns the service against KCC’s three key strategic priorities (kids/young people, community, senior citizens). … LRA is looking at how it can devise a toolkit for outcome evaluation as this is an area that needs more development … Through the service specification, KCC articulated what was required to be delivered and, in response, LRA has produced a service plan that explains clearly how it will deliver against this. This is being monitored quarterly and will be subject to a review against how we have done at the end of the financial year.&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Plymouth","Tue, 17 Jan 2017 20:30:56 +0000","Plymouth – Council set to close ten of Plymouth’s libraries and move book borrowing online – Herald. &#34;Libraries in Efford, Eggbuckland, Ernesettle, Estover, Laira, North Prospect, Peverell, Stoke, Tothill and West Park could close their doors under the new proposals. Plymouth City Council says the move, open for public consultation from next week, is designed to &#34;transform and modernise&#34; library services by embracing the &#34;digital world&#34;. The surviving libraries – Crownhill, Devonport, Plympton, Plymstock, St Budeaux, Southway and the Central Library – currently account for 80 per cent of all visits and 75 per cent of all items borrowed. They will be refurbished and kitted out with new computers, meeting rooms and fully-trained staff. There will also be pop-up libraries across the city; a &#34;click-and-collect&#34; service in children’s centres and community hubs; and an expanded home library service for housebound residents.&#34; see also Plymouth Council releases plan to close 10 libraries – BookSeller and Plymou&#8230;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Plymouth","Tue, 17 Jan 2017 20:30:56 +0000","Plymouth – The Herald says: Libraries are vital hub of communities – Herald. &#34;The council is right that all its services should be kept up-to-date. But it has to be certain that a modernised and abridged library network will meet the needs of the entire community. While young people may be flocking to the city centre library to borrow e-books to read on their tablets, there is still a percentage of the population for whom the computer age is still a mystery or an unaffordable luxury. From the pensioner looking for a large print book to the job seeker who can’t afford a computer at home and the young single mum who relies on the library for both books and support groups, there are people who will be affected by the closure of local libraries. The council is to be applauded for its creation of an exciting new history centre and the new central library. But the loss of 10 smaller libraries, many in deprived areas, will not be easy to replace.&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Plymouth","Tue, 17 Jan 2017 20:30:56 +0000","Plymouth – Mums ‘gutted’ over plans to close ‘lifeline’ libraries in Plymouth – Herald. &#34;Jenny, aged 32, is a primary school teacher and says the library was a lifesaver during the tricky early months of parenthood. &#34;When I was on maternity leave we used to come twice a week,&#34; she says. &#34;I found being on leave difficult to be honest, because my job is quite intense, maternity leave was quite boring. &#34;We loved it here, we made lots of friends who we are still in touch with. &#34;It’s not just about the books. I would be genuinely gutted if this place closed.&#34; I tweet a picture of Jenny and Theo, and receive a reply from 23-year-old Izy Jude, mum of five-month-old Oliver. &#34;We go to rhyme time at Peverell library and it’s always packed out,&#34; Izy says. &#34;I’ve never walked in to see an empty library. I agree with the other lady about it being a lifeline while you’re on maternity leave.&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Plymouth","Tue, 17 Jan 2017 20:30:56 +0000","Plymouth – Plymouth writers slam ‘crazy’ library closure plan – Herald. &#34;Babs Horton, Plymouth novelist and author of the award-winning A Jarful of Angels, said: &#34;A room without books is like a body without a soul, said Cicero. Imagine a city without books – a percentage of the citizens unable to access them. &#34;This is not a transformation, this is a transgression. I grew up in a family who bought all the books they could afford, which didn’t amount to many. My local library was a lifeline to knowledge, recreation and enlightenment. &#34;The Barbarians are at the gate and we must oppose them.&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Plymouth","Tue, 17 Jan 2017 20:30:56 +0000","Plymouth – Public urged to protest ‘barbaric’ library closure plans – Herald. &#34;Cllr Jonny Morris (Lab, Southway) vowed to fight the plans, branding ruling councillors &#34;barbarous and philistine know-nothing slash-and-burners&#34;. &#34;This Blukip council has made some pretty appalling attacks on the people of Plymouth, but closing libraries is what barbarians do,&#34; he said. &#34;I call on a loud howl of ‘No’ from Plymouth people. Literacy is the foundation of a civilised society. &#34;There’s a good Einstein quote at the top of the Central Library stairs: ‘The only thing that you absolutely have to know, is the location of the library’.&#34;&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Redcar and Cleveland","Tue, 17 Jan 2017 20:30:56 +0000","Redcar and Cleveland – Row over plans to axe mobile library in east Cleveland – Darlington and Stockton Times. &#34;Redcar & Cleveland Borough Council is planning on changing some of its 13 libraries’ opening hours, modernising some branches with self-service machines, relocate two libraries, and stop the mobile service. The proposals would see none of the council’s 13 libraries close and more of them would have customer information and access to services in the future&#34; … &#34;Residents can get involved by completing the survey online on the council’s consultation webpage at www.redcar-cleveland.gov.uk/haveyoursay, before April 10. The website also details drop-in consultation events at the library branches. &#34; see also Have your say on the council’s plans for the library service – NE Connected.","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Swindon","Tue, 17 Jan 2017 20:30:56 +0000","Swindon – Controversial library plans to be tested – Swindon Advertiser. &#34;The council’s libraries strategy faces its first test tonight as parish councillors in Stratton decide whether to foot the bill to fund their library. Swindon Borough Council will withdraw funding from 10 out of 15 of the town’s libraries later this year in a bid to save £1.5m a year by 2020. Campaigners have argued that a total withdrawal of funding means permanent closure is likely for many of the sites, but the council has repeatedly argued that all libraries could stay open if local groups come forward to help.&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Torfaen","Tue, 17 Jan 2017 20:30:56 +0000","Torfaen – New chapter set to curtail library service cuts – Free Press Series. &#34;Cuts to the library service in Torfaen have been shelved, postponing plans to make a £250,000 saving for the 2017/2018 budget and potentially stopping planned redundancies. In line with the budget saving exercise agreed by the council, libraries in Blaenavon, Cwmbran and Pontypool were facing reduced hours of manned service. However, a portion of money from a funding pot of £616,000 set aside for use on policies chosen by members will be used to save the libraries. A final decision will be made at the end of February.&#34;","2017/01/plymouth-to-cut-10-libraries-reading-allowed-review-and-goodbye-obama.html"],["Birmingham","Thu, 19 Jan 2017 20:50:46 +0000","Birmingham – Sutton Coldfield campaigners call for Town Council funding to help save the library – Sutton Coldfield Local News. &#34;Members of the campaign group The Library Lobby are asking Sutton Coldfield Town Council to &#34;put its money where its mouth is&#34; and commit funds to ensure the survival of a town centre library.&#34; … &#34;In the December Town Council meeting it became clear that the Town Council has funds at its disposal: it has a surplus of £308,000 for the year 2016-17, and currently almost £200,000 unallocated out of its 2017/18 budget&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Brent","Thu, 19 Jan 2017 20:50:46 +0000","Brent – Major step forward by Brent’s Community Libraries – Friends of Barham Library. &#34;Barham and the 3 other Community Libraries in Brent (Cricklewood, Kensal Rise and Preston) are making progress. Following a successful Grant bid to Brent’s Voluntary Sector Fund the 4 Community Libraries are able to go ahead with obtaining the services of a Professional Librarian. The Advert for the Professional Librarian and supporting documents are shown below…&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Brighton and Hove","Thu, 19 Jan 2017 20:50:46 +0000","Brighton and Hove – Postman Pat creator slams new library fines – Argus. &#34;John Cunliffe, the creator of the popular television show character and previously a librarian in Brighton, says that the council’s new policy is &#34;evidence of the nanny state in action&#34;. It was agreed by Brighton and Hove City Council last week to raise income levels by fining children when they are late returning library books. Mr Cunliffe, 83, a semi-retired writer, from Yorkshire, said: &#34;This whole business of library fines is against what libraries are all about and these fines will just end up charging children who are trying to read more and educate themselves&#34;. Conservative opposition councillor agrees: &#34;&#34;It doesn’t seem a lot, ten pence a day and a maximum of £2.50, but for some parents it might frighten them off.&#34;&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Bristol","Thu, 19 Jan 2017 20:50:46 +0000","Bristol – The 123 cuts Bristol City Council plan to make to their budget (but there are still more to come) – Bristol Post. &#34;Instead of closing down libraries, they are suggesting they could be run by volunteers or share buildings with other council services.&#34; see also Bristol Council to axe 1,000 staff – Bristol Cable. &#34;The 2014-17 financial plan currently being executed was drawn up under Mayor Ferguson. It imagined the council making savings of £34m through measures such as: Savings in delivery (£9.1m), improving business efficiency (£8.3m), reducing Council running costs (£6.5m) or a review of the library service (£1.1m). In addition to that, extra pressure on social care has increased the amount the Council needs to save by an additional £8m. Nowhere do the plans mention shedding a sixth of the workforce and it is not clear whether the Council still expects to make all of the savings identified by the previous administration.&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Bristol","Thu, 19 Jan 2017 20:50:46 +0000","Bristol – Corporate Strategy consultation 2017-2022 – Bristol City Council. £1.4m cut (-£300k first year, -£740k second, -£360k third). &#34;This would focus our investment and efforts on a smaller but high quality library service in Bristol. This would include retaining the Central Library and a redesign of the service within the lower cash limit&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Bristol","Thu, 19 Jan 2017 20:50:46 +0000","Bristol – Unison response – Unison. &#34;Co –location of council services is an interesting proposal but requires careful planning and proper investment. We note that previous similar proposals for libraries were not taken forward, resulting in a serious impact on our members. We look forward to seeing more detailed proposals about this idea&#34; .. &#34;A recent &#34;temperature check&#34; made for dire reading and showed that staff are depressed, angry and frightened for the future. Some of our members covered by the disability provisions in the Equalities Act have had to take grievances to get their reasonable adjustments. The proposals in the strategy for libraries appear to be a resurrection of the &#34;Libraries for the Future&#34; scheme from 2015 , albeit with a potentially higher level of cuts. A politically driven fudge arising from these proposals severely impacted our members working lives and incomes, resulting in a dispute and industrial action. These issues have still not been resolved and we still consider that we are &#8230;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Cheshire West and Chester","Thu, 19 Jan 2017 20:50:46 +0000","Cheshire West and Chester – WayWord in your local library – Storyhouse. &#34;From Monday 20 – Friday 24 Feb, free arts and crafts will be on offer every morning from 10am – 12.30pm where you will find a friendly creative activity host to help you and your family make and create! WayWord crafty stuff happening at the following libraries…&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Bury","Thu, 19 Jan 2017 20:50:46 +0000","Bury – Bury could lose at least 10 of its 14 libraries in new cuts blow – Manchester Evening News. &#34;Council chiefs say the move will save around £1.4m a year. Selling off closed sites for development and leasing buildings could net nearly £400,000 a year of that headline figure.&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Bury","Thu, 19 Jan 2017 20:50:46 +0000","Bury – Bury to lose at least 10 of its 14 libraries – Bury Times. &#34;In the worst case scenario the proposals could potentially see 11 of the facilities shut down, as major changes are made to the borough’s library services. More than 4,000 people took part in the first public consultation and, now, the decision on the future of Bury libraries will be made by councillors next week. Bury’s cabinet will table proposals on Wednesday, hold another public consultation, and then make a final decision at a meeting April.&#34;.  Councillor says &#34;&#34;The current library service is not sustainable. Staff levels have reduced by 30 per cent since the last review, meaning that libraries cannot fulfil their opening hours and are sometimes closed at short notice. &#34;Also, some of the library buildings are not in great condition and will need major investment in future years, money which we simply don’t have.&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Darlington","Thu, 19 Jan 2017 20:50:46 +0000","Darlington – Campaigners refuse to quit Darlington’s Crown Street library fight – Northern Echo. &#34;Darlington Borough Council is planning to close the town’s Crown Street library and move the service to a nearby leisure centre. Activists took the opportunity to continue their fight when they quizzed members of the council’s cabinet committee, tonight. Yvonne Richardson challenged the authority to listen the people of the town and involve them in any decision making process.&#34; … &#34;Christine Fishwick, of the Friends of Crown Street Library, handed over 100 drawings made by children from the town’s schools supporting the fight to keep the building open as a library. &#34; … &#34;In a passionate defence of the council’s proposals for the Crown Street Library, Cllr Nick Wallis, the cabinet member for leisure and local environment, said people were failing to separate the issue of the library service from the future of the actual building itself. &#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Essex","Thu, 19 Jan 2017 20:50:46 +0000","Essex – Essex Libraries have issued an appeal for donations of any unwanted Lego – Essex TV. &#34;Children of all ages love Lego, but it also has a real educational quality helping the development of motor skills and creativity, and learn about problem solving skills. &#34;If we are successful in gaining enough Lego, then we will be looking to launch a series of Lego clubs across the county where children can come together to take part in activities and Lego based challenges. &#34;These clubs have worked really well in other parts of the country and it would be fantastic to see it happen in Essex.&#34;&#34; see also Plans to launch ‘library lego clubs’ for children – ITV News.","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Middlesbrough","Thu, 19 Jan 2017 20:50:46 +0000","Middlesbrough – Plan to turn ‘daunting’ Central Library into flagship destination for families – Gazette Live. &#34;Plans are being drawn up to turn Middlesbrough’s ‘daunting’ Central Library into a ‘flagship destination venue’ to attract more families.&#34; … &#34;LGA assessors also found the role of Central Library was &#34;undeveloped and still reflected a relatively traditional approach&#34;.&#34; … &#34;&#34;Some of these changes would be minor, such as changing the configuration of existing spaces, and could be accommodated within existing budgets, whilst others would require more fundamental investment.&#34; Funding bids are likely to be submitted over the next two years after the development of new plans for inside the building.&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["North East Lincolnshire","Thu, 19 Jan 2017 20:50:46 +0000","North East Lincolnshire – Cleethorpes library: ‘Cuts mean asking people what they want for library provision in resort’ – Grimsby Telegraph. Leader of council writes after speculation over future of Cleethorpes Library: &#34;following recent coverage over the issue of Cleethorpes library, can I take this opportunity of reassuring your readers that this council, and this administration, is fully committed to ensuring the town’s library provision is maintained.&#34;.  Says council is asking public what provision is needed.","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Oldham","Thu, 19 Jan 2017 20:50:46 +0000","Oldham – Discover a world of comedy, drama, new writing and storytelling at Oldham’s libraries – Saddleworth Independent. Many professional theatre shows and author visits. &#34;Councillor Barbara Brownridge, Cabinet Member for Neighbourhood and Co-operative, said: &#34;Live@thelibrary has become a huge part of our library offer and one we are truly proud of. &#34;We have something for all ages and we’re supporting established and emerging local talent.&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Plymouth","Thu, 19 Jan 2017 20:50:46 +0000","Plymouth – Plymouth schoolgirl’s plea to council: ‘Don’t close our library’ – Herald. &#34;Lucy Woodman, aged eight, was horrified to learn that Efford library is one of ten slated for closure under Plymouth City Council’s &#34;transformation and change&#34; scheme. She started a petition and enlisted the help of her friends at High View Primary School. Mum Nicky Williams said: &#34;I was reading The Herald at the kitchen table and Lucy was just really adamant that this should not happen. &#34;We’ve been going to the library since she was a baby, it’s somewhere she is used to going, it’s literally opposite her school.&#34;&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Plymouth","Thu, 19 Jan 2017 20:50:46 +0000","Plymouth – Stop the closure of libraries in Plymouth – Change.org. &#34;We call on the Council to keep our local branch libraries open. They are vital for children who want to learn to read, adults who can’t afford to buy books, people who use the computers and printers to find a job, do research, family history and to access online services. They host book groups and children’s events, are staffed by professionals who can help, and are valuable free, public spaces in a world that charges for everything.&#34; [375 signatures at time of checking – Ed.]","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Plymouth","Thu, 19 Jan 2017 20:50:46 +0000","Plymouth – Top authors back campaign to save Plymouth’s libraries – Herald. &#34;Former children’s laureate Michael Rosen and bestselling novelist Neil Gaiman have shown their support for the cause on Twitter.&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Southend","Thu, 19 Jan 2017 20:50:46 +0000","Southend – Library set to close for three months to get big makeover – Echo. &#34;Westcliff Library, in London Road, is set for a major refurbishment that will reinvent the layout of the main library. The work will create a new welcoming area for customers with a new front desk and there will also be a private meeting room available for hire&#34; … &#34;&#34;The meeting room will facilitate business gatherings or community groups in a safe local space and will provide a great way to meet up with friends or colleagues. Other work being carried out will include a new welcome desk, new flooring throughout, new signage, a complete rewiring, new lighting including emergency lighting. We apologise for any inconvenience to customers but hope the wait is worth it.&#34; &#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Thurrock","Thu, 19 Jan 2017 20:50:46 +0000","Thurrock – Work continues to save East Tilbury Library and Bata Collection – Your Thurrock. &#34;Thurrock Council has been able to remove some Bata items and stored them at 1 Big Storage, located across the road – who kindly donated some space after hearing what had happened. Cllr Macpherson explained: &#34;Not everything can be moved yet; access to the building remains difficult until remedial works can take place to ensure visitors to the building are safe. The structural engineer visited the library last week and after their report is shared, we can expect the works to start. &#34;There was also a further incident over this weekend (Saturday 14 January) and I encourage everybody to remain vigilant and report any suspicious activity to the police.&#34;&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Vale of Glamorgan","Thu, 19 Jan 2017 20:50:46 +0000","Vale of Glamorgan – ‘Let yourself into the library’ – Llantwit Major Today. &#34;By the end of 2016 there were a growing number of libraries across many authorities in the UK that had adopted the open library in some form. As with many other locations, at Barry Library there will be a staged approach so that customers can become familiar with the new technology so that demand can be assessed. The intention at Barry is initially to extend opening hours on weekday evenings, while providing access on Sundays is another possibility.&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Waltham Forest","Thu, 19 Jan 2017 20:50:46 +0000","Waltham Forest – Higham Hill Library granted asset of community value by Waltham Forest Council – East London and West Sussex Guardian. &#34;Higham Hill Library has been made an asset of community value by Waltham Forest Council, even though it could be moved under £3million worth of cuts. The shock decision comes as local protest groups are passionately advocating to keep it where it is. Campaigners are trying desperately to rouse communities to save library services by responding to a consultation, which ends on January 31″","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["West Dunbartonshire","Thu, 19 Jan 2017 20:50:46 +0000","West Dunbartonshire – Clydebank libraries to offer free IT courses for beginners – Clydebank Post. &#34;West Dunbartonshire Council Libraries team have released a new timetable for the free computer and tablet courses held throughout the town. The Quest courses start on January 23 and offer participants a range of computer-related training. A six-week iPads for the beginner course kicks off at Dalmuir library on Monday; on Tuesday Android tablet courses begin in Clydebank library and in both Parkhall and Duntocher library residents can start an eight-week computer course on Wednesday.&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Wigan","Thu, 19 Jan 2017 20:50:46 +0000","Wigan – Consultation event to discuss the future of Atherton Library services – Leigh Journal. &#34;Wigan Council is proposing to move the library from York Street to the former town hall building. Currently empty, the building on Bolton Road is set to become a community hub. The council has vowed to keep all 15 libraries in the borough open despite many having closed their doors all over the country&#34;","2017/01/bury-proposes-10-out-of-14-branches-cut-bristol-will-cut-deeply-too.html"],["Aberdeen","Sun, 22 Jan 2017 19:32:52 +0000","Aberdeen – Ruth – Information Librarian – 23 Librarians. &#34;I really enjoy my job. It is not without stress but it is worth it when you believe you can make a difference. If I were to offer two parting pieces of advice in these times of austerity they would be: Grasp every opportunity you get however big or small. Think creatively and be flexible. Don’t get boxed into a view of what a librarian/ library is or isn’t.&#34;","2017/01/libraries-where-facts-trump-lies.html"],["Brent","Sun, 22 Jan 2017 19:32:52 +0000","Brent – Professional librarian vacancy – Preston Library Campaign and Community Hub. &#34;Major Step Forward By Brent’s Community Libraries – Barham and the other Community Libraries in Brent (Cricklewood, Kensal Rise and Preston) are making progress. Following a successful Grant bid to Brent’s Voluntary Sector Fund, the 4 Community Libraries are able to go ahead with obtaining the services of a Professional Librarian&#34; [This vacancy advertised again at the request of Brent library campaigners -Ed.] see also Professional Community Librarian? Apply for our innovative post – Kensal Rise Library.","2017/01/libraries-where-facts-trump-lies.html"],["Lancashire","Sun, 22 Jan 2017 19:32:52 +0000","Lancashire – Letter to Library Minister Rob Wilson MP – Paul Maynard MP Facebook. &#34;This is my letter to Library Minister Rob Wilson MP asking for an update following his meeting with LCC. It is vital to keep the pressure up if we are to save these libraries. Andrea Kay and Alan Vincent have been leading the way locally, but Labour just aren’t listening.&#34;","2017/01/libraries-where-facts-trump-lies.html"],["Nottingham","Sun, 22 Jan 2017 19:32:52 +0000","Nottingham – Hearts for the Arts Shortlist: Nottingham City Council, Nottingham Performing Arts Library Service (NPALS) – National Campaign for the Arts. &#34;Nottingham and Leicester City Libraries were both providing well-used music and drama sets services, loaning material to local amateur groups who wouldn’t be able to afford the rates from commercial publishers. However, this was at a cost that neither local authority could continue to support. Nottingham City Council showed strong leadership by persisting in trying to find a solution, approaching Leicester to discuss the idea of combining the two services.&#34;","2017/01/libraries-where-facts-trump-lies.html"],["Plymouth","Sun, 22 Jan 2017 19:32:52 +0000","Plymouth – Schoolgirl, 8, leads campaign to save Plymouth libraries – ITV News. &#34;Lucy Woodman started a petition after Plymouth City Council announced that her library in Efford is one of ten that could close, as part of a move to &#34;transform and modernise&#34; services and embrace the &#34;digital world.&#34; She’s enlisted the help of her friends at High View Primary School, in an attempt to stop the council’s plans. &#34;I decided to put together a petition because I really like that library down the road and all the other libraries that might actually shut and because i don’t get why they’re shutting,&#34; Lucy Woodman said.&#34;","2017/01/libraries-where-facts-trump-lies.html"],["Plymouth","Sun, 22 Jan 2017 19:32:52 +0000","Plymouth – Tories ‘not divided’ over library closures says campaigning councillor – Herald. &#34;A Conservative councillor fighting to keep his local library open insists his party is not divided on the issue. Earlier this week Tory chiefs revealed plans to shut ten &#34;under-used&#34; city libraries, promising to invest in new technology, introduce a click-and-collect service and expand the home library service.&#34; … &#34;Cllr Carson said: &#34;In the year 2000, 1.3 million people were using the libraries; last year that was down to 700,000. &#34;That’s quite a drop. There is a real threat to what a traditional library was when they were first set up.&#34;","2017/01/libraries-where-facts-trump-lies.html"],["Suffolk","Sun, 22 Jan 2017 19:32:52 +0000","Suffolk – Consultation launched for Mildenhall Hub project which would include a new library – Suffolk Libraries. &#34;Mildenhall residents are being asked for their views on plans for a new ‘Mildenhall Hub’ which would involve a number of local services being delivered on one site, including the relocation of the library. The Mildenhall Hub would involve the creation of a new school, leisure facility and health centre in Sheldrick Way. As well as a new library, the Hub would also house council offices for Forest Heath District and Suffolk County councils, emergency services, a pre-school and adult learning space, as well as the Citizens’ Advice Bureau and the Department for Work and Pensions.&#34;","2017/01/libraries-where-facts-trump-lies.html"],["Sunderland","Sun, 22 Jan 2017 19:32:52 +0000","Sunderland – Council should keep its hands off our libraries – Sunderland Echo / Letters. &#34;The council has just transferred Fawcett Street library to the museum building and, in the process, decimated the amount of books we can borrow. It has also reduced the number of tables that we can sit at to three and the three walls of computers, which were always in use, have now been reduced to a mere one computer. Now the council is asking people how strongly they support providing a city centre library and town centre libraries in Washington and Houghton (Echo, January 11) as though they have decided to get rid of them. They gained millions of pounds from Newcastle airport. What happened to that? What about the reserve money? They could spend some of it on the libraries. Hands off libraries.&#34;","2017/01/libraries-where-facts-trump-lies.html"],["Warrington","Sun, 22 Jan 2017 19:32:52 +0000","Warrington – Council to spend £30m on acquiring stake in new bank – LocalGov. &#34;The borough council will invest in a new Challenger business bank that hopes to gain a banking licence from the Bank of England in the first quarter of 2017. This will be a joint venture bank – known as Redwood Bank – between the council and the owners of an established bank, an unnamed ‘major city financier’. If it is granted a banking licence, Redwood will be launched in August.&#34; [Included in contrast to deep cuts proposed for library service – Ed.]","2017/01/libraries-where-facts-trump-lies.html"],["Warwickshire","Sun, 22 Jan 2017 19:32:52 +0000","Warwickshire – Stratford library closes for essential works – Stratford Observer. &#34;The Henley Street library will close today (Saturday January 21) for essential piping and electrical work which is not set to be completed until June at the earliest. Plans to operate from a temporary base at Stratford ArtsHouse have been dropped and Warwickshire County Council is currently investigating alternative options to provide a limited range of services during the temporary closure.&#34;","2017/01/libraries-where-facts-trump-lies.html"],["Aberdeen","Tue, 24 Jan 2017 21:11:17 +0000","Aberdeen – Aberdeen City Council next to benefit from Aberdeen’s digital transformation – CityFibre. &#34;Aberdeen’s schools, libraries and other public buildings are set to receive a 21st century boost after Aberdeen City Council became the latest organisation to benefit from its connection to CityFibre’s transformational Gigabit City pure fibre networks.&#34; … &#34;Over 100 public buildings will be connected to the ultra-fast, pure fibre network, delivering cost savings and improvements to digital systems and services such as online administration, public Wi-Fi, and classroom e-learning.&#34;","2017/01/the-minister-for-libraries-speaks.html"],["Birmingham","Tue, 24 Jan 2017 21:11:17 +0000","Birmingham – £150,000 Sutton Coldfield Library rescue plan put forward – Birmingham Post. &#34;Sutton Coldfield councillors will be asked to stump up £150,000 to keep the town’s threatened library open. The library, based in the Red Rose Shopping Centre , is one of the city’s most expensive to run and has been earmarked for closure by Birmingham City Council as a cost-cutting measure. More than 6,500 names have been put to petitions calling for a library to be retained – even if it has to relocate to a smaller, more moderately priced building. The Royal Sutton Coldfield Town Council was formed last March and this is its first major challenge. It is to debate a motion calling for it to use its own money to keep the service afloat on January 24.&#34;","2017/01/the-minister-for-libraries-speaks.html"],["Birmingham","Tue, 24 Jan 2017 21:11:17 +0000","Birmingham – Library of Birmingham & British Library win lottery grant for South Asian project – Birmingham Newsroom. &#34;Today (23 January 2017), the Library of Birmingham and the British Library have received £91,700 of National Lottery funding to present Documenting Histories, a partnership project celebrating the important role South Asian culture has played in forming Birmingham’s history and identity. At the heart of the project is a major exhibition which will open in July, drawing on both libraries’ rich collections, supported by a programme of complementary events and workshops during 2017.&#34; see also South Asian heritage to be celebrated in Birmingham – Sat Press Releases.","2017/01/the-minister-for-libraries-speaks.html"],["Bolton","Tue, 24 Jan 2017 21:11:17 +0000","Bolton – Reader Development Focus: Bolton Library and Museum Service &#34;Making it REAL Literacy Project&#34; – Society of Chief Librarians. &#34;Library staff visited children at nursery / school to read a story and collect completed library membership forms. Then the library and museum hosted families for bespoke story and rhyme workshops, on a theme of the nursery’s choice. The workshops also gave families the time and space to explore the library and books. Children and families were given their new library cards and began using the library straight away. Children were given a Bear’s Reading Adventure sticker book to encourage continued use of and excitement about the library….&#34;","2017/01/the-minister-for-libraries-speaks.html"],["Bradford","Tue, 24 Jan 2017 21:11:17 +0000","Bradford – Are you willing to help run Silsden Library? – Craven Herald and Pioneer. &#34;A meeting to set up an ‘accountable body’ will be held at Silsden Town Hall – which houses the library – on February 6 at 7.30pm. Anyone is welcome to go along if they are interested in becoming trustees on the new organisation. A separate meeting was held recently to recruit volunteers to staff the library. Bradford Council recently last year that it would close several libraries across the district, including the one in Silsden, unless members of the community came forward to take over responsibility.&#34;","2017/01/the-minister-for-libraries-speaks.html"],["Darlington","Tue, 24 Jan 2017 21:11:17 +0000","Darlington – Crucial vote delayed again as Tory councillors force deferral in the battle to save Darlington’s Crown Street Library – Northern Echo. &#34;Darlington people must be listened to, is the message from Tory councillors who have forced the deferring of a crucial vote on the future of Darlington’s library services. Contentious plans to cut and change library services across the town were expected to be approved at a council meeting this Thursday. The proposals would see the town’s mobile library service axed, Cockerton Library given over to volunteers and the historic Crown Street library closed, with the majority of its resources to be transferred to the Dolphin Centre&#34;","2017/01/the-minister-for-libraries-speaks.html"],["Darlington","Tue, 24 Jan 2017 21:11:17 +0000","Darlington – Darlington Library: keep it at Crown Street – Facebook. Campaign group.","2017/01/the-minister-for-libraries-speaks.html"],["Glasgow","Tue, 24 Jan 2017 21:11:17 +0000","Glasgow – DWP claims don’t add up – Evening Times. &#34;Seven out of ten benefits claimants in the most deprived communities on Glasgow can’t use the internet to apply for benefits a survey has found. A shift towards on-line and digital services is one of the key justifications for the DWP plan to shut half of Glasgow’s Jobcentres. The Government says more people are choosing to access job seeking opportunities though the internet leading to a fall in the numbers using Jobcentres for services other than to sign on, reducing the need for on-site services&#34;","2017/01/the-minister-for-libraries-speaks.html"],["Isle of Man","Tue, 24 Jan 2017 21:11:17 +0000","Isle of Man – Mobile Family Library gets Microgaming boost – Microgaming. &#34;Microgaming, through its PlayItForward community initiative, is supporting the Family Library’s mobile unit for the next three years.  Operating from their base on Westmoreland Road in Douglas, the Mobile unit of the Family Library travels all around the island, bringing a wide selection of books, audio CDs and other interactive material to people who are otherwise unable to get to a library. The vehicle is kitted out with over 2,600 books, covering a range of genres, and it also serves as an opportunity for people to meet, form friendships, and to exchange information.&#34;","2017/01/the-minister-for-libraries-speaks.html"],["Lancashire","Tue, 24 Jan 2017 21:11:17 +0000","Lancashire – County Council Supports Transfer of Two Buildings to Penwortham Town Council – Lancashire Council. &#34;Lancashire County Council has agreed to transfer the ownership of two buildings to Penwortham Town Council to enable it to establish a new independent community-run library, alongside other community uses, and a new community theatre, subject to final agreement over the terms of the transfer&#34; … &#34;The county council will also provide support to enable the town council to establish an independent community-run library in the Young People’s Centre building.  The council’s support package to establish this independent community-run library, which is in addition to the statutory service provided by the county council, includes £5,000 to provide public internet access and cover set-up costs, as well as shelving, an initial supply of books from the county’s store, and advice from a dedicated community library manager. When the independent community library becomes operational, the council will also continue to provide s&#8230;","2017/01/the-minister-for-libraries-speaks.html"],["Milton Keynes","Tue, 24 Jan 2017 21:11:17 +0000","Milton Keynes – Milton Keynes Budget 2017/18 – Milton Keynes Council. Stock development officer post to be lost – replaced by supplier selection. Increase in partners using libraries and paying for space. &#34;Open library&#34; technology to be introduced into three libraries (Kingston, Bletchley and Westcroft. £20k cut to bookfund. Interlibrary loans no longer offered with British Library given as an alternative (claimed that only 20 people use this service). £10k cut to school library service (detailed as a &#34;£-10k increase in income&#34;, other small changes including increased charge to schools and less new furniture.","2017/01/the-minister-for-libraries-speaks.html"],["Moray","Tue, 24 Jan 2017 21:11:17 +0000","Moray – Moray libraries launch online comic collection to entice young readers – Press and Journal. &#34;More than 16,000 graphic novels, ranging from exciting superhero tales to stories about ponies, are now available for the region’s youngsters to download for free. The new ComicsPlus service offers library members unlimited access to classic titles as well as new releases – which can be viewed on smart phones, computers and tablet devices. Elgin Library’s RonaStephen, said staff had noticed a growing interest in comics over the past few years and view them as an ideal way to entice children to read more.&#34;","2017/01/the-minister-for-libraries-speaks.html"],["North Yorkshire","Tue, 24 Jan 2017 21:11:17 +0000","North Yorkshire – Hambleton council to look again at policy that would tax community libraries – Press. &#34;A council which has repeatedly refused to abandon plans to levy business rates on volunteer-run libraries is due to review its policy on the tax. Hambleton District Council has been warned by volunteers and councillors that failure to waive the 20 per cent business rates charge on charitable organisations could jeopardise some of the community ventures.&#34;","2017/01/the-minister-for-libraries-speaks.html"],["Plymouth","Tue, 24 Jan 2017 21:11:17 +0000","Plymouth – Plymouth library closures must be scrutinised, say opponents – Herald. &#34;Any decision about the future of Plymouth’s library network should be subject to scrutiny by a select committee and a vote in the council chamber, opponents say. On Wednesday a public consultation opens on plans to shut 10 &#34;under-used&#34; libraries and introduce a click-and-collect service.&#34;","2017/01/the-minister-for-libraries-speaks.html"],["Birmingham","Thu, 26 Jan 2017 21:30:56 +0000","Birmingham – Town council sets aside £150k to save Sutton Coldfield Library but bars outsiders from negotiations – Sutton Coldfield Observer. &#34;Agreement has been reached to set aside a fighting fund from town council’s budget to save Sutton Coldfield’s library but there was anger as members voted to prevent rival parties and a campaign group from joining the negotiations. At a packed meeting of Royal Sutton Coldfield Town Council on Tuesday (January 24) night members of the public passionately pleaded with councillors to give financial support to save Sutton’s library based at the Red Rose Centre which faces being axed at the end of March. In a light-hearted moment Zoe Toft, from The Library Lobby, stood up during public questions and showed books she had picked from the town centre library for councillors demonstrating the depth of what was on offer and the relevance of libraries to people’s lives today. She said: &#34;I went to the library and I have got a personal pick for each and every councillor. For Cllr [Keith] Ward I have&#8230;","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Bury","Thu, 26 Jan 2017 21:30:56 +0000","Bury – Final chapter for 11 of Bury’s 14 libraries – Bury Times. &#34;Whitefield Library is set to close under council plans to save cash. Prestwich Library will be saved as Bury Council prepares to lose at least 10 of its 14 libraries. In the worst-case scenario the proposals could potentially see 11 of the facilities shut down, as major changes are made to the borough’s library services. Residents have expressed their outrage over the plans to shut Whitefield Library and Adult Learning Centre, which many claim is a &#34;lifeline&#34; for some of the town’s most vulnerable people.&#34;","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Devon","Thu, 26 Jan 2017 21:30:56 +0000","Devon – Bampton Library ready to relocate into new premises this Spring – Exeter Express and Echo. &#34;The library, currently located in an 18th Century building in Newton Square and run by Libraries Unlimited, will move into the new Library and Resource Centre (LARC), within the newly refurbished Old Schoolroom building which opened in September 2016. The move comes following the signing of a legal agreement between Libraries Unlimited and the Library and Resource Centre Supporters (LARCS), a community initiative and registered charity established to raise funds for the refurbishment of the Old Schoolroom.&#34;","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Glasgow","Thu, 26 Jan 2017 21:30:56 +0000","Glasgow – Glasgow library where Alasdair Gray read as a boy becomes his new gallery – Herald. &#34;It is the &#34;splendid&#34; home of books and learning where one of Scotland’s greatest living writers and artists first ignited his capacious imagination. Now Riddrie Library, where Alasdair Gray voraciously read and worked as a boy, is to be a gallery for his art. The solid, compact 1930s structure in the heart of the Riddrie housing scheme in the east of Glasgow, was where the young Gray spent many hours reading, and writing and drawing, stories of &#34;fantastic lands&#34;.","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Greenwich","Thu, 26 Jan 2017 21:30:56 +0000","Greenwich – Conservatives press case for ‘Library Lock’ policy – Greenwich Conservatives. &#34;Conservative councillors are calling on Greenwich Council to adopt their ‘Library Lock’ proposal to protect smaller libraries in the borough, amid renewed concerns over Labour councillors’ centralisation of library services in Town Centres. In a motion set to be debated at the Town Hall on Wednesday (25th January), Conservative councillors have called on the Labour-run council to &#34;explicitly commit to maintaining all of the borough’s smaller libraries&#34; in New Eltham, Coldharbour, Charlton, Blackheath, Plumstead, Slade Centre, Thamesmere and West Greenwich – and to ensure that local schools are encouraged to make use of these for library trips, and not just the three Centres. Figures show that together these eight smaller libraries serve more than half a million visitors and issue more than 250,000 items every year. Despite this, council policy continues to focus on the larger ‘co-located’ libraries in the Woolwich, Greenwich and Elth&#8230;","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Lancashire","Thu, 26 Jan 2017 21:30:56 +0000","Lancashire – Penwortham library and childrens centre are saved – Blog Preston. &#34;Penwortham Library and the town’s Young People’s Centre were both earmarked for closure due to Lancashire County Council cutbacks. The Town Council has stepped in to take on running both the buildings, with a 40p per month increase in council tax for Penwortham residents to keep the doors open. The county council has agreed to sign over the two buildings and also give the Town Council a £5,000 cheque to kick start the use of the buildings. Penwortham town centre manager Steve Caswell said the town council’s proposal represented good value for money.&#34;.  Library will be made into a theatre, with youth centre having a small volunteer library within it. see also Penwortham Town Council’s Library Theatre dream set to come true but Lostock Hall library will be sold off – Lancashire Evening Post.","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Leeds","Thu, 26 Jan 2017 21:30:56 +0000","Leeds – Chief Librarian – Leeds City Council. Vacancy. &#34;As Chief Librarian, you will play a crucial role in the strategic development of our library and information offer, ensuring that it continues to be a service of excellence.  Reporting to the Head of Customer Contact for Face to Face service you will have operational responsibility for the integration of the service into the broader customer access team and for the delivery of the day to day function across the city. In addition you will need to ensure that you bring up-to-date and practical involvement in the development of current professional thinking on the provision of public library services&#34;","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["North Yorkshire","Thu, 26 Jan 2017 21:30:56 +0000","North Yorkshire – Crime writer Anne Cleeves pens mystery for libraries – Keighley News. &#34;Skipton Library will host a murder mystery at 7.30pm on Wednesday, February 8, to celebrate Ann Cleeves’s 30th book in 30 years. The script, Bannocks and Blood, is based on Cold Earth, the new Shetland novel by the award-winning crime writer. As part of her 30th book celebrations, Cleeves hopes the murder mystery parties will help libraries, bookshops and community groups to hold events that engage new readers. She said: &#34;I am so lucky to have been supported by so many passionate librarians and booksellers in my 30 years as an author.&#34;","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Plymouth","Thu, 26 Jan 2017 21:30:56 +0000","Plymouth – Library closures: Everything you need to know as consultation begins today – Plymouth Herald. &#34;A public consultation begins today into the planned closure of ten of the city’s 17 libraries. Some services would be transferred online, with library staff moving out of &#34;under-used and expensive&#34; community buildings, as part of the plans. There will also be pop-up libraries across the city; a &#34;click-and-collect&#34; service in children’s centres and community hubs; and an expanded home library service for housebound residents. Libraries in Efford, Eggbuckland, Ernesettle, Estover, Laira, North Prospect, Peverell, Stoke, Tothill and West Park could close their doors under the new proposals.&#34;","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Plymouth","Thu, 26 Jan 2017 21:30:56 +0000","Plymouth – More than 130,000 people visited ‘under-used’ Plymouth libraries last year – Herald. &#34;More than 130,000 people visited the ten Plymouth libraries under threat of closure last year – but they cost £426,000 to run. This morning, as a public consultation went live, Plymouth City Council released full usage and cost figures for Efford, Ernesettle, Eggbuckland, Estover, Laira, North Prospect, Peverell, Stoke, Tothill and West Park libraries. North Prospect was the busiest in 2015/16, with 25,041 visitors through the doors, and also had the lowest cost per visit at £1.96. The least-used library was Eggbuckland, with 510 visits costing £28.06 each.&#34;","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Shropshire","Thu, 26 Jan 2017 21:30:56 +0000","Shropshire – How to Keep it Local: Five step guide for councillors and commissioners – Locality. &#34;Confronted with a £61 million budget shortfall over the next three years, Shropshire Council was faced with some tough decisions – cut back or close down their library services, or find a way to do things differently. Adopting an &#34;invest-to-save&#34; approach, the council has taken the bold step to hand the running of its libraries to community groups, a move it says will ensure the longevity of its library services, as well as tackle social isolation and relieve pressure on health and social care services.&#34;. Also includes a volunteer library in Halifax.","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Suffolk","Thu, 26 Jan 2017 21:30:56 +0000","Suffolk – Halesworth Library support group looks to bolster numbers following cuts proposal news – EADT. &#34;The Friends of Halesworth County Library (FOHCL) formed at the end of 2012, when day-to-day running of 44 libraries was handed to independent provident society, Suffolk Libraries. With the authority remaining the main source of funding, budgets have since been cut by almost a third – and Suffolk Libraries could face a further £230,000 reduction in 2017/18. FOHCL trustee and treasurer, Mike Stephens said: &#34;When the group started – as Suffolk County Council (SCC) was contracting out services to Suffolk Libraries – it generated a lot of interest, amid concerns that libraries may close.&#34;","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Sunderland","Thu, 26 Jan 2017 21:30:56 +0000","Sunderland – Anger over City libraries – Sunderland Echo. &#34;No one on the city council seems to care whether we have libraries or not. It beggars’ belief that this same council, whilst closing down our libraries, is proudly announcing that it is putting Sunderland forward as a City of Culture. How can anyone equate the dismantling of any city’s or town library system, and pretend to care about the people who use that library system, or that they care about the culture of Sunderland.&#34;","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Surrey","Thu, 26 Jan 2017 21:30:56 +0000","Surrey – Boxhead crafts – Club Minecraft. &#34;This fiendishly simple idea encourages kids to happily abandon the console to craft and enjoy imaginative play, together or with the family. While boxheads, costume pieces that mimicked the iconic block characters from Minecraft, had been available before, Ruth’s great idea was to provide cardboard templates that kids could design themselves. They can use pens, paints, paper and stickers to decorate their BoxHead Craft boxhead any way they choose.  Every BoxHead Craft box head comes with six handy templates to enable kids to plan and design a scaled down version before they decorate the full-sized head&#34;","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Worcestershire","Thu, 26 Jan 2017 21:30:56 +0000","Worcestershire – Carers invited to drop into library roadshows across the county – Tewkesbury AdMag. &#34;The association is aiming to reach as many carers in Worcestershire as possible this year through its Worcestershire Integrated Carers Hub and it is holding a series of roadshows at Libraries across the county – starting with Malvern Library today (Wednesday January 25) from 9.30am to 12 noon&#34;","2017/01/campaigning-for-libraries-before-theyre-under-threat.html"],["Barnet","Sun, 29 Jan 2017 15:21:19 +0000","Barnet – Job Opportunity: Library Manager based in Barnet – Inclusion Barnet. &#34;We are a voluntary organisation in Barnet, North London and we are about to take over the running of two branch libraries as community-based ‘partnership libraries’, working with the London Borough of Barnet.&#34; … &#34;we can offer an attractive salary, a positive and inclusive working environment and a warm and supportive team around you, including a CEO with a background in library management&#34;","2017/01/an-at-a-glance-heatmap-of-uk-public-libraries.html"],["Bradford","Sun, 29 Jan 2017 15:21:19 +0000","Bradford – Volunteers urgently needed to help run Thornbury library – Telegraph and Argus. &#34;Unless more volunteers respond to an appeal soon to help keep Thornbury Library open, it will close on April 1. Bradford Council announced in February last year that the branch based in the Thornbury Centre in Leeds Old Road would be one of fourteen libraries across the district to shut unless local communities could find enough helpers to staff them. But the take-up at Thornbury Library has been &#34;a bit slow so far&#34; according to parish priest and chairman of the Thornbury Centre, Father Nicholas Clews.&#34;","2017/01/an-at-a-glance-heatmap-of-uk-public-libraries.html"],["Darlington","Sun, 29 Jan 2017 15:21:19 +0000","Darlington – Crucial vote delayed again as Tory councillors force deferral in the battle to save Darlington’s Crown Street Library – Northern Echo. &#34;The proposals would see the town’s mobile library service axed, Cockerton Library given over to volunteers and the historic Crown Street library closed, with the majority of its resources to be transferred to the Dolphin Centre&#34; … &#34;In an unexpected move, opposition councillors have provided the much-loved library with a last minute stay of execution by demanding further scrutiny of Darlington Borough Council’s long-opposed proposals. Responding to concerns repeatedly raised by campaigners, Conservative councillors have ‘called in’ the agenda item concerning library services ahead of Thursday’s final vote on the issue.&#34; see Library Call-In – Darlington Council and Forward Plan – Darlington Council.","2017/01/an-at-a-glance-heatmap-of-uk-public-libraries.html"],["Hounslow","Sun, 29 Jan 2017 15:21:19 +0000","Hounslow – Library to re-open partially after two month closure following ceiling collapse – Get West London. &#34;Part of Brentford library will reopen this weekend more than two months after the ceiling collapsed. The Grade II listed building on Boston Manor Road has been closed since November 10, last year, after the plaster from one of the ceilings in the children’s section fell overnight.&#34; … &#34;However the children’s section will remain closed until works are completed with the aim of fully re-opening on March 11″","2017/01/an-at-a-glance-heatmap-of-uk-public-libraries.html"],["Leeds","Sun, 29 Jan 2017 15:21:19 +0000","Leeds – Chief Librarian – Leeds Council. &#34;Leeds City Council is delivering an ambitious programme of more locally determined and integrated services which help ensure that all who live, visit and work in the city have access to quality public services. As part of this development, an exciting opportunity has arisen to lead and develop the Library and Information service across the city, an integral part of our proposition to deliver more integrated and accessible services.  &#34;","2017/01/an-at-a-glance-heatmap-of-uk-public-libraries.html"],["Leeds","Sun, 29 Jan 2017 15:21:19 +0000","Leeds – Mannequin Challenge – YouTube. [I’ve seen a few of these now and this is pretty good – Ed.]","2017/01/an-at-a-glance-heatmap-of-uk-public-libraries.html"],["Plymouth","Sun, 29 Jan 2017 15:21:19 +0000","Plymouth – Anthologia: Library Closure Special  – Tall Tales. &#34;In response to the local library cuts suggested in Plymouth this week, several local writers have banded together to form ‘The Library Party’. This group has the aim of raising awareness of the proposed cuts and helping the public voice their concern and objections to the closures. This special Anthologia has poetry and micro-fiction from local Plymouth writers. Each piece focuses on the issue, libraries or the essential service provided by this ancient institution. There are also images explaining what is proposed and links to the petition within this page. &#34;","2017/01/an-at-a-glance-heatmap-of-uk-public-libraries.html"],["Plymouth","Sun, 29 Jan 2017 15:21:19 +0000","Plymouth – Council told libraries are ‘community hubs’ at first public meeting over closures – Herald. &#34;Jennifer Pointer, a mother of two, who attended the meeting with her family, felt that the closure of the school’s library would be wrong as for her libraries are &#34;a life-line&#34;. &#34;I had quite bad post natal depression,&#34; said Mrs Pointer, &#34;The library was a good way to meet other mums and talk about it – they are a bit of a life-line.&#34;. Many responses ask for investment in libraries to improve them rather than closing them.","2017/01/an-at-a-glance-heatmap-of-uk-public-libraries.html"],["Swindon","Sun, 29 Jan 2017 15:21:19 +0000","Swindon – Libraries minister comes to Swindon as community deadline looms – Swindon Advertiser. &#34;Last month Coun Mary Martin met with MP Rob Wilson, whose ministerial portfolio includes libraries, and on Thursday he came to Swindon to take a closer look at the plans&#34; … &#34;As part of the visit, he was shown the central library as well as Covingham library, which is well-advanced in its set up as a community run facility.&#34; Covingham is one of the few community libraries where a clear path to a secure future has emerged. A trust model, devised by ward councillors and recently registered with the charities commission, has received the backing of local library supporters and the borough council&#34; … &#34;&#34;It was a productive meeting to give the minister an update on the work that is going on towards protecting our vital libraries and to discuss further options for where the government can provide assistance. &#34;I’m greatly encouraged, we seem to be making good progress.&#34;","2017/01/an-at-a-glance-heatmap-of-uk-public-libraries.html"]]