[["Leicestershire","Wed, 02 Dec 2015 23:08:37 +0000","Leicestershire – Spring handover booked in for Market Bosworth Library plan – Hinckley Times. &#34;Villagers are likely to take over the running of their local library in spring next year as plans progress for Leicestershire County Council to offload rural branches. Members of the steering group for Market Bosworth Community Library organised an open evening to update residents on the transfer scheme.&#34; … &#34;The group spent months working on a business plan which will provide the framework for the continuation of library services and an income stream. Market Bosworth was one of a handful of communities in the borough who expressed willingness to take over the running of their local library as the county seeks to hand over responsibility as part of cost-cutting measures.&#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Lincolnshire","Wed, 02 Dec 2015 23:08:37 +0000","Lincolnshire – Lincolnshire libraries contract won by bidder previously ‘ignored’ by council – Lincolnshire Echo. &#34;Lincolnshire’s library service is being outsourced to the same organisation the county council was accused of snubbing a year ago. Senior councillors claim the decision to let Greenich Leisure Ltd run the service from April 2016 will bring &#34;significant savings&#34;.&#34; … &#34;The council says GLL will now take on the new model library service agreed in February, not the older model they originally expressed an interest in running. It means that GLL will run the county’s 15 major libraries, online services and specialist support for readers and help support services delivered at around 30 community hubs run by volunteers.&#34; … &#34;we predict that, once the reduction in our property costs is taken into account, this move will save us a further £500,000 or so.&#34; see also Council says Lincolnshire libraries take-over is a ‘win-win situation’ – Grantham Journal and Let’s start rebuilding the library service in &#8230;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Derby","Wed, 02 Dec 2015 23:08:37 +0000","Derby – More than half of Derby library opening hours could be unstaffed – Derby Telegraph. &#34;libraries could be unstaffed for up to 60% of their opening hours, with people getting in using their cards. The move is one of four options for the city’s libraries service which are under consideration by the city council as it looks to make £50 million by 2019. Another of the options is the closure of some of the council’s 15 libraries and having longer opening hours at those remaining.&#34; … &#34;The other ideas are to hand over some libraries to be run by community groups or to share library buildings with other organisations, such as the police or Derby Homes, in a bid to reduce costs.&#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Fife","Wed, 02 Dec 2015 23:08:37 +0000","Fife – Closure of Fife libraries will ‘hurt the vulnerable’. – Courier. &#34;Fife library closures would impact the most disadvantaged communities. That was among the conclusions of Fife Council’s education, health and social care scrutiny committee when it discussed proposals to shut 16 of the region’s libraries. Councillors also raised concerns about the cuts faced by Fife Cultural Trust (FCT) just three years after it took over management of the service. The trust has already made more than £900,000 of savings. It must now identify a further £813,000 between now and March 2018.&#34; … &#34;The option of cutting the trust’s £700,000 book budget was dismissed.&#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Lewisham","Wed, 02 Dec 2015 23:08:37 +0000","Lewisham – Proposed cuts to Lewisham libraries slammed as ‘short-sighted’ – East London Lines. &#34;A proposal to cut £1M from Lewisham’s libraries budget and for community organisations to take over running three local libraries has sparked fierce opposition from local residents.&#34; … &#34;Lewisham’s library service has already seen substantial cuts in recent years with five libraries – Blackheath, Crofton Park, Grove Park, New Cross and Sydenham – already being run by community organisations.  According to figures from Forest Hill Society, a locally run society which promotes high standards of planning and services and Lewisham Unison, the local branch of the public service union, borrowing in these five libraries decreased between 60 and 90 per cent from October 2010 to October 2014. Lewisham Council has acknowledged that the issue of declining book borrowing is a bigger problem in the community libraries than in the council-managed libraries, but said in a statement that: &#34;The [community] model is sound and is sustaining a l&#8230;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Walsall","Wed, 02 Dec 2015 23:08:37 +0000","Walsall – Walsall Council cuts: Volunteers invited to form DIY libraries – Express and Star. &#34;Walsall Council is looking to axe the libraries and the mobile library service, along with 13 jobs, in a bid to save £487,912 during the next two year. Bosses say the axed libraries could be replaced with ‘book exchanges’ which would be run by volunteers. Community groups and organisations are being asked to come forward to run the services to replace the libraries that are set to close down, including those in Beechdale, Blakenall, New Invention, Pleck, Rushall and South Walsall.&#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Lancashire","Wed, 02 Dec 2015 23:08:37 +0000","Lancashire – Sister weeklies unite to save libraries threatened with axe – Hold the Front Page. &#34;A petition to save up to 10 libraries threatened with closure by government cuts has been launched by two sister weeklies. The Accrington Observer and Rossendale Free Press are calling on readers to help save the libraries on its patch, after Lancashire County Council announced it may have to close up to half of the libraries under its control.&#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Warrington","Wed, 02 Dec 2015 23:08:37 +0000","Warrington – Your chance to shape future of libraries across Warrington – This is Cheshire. &#34;The organisation’s 33,000 library users, people who haven’t used a library for more than a year and those who’ve never used one of Warrington’s libraries before are being encouraged to give their views on how to bring the town’s 11 libraries into the 21st century. &#34; [NB. this is a highly positive press release. Freedom of Information request sent – Ed.]","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Lancashire","Wed, 02 Dec 2015 23:08:37 +0000","Lancashire – To Cut Lancashire’s Libraries will Crush Communities – Speaking the Mind. &#34;Libraries are saviors in themselves, not a vehicle for ‘savings’. Yet It appears that local authorities in are turning to libraries as one the first places to cut costs. This is almost ironic considering libraries are the places so many other people in society turn to, but for good reason– not just for borrowing books, but as a safe public space, a place of solace, an opportunity to interact, to be inquisitive and to learn. Councils and the government often refer to the importance of ‘community cohesion’ especially at times of difficulty, but to  close libraries is actually to destroy a dear community in itself.&#34; Looks at different aspects and strengths of public libraries.","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Reading","Wed, 02 Dec 2015 23:08:37 +0000","Reading – Mum urges council to leave Southcote Library alone – Get Reading. &#34;Emma Reeves, presenting a 250 signature petition to add to 600 signatures already collected, said her petition was from people who did not want to see Southcote Library in Southcote Lane either closed or rehoused.&#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Swindon","Wed, 02 Dec 2015 23:08:37 +0000","Swindon – Swindon Borough Council publishes draft 2016-17 budget – Swindon Council. &#34;Some services and facilities traditionally provided by the council, such as street cleaning and libraries, would have significantly reduced funding from the council and support will be given instead to parish councils and communities to run them themselves. A Library Service Strategy would be developed which assumes a reduction in council spend on the service of at least £1.5m, or 75%, by 2020.&#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Barnet","Wed, 02 Dec 2015 23:08:37 +0000","Barnet – Thousands raised by campaigners to challenge library cuts – Times Series. &#34;Campaigners have launched a crowdfunding appeal to raise cash to challenge library cuts in Barnet. More than £2,000 has so far been raised by the Save Barnet Libraries group in just one day.&#34; … &#34;On the appeal site, launched today (November 30), the campaigners said it aimed to challenge the proposals by judicial review. They said: &#34;We seek to challenge the unfair way the council has proposed wholesale removal of staff from Barnet libraries, a step which, if taken, will unlawfully discriminate against the young, disabled, and other legally protected groups who will no longer have proper access to their local libraries.&#34;&#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Barnet","Wed, 02 Dec 2015 23:08:37 +0000","Barnet – Saving Barnet Libraries – Crowd Justice. &#34;We seek to challenge the unfair way the Council has proposed wholesale removal of staff from Barnet libraries, a step which, if taken, will unlawfully discriminate against the young, disabled, and other legally protected groups who will no longer have proper access to their local libraries.&#34; … &#34;We need £2400 to pay for a solicitor (John Halford, partner at Bindmans LLP) with great expertise in this field to gather and analyse the evidence, advise us and to write a letter before action, as a first step towards judicial review. We are raising £1200 as a first step to our full £2400 stretch target, so anything you can give will be very gratefully received&#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Bradford","Wed, 02 Dec 2015 23:08:37 +0000","Bradford – Libraries will close across Bradford unless volunteers step up to run them, councillor warns – Telegraph and Argus. &#34;Under the proposal, all but the seven most heavily-used libraries would become community-managed over a period of three years. &#34; … &#34;&#34;Where those communities are unable to take on those libraries in a community management model, they will close.&#34; &#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Cornwall","Wed, 02 Dec 2015 23:08:37 +0000","Cornwall – Have your say on the future of St Austell services  – Cornish Guardian. &#34;The county authority needs to save £196 million from its budget over the next four years as a result of a cut in funding from central government, and as a result is asking town and parish councils to take on non-statutory responsibilities such as public toilets, libraries, open spaces and car parks","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Lancashire","Wed, 02 Dec 2015 23:08:37 +0000","Lancashire – Castle Museum safe but libraries could be under threat in budget cuts – Clitheroe Advertiser. &#34;A further £7 million will be saved by reducing the county’s libraries from 74 to 34. No further announcment has been made regarding which may close but a consultation process is expected to begin with library users in the New Year as some in the Ribble Valley may be affected.&#34;-","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Croydon","Wed, 02 Dec 2015 23:08:37 +0000","Croydon – ‘Possibility’ all Croydon libraries could close ‘apart from statutory ones’ says culture chief – Croydon Advertiser. &#34;All but one of Croydon’s 13 libraries could close as part of the council’s attempts to balance the books following further cuts in government funding.&#34; … &#34;&#34;It’s a possibility all of [the libraries] could close apart from what you would call the core statutory ones,&#34; he told the Advertiser. &#34;It’s a statutory service but it depends how you define what that is. You could go down to [just] the Central Library. &#34;In all fairness you should have proper coverage across the borough and that’s what we’re committed to.&#34; Council leader points to major hollowing out of libraries under previous (Conservative) administration. see also Croydon may close all but one of its libraries – BookSeller.","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Worcestershire","Wed, 02 Dec 2015 23:08:37 +0000","Worcestershire – We need to shed another £475,000 from libraries across Worcestershire, say council chiefs – Droitwich Spa Advertiser. &#34;Worcestershire County Council insists none of its 21 libraries will be forced to close but has kick-started a major new review of how to save cash. Bosses hope to plug all of the gap by asking more third parties to rent space at different sites, like the JobCentre Plus or cafes, a move they are calling ‘remodelling’.&#34; … &#34;The fresh savings target, for the 2016/17 financial year, comes after more than £2 million was taken out of the service in previous years. &#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Angus","Wed, 02 Dec 2015 23:08:37 +0000","Angus – New chapter for Angus libraries as overdue book charges are consigned to history – Courier. &#34;A month-long library fines amnesty last year indicated that charges discourage the return of overdue books, and the local authority has moved to stimulate the return of outstanding stock – while also attracting lapsed library users. The move coincides with a new organisation assuming control of culture, sport and leisure services in the county. From today, charitable trust Angusalive is in charge of providing these services to the community on behalf of Angus Council.&#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Sutton","Wed, 02 Dec 2015 23:08:37 +0000","Sutton – Renewed call for residents to have their say on Sutton’s looming £1m library cuts – Sutton Guardian. &#34;Options include closing Beddington library, which the council said has seen &#34;a low and diminishing usage&#34;; ending the mobile library service; paring back opening hours; and recruiting volunteers instead of paid staff. Services could be privatised, as has happened in Croydon and Wandsworth.&#34;","2015/12/google-digital-garage-getting-rid-of-fines-big-cuts-on-the-horizon-in-bradford-croydon-and-swindon.html"],["Barnet","Sun, 06 Dec 2015 18:44:43 +0000","Barnet – Campaigners use crowdfunding in bid to challenge library plans  – Local Government Lawyer. &#34;Campaigners seeking to challenge Barnet Council’s plans for the future of the area’s libraries service have used crowd-funding to obtain the funds to pay for preparatory work for a judicial review challenge including drawing up a pre-action protocol letter. Save Barnet Libraries have accused the London borough of the &#34;proposed wholesale removal of staff from Barnet libraries, a step which, if taken, will unlawfully discriminate against the young, disabled, and other legally protected groups who will no longer have proper access to their local libraries&#34;.&#34;","2015/12/vlogging-and-library-data.html"],["Cambridgeshire","Sun, 06 Dec 2015 18:44:43 +0000","Cambridgeshire – Lollipop ladies facing the chop – but mobile libraries and pothole maintenance are handed a reprieve – Cambridge News. Proposed cuts are being reviewed by committees: &#34;The committee refused to endorse cuts to mobile libraries and roads maintenance – but did recommend axing school crossing patrols and grants to the voluntary sector, as well as endorsing old plans to switch off the county’s streetlights in residential areas between midnight and 6am. The mobile library proposals would save £160,000, while cutting school crossing patrols will save cash-strapped Shire Hall £171,000.&#34; … &#34;&#34;The library service is going through a review at the moment. The mobile libraries are a lifeline to the rural communities and that was another one we thought was unacceptable and couldn’t endorse it.&#34; … &#34;The committee also heard about the work of a new group looking at generating income for the library service. Among the schemes it is looking at include sponsorship of the mobile libraries, so the council would be ab&#8230;","2015/12/vlogging-and-library-data.html"],["Fife","Sun, 06 Dec 2015 18:44:43 +0000","Fife – Robinson Crusoe could save our library – Fife Today. &#34;A last minute plea has been issued to save Lundin Links library from closure by partly transforming it into a Robinson Crusoe heritage museum. The idea was put before Levenmouth Area Committee yesterday (Wednesday) by members of Largo Community Council who argued the proposed closure presented &#34;not so much a challenge but an opportunity&#34;.","2015/12/vlogging-and-library-data.html"],["Lambeth","Sun, 06 Dec 2015 18:44:43 +0000","Lambeth – Library campaigners on camera – Brixton Blog. &#34;Brixton Blog journalist Helen Reid has created a short video in which users of Lambeth libraries and the people campaigning to keep all of the borough’s libraries open speak out.&#34; see also New Lambeth library consultation complaint – Brixton Blog. &#34;Forms for the Lambeth council consultation on the future of Tate South Lambeth Library (TSL) ran out at the library after four days and no more have been supplied, campaigners have charged. Christina Burnett of Vauxhall CIC, a social enterprise that works closely with the library, said this made the consultation period invalid&#34;","2015/12/vlogging-and-library-data.html"],["Manchester","Sun, 06 Dec 2015 18:44:43 +0000","Manchester – Enlighten Manchester – Festival of Light and Sound Art – Librarylive. &#34;Celebrating UNESCO’s International Year of Light, a new Festival of Light and Sound Art -‘Enlighten Manchester’ – is set to bring a stellar programme of world premieres, award-winning installations and international artists to the city. From 10-12 December contemporary artists will transform the public spaces inside Manchester Central Library and The Bridgewater Hall, offering visitors an immersive, inspiring cultural respite from the festive hustle and bustle.&#34; … &#34;Nightly performances in the unique setting of the Central Library from incredible musicians including Psappha Ensemble, Kaj Duncan David, Kathy Hinde and Matthew Olden.&#34;","2015/12/vlogging-and-library-data.html"],["Birmingham","Sun, 06 Dec 2015 18:44:43 +0000","Birmingham – Last-ditch attempt to save Birmingham Central Library – Telegraph. &#34;An eleventh hour bid is being made to save Birmingham Central Library from demolition – and turn it into an art gallery, hotel or even a museum of Midlands heavy metal. A supporters group in the second city has been lobbying for the distinctive 1974 library to be spared – and received backing from the Twentieth Century Society, the World Monuments Fund, and writers Jonathan Meades, Catherine O’Flynn, Jonathan Glancey and Owen Hatherley.&#34;","2015/12/vlogging-and-library-data.html"],["Lambeth","Sun, 06 Dec 2015 18:44:43 +0000","Lambeth – Lambeth Council possibly heading to High Court again as library campaigners bring case against bonkers book-ish gyms – Brixton Buzz. &#34;Lambeth Council is facing another possible Judicial Review – only one week after the High Court ruled that the Council acted unlawfully during the Cressingham Garden consultation. This time it is the Cultural Consultation that led to the bonkers book-ish gyms that could be heading for the High Court. A case is being brought by Public Interest Lawyers on behalf of a Lambeth resident who depends on the Carnegie Library.&#34; see also Shadow Chancellor John McDonnell launches Lambeth Momentum movement at Lambeth Academy with calls for local Labour party members to become more active – Brixton Buzz.","2015/12/vlogging-and-library-data.html"],["North Lanarkshire","Sun, 06 Dec 2015 18:44:43 +0000","North Lanarkshire – Fewer books on the shelves in our libraries – Cumbernauld News. &#34;CultureNL, the council-run company operating local libraries, reported that its expenditure on new books has dropped by £179,000, or 41%, over three years&#34;","2015/12/vlogging-and-library-data.html"],["South Tyneside","Sun, 06 Dec 2015 18:44:43 +0000","South Tyneside – New South Shields theatre work imagines a town without books in the future  – Chronicle. &#34;A new theatre work imagines a grim world only 50 years from now where libraries have been closed, books have been destroyed and stories of any kind are taxed. Mmm, cynics among you might think, are we not nearly there already? Well, no. An exciting new library and media centre called The Word is a key element of a £100m regeneration plan for South Shields town centre. And the new theatre work, called If Words Weren’t Free, was commissioned from Newcastle-based theatre company Precious Cargo as part of Arts in Libraries, a celebration of how libraries can be a catalyst for creativity.&#34;","2015/12/vlogging-and-library-data.html"],["Bradford","Sun, 06 Dec 2015 18:44:43 +0000","Bradford – Swingeing Bradford Council cuts poised to hit libraries, refuse collections and tourism in Ilkley, Burley and Menston – Wharfedale Observer. &#34;Libraries in Menston and Burley-in-Wharfedale are also among services facing the axe, unless they can be taken over by community groups, with proposals put out to consultation by Bradford Council’s ruling executive this week. But Ilkley Library, as one of the district’s main centres, appears to be safe.&#34;","2015/12/vlogging-and-library-data.html"],["Derby","Sun, 06 Dec 2015 18:44:43 +0000","Derby – Planned budget cuts will create ‘Scrooge city’ says councillor  – Derby Telegraph. &#34;&#34;The library in  Chellaston  is incredibly important to local people. It is used very well by locals and schoolchildren who say it is an important educational tool. &#34;We had a neighbourhood board meeting and the issue of the future of the library was brought up and there was, and is, a great deal of support to keep it where it is. One near to Chellaston is in Chaddesden, and that is new but residents will be unhappy at having to travel that far.&#34;","2015/12/vlogging-and-library-data.html"],["Hampshire","Sun, 06 Dec 2015 18:44:43 +0000","Hampshire – Youngster’s plot to save Yateley library to protect children’s ‘right to read’  – Get Hampshire. &#34;[11 year old] Alexandra Kelly has written a letter to Hampshire County Council pleading for it not to close Yateley Library and is urging people of all ages to do the same. &#34; … &#34;In her letter, Alexandra said her eight-year-old sister has a learning disability and struggles to read, but Yateley’s ‘homely’ library had helped her. Proud mother Sarah said the campaign to save the library started when Alexandra downloaded her first book onto her phone so she could read on the train.&#34;","2015/12/vlogging-and-library-data.html"],["Swindon","Sun, 06 Dec 2015 18:44:43 +0000","Swindon – Threat to libraries as more cuts loom in Swindon – Swindon Advertiser. &#34;There are 15 libraries across Swindon but talks have begun at several on how to combine them with other services. A new library strategy is being developed that aims to see how libraries can be linked up with other amenities to cut costs.&#34; … &#34;Shirley Burnham, a member of the Save Old Town Library Group, said: &#34;The substitution of paid staff by volunteers is a false economy. Fragmentation of our library service may result and that will have a reputational risk for the council.","2015/12/vlogging-and-library-data.html"],["Lincolnshire","Sun, 06 Dec 2015 18:44:43 +0000","Lincolnshire – Save Lincs Libraries gets ‘holding’ reply from DCMS – Save Lincolnshire Libraries. &#34;&#34;I have received the attached holding letter from the Department of Culture , Media and Sport. It is the first communication I have received since April. Maybe the appointment of GLL to run the library service has quickened the pace of response, and I look forward to receiving a full reply in due course. It is likely that the Secretary of State waited for the outcome of the Judicial Review, but a simple acknowledgement would have been helpful and courteous in the meantime.&#34;&#34;","2015/12/vlogging-and-library-data.html"],["Walsall","Sun, 06 Dec 2015 18:44:43 +0000","Walsall – Have your say on library closures at meetings – Express and Star. &#34;Residents can have their say on plans to shut seven libraries in Walsall at a series of consultation events taking place across the borough&#34; … &#34;A library questionnaire is online at www.lovelibrarieswalsall.co.uk &#34; see also Closures of Walsall libraries go to public consultation – Walsall Advertiser. &#34;The draft budget options for consideration in the year of 2016/17 include the closure of seven libraries from the current Walsall network. These are Beechdale, Blakenall, New Invention, Pleck, Rushall, South Walsall and Walsall Wood. Under the plans the mobile library service would also cease to operate but the home library service would continue. A book exchange would also be established in the new Oak Park Active Living Centre to cope with the loss of Walsall Wood library.&#34;","2015/12/vlogging-and-library-data.html"],["Birmingham","Tue, 08 Dec 2015 23:46:43 +0000","Birmingham – Birmingham’s children’s libraries get £250k funding boost – Birmingham Council. &#34;Five of Birmingham’s children’s libraries are set for a New Year makeover, thanks to £250k of funding from the Wolfson Foundation. As well as decorating and new furniture, the libraries will receive new technology and funding for local history projects and storytelling events.  New equipment will include iPads and android devices, plasma screens, DSLR cameras, laptops, Wii and the latest Raspberry Pi.&#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["East Riding of Yorkshire","Tue, 08 Dec 2015 23:46:43 +0000","East Riding of Yorkshire – East Riding Library Consultation Ends Soon – Yorkshire Coast Radio. &#34;East Riding of Yorkshire Council is reminding residents that they have until Monday 21 December 2015 to give their views on the future of its library service. Already, around 5500 responses have been returned to the council since the consultation was launched in September.&#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["Fife","Tue, 08 Dec 2015 23:46:43 +0000","Fife – Campaigners hold ‘read in’ in Pittenweem as library decision looms – Fife Today. &#34;Campaigners in Pittenweem held a ‘read in’ at their local library on Friday to protest against plans to close Pittenweem library and 15 others across Fife. The peaceful protest, organised by the Pittenweem Readers, gave local people the chance to come together in a show of support for the Fife library service and to explain just how much their local library means to them.&#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["Fife","Tue, 08 Dec 2015 23:46:43 +0000","Fife – D-Day for Fife libraries’ future – Fife Today. &#34;Tuesday’s meeting at Fife House is expected to be lively with protestors gathering outside to press the case to save their own branches.&#34; … &#34;Set up three years ago, the Trust has already delivered almost £1m in savings – and it still has to find a further £800,000 by March 2018.&#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["Cambridgeshire","Tue, 08 Dec 2015 23:46:43 +0000","Cambridgeshire – Mobile library service could be saved after councillors vote to spare it from cuts – Hunts Post. &#34;Cambridgeshire County Council’s highways and community infrastructure committee said last Monday (November 30) that the service offered &#34;a lifeline&#34; to people in rural areas and voted that it should not be subject to further cuts.&#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["Cardiff","Tue, 08 Dec 2015 23:46:43 +0000","Cardiff – Cardiff council’s proposed budget branded ‘shameful’ – Wales Online. &#34;These proposals are vague when it comes to actually stating what these mean in delivery.&#34;School children hit, small businesses hit, youth workers hit, community safety hit, libraries at risk, costs of services for elderly increased, to name but a few proposals. It is supposed to be an open and transparent administration, yet they lack the courage to be honest.&#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["Walsall","Tue, 08 Dec 2015 23:46:43 +0000","Walsall – Community, leisure and culture Portfolio Consultation – Walsall Council. &#34;The proposal for consultation is to consider closure of 7 libraries (Beechdale, Blakenall, New Invention, Pleck, Rushall, South Walsall, with Walsall Wood book exchange relocated to Oak Park Active Living Centre) keeping 9 libraries and the housebound service as the core library service for the Borough – Aldridge, Bloxwich. Brownhills, Darlaston, Pelsall, Pheasey, Streetly, Willenhall, Central, Housebound Library Service). The proposal would save a total of £487,912, £328,854 to be delivered in 2016/17 representing implementation at the end of July and a further £159,058 in 2017/18.&#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["Croydon","Tue, 08 Dec 2015 23:46:43 +0000","Croydon – Croydon libraries facing closure due to budget cuts – Guardian series. &#34;&#34;DIY libraries&#34;, run by community groups, are being considered as a way to keep threatened parts of the service running. But campaigners warned the strategy could lead to struggling &#34;second-rate libraries&#34;.&#34; … &#34;Upper Norwood library, which is funded jointly by Croydon and Lambeth councils, is now run by a community-run charitable trust founded to protect it from cuts. But the library face an uncertain future ahead of likely funding reductions and Robert Gibson, a campaigner who has played a central role in the trust, predicted the model may not work elsewhere in Croydon.&#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["East Sussex","Tue, 08 Dec 2015 23:46:43 +0000","East Sussex – Cut in opening hours of East Sussex libraries proposed – Hastings Observer. &#34;The opening hours of East Sussex libraries could be cut by around a quarter under new proposals. East Sussex County Council’s Cabinet is due to approve a public consultation on the proposed changes, which could see all libraries open only between 10am-5pm.&#34; … &#34;The proposals would result in a reduction in overall opening hours across the county of around 25 per cent and could save the county council £500,000 a year.&#34; … &#34;While over the past five years there has been an 87 per cent increase in the use of the e-library, and a 568 per cent increase in e-book downloads, compared to an 11 percent decrease in physical visits and a 20 per cent reduction in stock issues.&#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["Falkirk","Tue, 08 Dec 2015 23:46:43 +0000","Falkirk – Call to save Falkirk libraries before it’s too late – Falkirk Herald. &#34;Union officials are &#34;gravely concerned&#34; over proposals to cut library services after Falkirk Community Trust announced its business plan. &#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["Croydon","Tue, 08 Dec 2015 23:46:43 +0000","Croydon – Funding for libraries, meals on wheels and waste collections facing axe in £29m budget cuts – Guardian series. &#34;inviting community groups to run some of the borough’s libraries (£217,000) &#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["Derbyshire","Tue, 08 Dec 2015 23:46:43 +0000","Derbyshire – £892k library is officially opened – Derbyshire Times. &#34;&#34;The library offers a wide range of modern, accessible facilities for people of all ages and an excellent programme of free events and training. &#34;The enthusiasm of local people shows there is a demand for libraries and an appreciation that we are managing to maintain this very important service across the county during a time of unprecedented budget cuts.&#34; The library offers a wide range of facilities including an improved children’s library, a health and well-being zone, a custom-built area for people to use the council’s free-access computers and communal seating and study areas.&#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["Manchester","Tue, 08 Dec 2015 23:46:43 +0000","Manchester – Manchester Central Library introduces archive gift range – Manchester Evening News. &#34;Manchester Central Library’s new gift range, designed from its archives, offers the opportunity for you to take a piece of our great city’s history home with you. On sale at the library’s shop from today, items include Christmas cards, umbrellas, postcards, calendars, mugs and t-shirts are printed with historical images from classic cars, public notices and 1930s vintage posters.&#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["Fife","Tue, 08 Dec 2015 23:46:43 +0000","Fife – Councillors agree to close 16 Fife libraries – BBC News. &#34;Libraries at Abbeyview, Bowhill, Colinsburgh, Crail, Crossgates, East Wemyss, Falkland, Freuchie, Glenwood and Kinghorn are to shut. Libraries in Lundin Links, Markinch, Pittenweem, Pitteuchar, Thornton and Townhill are also to close. Fife Council’s executive committee took the &#34;tough decision&#34; to make sure the service was &#34;sustainable&#34; and &#34;suited to customer need&#34;. Dates for the closures are yet to be decided.&#34; see also Fife libraries will close – Fife Today. &#34;Despite impassioned pleas from councillors and attempts to stop or defer the closures, the Fife Council’s Executive Committee members voted by a clear majority to the plans proposed by the Fife Cultural Trust (FCT) who now run the library service.&#34;","2015/12/closures-cuts-a-new-library-more-e-books-librarylabs-and-a-scl-tender.html"],["Cornwall","Thu, 10 Dec 2015 21:25:04 +0000","Cornwall – New partnership formed to explore future of St Ives library – Cornishman. &#34;partnership between the Town Council, the St Ives Archive and the Friends of the Library will discuss the future of St Ives Library and the One Stop Shop, working to consider and explore options for the library in order to find a sustainable future.&#34;","2015/12/if-you-take-the-money-away-people-dont-come-as-much-cipfa-figures-201415.html"],["Birmingham","Tue, 15 Dec 2015 22:08:46 +0000","Birmingham – Birmingham libraries should be ‘re-imagined’ to survive – Birmingham Post. &#34;The Friends of the Library of Birmingham group and Birmingham Against The Cuts both called on the council leadership to stand up to the Government over the funding cuts. But councillor Clancy, who has been leader for just two weeks, responded that, under the partnership deal with the Brasshouse Language Centre, the Library of Birmingham would now have longer opening hours next year. He said: &#34;We have made some progress in relation to its opening hours. The Library of Birmingham is a real headache. We have to look at it as an asset.&#34;","2015/12/the-eleventh-library-trend-of-2015.html"],["Pembrokeshire","Tue, 15 Dec 2015 22:08:46 +0000","Pembrokeshire – Narberth library calls for volunteers to save resource – Carmarthen Journal. &#34;Pembrokeshire County Council has confirmed that if members of the ‘Friends of Narberth Library’ do not step in to help, the building will close in April.&#34;","2015/12/the-eleventh-library-trend-of-2015.html"],["Plymouth","Tue, 15 Dec 2015 22:08:46 +0000","Plymouth – Interior designer appointed for Plymouth’s new Central Library – Plymouth Herald. &#34;&#34;People told us they wanted a more exciting library offer for Plymouth and this innovative and dynamic company will help us create a welcoming and vibrant space. &#34;During the consultation we were asked for a café and some outside space, so we’re providing a café on the first floor and we’re using the vacant car park next door to create a roof terrace with views over the city centre. &#34;We’ve added an extra entrance on Mayflower Street to provide easy access and increased the amount of study space available. &#34;The whole building will be accessible to anyone in a wheelchair and will have plenty of toilets.&#34;","2015/12/the-eleventh-library-trend-of-2015.html"],["Falkirk","Thu, 10 Dec 2015 21:25:04 +0000","Falkirk – Officials concerned over proposed library cuts – Linlithgow Gazette. &#34;Union officials are &#34;gravely concerned&#34; over proposals to cut library services after Falkirk Community Trust announced its business plan. As children and adults across the country were enjoying Book Week, Falkirk Community Trust announced there would be a reduction in staff numbers and shorter opening hours within the libraries, possibly in Bo’ness, and the mobile library scrapped.&#34;","2015/12/if-you-take-the-money-away-people-dont-come-as-much-cipfa-figures-201415.html"],["Croydon","Tue, 15 Dec 2015 22:08:46 +0000","Croydon – Scudamore rides to library rescue with extra £50,000 grant – Inside Croydon. &#34;Bryher Scudamore, one of the trustees, has told Inside Croydon that she is &#34;delighted&#34; that the Upper Norwood Library Trust has squeezed an additional £50,000 over two years from Lambeth Council for the running of the facility.&#34; … &#34;&#34;This is in addition to the £60,000 per annum already agreed and will be delivered in partnership with Lambeth Council and the London Community Foundation, subject to final due diligence. We will be working closely with Croydon Council over the weeks ahead to align their funding to give us the budget we need to ensure a thriving neighbourhood library and community hub.&#34; see also Council’s £29 million cuts herald another three years of austerity in Croydon – Croydon Advertiser.","2015/12/the-eleventh-library-trend-of-2015.html"],["Redbridge","Tue, 15 Dec 2015 22:08:46 +0000","Redbridge – Reporters to work from library as part of weekly’s office move – Hold the Front Page. &#34;The move to Maritime House, Barking, which is around 2.5 miles away, will see Ilford Recorder reporters working once a week from Redbridge Central Library at designated times, after discussions between the newspaper and Redbridge Borough Council.","2015/12/the-eleventh-library-trend-of-2015.html"],["Shetland","Tue, 15 Dec 2015 22:08:46 +0000","Shetland – Merry Christmas Everybody&#34; from Shetland Library.","2015/12/the-eleventh-library-trend-of-2015.html"],["Fife","Thu, 10 Dec 2015 21:25:04 +0000","Fife – ‘This isn’t over’ — Fife library campaigners consider legal fight – Courier. &#34;Val McDermid, branded Fife Council’s controversial move a &#34;sad and shaming day&#34; for the kingdom, protesters revealed they had contacted a lawyer to see if a legal challenge is possible. Bryce Sutherland, from the group Keep Fife’s Libraries Open, said: &#34;This isn’t over. One way or another, we are going to reverse their shallow, callous, blinkered decision.&#34;&#34;","2015/12/if-you-take-the-money-away-people-dont-come-as-much-cipfa-figures-201415.html"],["Lancashire","Thu, 10 Dec 2015 21:25:04 +0000","Lancashire – New charges for county libraries – Lancashire Evening Post. &#34;From January 1, anyone aged 18 and over who has borrowed a book and returns it late will have to pay a fine of 15 pence per day. The maximum fine charged will be £6 for each book. &#34; … &#34;Currently there are a number of exemptions to fines for the late return of books which include library members aged 65 and over, have long-term health conditions or have a disability. These people will not be exempt when these new arrangements are introduced. A charge of £1 will also be introduced for each child taking part in a library craft activity, up to a maximum charge of £2 per family.&#34; … &#34;These new charges are in addition to the interlibrary loan charge, which was introduced on 1 December, for anyone requesting an item not available at a Lancashire library. &#34;","2015/12/if-you-take-the-money-away-people-dont-come-as-much-cipfa-figures-201415.html"],["Fife","Thu, 10 Dec 2015 21:25:04 +0000","Fife – Fife library closures: Author Val McDermid ‘saddened and angered’ by decision – Courier. &#34;The Fife author, whose novels have sold more than 10 million copies worldwide, branded the decision &#34;a sad and shaming day&#34; for the region. &#34;I’m deeply saddened and, yes, angered by Fife Council’s decision to close 16 libraries, mostly in communities that have very few alternative resources,&#34; she told The Courier. &#34;I grew up in a house where there was no money to spare for books and Kirkcaldy Public Library was my route to understanding the world. &#34;I couldn’t be a writer if it wasn’t for the library – my home from home growing up – and I know from talking to other writers from Fife that I’m not alone in that experience.&#34;&#34;","2015/12/if-you-take-the-money-away-people-dont-come-as-much-cipfa-figures-201415.html"],["Fife","Thu, 10 Dec 2015 21:25:04 +0000","Fife – MPs take library closure fight to House of Commons – Fife Today. &#34;Fife’s four SNP MPs have lodged a motion in the House of Commons calling on Fife Council to reconsider its decision to close 16 libraries. They describe that action as ‘‘devastating’’ and say the local authority has lost the vision of Fife born philanthropist, Andrew Carnegie, who gifted libraries to the world.&#34;","2015/12/if-you-take-the-money-away-people-dont-come-as-much-cipfa-figures-201415.html"],["Fife","Thu, 10 Dec 2015 21:25:04 +0000","Fife – New concern for Scotland’s libraries as sixteen are axed by one local authority – Herald Scotland. &#34;The closures agreed in Fife have raised fresh concerns that libraries may be a soft target for cuts as councils face up to half a billion pounds of cuts in the coming year. &#34;","2015/12/if-you-take-the-money-away-people-dont-come-as-much-cipfa-figures-201415.html"],["Herefordshire","Thu, 10 Dec 2015 21:25:04 +0000","Herefordshire – Hereford Library Users Group positive about working with council to explore options for future service delivery of library in city – Hereford Times. &#34;Herefordshire Council’s cabinet agreed last week that the Hereford Library Users Group (HLUG) – working with other relevant stakeholders – would be invited to confirm by the end of February 2016, whether it wanted to work with the council to look at future options for a library in Hereford. It would provide time, the cabinet was told, for discussions to take place to establish the ‘community appetite’ to pursue an alternative model of delivery – whether at the Broad Street site or an alternative.&#34; … &#34;Meanwhile, John Perkins, from the Save Our Libraries campaign, said although he welcomed news of the council’s consultation with HLUG, he would be more enthusiastic if the cabinet understood the word ‘consultation.’ &#34;Using a holiday period when people are distracted is a sure way to produce a low response,&#34; he said.&#34;","2015/12/if-you-take-the-money-away-people-dont-come-as-much-cipfa-figures-201415.html"],["Lambeth","Thu, 10 Dec 2015 21:25:04 +0000","Lambeth – Libraries ‘staff mutual’ not ruled out – Brixton Blog. &#34;Lambeth council libraries management team are to be given a budget to develop their plan to run the borough’s ten libraries as a &#34;staff mutual&#34;. But council leader Lib Peck warned at a meeting of its cabinet yesterday (7 December) that any plans must be within the &#34;financial envelope&#34; of nil cost to the council. The mutual has been irged [sic – ed.] on the council by opponents of its plans to turn three libraries into gyms run by its leisure provider GLL.&#34; … &#34;Cllr Davie said the library management proposal was &#34;not at a stage that is developed enough as yet to offer an alternative.&#34; Library campaigners in the audience – who were not invited to speak – shouted: &#34;Neither is GLL’s&#34;.&#34;","2015/12/if-you-take-the-money-away-people-dont-come-as-much-cipfa-figures-201415.html"],["Birmingham","Tue, 15 Dec 2015 22:08:46 +0000","Birmingham – Birmingham Central Library torn down forever as diggers begin work – Birmingham Mail. Old library being demolished. &#34;The beginning of the end of the old building began on Monday morning as part of a £500 million redevelopment of the Paradise Circus site making way for offices, a hotel and works to re-route traffic. The concrete library was opened in 1974 and for a while was one of the largest public libraries in Europe.&#34;","2015/12/the-eleventh-library-trend-of-2015.html"],["Devon","Tue, 15 Dec 2015 22:08:46 +0000","Devon – Community and staff to run libraries – Tavistock Times Gazette. &#34;Council chiefs have agreed that Libraries Unlimited, the new ‘public service mutual’ set up by the council, will take over the library service in April 2016. The move is set to secure the future of all 50 of the county’s libraries and save the authority a further £1.5-million in addition to the £3-million it has already saved from its library service budget over the past three years.&#34;","2015/12/the-eleventh-library-trend-of-2015.html"],["Lincolnshire","Tue, 15 Dec 2015 22:08:46 +0000","Lincolnshire – Letter: The future of Lincolnshire libraries is still uncertain… but we have to make the best of it – Lincolnshire Echo. &#34;It must be remembered that the hubs have only four years’ funding secured. The contract pays for up to 40 community hubs, but so far only 34 are identified. We have lost three libraries so far and just under half are still not open. It is very hard to identify the real savings. On top of the contract, the council will still be paying separately for county overheads to oversee the contract service, for the buildings, mobile library fleet, and IT. These are still subject to the council’s budget decisions next year. The self-service book borrowing system has been a mainstay for voluntary-run libraries, but the IT is not in the new contract. A new system will need new funding.&#34;","2015/12/the-eleventh-library-trend-of-2015.html"],["East Sussex","Tue, 15 Dec 2015 22:08:46 +0000","East Sussex – East Sussex libraries could cut hours to save running costs – BBC. &#34;Councillors have voted to put the plans out to consultation, which would see libraries opening at 10:00 and closing at 17:30, and 18:00 on Thursdays. Libraries which open on a Saturday would continue to do so. Cutting the hours by about 25% would cut running costs by £500,000 a year.&#34;","2015/12/the-eleventh-library-trend-of-2015.html"],["Leicestershire","Tue, 15 Dec 2015 22:08:46 +0000","Leicestershire – Leicestershire’s latest community library opens – ITV. &#34;Leicestershire’s latest community partnership library opens its doors later today, when the county council hands over the keys to local residents in the village of Sileby. The library will be open from 2pm to 5pm today. The county council says it needs to make £800,000 of savings in its library service, meaning that it has asked 36 communities to manage their own libraries. It’s hoped 30 of those communities will reach an agreement on their local library by April next year.&#34;","2015/12/the-eleventh-library-trend-of-2015.html"],["Warrington","Tue, 15 Dec 2015 22:08:46 +0000","Warrington – Warrington plans £5m heritage hub – Designing Libraries. &#34;Expanding our library into a central town centre location will allow LiveWire to bring its library offer into the 21st century, providing a modern, exciting and interactive environment for users so they can use the library space differently and for longer.&#34; A new library venue will also allow the organisation to provide a larger digital offer to reflect the digital age and remain relevant in the future. The new building will be easier for users to access as it is closer to transport links and would be able to offer have longer opening hours.&#34; [Warrington Livewire have refused a request for information on the size on the new library, in relation to the old, as well as other requests for information on bookfung and staffing – Ed.]","2015/12/the-eleventh-library-trend-of-2015.html"],["Worcestershire","Tue, 15 Dec 2015 22:08:46 +0000","Worcestershire – Library users warned The Hive and other county libraries will have different opening times over Christmas period – Worcester News. &#34;We would like to wish all of our library customers a happy festive season and remind everyone that if you are a member of Worcestershire’s libraries even when the libraries are closed you can still get access to eBooks, eAudiobooks and eMagazines and your account on your laptop, tablet or other mobile device – and it’s free.&#34; &#34;","2015/12/the-eleventh-library-trend-of-2015.html"],["Lancashire","Tue, 15 Dec 2015 22:08:46 +0000","Lancashire – Library users hit by fee hikes as axe hovers over 40 sites – Accrington Observer. &#34;The increases, which include a 2,067 per cent hike in loans from the British Library which was introduced this month, will see fines of 15p per day for late returns, and removal of fine exemptions for the elderly and vulnerable. Under current rules, there are a number of exemptions to fines including over-65s and people with disabilities and long-term health conditions, but they will not be exempt when new rules are introduced. The Observer has mounted a campaign to save our libraries, including Accrington, Oswaldtwistle, Great Harwood, Rishton and Clayton-le-Moors, with our petition so far signed by 1,116 supporters.&#34;","2015/12/the-eleventh-library-trend-of-2015.html"],["North Yorkshire","Tue, 15 Dec 2015 22:08:46 +0000","North Yorkshire – Leaders say maximum council tax rise &#34;almost inevitable&#34; for North Yorkshire, as they brace themselves for £60 million cuts – Gazette and Herald. &#34;Cllr Les and the authority’s chief executive Richard Flinton are trumpeting the council’s community partnerships – including volunteer-run libraries – and &#34;investments to save&#34; – like the Living Well programme which puts money into preventative work to help older people stay independent in their own homes – and save on costly care packages in the long run.&#34;","2015/12/the-eleventh-library-trend-of-2015.html"],["Croydon","Thu, 17 Dec 2015 07:03:07 +0000","Croydon – Croydon Council to shed 450 jobs over next three years – Croydon Advertiser. &#34;Sara Bashford, vice chairman of the committee, asked for clarity over the council’s plans for libraries, which face a £217,000 (4.9 per cent) cut next year. &#34;We’re quite determined, if it’s possible, to retain a full library service,&#34; said Cllr Newman. &#34;What we’ve said is we’re going to have to provide those services differently. Libraries need to evolve.&#34;","2015/12/my-library-by-right-cilip-launch-key-campaign-to-protect-public-libraries.html"],["Fife","Thu, 17 Dec 2015 07:03:07 +0000","Fife – Glenrothes library campaigners: ‘We’re running out of time…’ – Fife Today. &#34;Campaigners reeling from Fife Council’s decision to close 16 libraries, including four within the Glenrothes area, say time is now running out for alternative provision to be found. Community groups have until Christmas to come forward with their own proposals ahead of the closure plan scheduled for spring 2016.&#34; … &#34;&#34;We have repeatedly requested impact assessments for each of these closures and received nothing. People are starting to realise it was always a done deal.&#34;","2015/12/my-library-by-right-cilip-launch-key-campaign-to-protect-public-libraries.html"],["East Renfrewshire","Mon, 21 Dec 2015 21:08:30 +0000","East Renfrewshire – Union joins library cuts fight – Extra. &#34;Unison East Renfrewshire says it will fight council plans to axe school library services. The local branch estimates a 50 per cent reduction in services, and brands it the &#34;second most unpopular cut&#34; in the public consultation on East Renfrewshire Council’s 2014 budget savings proposal.&#34;","2015/12/merry-christmas-everyone-2.html"],["Somerset","Mon, 21 Dec 2015 21:08:30 +0000","Somerset – Somerset County Council: Plans for libraries to house multiple public services – Western Gazette. &#34;&#34;The new hubs will provide modern, flexible spaces to meet local community needs. The first hub will open in Glastonbury in autumn 2016, with services including the library, children’s centre, Citizens Advice, registration services and Mendip District Council. &#34;While not all areas will be suitable for hubs, the Council aims to work with local communities to develop approaches reflecting local need and demand, such as plans being developed with Martock Parish Council for Martock library.&#34; Under the plans libraries would have reduced opening times to deliver &#34;savings equivalent to the cost of running the county’s ten smallest libraries&#34;. The opening hours of some libraries will remain the same or even be open for longer, particularly where they form part of hubs.&#34;","2015/12/merry-christmas-everyone-2.html"],["Somerset","Mon, 21 Dec 2015 21:08:30 +0000","Somerset – Somerset libraries to cut national newspapers for three months – Western Gazette. £4k cut. &#34;National papers will not be available in the county’s libraries from the beginning of January 2016 until the end of March.&#34;","2015/12/merry-christmas-everyone-2.html"],["Walsall","Mon, 21 Dec 2015 21:08:30 +0000","Walsall – Walsall Council cuts: Public have their say over future of libraries – Express and Star. &#34;Residents have had their say over controversial council proposals to shut the doors at seven libraries in Walsall during a series of public consultation events.&#34;","2015/12/merry-christmas-everyone-2.html"],["Dudley","Thu, 17 Dec 2015 07:03:07 +0000","Dudley – Dudley’s libraries to offer iPad taster sessions – Halesowen News. &#34;Other support on offer in libraries includes on-the-spot help with simple problems and drop-in sessions for help with Internet, e-mail and form filling, including online applications and job searches. &#34;","2015/12/my-library-by-right-cilip-launch-key-campaign-to-protect-public-libraries.html"],["Suffolk","Mon, 21 Dec 2015 21:08:30 +0000","Suffolk – Lowestoft Library Pages café to close – Suffolk Libraries. &#34;Lowestoft Library Pages cafe will close on December 24. We have tried various initiatives to improve the fortunes of the café as it hasn’t been attracting enough customers to cover its costs. Given the increasing funding pressures that Suffolk Libraries is under, we are unable to justify continuing to subsidise it.&#34;","2015/12/merry-christmas-everyone-2.html"],["Swindon","Mon, 21 Dec 2015 21:08:30 +0000","Swindon – Our fate is in our own hands, says council leader – Swindon Advertiser. &#34;We are starting the process to save about £1.4million – that’s 65 per cent – of the cost of the library service. We are also looking to find ways to remove the entire tax payer subsidy from Lydiard Park and House.&#34; … &#34;To keep all the current library buildings, some of which are open for barely 10 hours a week, we need to £1.4m of savings elsewhere. &#34;","2015/12/merry-christmas-everyone-2.html"],["East Sussex","Thu, 17 Dec 2015 07:03:07 +0000","East Sussex – Uckfield library hours may be cut by 25 per cent – Uckfield News. &#34;&#34;The proposal is one of a number of potential measures we have identified that could save £2million from the running costs of our libraries and contribute towards the county council’s overall savings plan. &#34;Our libraries are not well used at all times of the day.&#34;","2015/12/my-library-by-right-cilip-launch-key-campaign-to-protect-public-libraries.html"],["Greenwich","Thu, 17 Dec 2015 07:03:07 +0000","Greenwich – Greenwich Conservatives propose policy to protect borough’s libraries – News Shopper. &#34;Conservative councillors in Greenwich have proposed a new policy to protect smaller libraries in the borough amidst fears for their future. Described as a &#34;Library Lock&#34; proposal, the fresh policy is due to be debated this evening at the Greenwich full council meeting in Woolwich town hall.&#34; … &#34;The move follows the Labour-run council’s decision to consult on closing the Greenwich mobile library service which currently stops at 18 roadside locations, six primary schools and 27 nurseries, issuing 30,000 items a year.  Local Conservatives have expressed fears over a &#34;creeping centralisation&#34; of library services to the bigger centres in Greenwich, Woolwich and Eltham, which could put eight smaller libraries at risk of closure.&#34; … &#34;Between them, these smaller libraries serve more than half a million visitors and issue more than 250,000 items, a year. &#34;","2015/12/my-library-by-right-cilip-launch-key-campaign-to-protect-public-libraries.html"],["Lancashire","Thu, 17 Dec 2015 07:03:07 +0000","Lancashire – ‘Save Garstang Library’ campaign launched – Garstang Courier. &#34;now county councillor for Garstang, Sandra Perkins, wants the town to rally together in an attempt to save the &#34;vital&#34; resource. She said: &#34;The library is one of two community spaces in the town and it is something we really shouldn’t be losing. &#34;I want people to really get behind this and write to show their support.&#34;","2015/12/my-library-by-right-cilip-launch-key-campaign-to-protect-public-libraries.html"],["Bedford","Mon, 21 Dec 2015 21:08:30 +0000","Bedford – Bedford Borough Council plans more cuts to meet ‘massive funding shortage’ – Bedfordshire News. Cuts being planned, including for libraries.","2015/12/merry-christmas-everyone-2.html"],["East Sussex","Mon, 21 Dec 2015 21:08:30 +0000","East Sussex – Pevensey Bay library ‘must be fit for purpose’ – Eastbourne Herald. &#34;The Friends of Pevensey Bay Library are calling for a facility which is fit for the 21st century following a flood, which resulted in the closure of the library. Helen Burton, from the Friends of Pevensey Bay Library group, says residents were thanked by the council for their patience in the  delayed reopening of the  library several months ago.&#34;","2015/12/merry-christmas-everyone-2.html"],["Cardiff","Mon, 21 Dec 2015 21:08:30 +0000","Cardiff – ‘All we want for Christmas is our library back’ Residents unite over Roath library closure a year on – Wales Online. &#34;Campaigners from Save Roath Library and Cardiff People’s Assembly stage a festive read-in outside the library on Newport Road &#34; … &#34;But the council say the repair bill is too high and is currently asking for expressions of interest for a Community Asset Transfer for the future operation of the service, the closing date for which is in January.&#34; … &#34;Works have already taken place on the building after a &#34;significant leak&#34; which meant books and computers had to be removed while the building was made watertight, but the boiler has failed and pipes now need to be replaced.&#34;","2015/12/merry-christmas-everyone-2.html"],["Lambeth","Mon, 21 Dec 2015 21:08:30 +0000","Lambeth – Unison send out ballot papers for strike action to Lambeth library staff – SLP. &#34;&#34;Even if libraries didn’t achieve all these outcomes. If it didn’t reap massive social benefits in terms of health, education and employment, I’d still be asking you to save our libraries. Because people enjoy reading and we shouldn’t have to justify every moment of our existence and pleasures in life by how much money someone can make or can save. We have the right to a bit of humanity – to find things out, to get lost in stories. &#34;","2015/12/merry-christmas-everyone-2.html"],["Lancashire","Mon, 21 Dec 2015 21:08:30 +0000","Lancashire – Martin Hill: Tell us where council cuts should be made – Bourne Local. &#34;Imagine if every council in England stopped filling in potholes, turned off every street light, and closed all parks, children’s centres, libraries, museums and leisure centres. Even that would still not save enough to plug the financial black hole we’re facing by 2020.&#34;","2015/12/merry-christmas-everyone-2.html"],["Renfrewshire","Mon, 21 Dec 2015 21:08:30 +0000","Renfrewshire – Fury over Renfrewshire Leisure chief’s 14 per cent pay increase  – Daily Record. Pay increase despite reduced numbers but a doubling of responsibilities.","2015/12/merry-christmas-everyone-2.html"],["Cardiff","Mon, 21 Dec 2015 21:08:30 +0000","Cardiff – Letters: Insulted by ‘asset transfer’ proposals – Wales Online. &#34;Currently the council refuses to repair and reopen Roath Library. Instead it is advertising a &#34;community asset transfer&#34; to hand over the building to another group on the cheap. A corner of the building may remain a &#34;library&#34;, but with only a handful of books and barely any computers. Trained library staff could be replaced with a self-service machine and a librarian who only drops in for four hours a week. This is an insult. A deprived community has already been deprived of too many community services. &#34;","2015/12/merry-christmas-everyone-2.html"],["Lancashire","Mon, 21 Dec 2015 21:08:30 +0000","Lancashire – IT plan for under threat libraries – Lancashire Telegraph. &#34;The Burnley and Longridge branches will have the latest modern computers installed as part of the scheme, which runs from January to March 2016.  This is part of an upgrade to the People’s Network in Libraries which allows free public access to computers and the internet.  Both Burnley and Longridge are on a list of branches which could close as Lancashire County Council cuts its network from 75 to 34 to save £7million a year.  Feedback from users during the pilot will help to shape how similar improvements are made to the remaining Lancashire libraries.  A range of computers, laptops and tablets will be available for customers to use.  The Wi-Fi network will also be improved for people who prefer to use their own device.  The upgrade will mean that printing using the Wi-Fi network will be possible.  The online booking service, allowing people to reserve the use of a computer in advance, will be updated.&#34;","2015/12/merry-christmas-everyone-2.html"],["Northumberland","Mon, 21 Dec 2015 21:08:30 +0000","Northumberland – Temporary relocation for library – News Post Leader. &#34;Details have been announced for the temporary relocation of Morpeth library to a new site in the town centre. The move to Royal Sovereign House, Manchester Street, is planned to begin in the New Year with the move expected to be completed by May 2016.&#34; … &#34;the council has to explore new, more efficient ways of providing services, including the relocation and co-location of key services such as libraries.&#34; … &#34;Building surveys of the library have revealed that a 5-year programme of repairs and maintenance costing £500,000 would be required to bring the building up to required building standards.&#34; see also Town centre library on the move – Morpeth Herald and Budget cuts see flooded Morpeth library close after 50 years as community’s hub – Chronicle Live.","2015/12/merry-christmas-everyone-2.html"],["Somerset","Mon, 21 Dec 2015 21:08:30 +0000","Somerset – Concerns over future of community building in Castle Cary after Caryford Hall bid rejected – Western Gazette. &#34;According to the Caryford Community Hall’s Management Committee their bid to manage the Swainson Building, opposite the hall, has been turned down by Somerset County Council. At a recent town council meeting an apparent rival bid to turn the building into a library ‘hub’ was discussed, with several councillors voicing their concerns that the Swainson Building was the wrong location for such a facility.&#34;","2015/12/merry-christmas-everyone-2.html"]]