[["Herefordshire","Tue, 02 Feb 2016 21:52:34 +0000","Herefordshire – Libraries are an essential service, so why are we losing them? – Hereford Times / Letters. &#34;Until the local authority abandoned its duty under the Public Libraries and Museums Act 1964 to provide a comprehensive and efficient library service, the services outlined for WISH were provided by a first class reference library, manned by professional librarians, in Hereford City and also in other branches of the county library. This, of course, is Tory ideology implemented merely to destroy public services.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Pembrokeshire","Tue, 02 Feb 2016 21:52:34 +0000","Pembrokeshire – New chapter for campaign to secure library’s future – Tivy-Side Advertiser. &#34;The newly established Newport Library Working Group is working with the county council to find a way forward and is now urging more people to join them in the fight to save the library. The group says it has already secured a reduction in rent on the current premises and many offers of volunteer help.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Brent","Tue, 02 Feb 2016 21:52:34 +0000","Brent – Brent Library Privatisation Ditched  – James Powney’s Blog. &#34;One aspect of the Brent Council Budget papers of particular interest to me is the proposed spinning off of the service into some sort of trust or possibly to an independent contractor.  I thought it unlikely that this would yield a real saving, and that it might adversely affect performance (which has been exceptionally good since the Libraries Transformation Project was implemented).  It is therefore good news that Brent Council has apparently now realised that it will not work and ditched the idea in the latest budget.  Unfortunately, the financial saving budgeted for even though the hoped for mechanism, to reduce business rates via a tax avoidance scheme, has been abandoned as unworkable.  The current Cabinet has therefore come back to the position the previous one decided on back in 2012/13.  The savings target of £160k will now have to come from the running of the service.  It would have been far better if the Cabinet had been more realistic is assessing the&#8230;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Swindon","Tue, 02 Feb 2016 21:52:34 +0000","Swindon – Libraries and Community-based Services – Emerging Model – Swindon Council. &#34;The current model of library service delivery is aimed at delivering a core library service through multiple delivery points across a range of locations. This model does not enable different levels of services or support to be provided for communities who face more challenges, and in particular, where communities have higher levels of need or deprivation.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Bournemouth","Tue, 02 Feb 2016 21:52:34 +0000","Bournemouth – &#34;You should get volunteers&#34; – councillor ‘throws the ball back’ to library campaigners at meeting&#34; – Daily Echo. &#34;Cllr Nick Rose, who represents Westbourne and West Cliff, suggested the council look at alternative volunteer-run models he said are used in &#34;villages around Dorset&#34;. &#34;I can’t see anywhere in here any proposals or suggestions about volunteers running the place with maybe supervision from a paid member of council staff,&#34; said Cllr Rose&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Bristol","Tue, 02 Feb 2016 21:52:34 +0000","Bristol – Library assistants must pass written exam to hold on to their jobs – Bristol Post. &#34;Library assistants in Bristol who are mostly women on low pay and work part-time must pass a written exam in the hope of holding on to their jobs. The number of library assistants is being cut from April because all of the city’s libraries are being kept open but with less opening hours. It means they must face a selection process because there are not enough vacancies elsewhere in the council to redeploy them to other jobs. A library assistant who contacted the Post said: &#34;Many assistants have over 20 years service, some have had long service awards, and all are dedicated to their jobs.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Lancashire","Tue, 02 Feb 2016 21:52:34 +0000","Lancashire – Local comedian helps campaign to save local Chorley library – Bee. &#34;There were poem and story readings, with campaigners dressing up as their favourite book characters. Joanne Bithell is the leader behind the campaign – she tells The Bee libraries are so important in the community;&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Lincolnshire","Tue, 02 Feb 2016 21:52:34 +0000","Lincolnshire – District news from Louth and surrounding areas – Louth Leader. &#34;Village library – Little more than three months after it was forced to close by Lincolnshire County Council’s austerity measures, Alford Library will reopen on February 2. Now run by volunteers, the facility will be known as Alford Focal Point and will be extending the facilities it provides to local residents.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Northumberland","Tue, 02 Feb 2016 21:52:34 +0000","Northumberland – Charity behind Northumberland’s leisure centres and libraries asks for £1m bailout – Chronicle. &#34;Non-refundable grant&#34; of £1m asked for, due to &#34;&#34;historic governance of the organisation and a significant financial deficit&#34;. Trust began in 2014. Council has asked for £3.5m cut over next two years.","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Northumberland","Tue, 02 Feb 2016 21:52:34 +0000","Northumberland – Event in Alnwick for National Libraries Day – Northumberland Gazette. &#34;The Alice in Wonderland-themed craft event takes place between 10.30am and noon for children aged four to 12″ … &#34;Any customer updating their contact details and choosing either email or text as their preferred notification method for information will be entered into the draw to win one of two seven-inch Kindle Fire tablets.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Shropshire","Tue, 02 Feb 2016 21:52:34 +0000","Shropshire – Shifnal Library refurbishment – Shropshire Council. &#34;Following a public consultation it has been agreed that Shifnal Town Council will take over the running of the Library and Customer Service Point from Shropshire Council.  They will move from their office in Broadway into the Library.  This involves building work and a refurbishment to provide a modern and flexible library space.  In order to achieve this, the library will need to close for a 6 to 8 week period from 1 February&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Central Bedfordshire","Tue, 02 Feb 2016 21:52:34 +0000","Central Bedfordshire – Sarah Winman to call in on National Libraries Day – Bedford Today. &#34;Central Bedfordshire Libraries are also hosting the ‘Mega Read’ in partnership with Headline Publishers and the Reading Agency. Already, 250 free copies of award-winning Sarah Winman’s newest and long-awaited novel, A Year of Marvellous Ways, has been handed out to members of the community ahead of her visit to Flitwick Library on Thursday, February 4 at 7.30pm. &#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Oxfordshire","Tue, 02 Feb 2016 21:52:34 +0000","Oxfordshire – Bicester town centre’s new library to open in April – BBC. &#34;The facility will form part of Franklins House, the town’s new £6.6m community building off Manorsfield Road. The current Bicester Library, in Old Place Yard, will close on 19 March and staff will spend the following six weeks moving its stock to the new site. Oxfordshire County Council said the new library will be larger and will have improved facilities.&#34; … &#34;The library is planned to have more public computers, WiFi internet, regular activities, and Bicester Local History Society and National Careers Service will both have their own areas. &#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Cheshire West and Chester","Tue, 02 Feb 2016 21:52:34 +0000","Cheshire West and Chester – Libraries sign up for global Harry Potter night – Guardian series. &#34;Cllr Louise Gittins, Cheshire West and Chester Council’s cabinet member for culture, leisure and wellbeing, said: &#34;It is so exciting to be joining up with thousands of other libraries, schools, bookshops and community centres …&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Dudley","Tue, 02 Feb 2016 21:52:34 +0000","Dudley – Dudley celebrations prepared for National Libraries Day – Halesowen News. &#34;Emma Purshouse and Michael Thomas will be at Dudley Library between 10am and 1pm to create personalised poems for people to take away .. During National Libraries Day we want to invite people to come into our libraries to find out what services are available and we want to show how libraries and reading can enrich and improve the lives of people everywhere.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Lincolnshire","Tue, 02 Feb 2016 21:52:34 +0000","Lincolnshire – Hub would be music to Holbeach Town Band’s ears – Spalding Today. &#34;As well as the potential to create a centre of excellence for music – with musicians from all backgrounds under one roof – it could open the way for grant-aid to help the band buy the Holbeach Library building at a cost of £100,000.&#34; … &#34;The library building is owned by Lincolnshire County Council, which is willing to sell it to the band, but the price tag means the band will have to seek grants&#34; … &#34;If the band can’t raise the sum, it will consider renting the library building which is due to be vacated later this year when the volunteers move to the Co-op.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Thurrock","Tue, 02 Feb 2016 21:52:34 +0000","Thurrock – Isn’t it time that all of Thurrock was on-line? – Your Thurrock. &#34; National campaign to get more people online and computer-savvy runs through the second half of February and Thurrock Council’s libraries are offering free sessions to help.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Derbyshire","Tue, 02 Feb 2016 21:52:34 +0000","Derbyshire – Libraries in Derbyshire could close following review – Burton Mail. &#34;library service in Derbyshire cannot continue unless the county council looks at some closures and further reductions in opening hours, says a leading councillor.&#34; Possible closures from 2017.","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Essex","Tue, 02 Feb 2016 21:52:34 +0000","Essex – Knit and natter naturals knock out 11,000 hats in charity drive – Essex Chronicle. &#34;he Big Knit challenge saw volunteers craft mini woolly hats in aid of Age UK Essex at Knit and Natter groups in libraries across Essex.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Isle of Wight","Tue, 02 Feb 2016 21:52:34 +0000","Isle of Wight – Local authors signing debut novels during National Libraries Day – Island Echo. &#34;It’s great to be part of National Libraries Day. Supporting your local library is very important&#34;.","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Lancashire","Tue, 02 Feb 2016 21:52:34 +0000","Lancashire – Free Press hands in your petition to save Valley’s libraries – Rossendale Free Press. &#34;More than 1,600 people – signing our petitions online and in the paper – backed the Free Press campaign to save the borough’s five libraries after Lancashire County Council (LCC) announced savage budget cuts.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Plymouth","Tue, 02 Feb 2016 21:52:34 +0000","Plymouth – Plymouth shop, pub, and mall to be transformed into pop-up libraries this weekend – Herald.","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Lincolnshire","Tue, 02 Feb 2016 21:52:34 +0000","Lincolnshire – Gallery: Hundreds at reopening of Deepings Library – Rutland and Stamford Mercury. &#34;More  1,000 people came through the doors of the revamped Deepings Library as it entered a new era of community involvement.&#34; … &#34;The group has taken over the running of the library after Lincolnshire County Council withdrew its funding. The council has spent about £175,000 refurbishing the building, and people were able to see what was new at the open day.&#34; … &#34;The library now has a paid co-ordinator, Louisa Crowson, whose role is funded partly from renting office space above the library out, partly from a precept increase by both Deeping St James Parish Council and Market Deeping Town Council, and partly from a private donation specifically for staff.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Sandwell","Tue, 02 Feb 2016 21:52:34 +0000","Sandwell – Libraries’ boost for dementia charity – Sandwell Council. &#34;Staff and customers of Sandwell Library and Information Service have raised £4,887 for Better Understanding of Dementia for Sandwell (BUDS).&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Suffolk","Tue, 02 Feb 2016 21:52:34 +0000","Suffolk – Kesgrave Library celebrates 10 years in permanent building – Ipswich Star. &#34;From modest beginnings in a portable cabin serving just a handful of residents to the thriving and fully-fledged service it has become, Kesgrave Library has undergone something of a transformation over the years.&#34; … &#34;Among some of the successes staff hailed were the take-up in Sunday craft activities, with nearly 1,400 children taking part in craft activities last summer, and 275 youngsters completing the Summer Reading Challenge last year.&#34;","2016/02/swindon-proposes-just-1-out-of-15-libraries-to-survive-scl-plans-2-day-conference.html"],["Barnet","Sun, 07 Feb 2016 21:27:39 +0000","Barnet – ‘They may as well stock it with weapons and tell people where to hit the bullseye’ – anger over unstaffed libraries – Time Series. Campaigners pretend to wreak havoc in Open+ library, including two collapsing and one smoking. No response from CCTV. &#34;People say they don’t want to go there at night because it is creepy when nobody works there. &#34;Smoke alarms might not even pick up smoking.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Bedford","Sun, 07 Feb 2016 21:27:39 +0000","Bedford – ​Is this the final chapter for libraries in Bedford Borough? – Bedfordshire News. &#34;there’s no getting away from the fact that cuts to Bedford Borough’s library service are inevitable and the council is currently consulting with the public on the future of its libraries. The service’s budget has been slashed by 25 per cent over the last four years. Rachael said: &#34;If some libraries have to close they must make sure there are affordable, accessible transport links to the remaining libraries.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Cardiff","Sun, 07 Feb 2016 21:27:39 +0000","Cardiff – Charlotte Church gives her backing to Cardiff’s arts campaigners as they protest against cuts – Wales Online. &#34;The march had a theme of a New Orleans funeral march, and a coffin was carried at the front of the protesters mourning &#34;the death of art&#34;.&#34; .. protest included libraries.","2016/02/it-was-a-happy-national-libraries-day.html"],["Northamptonshire","Sun, 07 Feb 2016 21:27:39 +0000","Northamptonshire – Union could launch legal bid to block Northamptonshire County Council’s outsourcing plans – Daventry Express. &#34;In a recent poll 93 percent of Unison members at the county council who replied said they were against the authority’s proposals to reduce its core workforce to about 200 people and deliver services such as adult social care, libraries and child protection through four mutual companies.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Sheffield","Sun, 07 Feb 2016 21:27:39 +0000","Sheffield – Sheffield residents celebrate National Libraries Day – Star. &#34;After speaking to volunteers of the library and seeing all the work they do Louise Haigh MP said &#34;It is always great to meet people who give up their spare time for their community. Libraries play an important role for everyone and offer a huge amount to our local area, whether its books, learning, access to computers or the huge range of activities that often take place there. I regularly hold surgeries in the libraries in my constituency, which are based in the heart of our communities. Local Libraries are as important today as they ever were. It was fantastic to see all the hard work the volunteers put in to Greenhill Library.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Southampton","Sun, 07 Feb 2016 21:27:39 +0000","Southampton – Optimistic mood for National Libraries Day at Cobbett – Bitterne Park Info. &#34;There was an optimistic feel to the National Libraries Day celebration at Cobbett Road Library on Saturday (Feb 6), following recent news that Social Care in Action and theatre group Unexpected Places have expressed an interest in running the branch – if they can raise enough cash – when Southampton City Council stops funding it in April.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Swindon","Sun, 07 Feb 2016 21:27:39 +0000","Swindon – Campaigner Shirley Burnham fears for future of town’s libraries – Swindon Advertiser. &#34;&#34;There’s no evidence-based mechanism for judging in advance whether community groups have either the capacity or capability to deliver a library service that is fit for purpose.&#34; … &#34;&#34;So, what has the library staff input into the strategy been, if any? I fail to find any evidence of it. All I can see is that it is to be every man for himself and the devil take the hindmost, leaving communities which cannot cope to whatever fate befalls them.&#34; &#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Bradford","Sun, 07 Feb 2016 21:27:39 +0000","Bradford – Bradford South MP joins fight against major cutbacks to district’s libraries – Telegraph and Argus. &#34;Bradford South Labour MP Judith Cummins is urging Labour-led Bradford Council to rethink its proposals to close all but seven libraries, if volunteers are not found to run them. &#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Newcastle","Sun, 07 Feb 2016 21:27:39 +0000","Newcastle – Vera author Ann Cleeves gives talk in Newcastle to children as ambassador of National Libraries Day – Chronicle. &#34;Ahead of her arrival at the city centre venue, where she gave a talk to children and launched a poetry competition, she said that without libraries she simply would not be doing what she does. &#34;I wouldn’t be a writer without libraries; there would be no Vera,&#34; said the creator of the character voted the UK’s favourite fictional detective in a poll last year.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Rhondda Cynon Taff","Sun, 07 Feb 2016 21:27:39 +0000","Rhondda Cynon Taff – Bus routes saved and NO single-staffed libraries in RCT as latest cuts are not as bad as we’d feared – Wales Online. &#34;RCT council’s cabinet members reduced proposed £937,000 cuts by almost £300,000 on Thursday &#34;… &#34;Coun Pauline Jarman, leader of the opposition Plaid Cymru group in RCT: &#34;I’ve always been opposed to single-staffed libraries and am pleased that this seems to be reflected by cabinet members today. In total, 172 people signed a petition about Mt Ash Library, and 37 people turned up to a consultation event in Hirwaun. That shows that people care.&#34;&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Swindon","Sun, 07 Feb 2016 21:27:39 +0000","Swindon – Nearly all libraries will be run by volunteers in 2020 – Swindon Advertiser. &#34;At this stage council chiefs believe there is enough time to find volunteers to avoid closures but have accepted there will need to be a ‘rationalisation’ of services if no-one is found at a particular site. &#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Bradford","Sun, 07 Feb 2016 21:27:39 +0000","Bradford – Why the hands of our libraries could lie with our communities – Telegraph and Argus. &#34;news that Bradford Council’s ruling Labour group has proposed shutting 17 libraries across the district, unless they can be taken over by volunteer groups, has prompted Baildon Youth Council to carry out its own study on the impact of closing the town’s library. Members quizzed fellow pupils at Titus Salt School aged mainly between 14 and 17. Of nearly 300 respondents, 60 per cent of youngsters who use the library didn’t want it to close&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Lancashire","Sun, 07 Feb 2016 21:27:39 +0000","Lancashire – New battles launched in bid to protect libraries – Lancashire Evening Post. &#34;A read-in event held last weekend at Coppull Library, near Chorley, was attended by 400 people including well-known comedian Dave Spikey.&#34; … &#34;Their quarrel isn’t with the county council, it’s with the Conservative MPs who are approving these massive cuts in spending,&#34; he said&#34; … &#34;Nearly 7,000 people have filled in a council questionnaire on the library service, either on line or by filling in forms available at local libraries.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Lancashire","Sun, 07 Feb 2016 21:27:39 +0000","Lancashire – Thousands oppose plans to axe libraries in Lancashire – Lancashire Telegraph. &#34;,300 people in Lancashire have voiced their opposition to plans to close 40 out of the county’s 72 libraries. No fewer than 15 petitions have been lodged with County Hall, opposing either general or specific library closures, the county council’s executive scrutiny committee has been told&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Suffolk","Sun, 07 Feb 2016 21:27:39 +0000","Suffolk – Suffolk Libraries urges public to support National Libraries Day tomorrow – Journal. &#34;Alison Wheeler, chief executive of Suffolk Libraries, said: &#34;National Libraries Day this year is giving a real focus to championing the  country’s libraries and reminding people that they have a right to them. &#34;We know from the feedback and stories we receive from staff  and customers how well loved and appreciated Suffolk’s libraries are.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["West Berkshire","Sun, 07 Feb 2016 21:27:39 +0000","West Berkshire – ‘Leak’ reveals West Berkshire library closures plan – BBC. &#34;Leaked proposals suggest the majority of libraries in West Berkshire will close, the BBC has been told.&#34; … &#34;Previously published budget cut included merging the libraries in Burghfield and Mortimer&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Brighton and Hove","Sun, 07 Feb 2016 21:27:39 +0000","Brighton and Hove – Hove Library to be moved not closed – Argus. &#34;The Carnegie Building isn’t designed for today’s needs, it’s very costly to run and is actually further away from the majority of users than Hove Museum. &#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Lincolnshire","Sun, 07 Feb 2016 21:27:39 +0000","Lincolnshire – The latest voluntary-run library opens in Lincolnshire market town – Lincolnshire Echo. &#34;Alford library has reopened as a completely volunteer-run facility under a new name – Alford Focal Point. It closed in September due to cost-cutting by Lincolnshire County Council.&#34; … &#34;Richard Quantrell, chairman of Alford Focal Point said: &#34;I think everyone is very pleased to see it open and we are encouraged by their excitement. &#34;This is more than a library, that’s why it is now called Alford Focal Point. &#34;It is a centre for knowledge, education and culture.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["East Sussex","Sun, 07 Feb 2016 21:27:39 +0000","East Sussex – Cuts to library hours looming on the horizon – Rye and Battle Observer. &#34;The proposals relating to Rye Library involve reducing the Monday opening hours from 9am – 5.30pm to 10am – 1pm and reducing the opening hours on Tuesday, Thursday and Friday from 9am – 5.30pm to 10am – 5pm. The Wednesday hours would be from 10am – 4pm, rather than the current 10am – 5.30pm hours, while Saturday would be 10am – 5pm, instead of 9am – 5pm.&#34; … &#34;The county council says the proposed cuts to library services could save £2 million in running costs and would involve an overall reduction of around 25 percent of current opening hours of libraries across the county&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Flintshire","Sun, 07 Feb 2016 21:27:39 +0000","Flintshire – Library opens in Deeside Leisure Centre but others shut – BBC. &#34;Three council-run libraries in Flintshire will shut this month when a new facility opens at Deeside Leisure Centre. The closure of Hawarden, Mancot and Queensferry libraries was agreed last year, partly due to funding cuts. But a group, Friends of Mancot Library, has been set up to to operate the existing building as a community library from March. The new library opens on 29 February and the others shut on different days.","2016/02/it-was-a-happy-national-libraries-day.html"],["South Lanarkshire","Sun, 07 Feb 2016 21:27:39 +0000","South Lanarkshire – Happy National Libraries Day 2016 – Scottish Libraries Wifi. &#34;Greenhills Library is marking National Library Day by teaming up with The Big Glasgow Comic Page to present the first ever South Lanarkshire Mini Comic Con&#34; .. &#34;It’s brilliant to see so many people here, and huge credit must go to the staff for taking the opportunity to promote all of the fantastic services that the library offers.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Vale of Glamorgan","Sun, 07 Feb 2016 21:27:39 +0000","Vale of Glamorgan – Vale of Glamorgan libraries community takeover plan – BBC News. &#34;Groups could assume responsibility for libraries in Sully, Wenvoe, St Athan, Dinas Powys and Rhoose from April if councillors approve plans on Monday. About £100,000 has been set aside to cover group set-up costs and make improvements to buildings if the leases and assets are transferred to them. It is hoped this will save the council £525,000 in 2015/16 and 2016/17.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Lambeth","Sun, 07 Feb 2016 21:27:39 +0000","Lambeth – Campaigners draw up battle plans for National Libraries Day – Brixton Blog. &#34;National Libraries Day, celebrating libraries nationwide Saturday (6 February) used to be called National Save Libraries Day. The library campaign in Lambeth plans to reclaim this name as it continues to battle the council’s plans to close libraries and transform some into gyms.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Lancashire","Sun, 07 Feb 2016 21:27:39 +0000","Lancashire – Thursday, 11th February, 2016 12.00 pm – Lancashire County Council. Motion: &#34;&#34;Lancashire County Council is known for having one of the best library services in the country. It also owns some important museums which are an important part of the county’s heritage. Following the recent Cabinet meeting, Council is concerned that there will be an insufficient consultation period before closures of libraries and museums are made. Council therefore resolves that an extended consultation period should be implemented to allow alternative delivery mechanisms to be explored.  Options to be considered should include, but not be limited to, charitable trusts, the private sector, voluntary sector and partnerships.&#34;&#34; see also Lancashire County Library Service consultation – stage one.","2016/02/it-was-a-happy-national-libraries-day.html"],["Newcastle","Sun, 07 Feb 2016 21:27:39 +0000","Newcastle – Highlighting the effect of Labour’s cuts in Newcastle on National Library Day – Newcastle Upon Tyne Liberal Democrats. Looks at cuts already in place in the borough. &#34;At the meeting of Newcastle City Council, Cllr Robin Ashby asked a series of questions (below) of Labour’s responsible councillor, mainly about Gosforth but equally applicable to most of the closures. He received no sensible response or promise of one, despite much trumpeting about Newcastle’s libraries in the media for National Library Day. You can judge Labour on what it says, or what it does….&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["South Gloucestershire","Sun, 07 Feb 2016 21:27:39 +0000","South Gloucestershire – Emersons Green Library: maintain current opening hours & oppose service cuts – Change.org. &#34;South Gloucestershire Council is proposing to cut weekly opening hours from the current, already insufficient, 38 hours per week to only 18 hours per week. That equates, perhaps, to only 3 part days opening per week. As well as the obvious impact on the staff members, who will see their hours cut or find themselves made redundant, there are innumerable consequences that will be felt by the community at large.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Leicestershire","Sun, 07 Feb 2016 21:27:39 +0000","Leicestershire – Library opening set to double in Ratby – Leicestershire County Council. &#34;Leicestershire’s latest community partnership library will open its doors on Monday (8 February) in Ratby, when the county council hands over the keys to a local group.  Graham Stanley, chair of the Ratby Library & Community Group said: &#34;Since setting up an independent group we’ve created a charity business and recruited a fantastic group of committed volunteers, including six-form students from Groby Community College. &#34;We shall more than double the library building’s previous opening hours and be open every day except Sunday and we hope to improve the building’s current operating income.&#34; He revealed the group was raising £115,000 to alter the building&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Liverpool","Sun, 07 Feb 2016 21:27:39 +0000","Liverpool – Visits to Liverpool’s libraries tumbled 150,000 last year – Echo. &#34;The city’s network of libraries and its home service had 1.66m visitors in 2015, figures released exclusively to the Echo show. This was 153,936 people fewer than the city’s 2014 total, and Fazakerley, Spellow and Toxteth libraries saw particularly big falls in visitor numbers.&#34;.  Council says &#34;&#34;There is always an annual fluctuation in the numbers and thanks to national and local reading campaigns we saw a spike in 2014 which bucked the trend across the rest of the country.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Stockport","Sun, 07 Feb 2016 21:27:39 +0000","Stockport – Stockport expands library service – Cheshire Today. &#34;From Saturday 6 February, Stockport and six other Greater Manchester councils’ libraries networks will operate a shared online catalogue system – giving access to 2.8 million books and other items held by the participating library services. People in Stockport will be able to search for books in any of the participating councils’ collections, reserving items using their existing Stockport Libraries card. Manchester, Bolton, Oldham, Rochdale, Salford, and Trafford councils are all included in the shared Library Management System (LMS) scheme, as are Blackburn with Darwen Council – with Tameside joining later this year.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Sutton","Sun, 07 Feb 2016 21:27:39 +0000","Sutton – Beddington library and mobile service scrapped in bid to slash £1m from council budget – Guardian series. &#34;Sutton Council has scrapped its mobile library service and will close Beddington library, despite the public preferring the use of volunteers to keep services open. Council approved the closures at the Environment and Neighbourhood Committee meeting last night, blaming &#34;draconian cuts&#34; for the need to slash £1m from its £4.4m library budget. Closing Beddington library and the mobile service will save the council £153,000 a year.&#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Southampton","Sun, 07 Feb 2016 21:27:39 +0000","Southampton – Preferred options for groups to take on all five libraries in Southampton that could close – Daily Echo. &#34;Seven groups came forward to take over the five libraries – and library campaigners now say they have a &#34;glimmer of hope&#34; that they will not be marking their last National Libraries Day today. &#34; … &#34;Labour council chiefs have insisted at every opportunity that the plan is not to close the libraries, but to allow community groups take them on and deliver a &#34;sustainable&#34; future for them&#34; … &#34;Conservative leisure and finance spokesman John Hannides, to accuse her and Labour of &#34;hypocrisy&#34;, saying: &#34;I find it very hypocritical that people who are very quick to tell us how important the libraries are are the very same ones who are proposing to close half of the city’s libraries. &#34;","2016/02/it-was-a-happy-national-libraries-day.html"],["Bolton","Tue, 09 Feb 2016 22:02:07 +0000","Bolton – Bolton library card holders to get access to millions more books stored in libraries across North West – Bolton News. &#34;Bolton and six other Greater Manchester councils’ libraries networks will operate a shared online catalogue system — giving access to 2.8 million books and other items held within the participating library services. &#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Cambridgeshire","Tue, 09 Feb 2016 22:02:07 +0000","Cambridgeshire – ‘Our lobbying has paid off’ says Steve Count as Cambridgeshire County Council nets extra £3.2m – Cambridge News. &#34;The county council has been handed the sum for 2016/17 and 2017/18, as Whitehall wilted to pressure from cash-strapped councils across the land.&#34; … &#34;No party has overall control at Shire Hall – prompting fears of budget deadlock at the meeting of full council next Tuesday. &#34;Most of the other parties at the council want to charge an additional 2 per cent, and therefore burden residents of Cambridgeshire with a higher council tax bill,&#34; Cllr Count added.&#34; … &#34;School crossing patrols, mobile libraries, community transport and road maintenance have all been spared from the chop.&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Kirklees","Tue, 09 Feb 2016 22:02:07 +0000","Kirklees – Book lovers abandon Kirklees libraries in their droves – Huddersfield Daily Examiner. &#34;There were nearly a quarter-of-a-million fewer visits overall compared to 2012/13. Huddersfield’s central library suffered a drop of over 100,000 visits during that time. The library on Princess Alexandra Walk had a total of 508,982 visitors during 2014/15, figures released exclusively to the Examiner show.&#34; … &#34;Even so, Kirklees’ network of libraries had 1.96m visitors last year.&#34; … &#34;The biggest drop from 2013/14 to last year – a fall of 41% – was Thornhill Lees which is set for closure in April.&#34; … &#34;The shrinkage in library visits has been revealed amid a huge shake-up of the library service.&#34; [NB. This is still nearly 4.5 visits per year for every man, woman and child in the borough – Ed.]","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Swindon","Tue, 09 Feb 2016 22:02:07 +0000","Swindon – Library calls not useful – Swindon Advertiser. &#34; Coun Gary Perkins suggested that Wroughton’s library could be relocated within the Ellendune Community Centre.  This proposal has not been discussed with either Wroughton Parish Council or the Ellendune Community Trust and it is not mentioned in the report to Swindon’s Cabinet. It would therefore seem that this suggestion does not form part of Swindon’s current proposals.  Wroughton’s library is much valued and loved by local residents and Coun Perkins’ comments have caused unnecessary alarm and distress in the community.&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Telford and Wrekin","Tue, 09 Feb 2016 22:02:07 +0000","Telford and Wrekin – At least four of six under-threat Telford libraries will be safe, say council leaders – Shropshire Star. &#34;Telford & Wrekin Council cabinet member Councillor Shaun Davies made the claim as he revealed a deal had been brokered to save Hadley Library following talks between Hadley & Leegomery Parish Council and Hadley Learning Community (HLC), where it is sited.","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Telford and Wrekin","Tue, 09 Feb 2016 22:02:07 +0000","Telford and Wrekin – Hadley Library set to be saved as Council hails response to budget cuts – Shropshire Live. &#34;It looks extremely likely that Hadley Library will now be saved as a result of a deal between Telford & Wrekin Council, Hadley and Leegomery Parish Council and the Hadley Learning Community. Telford & Wrekin Council says it is confident that more positive announcements will be able to be made in relation to the future of other libraries in due course, although all changes to the proposed cuts are subject to the approval of the council’s Cabinet.&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Lincolnshire","Sun, 14 Feb 2016 20:21:51 +0000","Lincolnshire – Lincolnshire Campaigner reports from #SUFLlobby2016 – Save Lincolnshire Libraries. &#34;The campaigners I spoke to were very positive, but realistic. There was growing concern about volunteer run libraries, rabid cuts by local authorities, and suspicion of organisations like Greenwich Leisure Ltd. Some had insinuated themselves onto &#34;user boards&#34;, others were just beginning to understand the magnitude of the fight ahead.&#34; … &#34;In many ways it was a sad day hearing about the dreams of so many people destroyed needlessly, in my opinion. We are a long way down the line here in Lincolnshire, but I shall pass on these notes to colleagues and friends here in the hope that they see they do not stand alone, and that support to fight in still exists. Nor am I naive enough to believe that my MP is going to do anything to pull things back to where they were.&#34;","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Swindon","Sun, 14 Feb 2016 20:21:51 +0000","Swindon – Librarians showed appreciation with giant Valentine’s Day card – Swindon Advertiser. &#34;As part of Swindon Borough Council’s plans cut the costs of library services a suggestion has been made to relocate Wroughton Library and sell the building – a course of action which has been met with fierce opposition in the village. To show library staff how much their work at the library means to the village, Talis Kimberley-Fairbourn created a special Valentine’s-themed card and rallied friends and supporters to deliver it.&#34;","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Cheshire West and Chester","Tue, 09 Feb 2016 22:02:07 +0000","Cheshire West and Chester – Fate of Bishops’ High and Elton libraries hangs in the balance – Chester Chronicle. &#34;The local authority is asking for views on proposals for Bishops’ High and Elton libraries which would see them close to the public and be replaced with alternative ways to access the libraries service.&#34; … &#34;Elton Library is located in a community centre in the village of Elton. The library is currently open on a Thursday afternoon for 4.25 hours and provides a small selection of book stock for lending. There are no IT facilities. It is proposed to offer an improved library service to Elton residents via the mobile library.&#34; … &#34;Bishops’ High Library is a dual-use library based at Bishops’ Blue Coat High School in Great Boughton. It is open for ten hours a week split between Mondays and Thursdays and is used by the school for the rest of the week. The consultation explains how it is proposed to withdraw public access to Bishops’ High Library and provide alternative access to the public library service from&#8230;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Swindon","Tue, 09 Feb 2016 22:02:07 +0000","Swindon – Council urged to reconsider library decision – Swindon Advertiser. Nick Poole of CILIP condemns decision. &#34;a new low&#34;.","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Wiltshire","Tue, 09 Feb 2016 22:02:07 +0000","Wiltshire – Save our libraries – Swindon Advertiser. Letter write concerned that Wiltshire councillor says volunteers should replace paid staff.","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Darlington","Tue, 09 Feb 2016 22:02:07 +0000","Darlington – ‘Don’t sacrifice our libraries’ – Darlington Arts group urges council rethink – Northern Echo. Concerns over Cockerton Library. &#34;the case of Cockerton Library, Darlington Borough Council has had several opportunities to work with the community over the past three years in order to devise a future for the library and has failed to take advantage of them. &#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Hertfordshire","Tue, 09 Feb 2016 22:02:07 +0000","Hertfordshire – New opening hours for libraries – Herts Direct. &#34;Library opening hours across Hertfordshire have changed in response to feedback from library users across the county.&#34; … &#34;From November, Watford Central Library will join Borehamwood, Harpenden and Hoddesdon in offering ‘Library Express’ – where part of the library is opened for extended hours. Meanwhile, Bovingdon, Harpenden, Radlett and Waltham Cross Libraries offer extended access through ‘supervised self-service’ with the support of volunteers and partner organisations. &#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Warwickshire","Tue, 09 Feb 2016 22:02:07 +0000","Warwickshire – New Southam library is now open – Leamington Observer. &#34;The long-awaited facility has been built on Tithe Place – the same location as the former library – as part of a £12.4million project which also includes 75 retirement apartments and a neighbourhood police office. Warwickshire County Council made an arrangement with Orbit Homes whereby the land could be developed in exchange for the new library being provided as part of the development. Southam county councillor John Appleton said: &#34;We are pleased that the library’s site is now accommodating so many services for local people. &#34;The library itself will offer more computers and a much more versatile space inside for adults and children, reading groups and many others who would like to use it.&#34;  see also Southam library opens week ahead of schedule – Warwickshire News.","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Warwickshire","Tue, 09 Feb 2016 22:02:07 +0000","Warwickshire – Plans unveiled to axe Sunday opening at three Warwickshire libraries – Coventry Telegraph. &#34;The county’s larger hub libraries currently open for four hours each on Sundays, but it has been argued that reducing opening hours to six days a week in the three branches will reduce running costs by nearly £55,000 a year. &#34; … &#34;&#34;While Sundays are not the busiest day of the week for the three libraries, Sundays generate expensive running costs.&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Bath and Northeast Somerset","Sun, 14 Feb 2016 20:21:51 +0000","Bath and Northeast Somerset – Winning design to feature on library cards – Somerset Guardian. One prize for adults and one for children.","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["East Renfrewshire","Sun, 14 Feb 2016 20:21:51 +0000","East Renfrewshire – Workers’ union reinforces opposition to school library cuts – Barrhead News. &#34;Unison claims that it has uncovered evidence of a consistent pattern of school library services being a soft target to meet budget cuts, saying school libraries are vital for young people’s learning and have a central role in equipping our younger people from disadvantaged backgrounds for the digital age. &#34; … &#34;More than 2,500 people signed the petition which was created after multiple local authorities, including Barrhead’s, announced cuts to school library services. Under plans to plug a £20 million funding gap, East Renfrewshire Council’s education department is proposing a 50 per cent reduction in school library services, meaning pupils would have access to a library service less than half the week.&#34;","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Leeds","Sun, 14 Feb 2016 20:21:51 +0000","Leeds – New chapter for Leeds Library Festival – Yorkshire Evening Post. &#34;Jedi Knights, gaming fans and bookworms are set to turn over a new leaf with the return of the Leeds Library Festival. The second annual literary celebration is once again set to &#34;stamp out the shhh&#34; across the city from today.&#34; … &#34;For the first time, the festival will also include events at the historical independent subscription library, The Leeds Library and the Treasures of the Brotherton Gallery at the University of Leeds.&#34;","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Dorset","Tue, 09 Feb 2016 22:02:07 +0000","Dorset – A national charity is encouraging more families to visit libraries – Dorset For You. Looks at BookStart sticker scheme.","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Lancashire","Tue, 09 Feb 2016 22:02:07 +0000","Lancashire – Community ownership of assets and community service provision – Lancashire County Council. &#34;Over the coming months there will be a number of opportunities for interested parties to potentially take over the management of council buildings or provision of services and we would welcome expressions of interest. &#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Southampton","Tue, 09 Feb 2016 22:02:07 +0000","Southampton – Author Sandra Horn joins fight to keep five libraries in Southampton open – Southern Daily Echo. &#34;Sandra was one of several people who helped a group called Friends of Cobbett Road Library stage a day of free activities at the facility on Saturday. Members marked National Libraries Day by highlighting the importance of the building, which has been at the heart of the community since 1939. Sandra, who took part in storytelling sessions for children, said she was &#34;devastated&#34; when she first heard that the city council was planning to axe the service to save money&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Swindon","Tue, 09 Feb 2016 22:02:07 +0000","Swindon – Is this the final chapter for Swindon’s libraries as locals denounce 60% cuts?  – Guardian. &#34;The weekly event of Rhyme Time is one that would pass by most residents of Swindon. But for the dozen or so parents who come every week with their children – some as young as three months – it is one of the simple yet essential services offered by their local library. And, as such, it is under threat.","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["West Berkshire","Tue, 09 Feb 2016 22:02:07 +0000","West Berkshire – Newbury author Robert Harris attacks library cuts – BBC. &#34;Conservative-run West Berkshire Council has proposed shutting down several small libraries as part of £18.9m cuts next year. Harris, author of Pompeii, said the news of the plans &#34;hit me like a bombshell – I couldn’t believe a limb is being amputated in that way.&#34; The authority said it had been left with &#34;no choice&#34; in the face of cuts.&#34; … &#34;Local Government Secretary Greg Clark announced a £90m increase in funding for rural councils in 2017 after complaints from local authority leaders that they’re not as well funded as urban areas.&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Hertfordshire","Tue, 09 Feb 2016 22:02:07 +0000","Hertfordshire – Blind dates with books mark national libraries day in Hitchin – Hertfordshire Mercury. &#34;Titles were hand-picked by staff, who then wrapped them and wrote a brief description on the packaging. Readers both famous and local wrote tributes to libraries about what the service means to them and took part in a quiz.&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Lancashire","Tue, 09 Feb 2016 22:02:07 +0000","Lancashire – Lancashire Archive Service consultation 2016 – Lancashire Archive Service. &#34;However, the Archive Service must operate with a significant reduction of 33% to its current overall budget. In order to meet these budget challenges we are proposing to change the hours the service will be open to&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Lambeth","Tue, 09 Feb 2016 22:02:07 +0000","Lambeth – GLL chief replies to union accusations – Brixton Blog. &#34;Mark Sesnan, managing director of GLL, the organisation that runs Lambeth council’s leisure services and is set to turn three of its libraries into gyms, has told Brixton Blog that: &#34;We believe in the future of libraries. We want to protect and improve them and extend opening hours and improve accessibility&#34; … &#34;He said GLL had &#34;nothing to do&#34; with a decision on the future of the mobile library service in Greenwich. &#34;This is a council decision and they are currently consulting the public on the future of that service,&#34; he said, adding that the consultation is not due to end until the middle of next month.&#34; … &#34;Sesnan also told Brixton Blog that the unions’ charge that threequarters of GLL staff are on zero hours contracts is not true, adding: &#34;many of our staff, such as coaches and exercise and swim teachers, do work sessional hours&#34;.&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Lambeth","Tue, 09 Feb 2016 22:02:07 +0000","Lambeth – Lambeth Councillor Scott Ainslie joins Brixton Library picket ahead of Cabinet protest tonight, Mon 8th Feb – Brixton Buzz. &#34;The campaign to save Lambeth libraries has gathered momentum after Cabinet rubber-stamped a decision to sell off Waterloo Library and gift South Lambeth, Minet and Carnegie Libraries to Greenwich Leisure Limited to run as gyms. A fifth library, Upper Norwood, will be turned into a &#34;community hub&#34;. &#34;The council decision leaves no libraries at all in the borough north of Brixton, an area where more than 40% of people live in social housing and many households rely on library services,&#34; added Cllr Ainslie.&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Powys","Sun, 14 Feb 2016 20:21:51 +0000","Powys – Powys libraries’ £13k unpaid fines – News North Wales. &#34;Users are still to cough up the money for 2,623 fines accrued last year however, meaning a potential £13,000 is still at large from 2015 alone, in what would otherwise provide a welcome funding boost to libraries across the county. The maximum £5 per item and £10 fine per user sees them blocked from taking out any more books until their bill is paid. With 1,758 fines still outstanding from August 2013 to July 2014, there is no guarantee libraries will get their money or their books back.&#34;","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Somerset","Sun, 14 Feb 2016 20:21:51 +0000","Somerset – Town’s library has moved on, nobody says &#34;shush&#34; any more – Frome Standard. Looks at the changes and improvements and mentions the national petition.","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Lancashire","Tue, 09 Feb 2016 22:02:07 +0000","Lancashire – Battle to stop sell-off of Garstang Library coming to a head – Garstang Courier. &#34;petition to save the library has been set up with 326 signing up to save the library. The closing date for signatures is February 16. With National Library Day on Saturday, Julie Dobson, communications office at LCC, said: &#34;We’ve now come to the end of stage one of the process. We will now analyse the responses, finding out what is important to the public and what they want from the library services moving forward. There’s no timeline as to when stage two will begin, but when it does, it will be a 12 week consultation with the public. On February 11 we’ll have a full council meeting and there we will see what resources we have and what money we have got to implement the changes people want to see.&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Lincolnshire","Tue, 09 Feb 2016 22:02:07 +0000","Lincolnshire – Rasen MP Sir Ed condemns &#34;unfair&#34; funding cuts – Market Rasen Mail. Notes libraries and other services cut and that other reductions would be unfair.","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Vale of Glamorgan","Tue, 09 Feb 2016 22:02:07 +0000","Vale of Glamorgan – Community groups will take over control of five Vale of Glamorgan libraries – Wales online. &#34;Five libraries in the Vale of Glamorgan which were under threat of possible closure will be taken over by community groups. Libraries in Dinas Powys, Sully, Wenvoe, St Athan and Rhoose will be taken over by community groups from April. Vale of Glamorgan council say they will provide £100,000 for set-up costs and improvements.&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["West Berkshire","Tue, 09 Feb 2016 22:02:07 +0000","West Berkshire – West Berkshire libraries set to close due to £19m council cuts – Newbury Today. &#34;It could mean seven libraries, many of which serve the most rural and isolated communities, will be closed down. The proposals are belived to include Wash Common, Burghfield Common, Hungerford, Lambourn, Pangbourne, Theale and Mortimer.The council described the closure of libraries as &#34;unthinkable&#34; weeks ago, but said it had been left with little choice as is battles with a 44 per cent reduction in government funding. One library employee, who didn’t want to be named, told Newburytoday: &#34;We got the phone call from the council. &#34;They said they are proposing to cut all the libraries except Newbury and Thatcham. It’s devastating news.&#34;&#34;","2016/02/speaking-up-for-libraries-deep-cuts-to-west-berkshire-and-darlington-new-library-in-warwickshire.html"],["Calderdale","Sun, 14 Feb 2016 20:21:51 +0000","Calderdale – Youngsters are loving our libraries – Halifax Courier. &#34;Bookworms across Brighouse had a great day full of activities on Saturday in celebration of National Libraries Day. The aim of the day was to highlight activities that local libraries across the district could offer and see the joy that a Library membership can bring.&#34;","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Darlington","Sun, 14 Feb 2016 20:21:51 +0000","Darlington – Bringing to book the library founder – Northern Echo. &#34;It is ironic that Darlington council no longer feels that the ratepayers of the town can support a fully functioning library because back in the early days of libraries, the ratepayers of the town refused to allow their pennies to be spent on a public library.&#34;","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Sheffield","Sun, 14 Feb 2016 20:21:51 +0000","Sheffield – Opinion: Help write a happy ending for libraries – Sheffield Star. &#34;were libraries forced to become volunteer run because they weren’t being used enough, or are they now not being used as much because they are no longer operated by Sheffield Council? One thing is for certain: the efforts of those who are volunteering to keep the libraries open cannot be faulted.&#34;","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Swindon","Sun, 14 Feb 2016 20:21:51 +0000","Swindon – What do you want from the library service? – Swindon Advertiser. Consultation &#34;on the future of library provision in Swindon will officially begin next week as council chiefs look to save 60 per cent from the budget&#34;","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Birmingham","Thu, 11 Feb 2016 22:55:25 +0000","Birmingham – Council cuts blamed as Library of Birmingham trust wound up – Birmingham Post. &#34;Trustees claim council cuts made it impossible to attract more private funding into the Library of Birmingham after its charity arm was wound up. As the Mail revealed last week, the Library of Birmingham Development Trust, established by Lord Whitby to boost its income, has been axed following a series of financial blows for the city’s top attraction. The trust, which was wound up at a meeting on Tuesday, was established by then council leader Mike Whitby with plans to raise more than £2 million a year – although never got near those lofty heights. Trustee Randall Brew, the Conservative councillor who took over from Lord Whitby on the board, said swingeing cuts to the library – which have seen around half of staff axed – made it hard for the trust to attract philanthropists.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Brent","Thu, 11 Feb 2016 22:55:25 +0000","Brent – Childrens’ laureate reads books to youngsters at Preston Community Library from Pakistan – Brent and Kilburn Times. &#34;Children sat enraptured as a community reading room in Wembley held a unique event to celebrate National Library Day with a live link to Pakistan&#34; … &#34;Volunteers at the Preston Community Library in Carlton Avenue East, pulled out all the stops with a live link to childrens’ laureate Saman Shamsie, who read her books to the young residents from a literary festival in Karachi. The Pakistani author launched a creative writing challenge when she visited Mount Stewart School in Mount Stewart Avenue, Kenton, last summer, which gave a platform for all local children to join in.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Lancashire","Thu, 11 Feb 2016 22:55:25 +0000","Lancashire – Campaign to save Tarleton Library launched ahead of budget meeting – Visiter. &#34;A Facebook group, with almost 100 likes has been started and a petition with over 500 signatures has been submitted to Lancashire County Council&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Northern Ireland","Thu, 11 Feb 2016 22:55:25 +0000","Northern Ireland – Children leading by example in our libraries – Belfast Telegraph. &#34;How reassuring to read how well-used the libraries are – especially by children (News, February 5). Well done, Northern Ireland. &#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Birmingham","Thu, 11 Feb 2016 22:55:25 +0000","Birmingham – Library of Birmingham might be unworkable – but that’s no reason not to try – Birmingham Mail / Opinion. &#34;Making sense of a library which spends far more on interest than it does on books is an unenviable proposition.&#34; … &#34;Interest payments on the library cost Birmingham £1 million every month. That is £33,000 every day or £1,370 every hour for interest alone.&#34;… &#34;With a plethora of universities in easy reach, not to mention the Paradise and Arena Central developments in spitting distance, opportunities should be abound for support. Clearly, they have not been thus far.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Lincolnshire","Thu, 11 Feb 2016 22:55:25 +0000","Lincolnshire – Ringing the changes – Secret Librarian. &#34;An urgent email was received today informing staff that a series of briefing meetings will be held over the next two weeks as a formal thirty day consultation exercise will begin next week with all of those staff who are transferring to the new organisation under the Transfer of Undertakings (Protection of Employment ) Regulations (TUPE) 2006″ … &#34;A mood of weary cynicism just seems to be pervading at the moment however as staff are resigned to yet more change and disruption.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Newcastle","Thu, 11 Feb 2016 22:55:25 +0000","Newcastle – Warning: Fears over plummeting visitors to Newcastle’s libraries sparks warning – Chronicle. &#34;Thousands of children are growing up having never visited a library as plummeting visitor numbers reveal a book-lending crisis. Newcastle’s libraries lost more than 220,000 visitors last year prompting concerns that vital access to free books is dying out.&#34; … &#34;The city’s network of libraries and its home service had 1.44m visitors in 2015, figures released to the Chronicle show. This was 227,856 people fewer than the city’s 2014 total. While the main city centre library continues to flourish, concerns have been raised about the smaller, estate libraries.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Stoke","Thu, 11 Feb 2016 22:55:25 +0000","Stoke – Kathie McInnes: The changing face of our libraries – Stoke Sentinel. &#34;libraries are what we make them. And in return, they make us who we are today.","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Swindon","Thu, 11 Feb 2016 22:55:25 +0000","Swindon – Written questions and answers: Cabinet 10th February 2016 – Friends of Old Town Library. &#34;Our first step is to develop the strategy, which comes from the engagement process.   I hope that we will receive a wide range of contributions.  It is legal for any council to go out to consultation with just one option on any policy.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Bradford","Thu, 11 Feb 2016 22:55:25 +0000","Bradford – Libraries host Lego sessions for toddlers – Telgraph and Argus. &#34; children will have the opportunity to be constructive and learn new skills with an educational play programme using Lego or Duplo.&#34; … &#34;Sessions will be led by Keith Moran of Bricks4Kidz over a four-week period and will include singing and free play along with a guided challenge activity involving building an animal or vehicle with parents or carers.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Lambeth","Thu, 11 Feb 2016 22:55:25 +0000","Lambeth – Mark Rylance comes out against Lambeth Library Closures – Lambeth Green Party. &#34;Mr Rylance said: &#34;To sell them off to private interests is a betrayal of the wishes of someone like Mr. Carnegie who educated himself out of extreme poverty as an immigrant in America. How did he do that? At a Library.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Leicestershire","Thu, 11 Feb 2016 22:55:25 +0000","Leicestershire – Last ditch attempt to save Barwell ‘lifeline’ – Nuneaton News. &#34;During the recent National Libraries Day protesters did their best to try and save Barwell Library from shutting down. The team, made up of politicians and concerned residents were in Hinckley Library for the event. Councillor Michael Mullaney, the Liberal Democrats Parliamentary spokesman for Hinckley and Bosworth, and Mathew Hulbert, a former councillor for Barwell, wanted to highlight the role public libraries play in communities across the country. They were also backing the ‘My Library By Right’ campaign, a national initiative supporting the public’s right to quality libraries.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Warwickshire","Thu, 11 Feb 2016 22:55:25 +0000","Warwickshire – Alcester Library reopens following Globe House move – Redditch Advertiser. &#34;The library is open weekdays (except Tuesday) from 9.30am to 5.30pm. On Saturdays, library staff will be on hand from 10am to 1pm and people can still borrow and return books as well as having computer, photocopying and printing access between 1pm and 4pm. The new facility joins the Roman Museum and Town Council at the hub. Recently, Warwickshire County Council agreed to enter a 99-year lease for the Globe House building securing its future.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Bromley","Thu, 11 Feb 2016 22:55:25 +0000","Bromley – Bromley and Greenwich library staff on strike amid potential cuts – This is Local London. &#34;Bromley library staff lobbied parliament today (February 9) to protest the privatisation of services and plans to replace employees at 14 libraries in the borough with volunteers. With the support of their union, Unite, Bromley staff are joined in their strike by Greenwich library employees, who are demonstrating against the closure of their mobile library service. A week of industrial action started on Saturday (February 6), with Bromley Library staff staging a march down the High Street.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Manchester","Thu, 11 Feb 2016 22:55:25 +0000","Manchester – Levenshulme’s new Arcadia Library and Leisure Centre set to welcome first visitors – Manchester Evening News. Old Levenshulme library closes: &#34;Campaigners hope the historic building can be transformed into a community arts and cultural centre.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Stockton","Thu, 11 Feb 2016 22:55:25 +0000","Stockton – UK’s first library-based building society branch looks to land in Yarm – BDaily. &#34;The partnership between Stockton Borough Council and Newcastle Building Society to push forward the realisation of the UK’s first library-based building society branch is edging ever-closer. A consultation event was jointly held between the two bodies, showcasing plans to Yarm residents, who gave the project their ‘stamp’ of approval.&#34; … &#34;The partnership between Newcastle Building Society and Stockton Borough Council forms part of the Council’s wider refurbishment plans for the new look library. The community-based branch will be able to support local peoples’ saving and borrowing needs and will also offer financial advice on site through its financial advice subsidiary Newcastle Financial Services Limited.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Coventry","Thu, 11 Feb 2016 22:55:25 +0000","Coventry – Coventry council pressing on with £1.2m of cuts to libraries, play centres and public toilets – Coventry Telegraph. &#34;Thousands responded to the plans during an eight-week public consultation which saw 80 meetings take place and more than 12,000 people contacted directly by the council. But the only change set to be made to the far-reaching strategy is a minor tweak to opening hours at three of the city’s 17 libraries.","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Greenwich","Thu, 11 Feb 2016 22:55:25 +0000","Greenwich – Bromley and Greenwich library staff on strike amid potential cuts – This is Local London. &#34;Bromley library staff lobbied parliament today (February 9) to protest the privatisation of services and plans to replace employees at 14 libraries in the borough with volunteers. With the support of their union, Unite, Bromley staff are joined in their strike by Greenwich library employees, who are demonstrating against the closure of their mobile library service. A week of industrial action started on Saturday (February 6), with Bromley Library staff staging a march down the High Street.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["East Sussex","Thu, 11 Feb 2016 22:55:25 +0000","East Sussex – ‘Great improvement’ to Hastings Library approved by planners – Hastings Observer. &#34;The Grade II listed building in Claremont is set for major internal alterations allowing the children’s library in nearby Robertson Passage to relocate alongside facilities for adults.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Kent","Thu, 11 Feb 2016 22:55:25 +0000","Kent – Anti-cuts demo outside Kent County Council budget talks – BBC. &#34;The Unite union said schools, libraries and street cleaning would be cut and Unison said the 2% social care precept would not cover costs.&#34; … &#34;&#34;They should draw on the £50m which is sitting idly by while they are cutting services and closing down mobile libraries,&#34; he said.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Northamptonshire","Thu, 11 Feb 2016 22:55:25 +0000","Northamptonshire – Magic Kitten author from Northampton celebrates 10 years…and millions of readers – Northampton Chronicle. &#34;The books – about Flame, a kitten with magical powers who is really young white lion in his home world – have made Sue one of the most borrowed authors in the UK from public libraries – coming in at position 258 overall last year.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Telford and Wrekin","Thu, 11 Feb 2016 22:55:25 +0000","Telford and Wrekin – Second Telford library to be reprieved – Shropshire Star. &#34;The running of Dawley Library is set to be taken on by Great Dawley Town Council. Details of an agreement with officials at Telford & Wrekin Council are being finalised. The borough council has also made an offer to Newport Town Council that would see the town’s library preserved.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Warrington","Thu, 11 Feb 2016 22:55:25 +0000","Warrington – Nine libraries in Warrington to trial reduced opening hours from Monday – Warrington Guardian. &#34;hours at nine libraries in the town will be slashed by up to 11 hours a week from Monday as part of a trial month by LiveWire. The new timings will be trialled and if deemed successful the organisation will look to implement them permanently.&#34; …&#34;The move will see opening times cut by; 11 hours at Birchwood, Padgate 10 hours, Culcheth eight hours 30 minutes, Warrington Central eight hours, Penketh five hours 30 minutes, Lymm and Orford four hours and Stockton Heath and Westbrook three hours and 30 minutes. &#34; … &#34;The review revealed just two users were accessing some libraries during their first half an hour of opening, with the hours of 6pm to 7pm also generally among the quietest periods. &#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Lancashire","Thu, 11 Feb 2016 22:55:25 +0000","Lancashire – House of Lords challenge to Lancashire’s library cuts – Lancaster Guardian. &#34;Lancashire’s plan to shut 40 of its 74 libraries was being challenged in the House of Lords today as county councillors were meeting in Preston to vote through the biggest raft of cuts in living memory. Liberal Democrat peer Lord Tony Greaves was due to condemn the &#34;destruction&#34; of the library service in the county as &#34;a disaster&#34; after tabling an oral question in the Lords.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Stockton","Thu, 11 Feb 2016 22:55:25 +0000","Stockton – Two Stockton libraries under threat of closure as council tries to balance books – Gazette Live.","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Leicestershire","Thu, 11 Feb 2016 22:55:25 +0000","Leicestershire – Have your say on community services of the future – Loughborough Echo. &#34;Leicestershire County Council has launched the consultation on the future shape of its communities and wellbeing service as part of plans to save more than £1.8 million by 2018. It currently spends £5.7 million per year. The consultation will run for three months, until midnight on May 2, with the findings reported back to the council’s ruling cabinet in June.&#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Manchester","Thu, 11 Feb 2016 22:55:25 +0000","Manchester – New Arcadia Library and Leisure Centre opens its door for the very first time – Manchester City Council. &#34;The brand new Arcadia Library and Leisure Centre, Levenshulme, will open its doors to the public for the very first time on Saturday 20 February 2016. &#34; … &#34;Arcadia is also the home of a new neighbourhood library&#34; … &#34;The new library will be an attractive, open-plan space within the leisure centre, where members will be able to browse and borrow a selection of popular books, return or renew existing book loans and collect reservations.  Computers for internet use, photocopying and printing will also be available, plus free wifi access. The library will be staffed for 30 hours per week and library services, including internet access and wifi,  will be available throughout the centre’s opening hours via a self-service terminal.  &#34;","2016/02/philanthropy-experiment-ends-in-birmingham-cuts-in-stockton-warrington-increased-hours-in-levenshulme.html"],["Bradford","Sun, 14 Feb 2016 20:21:51 +0000","Bradford – Worth Valley Methodists launch community libraries in Oxenhope, Lees and Haworth – Keighley News. To replace mobile library stops.","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Cornwall","Sun, 14 Feb 2016 20:21:51 +0000","Cornwall – Hunt for golden ticket continues as Helston Library inspires love of books – This is the West Country. Golden bookmark hidden in a book, with the winner winning a free year–long free theatre pass courtesy of local theatre. 30 silver bookmarks offer single free shows.","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Sheffield","Sun, 14 Feb 2016 20:21:51 +0000","Sheffield – Book loans drop by one-third at Sheffield’s volunteer-run libraries – Sheffield Telegraph. &#34;New figures have shown a ‘dramatic dip’ in book lending at the city’s 15 volunteer-run libraries – with some of the facilities seeing loans dropping by more than 50 per cent in the past year.&#34;.  But volunteers and councils argue big drop in normal loans as well and stats don’t include all loans.","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Shropshire","Sun, 14 Feb 2016 20:21:51 +0000","Shropshire – Broseley and Albrighton libraries changing hands – Shropshire Star. &#34;Broseley Town Council and Albrighton Parish Council have agreed to take on their libraries and customer service points from Shirehall. But both libraries will close for at least six weeks for work to be carried out to move each council’s offices in. Mobile libraries will be made available outside both buildings on every Saturday in March from 10am until 1pm.&#34;","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Torbay","Sun, 14 Feb 2016 20:21:51 +0000","Torbay – Mayor asked by councillors to protect vital Torbay services – Herald Express/ &#34;Objections were raised against proposals in the mayor’s budget to close Connections services in Torquay and Brixham and to cut library funding.&#34;","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Worcestershire","Sun, 14 Feb 2016 20:21:51 +0000","Worcestershire – Worcestershire’s great reading bonanza – council’s stock of books surges 13% to 770,000 – Droitwich Spa Advertiser. &#34;New figures from the county council have revealed how the number of books have rocketed to a record 770,159, with the success of the glittering £60m Hive a big factor.&#34;","2016/02/parishing-church-libraries-and-goodbye-to-a-school-library.html"],["Argyll and Bute","Tue, 16 Feb 2016 21:19:37 +0000","Argyll and Bute – Decision to axe school librarians in Argyll ‘utterly disgraceful’ – BookSeller. &#34;As part of an attempt to make £9m worth of savings from its budget in the next two years, the council made the decision to remove 10 librarians from schools in the region last Thursday (11th February), despite widespread protest from library campaigners and authors including Debi Gliori, James Robertson and Christopher Brookmyre. Campaign group Save Scotland’s Libraries has said the impact this &#34;outrageous&#34; decision will have on school children will be &#34;enormous&#34;. The group said: &#34;The decision from Argyll and Bute council to remove all 10 school librarians is utterly disgraceful. There will be an enormous impact in schools and it is undoubtedly pupils who will suffer most from this outrageous decision. It is completely unfair that the pupils of Argyll and Bute will now become educationally disadvantaged from their peers elsewhere in Scotland.&#34;&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Oxfordshire","Tue, 16 Feb 2016 21:19:37 +0000","Oxfordshire – Spring date set for opening of Bicester’s brand new library – Oxfordshire Council. &#34;The new library will be larger than the current facility and will allow Oxfordshire County Council’s Library Service to offer an improved service. There will be more public access computers than at the current Bicester Library and the availability of WiFi will offer increased opportunities for people to get online and further develop their digital skills. There’ll also be a broader choice of books and audio visual items and increased opportunities to join in with regular activities such as weekly rhyme-times for babies and toddlers, family learning activities and reading groups.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["West Berkshire","Tue, 16 Feb 2016 21:19:37 +0000","West Berkshire – West Berkshire library closures ‘unimaginable’ – BBC. &#34;West Berkshire Council has announced a public consultation on the idea of shutting the majority of libraries and two mobile library services. The council plans to save £730,000 from the libraries budget, amid £17.5m of savings across council services. If the plan was implemented, Newbury Library would be the only one key.&#34; … &#34;Hungerford community magazine editor David Piper said the potential closures would be &#34;unimaginable, unthinkable and unworkable&#34;.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Sheffield","Tue, 23 Feb 2016 22:10:37 +0000","Sheffield – Sheffield Library Adds 100 LGBT Books To Its Shelves – The Gay UK. &#34;Over 100 books, which include those from authors Patrick Gale, Stella Duffy and Armistead Maupin have been added  to Sheffield‘s central library, bringing their collection of LGBT books to 300 titles.&#34; … &#34;The new books hit the shelves this month to mark LGBT history month which promotes diversity and equality.&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Birmingham","Tue, 16 Feb 2016 21:19:37 +0000","Birmingham – Letters – The Times (behind paywall).  Argues that the truth about the new public library in Birmingham is that it itself is a £189 million &#34;vanity project&#34; that the council could never afford to run without cuts to neighbouring libraries or other services.","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Kent","Tue, 16 Feb 2016 21:19:37 +0000","Kent – Anti-cuts demo outside Kent County Council budget talks – BBC. &#34;The Unite union said schools, libraries and street cleaning would be cut and Unison said the 2% social care precept would not cover costs.&#34; … &#34;about 80 people protested outside County Hall in Maidstone, including union members, families, students, care home staff and library workers.&#34; … &#34;&#34;They should draw on the £50m which is sitting idly by while they are cutting services and closing down mobile libraries,&#34; &#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Sandwell","Tue, 16 Feb 2016 21:19:37 +0000","Sandwell – Libraries staff take on Wolf Run for charity – Sandwell Council. &#34;They are competing in the challenge – a hardcore 10km off-road run with obstacles – under the team name Librarians Run Quietly.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Bradford","Tue, 16 Feb 2016 21:19:37 +0000","Bradford – Award for voluntary group behind Addingham’s village library – Craven Herald. &#34;Volunteers who run Addingham Community Library have been presented with an award by the village’s Civic Society in recognition of their commitment and dedication in running the service for the village. This year’s Addingham Civic Society Civic Pride Award was made to the library team earlier this month. The community library was established by residents five years ago, when Addingham Library, along with several other small libraries in Bradford district, became a victim of Bradford Council cuts.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Cheshire East","Tue, 16 Feb 2016 21:19:37 +0000","Cheshire East – New season for Cheshire Rural Touring Arts – Cheshire Today. &#34;The new season will also be the first time CRTA have begun taking professional work into Cheshire’s libraries as part of their &#34;See It Live In Libraries&#34; scheme launching this year. The three year project will see events in eight libraries across the county added to the programme alongside the usual rural venues.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Coventry","Tue, 16 Feb 2016 21:19:37 +0000","Coventry – Coventry council library cuts consultation branded a ‘sham’ by campaigners – Coventry Telegraph. &#34;A council consultation into library cuts has been branded a &#34;sham&#34; by campaigners after initial plans were barely altered despite feedback from thousands of people. Coventry council revealed its ‘Connecting Communities’ strategy in November, a plan which will save £1.2million from the budget for libraries, play centres and public toilets. It will result in 35 jobs cuts and the closure of the city’s mobile library.&#34; … &#34;the only change set to be made to the far-reaching strategy is a minor tweak to opening hours at three of the city’s 17 libraries.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Swindon","Tue, 16 Feb 2016 21:19:37 +0000","Swindon – Volunteer library operator says model can work – Swindon Advertiser. &#34;Former councillor Peter Mallinson has run the library, and the attached charity shop, for six years and recently overseen a move to new premises. Along with a team of up to ten volunteers, he ensures the facility is open at least five days a week.&#34; … &#34;Firstly, the organisation is officially a registered charity which means it gets relief on business rates&#34; … The charity shop also operates out of the library which not only means some of the money can go towards good causes, but some of the costs can be met. Some of the major costs, such as the building lease, are still being met by the council but Peter believes it is possible to find the savings required&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Cornwall","Tue, 16 Feb 2016 21:19:37 +0000","Cornwall – Open day organised at St Ives Library next week – Cornishman. &#34;Cornwall is making severe cuts to its library service; St Ives Library, which was stood since 1896, must also share the £1.8m reduction over the next couple of years. It is thought that negotiations are taking place across Cornwall with local councils, groups and organisations; no decisions have been made about individual libraries yet whilst options are being developed and discussions are ongoing about all sites including St Ives library. The open day will be held on Monday February 22 from 9:30am-7:00pm where an opportunity to share ideas of how to improve the building, a chance to look around the building and time to study displays of its history will all be available.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Derbyshire","Tue, 16 Feb 2016 21:19:37 +0000","Derbyshire – Are libraries going to close in South Derbyshire? – Burton Mail. &#34;By 2020 the funding we get from Government will be more than a third lower than the amount we would need to provide services to the same level as in 2010. &#34;So it’s inevitable more and more people will see changes to the services they use. &#34;No decisions have been made about which libraries could close and any closures would only happen following a period of public consultation.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Lancashire","Tue, 16 Feb 2016 21:19:37 +0000","Lancashire – West Lancashire villages come together to oppose library and bus cuts plan – Southport Visiter. &#34;Representatives from all four Northern parish villages attended a packed meeting, at the Cock and Bottle in Tarleton, on Monday night, to oppose planned cuts to transport and library services, announced by Lancashire County Council. More than 800 people have also already signed an online petition against the proposals.&#34; … &#34;Councillor Kay stressed that closure of the library coupled with the potential removal of the bus service to Ormskirk, via Burscough, would leave pensioners, the young, poor, and migrant workers virtually isolated.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Reading","Tue, 16 Feb 2016 21:19:37 +0000","Reading – Reading libraries: cuts in opening hours and moves proposed – Get Reading. &#34;Reading councillors are to launch a consultation tonight which looks at making cuts in opening hours across all the borough’s libraries. It also proposes major changes at Whitley and Southcote libraries. These changes are being forced on Reading Borough Council the council by cuts in Government funding. The policy committee tonight, Monday, February 15, will not be making decisions on the library service – just launching the consultation.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Birmingham","Tue, 23 Feb 2016 22:10:37 +0000","Birmingham – Library of Birmingham visitor numbers plummet by 600k – BookSeller. Tim Coates: &#34; &#34;The Library of Birmingham is a monument to the appalling and disgraceful standard of local government in our country. Are we really expected to believe that having borrowed nearly £200m to create the building, no-one anywhere anticipated the payments of interest that would be needed? There should be a national and rapid public inquiry into what happened, covering the sources and applications of all funding of Birmingham city council in the pursuit of dramatic improvement.&#34;&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Reading","Tue, 23 Feb 2016 22:10:37 +0000","Reading – Reading libraries: have your say in second consultation – Get Reading. &#34;Cabinet’s recommendation to close six libraries, including Rushall Library, will be decided on Thursday however Rushall-Shelfield Councillor Richard Worrall has secured a nomination for Rushall Library to be listed as an Asset of Community Value (ACV). The listing, which would mean that the use of the building or land cannot be changed without permission nor may it be demolished without permission, has already succeeding in saving the ‘magic Lantern’ on the Beechdale Estate from demolition and redevelopment as shops and paved the way for the Four Crosses to re-open as a pub.&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Darlington","Tue, 16 Feb 2016 21:19:37 +0000","Darlington – Fight for Darlington library – Northern Echo. Letter. &#34;Closing a public library will save money, but at the expense of this nation’s future. &#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Leicestershire","Tue, 16 Feb 2016 21:19:37 +0000","Leicestershire – Library use drops across Leicestershire – Hinckley Times. &#34;The cash-strapped authority is off-loading many smaller, rural libraries onto community groups &#34; … &#34;From its peak in 2010 when physical visits to Leicestershire’s libraries were 5,895 visits per 1,000 population (against a national average of 4,864) overall visits have declined to 3,866 visits per 1,000 population (against a national average of 4,049). Before 2015 Leicestershire had one of the highest numbers of libraries with 56 branches however by 2020 it will fully fund only 16.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Staffordshire","Tue, 16 Feb 2016 21:19:37 +0000","Staffordshire – People from across Staffordshire are being urged to volunteer at libraries across the county – Burton Mail. &#34;Those who want to take part have to commit to a minimum of two hours a week, which will give them the opportunity to meet new people and learn new skills, while promoting the services libraries have to offer including reading groups, bounce and rhythm sessions for children and job search activities.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Gloucestershire","Tue, 23 Feb 2016 22:10:37 +0000","Gloucestershire – Community call to action to preserve Brockworth Library’s future – Gloucester Citizen. &#34;Brockworth Community Project, which runs the library with its team of 30 volunteers, now needs your help again to secure its future. Brockworth was one of eight libraries in Gloucestershire which was taken on by the community when the county council decided it could not afford to keep running it.&#34; … &#34;Since taking over the library four years ago, the project has been supported by organisations such as The Big Lottery Fund and a £10,000 annual grant from the county council – but that agreement only runs until next year. The community project is now appealing for help to fund the library which has been a much-loved meeting place for the Brockworth community over the past four years.&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Leicestershire","Tue, 23 Feb 2016 22:10:37 +0000","Leicestershire – Axe set to fall on Barwell library as County Hall cuts costs – Leicester Mercury. &#34;Council bosses have recommended the closure of Barwell’s village library as part of cost-cutting measures. Conservative-run Leicestershire County Council has being trying offload 36 of the smaller libraries it has run to volunteers to save some £800,000-a-year. While deals have been done with 13 communities to keep libraries open no arrangements have been possible in Barwell so closure looms.&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Oxfordshire","Tue, 23 Feb 2016 22:10:37 +0000","Oxfordshire – Oxford Central Library to close this weekend until October 2017 – Oxford Times. &#34;Library users are being reminded that the Westgate-based Oxford Central Library will close as of Saturday, January 27 for redevelopment work. A smaller, temporary library will instead be available in Oxford’s Castle Quarter from the end of March until October 2017.&#34; … &#34;Once complete Oxford Central Library will feature a new entrance foyer, a refurbished and extended children’s library and new windows with views over Bonn Square and Castle Street.  &#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Dudley","Tue, 16 Feb 2016 21:19:37 +0000","Dudley – Be Online campaign comes to Dudley libraries – Dudley News. &#34;The free taster IT sessions and drop-in events are set to be held at libraries across Dudley during the ‘Be Online’ campaign from today (February 15) to 28, designed for people who are new to computers and tablets. &#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Greenwich","Tue, 16 Feb 2016 21:19:37 +0000","Greenwich – Plumstead Library given listed status days before council proposals to demolish all but the facade – South London Press. &#34;Residents welcomed the news that English Heritage (EH) granted Grade II status to the library in Plumstead High Street for its architectural significance and relevance as one of the first funded by philanthropist Andrew Carnegie. Shock had been expressed by residents that proposals for the Plumstead Urban Framework, included demolishing all but the facade of the building and build a new combined library, leisure and cultural centre.&#34;","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Lambeth","Tue, 16 Feb 2016 21:19:37 +0000","Lambeth – Actor Mark Rylance condemns Lambeth library closures – BookSeller. &#34;British &#34;Bridge of Spies&#34; actor Mark Rylance, who won Best Supporting Actor at 2016’s BAFTA awards last night (14th February), has spoken out in support of a campaign to save Lambeth’s libraries from closure. Rylance, a resident of Lambeth for the past 30 years, called libraries the &#34;fabric of our communities&#34; as he joined in opposition to the council’s plans to privatise the services. Lambeth plans to close five out of 10 of the borough’s libraries in April and replace employees with volunteers.&#34; … &#34;Lambeth library workers first went on strike over the plans in November last year and at least a quarter of the libraries’ staff will be made redundant if the plans go ahead, Unison has said. Tim O’Dell, local librarian and member of Unison, told The Bookseller that campaigners &#34;cannot accept&#34; the library closures or the loss of jobs.&#34; see also Library closures are a betrayal, says Mark Rylance – London Evening Standard.","2016/02/temple-of-literacy-and-the-citys-heart.html"],["Aberdeen","Thu, 18 Feb 2016 22:32:24 +0000","Aberdeen – Eight libraries in Aberdeen facing closure – Evening Express. £500k cut, not clear which libraries will be closed. See also Willie Young: ‘Our budget is a budget for growth, it’s a budget for prosperity’ – Evening Express. &#34;Education remains at the heart of our priorities and we believe by focusing on education, including lifelong learning, we can work towards becoming a city of learning with a city-wide workforce, which will help us to grow and diversify the economy. That is why I can guarantee, despite officers’ recommendations, we will not close any of our libraries.&#34;","2016/02/200-time-to-think-about-the-future.html"],["Bracknell Forest","Thu, 18 Feb 2016 22:32:24 +0000","Bracknell Forest – Bracknell Forest Council budget: six things we learnt – Get Reading. &#34;The budget briefing was all about making savings and ensuring the council can balance its books in the years to come. This being the case councillors feared the public would see changes in the services provided by the authority. One change could be a reduction in the library services. Mr Nash explained services funded by the council related to the arts and also the libraries were to have ‘finance driven reviews’. Cllr Bettison asked: &#34;Do we as an authority need nine libraries?&#34; He confirmed there were four out of the nine libraries which were at risk but would not confirm which and Mr Nash stressed there were no specific proposals as yet. Mr Wheadon said: &#34;We need to look at what sort of libraries we need in the 21st Century. &#34;The borough’s library service would be broadly recognisable to a Victorian.&#34;&#34;","2016/02/200-time-to-think-about-the-future.html"],["Lincolnshire","Thu, 18 Feb 2016 22:32:24 +0000","Lincolnshire – See no evil, hear no evil, speak no evil – Secret Librarian. &#34;It sounds like the county’s libraries will become more like bookshops in terms of layout as they will be paperback heavy and more geared towards popular literature. If a book is not in stock rather than get it from another library it will be bought from a large internet supply company.&#34; … &#34;They claim to be a not for profit social enterprise co-operative company but their top managers certainly earn good salaries and surely there are some services that should be the government’s responsibility and not be privatized in all but name. &#34; … &#34;The organisation have certainly made all the right sounding noises but this blogger is reserving judgment as the question remains of whether the council have the authority it claims to if they begin in any way to renege on all their fine sounding promises.&#34;","2016/02/200-time-to-think-about-the-future.html"],["Reading","Thu, 18 Feb 2016 22:32:24 +0000","Reading – Council plans to move Southcote and Whitley libraries into community centres – Reading Chronicle. &#34;the council looks to combine the Southcote and Whitley branches with community centres. The move is part of a proposed package of cuts to the sector which if approved would see reduced opening hours across the board. Councillors have pledged there will be no break in service during transition and said the scheme was designed to help avoid future library closures.&#34;","2016/02/200-time-to-think-about-the-future.html"],["Plymouth","Sun, 21 Feb 2016 21:08:12 +0000","Plymouth – Video: Take a 3D virtual tour of Plymouth’s new Central Library before it opens – Herald. &#34;Builders have worked tirelessly over the past four months in converting vacant retail and bank units on the corner of Armada Way and Mayflower Street into a modern, flexible and welcoming library which will replace the one at Drake Circus. As well as helping to make way for the £32million History Centre, which is due to open in 2010, the move is considered a major step forward in Plymouth City Council’s (PCC) ambition to modernise its library service. Service manager, Mandy Macdonald, believes the new central library – which will offer computer access, free Wi-Fi and the services of a cafe – will quash public misconceptions about libraries.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Slough","Sun, 21 Feb 2016 21:08:12 +0000","Slough – Slough to be given £625,000 boost to develop arts in the town – Slough Express. &#34;Funded by Arts Council England, a consortium including Rifco Arts theatre company, Slough Libraries and SWIPE, a charity which provides music activities for young people in Slough, will be working to grow the arts community in the borough. The £625,000 investment is called ‘Home’ and aims to create a ‘sense of pride’ for people by connecting them to a number of activities, including music and dance. The first series of activities is expected to start in spring to coincide with the opening of The Curve, a new multi-million pound cultural centre in Wellington Street. Aside from funding for Home, Arts Council England has given Slough Borough Council £49,000 to develop arts and culture at The Curve.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Suffolk","Sun, 21 Feb 2016 21:08:12 +0000","Suffolk – Youngsters flock for library craft events in Ipswich – Ipswich Star. &#34;Gainsborough Library youngsters enjoyed taking part in family colouring activities with their parents, alongside other games. At Chantry Library, children and adults came together for a special colouring project, before the children could have a go at crafting their very own creatures. The library’s new Minecraft group for ages eight to 13 was also launched, bringing children together to socialise through the game.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Bradford","Thu, 18 Feb 2016 22:32:24 +0000","Bradford – Wibsey Branch Labour Party supports the campaign to Stop the Closure of Wibsey Library – Wibsey Branch Labour Party. &#34;It is dispiriting that despite the success and victories celebrated across Bradford at the recent local and general elections, we are experiencing the decimation of public and voluntary services, due to cuts imposed by the Tory government. Wibsey Branch Labour Party acknowledges the extraordinary pressures faced by the Council and the difficult financial decisions the council is being forced to make as a result of Tory cuts. However, we are concerned that current draft budget proposals would see the closure of all public libraries (if they are unable to be community managed) across Bradford South, including Wibsey.&#34;","2016/02/200-time-to-think-about-the-future.html"],["Brent","Thu, 18 Feb 2016 22:32:24 +0000","Brent – Celebrities to take part in fundraising night for Kensal Rise community library – Brent and Kilburn Times. &#34;A host of famous actors and writers will be taking part in ‘a night of poetry and readings’ to raise funds for Kensal Rise community library.&#34; … &#34;Famous names taking part on the night include Kensal Rise-resident Danny John-Jules, Tamsin Greig, Haydn Gwynne, Guardian columnist Tim Lott and author Allen Samuels. Ms Greig said: &#34;This Library, and by definition all libraries, are havens and sanctuaries to be supported, and not to be threatened with closure.&#34;&#34;","2016/02/200-time-to-think-about-the-future.html"],["South Gloucestershire","Thu, 18 Feb 2016 22:32:24 +0000","South Gloucestershire – South Gloucestershire Council sets 3.99 per cent increase in council tax – Bristol Post. &#34;Consultations will be taking place next week over potential savings including closing Chipping Sodbury Library and ending the mobile library service to save £640,000; moving staff based at Kingswood Civic Centre to Yate and creating One Stop Shops to house libraries and other public sector organisations in Kingswood, Patchway and Yate.&#34;","2016/02/200-time-to-think-about-the-future.html"],["Argyll and Bute","Sun, 21 Feb 2016 21:08:12 +0000","Argyll and Bute – Librarians removed in budget cuts – Argyllshire Advertiser. &#34;Every school librarian in Argyll and Bute will be made redundant after Argyll and Bute Council passed the administration’s budget.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["East Sussex","Sun, 21 Feb 2016 21:08:12 +0000","East Sussex – Pevensey Bay Library will be returned to the community, and that is a promise – Pevensey Bay Life. &#34;Pevensey Bay Village comes together in community show of strength. News of the demonstration began on Radio Sussex at 6:30am . As the local news sequence began, second on the agenda was the story of the little village in East Sussex campaigning to see their library re-open&#34; … &#34;As the news reader explained that as a result of a flood in January 2015, that the library had been closed ever since, the importance of the campaign was suddenly shoved local centre stage.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Kent","Sun, 21 Feb 2016 21:08:12 +0000","Kent – Mobile libraries in Deal, Walmer and Sandwich could be cut – Kent Online. &#34;Kent County Council (KCC) is proposing to withdraw more than half of its mobile libraries – including those that stop in Deal, Walmer and Sandwich. A consultation document, available online, proposes to remove stops that have only had, on average, two or less visitors over the period October 2014 to September 2015, reducing the number of stops from 651 to 283.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Suffolk","Sun, 21 Feb 2016 21:08:12 +0000","Suffolk – New Suffolk Libraries campaign aims to get people reading – Ipswich Star. &#34;While literacy continues to be a nationwide issue, library bosses are keen to encourage reading as a pleasurable activity, through a number of events, competitions and ongoing projects as part of the ‘Our year of reading’ campaign.&#34; … &#34;A major conference has been set up for May 27 for education chiefs to discuss ideas with libraries over ways to achieve a new reading culture in schools.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Warrington","Sun, 21 Feb 2016 21:08:12 +0000","Warrington – Readers’ anger at slashing of library opening hours – Warrington Guardian. &#34;The shorter hours mean that people can’t visit in the early evening and to be closed all day Friday is appalling. &#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Cornwall","Thu, 18 Feb 2016 22:32:24 +0000","Cornwall – Residents urged to help save St Ives library – Cornishman. &#34;To alert people to the threat of closure and attract support, Friends of St Ives Library (FOSIL), St Ives Archive and the St Ives Community Land Trust have organised an open day at the library on Monday. Janet Axten, heritage manager at St Ives Archive and one of the organisers, said: &#34;The library is most definitely threat from Cornwall Council. If we cannot get a plan together that works by April 1, 2017, then we will probably lose our library.&#34;","2016/02/200-time-to-think-about-the-future.html"],["Suffolk","Thu, 18 Feb 2016 22:32:24 +0000","Suffolk – Halesworth Library support group hopes to attract new friends and trustees – EADT. &#34;Since late 2012, the Friends of Halesworth County Library has raised funds for a number of improvements, including new carpeting, redecoration, installation of blinds on the mezzanine level and the purchase of iPads. This April, the Friends will be holding an annual general meeting (AGM), where they hope to attract more volunteers and appoint new trustees. Secretary and treasurer, Mike Stephens said those who sign up are asked to make a minimum contribution of one pound for three years’ membership.&#34;","2016/02/200-time-to-think-about-the-future.html"],["Telford and Wrekin","Thu, 18 Feb 2016 22:32:24 +0000","Telford and Wrekin – Newport Library is saved from closure – Shropshire Star. &#34;Telford & Wrekin Council’s senior cabinet members have decided to save Newport Library and First Point Services, announcing there will be a reduction in the savings needed at the library. This will allow the council to continue to run a First Point service alongside a new self-service library facility. Saving the First Point service and library, which will be subject to a review of operational arrangements, will mean the council has halved the level of savings it had originally planned to deliver, after listening to the views of local residents.&#34;","2016/02/200-time-to-think-about-the-future.html"],["West Berkshire","Thu, 18 Feb 2016 22:32:24 +0000","West Berkshire – Save Hungerford Library from Steph Richardson.","2016/02/200-time-to-think-about-the-future.html"],["East Sussex","Sun, 21 Feb 2016 21:08:12 +0000","East Sussex – New theatre and alternative library at the Observer Building – Hastings Observer. &#34;The first floor gallery will host exhibitions and workshops from the local art scene and a new alternative community library will offer informal café, free WIFI, meeting space and information sharing.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Fife","Sun, 21 Feb 2016 21:08:12 +0000","Fife – Councillors vote to close 16 libraries in Fife – Fife Today. &#34;Five libraries scheduled to close next month; Eight will stay open for up to a year while alternative proposals are considered; Libraries at high schools considered as alternatives in Glenwood and Abbeyview&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Lewisham","Sun, 21 Feb 2016 21:08:12 +0000","Lewisham – Lobby Lewisham Council – Save Lewisham Libraries. &#34;Come along to the next lobby of Lewisham council as they set the budget for next year including the cuts to library services&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Oxfordshire","Sun, 21 Feb 2016 21:08:12 +0000","Oxfordshire – Effects of library cuts – Swindon Advertiser. &#34;Cuts by Oxfordshire County Council, coupled with those imposed by Swindon Borough Council will hit some communities very hard. This &#34;double whammy&#34; effect will hit the communities on the borders of the County and Borough in a disproportionate way.&#34; … &#34;When Swindon proposes to reduce library provision to only its large central library, and Oxfordshire cuts the mobile library van service (including to the schools), we are left in our villages with a &#34;double whammy&#34; effect of local government cuts&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["South Gloucestershire","Sun, 21 Feb 2016 21:08:12 +0000","South Gloucestershire – MP Jack Lopresti joins fight to save South Gloucestershire libraries after his own party vote to consult on closures – Gazette. &#34;Mr Lopresti said he was ‘disappointed’ at the plans unveiled by his own Conservative party to cut library services and said money should be saved elsewhere to protect frontline services. His statement comes two days after the Tory-run council agreed to spend a £3.6million government handout on cutting the district’s opt-in green bin charge from £36 to £30 over safeguarding services including libraries, youth services and council-funded PCSO posts.&#34; … &#34;The decision, furiously challenged by South Gloucestershire’s Labour and Liberal Democrat parties, has sparked outrage on social media with many people saying they would happily pay the annual £36 subscription charge to have their green bin emptied if it meant other services were saved.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Highlands","Thu, 18 Feb 2016 22:32:24 +0000","Highlands – Where the axe is proposed to fall in Highlands – Strathspey Herald. &#34;£325,000: Reduce funding to High Life Highland: Leisure centres and libraries will suffer as a result of 4.3 per cent cut in High Life Highland’s budget. The council expects a drop in customer numbers, membership and income because of the reduction in services, as well less people taking up adult learning courses or participating in youth work schemes. Opening times and prices of leisure centres and libraries will also be affected.&#34;","2016/02/200-time-to-think-about-the-future.html"],["Leeds","Thu, 18 Feb 2016 22:32:24 +0000","Leeds – Pudsey Library to become ‘community hub’ – West Leeds Dispatch. &#34;Residents will soon be able to register a birth, arrange to pay their rent, access the internet and borrow books all under the same roof when Pudsey Library becomes a Community Hub. Council services such as housing, registrars and other one stop services will all join the library under one roof. These services are moving from Pudsey Town Hall, which will become a base for Adult Social Care and Health staff.&#34;","2016/02/200-time-to-think-about-the-future.html"],["West Berkshire","Thu, 18 Feb 2016 22:32:24 +0000","West Berkshire – Town mobilises to fight library closure – Newbury Today. &#34;The bitter backlash has bolstered an instant grassroots campaign and as this newspaper went to press: The Friends of Hungerford Library had met formally and elected a committee. A public meeting had been arranged. A petition opposing the closure of Hungeford Library had attracted nearly 1,000 signatures. West Berkshire Council has announced that the Church Street community hub is among eight facing closure as part of its plans to save £17.5m.&#34; … &#34;I see no financial analysis that must have been prepared before such a proposal was arrived at. &#34;Unless we can see how the district council arrived at such a proposal, we cannot respond in an informed and as constructive manner.&#34;","2016/02/200-time-to-think-about-the-future.html"],["Enfield","Sun, 21 Feb 2016 21:08:12 +0000","Enfield – Council deny selling books as pretext to library closure – Barntet Today. &#34;On Tuesday, The Advertiser witnessed a van emblazoned with the logo WeBuyBooks.co.uk being loaded with boxes of books taken from inside the John Jackson library in Agricole Place, Bush Hill Park&#34; … &#34;Former physics teacher Michael Hardyman, who lives in Bush Hill Park, said that over the past three months he has seen the permanent closure of the music room in the library, fewer desks for students to study on and a gradual reduction in book shelves and IT terminal space throughout the library. However, The Council is adamant that they are not selling off all the books in the library as a way to raise some quick cash.&#34; … &#34;She said that the books are sold to a private, profit-making company, Revival Books, who either sell them on again, or pulp them for recycling. In the past year this process has raised £3,300 for council coffers&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Lancashire","Thu, 18 Feb 2016 22:32:24 +0000","Lancashire – Campaigners fighting to save library services – Chorley Guardian. &#34;A day of action is planned this Saturday to save Leyland Library from closure. Coun Claire Hamilton and County Coun Matthew Tomlinson will be on Hough Lane in Leyland collecting signatures on a petition. They will also be at the library from 1pm to 3pm for people to sign the petition and talk about the cuts to services. Campaigners will be at Clayton Green Library in Chorley from 10am on Saturday as they call to keep their library open. Read-ins are being organised at Adlington Library on Saturday, February 27 and at Euxton Library on Saturday, March 5, both from 9.30am to 12.30pm&#34; see also The history of now-threatened Adlington Library – Chorley Guardian.","2016/02/200-time-to-think-about-the-future.html"],["Wokingham","Thu, 18 Feb 2016 22:32:24 +0000","Wokingham – Give us your views on exciting library proposals – Wokingham Borough Council. &#34;Wokingham Borough’s libraries are a great success story – bucking the national trend by actually increasing usage – and now you can help write their next chapter by giving us views on how can continue to enhance and expand what we offer. While library usage is down across the country, Wokingham Borough’s libraries are on the bestseller list – with library usage increasing by nearly 6,000 from 2013/14 to 2014/15 and on the up again this year – and Wokingham Borough Council is determined to enhance them even further. In order to achieve this, the council’s decision-making executive on January 28 approved a public consultation on the draft library offer – which includes proposals to open the borough’s main libraries for longer by introducing some self-service facilities. The eight-week consultation will start on Monday 1 February and all comments will be considered before the council decides later in the year on whether to put the library offer&#8230;","2016/02/200-time-to-think-about-the-future.html"],["Nottingham","Thu, 18 Feb 2016 22:32:24 +0000","Nottingham – New library, offices and flats given go ahead in Aspley – Nottingham Post. &#34;The Joint Services Centre will be built on the former site of similar facilities that were knocked down in 2015, on the corner of Strelley Road and Bradfield Road. The new three-storey building will be home to a housing office for Aspley, along with a library, meeting rooms and office space for council staff on the ground floor. The top two floors will then house 30 sheltered accommodation apartments for the over 55s, along with communal services, including a hairdressers, an activity room, a hobby room and a living room.&#34; … &#34;&#34;I am slightly worried about the ‘Joint Services Centre as a name. It is remarkably functional and doesn’t express for the people what is its and needs some thought.&#34;","2016/02/200-time-to-think-about-the-future.html"],["Wiltshire","Thu, 18 Feb 2016 22:32:24 +0000","Wiltshire – Calne Library set to trial no-staff system – This is Wiltshire. &#34;The library is due to undergo refurbishment work later this year, which will see a swipe card system and CCTV installed, allowing it to be opened without having staff on duty. A spokesman for Wiltshire Council said: &#34;The library isn’t going to close and staff are not going to lose their jobs, but some of the current staff’s hours will be cut. &#34;Following refurbishment, the library will be able to open for longer and we are hoping that it will be able to open on Wednesdays, as it currently isn’t.&#34;","2016/02/200-time-to-think-about-the-future.html"],["Lambeth","Sun, 21 Feb 2016 21:08:12 +0000","Lambeth – Waterloo Library: ‘meanwhile space opportunity’ in Lower Marsh – London SE1. &#34;As Lambeth Council prepares to shut Waterloo Library in its current form, the authority has revealed plans for a ‘meanwhile use’ of the Lower Marsh building pending redevelopment.&#34; … &#34;Waterloo Library is due to close just after Easter under Lambeth Council‘s controversial ‘Culture 2020′ package of cuts to the borough’s libraries and parks.&#34; … &#34;&#34;A prime location, good support and some creativity to provide employment and entrepreneurial opportunities could make your name.&#34;&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Lancashire","Sun, 21 Feb 2016 21:08:12 +0000","Lancashire – Don’t allow libraries to close – Lancashire Evening Post. &#34;What was disappointing was that the debate had little to do with libraries, although the Conservative proposer of the motion did speak eloquently about the situation and the effects that mass closures would have in the county. &#34; … &#34;Lancashire was, and currently still is, one of the best library services. The previous head of Libraries, a professionally qualified librarian, and then the management that followed his retirement, provided superb libraries and revamped many libraries into cheerful, well designed and well stocked spaces, with many additional community services.&#34; … &#34;What concerned me about the debate was that it seemed to be purely about scoring political points, rather than the consequences to the public, in particular the very young, school children and the elderly.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Birmingham","Sun, 21 Feb 2016 21:08:12 +0000","Birmingham – Visitors to Library of Birmingham plummet by a quarter – Birmingham Mail. &#34;A total of 1.83 million people passed through the doors of the library in 2015 – which works out at about 5,000 per day based on a six-day week. The figures, for a tough year for the library which saw opening hours cut, represented a decline from the 2.4 million the year before when it became the most-visited attraction in the UK outside London. The library costs the council more than £70,000 for every day it operates as a result of giant interest bills.&#34; … &#34;Even so, the 3.89 million visitors to Birmingham’s libraries works out at everyone in the city visiting a branch between three and four times last year.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Bradford","Sun, 21 Feb 2016 21:08:12 +0000","Bradford – Library closures and adult and children’s services cuts top public’s fears ahead of Bradford Council’s crunch budget meetings – Telegraph and Argus.  &#34;a public consultation revealed potential library closures and cuts to adult and children’s services topped people’s fears for the next two years. &#34; … &#34;Petitions have also been submitted against proposals to close libraries, cuts to youth service provision, a reduction in community development workers, and the de-commissioning of financial and welfare advice services. The highest number of submissions, about 115, related to the potential closure of libraries.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Cheshire West and Chester","Sun, 21 Feb 2016 21:08:12 +0000","Cheshire West and Chester – Neston, Little Sutton and Upton libraries to welcome children’s show Bardolph’s Box – Chester Chronicle. &#34;Bardolph’s Box is the opening show of Cheshire Rural Touring Arts’ spring season of touring, taking professional arts events to rural venues and libraries across the county from March until July this year. Unity Theatre’s artistic director, Matthew Linley, said: &#34;We’re all really excited to be working alongside Up The Road Theatre to help little Bardolph come into the world – or rather into a library, school, arts venue or community hall near you.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Fife","Sun, 21 Feb 2016 21:08:12 +0000","Fife – Why I care about keeping Fife’s Libraries open – CILIPS. &#34;Guest Blog by Bryce Sutherland, one of the campaigners behind ‘Keep Fife’s Libraries Open’ as part of the ‘Scotland’s Libraries: Inspiration for the Nation’ Campaign.&#34; … &#34;the question posed most frequently to me, was, in essence, &#34;Why do you care?&#34; The implication was that libraries are obsolete, arcane institutions; a drain on local resources and funding. Who even reads books anymore? Perhaps this shows where the library system has failed. The general populous are still under the incorrect assumption that libraries are quiet spaces for elderly people to peer down their noses at dusty old books, watched over by the imposing matriarchal librarian, forever shushing us into silence.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Lancashire","Sun, 21 Feb 2016 21:08:12 +0000","Lancashire – Bids invited to run Lancashire’s museums and libraries – BBC. &#34;The authority plans to close 40 libraries and withdraw funding for five museums as part of savings worth £65m over the next two years. There are a &#34;number of opportunities&#34; to take over council buildings or services, said a council spokesman.&#34; … &#34;The council said it had not identified which libraries could close but that it was keen to talk to groups interested in keeping them open.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Lancashire","Sun, 21 Feb 2016 21:08:12 +0000","Lancashire – Longridge leaps into action in face of cuts – Longridge News. &#34;It was felt that, with town and parish councils’ operational changes due to the government’s austerity policies, the town council should use its powers to adopt a more proactive approach to identifying and resolving issues affecting the town. An increase in its precept was overdue, Coun Swarbrick said, after hearing that some parishes were looking at funding their own buses after the cuts and others were also setting aside funding to support their libraries.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Lancashire","Sun, 21 Feb 2016 21:08:12 +0000","Lancashire – Pendle peer challenges Government over library cuts – Burnley Express. &#34;Pendle Liberal Lord Greaves has challenged the Government over the proposed closure of 40 libraries in Lancashire – including possibly up to five in Pendle. In the House of Lords he asked what assessment it had made of the impact of the Local Government Finance Settlement on the provision of libraries.&#34; … &#34;She went [Baroness Nevile-Rolfe] on to say libraries should be looking to use more volunteers, which is what people are hoping to do in Pendle to keep some of them open. &#34;But she completely failed to accept that it’s the massive cuts in government funding which is causing the problem in the first place.&#34;","2016/02/arts-funding-scotland-birmingham-and-finding-volunteers-for-40-branches.html"],["Argyll and Bute","Tue, 23 Feb 2016 22:10:37 +0000","Argyll and Bute – Put school librarians before top job, says Argyll and Bute MSP – Buteman. &#34;Argyll and Bute’s MSP says the local council should put on hold plans to recruit a new chief executive – and use the money to save its secondary school librarians from the axe. Michael Russell hopes to raise the issue in the Scottish Parliament on Wednesday afternoon in a debate on the Scottish Government’s budget.&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Cambridgeshire","Tue, 23 Feb 2016 22:10:37 +0000","Cambridgeshire – Claims Cambridgeshire Collection is taking ‘disproportionate’ amount of county council cuts – Cambridge News. &#34;There are fresh fears for the future of an in-depth archive of Cambridgeshire after &#34;disproportionate&#34; and &#34;ill-founded&#34; cuts were waved through. The protests of campaigners Sean Lang and Stephen Swift were not enough to sway councillors last week from agreeing a budget that will see £195,000 cut from Cambridgeshire Archives and Local Studies. Dr Lang, a member of the fledgling Friends of Cambridge Central Library, said the central library based Cambridgeshire Collection was taking a &#34;disproportionate&#34; amount of cuts compared to the overall library service, and other areas of the council.&#34; … &#34;Archives and local studies is having its overall budget cut by 30 per cent, and the library service by around 10 per cent overall.&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Lambeth","Tue, 23 Feb 2016 22:10:37 +0000","Lambeth – Lambeth Tories propose to bulldoze Brixton Rec and move it to Pop Brixton as part of alternative Budget proposals – Brixton Buzz. &#34;The bonkers book-ish gyms appear to be one policy area of sanity however for the local Conservative group. The Opposition budget would allow a not-for-profit organisation to keep all Lambeth libraries operating as public library spaces. Costings have been worked out by the local Conservatives. This has been passed as a legal, balanced budget by apolitical Officers at the Town Hall. There is the disclaimer however that the proposals can only be delivered with a significant degree of risk management and monitoring.&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Norfolk","Tue, 23 Feb 2016 22:10:37 +0000","Norfolk – Norfolk taxpayers will pay 4% more in council tax next year as councillors agree £42m of cuts – Eastern Daily Press. &#34;Labour leader George Nobbs said: &#34;It’s a budget for all the people of Norfolk&#34; and said it would mean no fire stations, children’s centres or libraries would shut.&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Bradford","Tue, 23 Feb 2016 22:10:37 +0000","Bradford – Amended Council budget proposals could bring better news for five threatened libraries – Telegraph and Argus. &#34;Under the adjusted proposals, council tax would rise by the maximum of 1.99 per cent a year instead of the planned 1.6 per cent, with the extra £600,000 raised being used to soften the blow of a host of cuts to local services. &#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Leicestershire","Tue, 23 Feb 2016 22:10:37 +0000","Leicestershire – Bid to protect Barwell library taken to Parliament – Nuneaton News. &#34;Mathew Hulbert, a former councillor representing Barwell on Hinckley and Bosworth Borough Council, is calling for the village’s library to be saved from the axe. He’s taken part in a lobby of Parliament by ‘Speak Up for Libraries’, a coalition of organisations and campaigners working to protect libraries and their staff.&#34; … &#34;Mr Hulbert said: &#34;It was fantastic to be part of this big day of campaigning. Libraries play a vitally important role in our communities and cash-strapped councils should not see them as an easy target for cuts.&#34; … &#34;&#34;This is the only library out of 36 that is facing closure. There was a bid from a local group that we thought offered a good basis to build on but, unfortunately, the group did not feel they could guarantee the longer term sustainability of the library&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Newcastle","Tue, 23 Feb 2016 22:10:37 +0000","Newcastle – Newcastle City Council meeting recap: Cabinet expected to approve cuts of £30m – Chronicle. &#34;Opening hours at nine libraries across Newcastle could be cut from 400 hours per week to 181 hours should proposals put forward by Newcastle City Council be approved. &#34; … &#34;Sunday opening hours at Newcastle’s flagship City Library will remain unchanged after respondents to the budget consultation highlighted the need to maintain access for people who are at work or in education through the week. Councillor David Stockdale, cabinet member for communities and facilities, said the cuts had their roots in coalition cuts. Nick Brown, MP for Newcastle East, added: &#34;I greatly value the cities libraries and nobody wants to see the service restricted. &#34;However, the council is in an impossible situation – the cuts from central government have been remorseless.&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Buckinghamshire","Tue, 23 Feb 2016 22:10:37 +0000","Buckinghamshire – Report to the Transport, Environment and Communities Select Committee – Buckinghamshire Council. &#34;to work up a detailed business case exploring this option, taking into consideration the various organisational forms of ‘spin out’ including charitable trust and public service mutual.&#34; … &#34;If Cabinet approve the business case it would be possible to implement new delivery model by April 2017.&#34; £1,125,000 expected to be saved by moving to a trust over three years. Library budget has reduced from £7m to £5m since 2010: at least £1m more expected to be cut by end 2009.","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Manchester","Tue, 23 Feb 2016 22:10:37 +0000","Manchester – Revamped Central Library attracts more visitors than the rest of the city’s branches combined – Manchester Evening News. &#34;Manchester’s libraries gained almost 700,000 visitors last year – mainly down to the Central Library’s successful reopening. A total of 2.8m people visited the city’s network of libraries in 2015. This was 691,200 more than the 2.13m who came through the doors in 2014, figures released to the M.E.N. under Freedom of Information show.&#34; … &#34;Some of the libraries with the steepest drops in visitor numbers are the seven that are run by volunteers. Barlow Moor, Burnage, Fallowfield, Levenshulme, Miles Platting, New Moston and Northenden branches all have limited opening hours under their ‘community library model’.&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Newcastle","Tue, 23 Feb 2016 22:10:37 +0000","Newcastle – Download deals mean more e-books come online at Gateshead and Newcastle libraries – Chronicle. &#34;Thanks to its agreement with publishing houses including Harper Collins, Penguin Random House and Faber &amp; Faber, Gateshead Council has been able to add works by more than 20 of the most popular modern authors to its download library, as well as a selection of film and TV tie-ins such as The Martian by Andy Weir and The Man in the High Castle by Philip K Dick.&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Swindon","Tue, 23 Feb 2016 22:10:37 +0000","Swindon – Town deserves better – Swindon Advertiser / Letters. &#34;We do not deserve to be a laughing stock with a council that closes our, repeat, our libraries. Swindon Advertiser recently reported that head teachers are finding difficulty in attracting teachers to Swindon.\nWill it help if our own councillors portray us as yokels, happy to live in a cultural desert?  There is also another issue, that of being fair to semi rural areas within the borough. The figures show how well Highworth and Wroughton use their libraries and appreciate their librarians.&#34;","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Walsall","Tue, 23 Feb 2016 22:10:37 +0000","Walsall – Potential reprieve for closure-threatened Walsall library – Walsall Advertiser.","2016/02/idea-stores-beautiful-libraries-and-cuts-in-gosh-australia.html"],["Aberdeen","Sun, 28 Feb 2016 21:22:05 +0000","Aberdeen – Aberdeen City Council backs budget with more than £25m savings – BBC. &#34;Proposals to cut the cultural programme and libraries, as well as increasing parking charges, were ruled out. However, reductions will be made in sports funding.&#34;","2016/02/being-economical-with-the-truth.html"],["Bradford","Sun, 28 Feb 2016 21:22:05 +0000","Bradford – Bradford council washes its hands of 14 libraries after ‘devastating’ budget cuts – Guardian. &#34;Bradford council is to withdraw from running 14 libraries across its district, either putting them in the hands of community management groups or, if no bids to run them are forthcoming, close them down.&#34; … &#34;The budget proposal that was initially passed kept seven of Bradford’s full-time libraries safe – the recently opened facility in the city centre and libraries in Keighley, Ilkley and Bingley, Manningham, Shipley and Eccleshill.&#34; … &#34;n addition, if volunteers can be found, two other libraries – Baildon and Clayton – will become &#34;hybrid&#34; libraries, partly staffed by the council but with volunteers making up the rest of the hours.&#34;","2016/02/being-economical-with-the-truth.html"],["Fife","Sun, 28 Feb 2016 21:22:05 +0000","Fife – Kinghorn Library reprieve welcomed by locals – Fife Today. &#34; a new group called Kinghorn Library Renewed has written to Fife Council to ask if it could use the current premises for a possible community library and heritage centre.&#34;","2016/02/being-economical-with-the-truth.html"],["Sheffield","Sun, 28 Feb 2016 21:22:05 +0000","Sheffield – Volunteers to take over one of last Sheffield Council run library services – Star. &#34;Services at Tinsley will be changing from today as Sheffield City Council’s lease on the current building comes to an end&#34; … &#34;Volunteers already run 15 other libraries in Sheffield following council budget cuts.&#34;","2016/02/being-economical-with-the-truth.html"],["Worcestershire","Sun, 28 Feb 2016 21:22:05 +0000","Worcestershire – MP full of praise for work of libraries – Worcester Observer. &#34;Mr Walker, who has been a long standing supporter of the library and its place as the hub of Worcester’s community, made the visit earlier this month to attend a storytelling session and meet with library staff. Mr Walker also visited St John’s Community Library to meet with adults and children who benefit from the innovative projects the city’s libraries are running.&#34;","2016/02/being-economical-with-the-truth.html"],["Barnet","Sun, 28 Feb 2016 21:22:05 +0000","Barnet – Scrap tuition fees, build more social homes and save libraries: Shadow Chancellor John McDonnell visits Barnet – Times Series. &#34;Mr McDonnell said libraries are the &#34;demonstration of a civilised society&#34; and said he does not support plans to cut them. He said: &#34;I was campaigning on the library closures issues before the last election.&#34;","2016/02/being-economical-with-the-truth.html"],["Leicestershire","Sun, 28 Feb 2016 21:22:05 +0000","Leicestershire – Barwell Library fight looks to have been lost – Hinckley Times. &#34;The axe has moved closer to Barwell Library after council chiefs recommended it should close. A paper going to Leicestershire County Council’s cabinet proposes the centre should close on June 1 and be replaced by a weekly mobile library service.&#34;","2016/02/being-economical-with-the-truth.html"],["Manchester","Sun, 28 Feb 2016 21:22:05 +0000","Manchester – Levenshulme’s new library and leisure centre opens to public – Manchester Evening News. &#34;Arcadia Library and Leisure Centre boasts swimming pools, a new gym, sauna and steam room, a dedicated community studio and is also home to a new, open-plan neighbourhood library &#34;… &#34;The leisure centre, on Yew Tree Avenue, will be run by Greenwich Leisure Limited, while the library will be managed by Manchester Libraries. Council bosses will this year develop plans for a £16 million transformation of the leisure centres and neighbourhood library facilities at Moss Side and Abraham Moss. Levenshulme’s former library, on Cromwell Grove, closed its doors for the final time last Saturday.&#34;","2016/02/being-economical-with-the-truth.html"],["Swindon","Sun, 28 Feb 2016 21:22:05 +0000","Swindon – Government’s library taskforce visits Swindon – Swindon Advertiser. &#34;I have come down to find out first-hand what is happening in Swindon. Part of our role is to have conversations and offer advice because we have seen different models from elsewhere and other approaches to running libraries. &#34;We can therefore share that knowledge. I understand the pressure local authorities are under financially but what’s important is the council engage with users. They have a legal requirement to provide a comprehensive library service.&#34;&#34;","2016/02/being-economical-with-the-truth.html"],["Swindon","Sun, 28 Feb 2016 21:22:05 +0000","Swindon – Protesters gather to voice opposition to cuts – Swindon Advertiser. &#34;Organised by the Swindon People’s Assembly, people held placards and chanted against a wide range of issues, including the closure of children centres, cuts to the library budget and plans to increase the number of parishes.&#34;","2016/02/being-economical-with-the-truth.html"],["Coventry","Sun, 28 Feb 2016 21:22:05 +0000","Coventry – Council pays more to rent library site than Coventry City FC pays to lease Ricoh Arena – Coventry Telegraph. &#34;The council has spent about £2.5m running the Arena Park library since it opened after signing up to a ten-year lease which committed them to retail-level rents&#34; … &#34;The current cost of running the library is £218,000 a year – made up of £110,850 rent, a £17,222 lease service charge and £47,082 business rates, as well as cleaning and energy costs.&#34;","2016/02/being-economical-with-the-truth.html"],["Croydon","Sun, 28 Feb 2016 21:22:05 +0000","Croydon – Newman and Labour cabinet contemplate library closures – Inside Croydon. &#34;Croydon’s ruling Labour group is split over whether to break its manifesto commitment to keep all of the borough’s libraries open&#34; … &#34;Tony Newman, the council leader, and four other members of the all-powerful council cabinet are understood to have voted in favour of abandoning the commitment on libraries, as 15 voted to break a promise to electors, while 11 councillors voted to uphold the manifesto. Those opposed to the idea did not include a single cabinet member, Inside Croydon understands.&#34;","2016/02/being-economical-with-the-truth.html"],["Northern Ireland","Sun, 28 Feb 2016 21:22:05 +0000","Northern Ireland – Tyrone crime fiction author and journalist Anthony J Quinn picked as Northern Ireland Libraries Writer in Residence – Mid Ulster Mail. He &#34;the top literary post as part of the libraries’ Creativity Month celebrations. &#34; … &#34;In addition, the award winning Dungannon author will be facilitating writing workshops, seminars, manuscript clinics and readings in a host of libraries across Northern Ireland. He will also be providing regular updates in a blog about the craft of writing. &#34;","2016/02/being-economical-with-the-truth.html"],["Oxfordshire","Sun, 28 Feb 2016 21:22:05 +0000","Oxfordshire – Heine on Friday: Spelling out our libraries’ future after council cuts – Oxford Mail. &#34;&#34;The council is looking at every brick and every piece of paper for savings and the library service can’t be immune from this. We need to save £1m out of a budget of £7.5m and that has to be realised by 2018/19. This is a big ‘ask’ but it’s a matter of ‘we have to’.&#34; .  Main cut is to mobiles. &#34;The further £650,000 will come from a reduction in the book buying fund of £500,000, a contribution from library reserve funds [past savings], library management and staffing reorganisation and retendering the library management and IT system.&#34;","2016/02/being-economical-with-the-truth.html"],["Fife","Sun, 28 Feb 2016 21:22:05 +0000","Fife – Fight to save libraries ‘has only just begun’ – Courier. &#34;A Fife body is considering legal action as a last ditch bid to save its axed library. Freuchie community council claims the battle has only just begun in the wake of last week’s controversial decision to close its library along with several others. Secretary Patrick Laughlin said the loss of the library would cause immeasurable damage to literacy levels, access to benefits and quality of life.&#34;","2016/02/being-economical-with-the-truth.html"],["Lambeth","Sun, 28 Feb 2016 21:22:05 +0000","Lambeth – Lambeth honours librarian whose job is due to disappear – Brixton Blog. &#34;A Lambeth librarian whose job is due to disappear at the end of this month was yesterday (23 February) presented with a Lambeth council award for her outstanding work. Caroline Mackie is library manager at Carnegie Library in Herne Hill – one of three Lambeth libraries due to be turned into gyms with no library staff.&#34; … &#34;The Telegraph recently revealed the library will move less than one mile to Holbrooks Community Care Association, on Holbrooks Lane, as the council bids to shave £1.2m from its library and services budget this year.&#34;","2016/02/being-economical-with-the-truth.html"],["Lambeth","Sun, 28 Feb 2016 21:22:05 +0000","Lambeth – Union to consult all Lambeth members over library strike – Brixton Blog. &#34;The Lambeth branch of the trade union Unison is to ballot all its members in the borough to discover if they would be willing to strike over the council’s plans for its libraries. The union is also planning further days of strike action by library staff in March. A strike on 8 February shut every library in the borough. Unison accused the council of pushing ahead with its closure plans before announcing its attitude to alternative plans drawn up by the head of its own library service.&#34;","2016/02/being-economical-with-the-truth.html"],["St Helens","Sun, 28 Feb 2016 21:22:05 +0000","St Helens – The 15 most borrowed books by readers at St Helens Libraries ahead of World Book Day – St Helens Star. &#34;Five children’s books were included in the list with one topping the list – a book about farm animals. Two of David Walliams’ novels, which appeal to readers aged between seven and 10, were on the list as well as two classic fairy tales&#34; … &#34;The top adults’ book was a John Grisham thriller – and recently deceased US author Harper Lee’s classic To Kill a Mockingbird features in the top 15. There are two Lee Child thrillers and two historical romances. &#34;.  Ordnance Survey maps were number six.","2016/02/being-economical-with-the-truth.html"],["Walsall","Sun, 28 Feb 2016 21:22:05 +0000","Walsall – Seven Walsall libraries saved…for now – Express and Star. &#34;The Labour and Liberal Democrat budget did not include the proposed closures of Beechdale, Blakenhall, New Invention, Rushall, South Walsall, Walsall Wood and Pleck libraries.&#34; … &#34;The new Labour and Liberal Democrat budget proposed withdrawing cuts in the region of £150,000 to street cleaning services and £211,651 to seven libraries earmarked with closure. The plans will also see Aldridge, Bloxwich, Brownhills and Willenhall libraries becoming Open Plus hubs with extended opening times.&#34;","2016/02/being-economical-with-the-truth.html"],["Manchester","Sun, 28 Feb 2016 21:22:05 +0000","Manchester – Chorlton Library to get major refurb with new suite of computers, sofas and children’s section – Manchester Evening News. &#34;Chorlton Library is to undergo a major revamp – more than a century after the original plans for the building were lost at sea on the doomed Titanic.&#34; … &#34;The interior will be improved, with a suite of new computers and a new children’s library section, as well as comfortable new sofas, chairs, display units and shelving. The Grade II listed library will close from Monday, February 29 and is due to reopen on Thursday, March 17.&#34;","2016/02/being-economical-with-the-truth.html"],["North Yorkshire","Sun, 28 Feb 2016 21:22:05 +0000","North Yorkshire – Help shape future of town library – Gazette and Herald. Norton: &#34;A steering group is aiming to transform the library in Commercial Street into a community hub ahead of financial cuts from North Yorkshire County Council (NYCC). Norton library was given community status by NYCC at a meeting to debate the future of libraries across the county last July.&#34;","2016/02/being-economical-with-the-truth.html"],["Reading","Sun, 28 Feb 2016 21:22:05 +0000","Reading – Libraries in Reading face Government cuts – ITV. &#34;Residents and library users are being asked what they think about plans to reduce opening hours in a bid to save money. The public consultation process runs for 12 weeks and asks residents and library users for feedback on a set of proposals in which all seven local services operating in the borough continue to be delivered, but opening hours are reduced to make savings.&#34;","2016/02/being-economical-with-the-truth.html"],["Staffordshire","Sun, 28 Feb 2016 21:22:05 +0000","Staffordshire – Plans to move Lichfield library to St Mary’s in the Market Square – Lichfield Mercury. &#34;Proposals to &#34;safeguard two historic buildings&#34; and open a library in the heart of Lichfield City will be considered by councillors next week. The plan to move the city’s library from its current home at the Friary to the ground floor of St Mary’s in the Market Square will be considered by members of Staffordshire County Council’s Prosperous Staffordshire select committee before any final decision is taken. Ben Adams, Staffordshire County Council cabinet member responsible for Libraries, said that the proposal for a 30-year lease at St Mary’s is in everyone’s interests.&#34;","2016/02/being-economical-with-the-truth.html"],["Northumberland","Sun, 28 Feb 2016 21:22:05 +0000","Northumberland – Libraries in new LGBT initiative – New Post Leader. &#34;To highlight the stories and experiences of LGBT people and to provide information about sources of support, resources and books are being displayed at Ashington and Cramlington Libraries.&#34;","2016/02/being-economical-with-the-truth.html"],["Oldham","Sun, 28 Feb 2016 21:22:05 +0000","Oldham – Oldham Library – Public Libraries News. A review of Oldham Library, looking at it’s services and innovations. [Produced by myself after attending a Tedx event there – Ed.]","2016/02/being-economical-with-the-truth.html"],["Telford and Wrekin","Sun, 28 Feb 2016 21:22:05 +0000","Telford and Wrekin – More libraries set to stay open under Telford council cuts – Shropshire Star. &#34;Stirchley Library will be taken on by Stirchley & Brookside Parish Council at its offices at the Sambrook Centre. Parish councillors are also looking to support the closure-threatened Brookside Central community centre and talks are taking place with local groups. Meanwhile, proposals have been put forward that could see Madeley Library move to the Anstice Memorial Hall to secure its future.&#34;","2016/02/being-economical-with-the-truth.html"],["Nottingham","Sun, 28 Feb 2016 21:22:05 +0000","Nottingham – Library closures branded ‘ludicrous’ by local residents – Nottingham Post. &#34;Two libraries could be closed and merged into one inside a refurbished police station.&#34; … &#34;Residents close to the affected libraries – Bakersfield Library and Sneinton Library – have called the plans &#34;ludicrous&#34; and &#34;a real shame&#34;. They fear the proposed new library at Sneinton Dale Police Station would be too far for some vulnerable people to travel to. They are also concerned that much-loved staff could lose their jobs.&#34;","2016/02/being-economical-with-the-truth.html"],["South Gloucestershire","Sun, 28 Feb 2016 21:22:05 +0000","South Gloucestershire – Petition to save Chipping Sodbury Library gains support – Gazette Series. &#34;The online petition calling for the library in High Street to be spared under South Gloucestershire Council’s latest round of savings has so far racked up more than 250 signatures. The petition, on social campaign site 38 Degrees, coincides with a consultation on the future of library services launched on Monday (February 22) by the council. Three options in the consultation involve closing the library which the council says does not have enough unique users, with many also accessing at the bigger Yate Library less than one mile away, to warrant its £42,000 annual costs.&#34;","2016/02/being-economical-with-the-truth.html"],["Swindon","Sun, 28 Feb 2016 21:22:05 +0000","Swindon – Briefing Paper for Libraries Taskforce visit to Swindon – Library Campaign. &#34;ensure that this visit by the Taskforce to Swindon not be treated as a mere fact-finding mission to be buried in a future Report, but welcomed as an opportunity to work with the Council to promote mechanisms that will safeguard a high standard of library provision in Swindon.&#34;","2016/02/being-economical-with-the-truth.html"],["West Berkshire","Sun, 28 Feb 2016 21:22:05 +0000","West Berkshire – West Berkshire residents unite to protest against library closure proposals – Newbury Today. &#34;Campaigners from across West Berkshire descended on Newbury Library yesterday to form a mass protest against council proposals to close eight of the district’s nine libraries. Yesterday’s protest was designed to show the council how impractical it would be if everyone from across West Berkshire only had access one library. In a defiant display of community spirit, around sixty people – both young and old – gathered in the library and held up placards.&#34;","2016/02/being-economical-with-the-truth.html"],["Lambeth","Sun, 28 Feb 2016 21:22:05 +0000","Lambeth – Lambeth honours librarian whose job is due to disappear – Brixton Blog. &#34;A Lambeth librarian whose job is due to disappear at the end of this month was yesterday (23 February) presented with a Lambeth council award for her outstanding work. Caroline Mackie is library manager at Carnegie Library in Herne Hill – one of three Lambeth libraries due to be turned into gyms with no library staff.&#34;","2016/02/being-economical-with-the-truth.html"]]