[["Birmingham","Sun, 04 Dec 2016 22:13:38 +0000","Birmingham – Sutton Coldfield Library closure plans slammed as being ‘illegal’ and ‘false economy’ – Sutton Coldfield Observer. &#34;City council representatives from the Royal town rounded on local authority officer Chris Jordan at the Sutton Coldfield District Committee Meeting held last Monday (November 28) and branded the Labour-controlled administration’s decision to close Sutton Coldfield library a ‘disgrace’.","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Bradford","Sun, 04 Dec 2016 22:13:38 +0000","Bradford – Visiting children’s laureate Chris Riddell: ‘We need libraries now more than ever’ – Telegraph and Argus. &#34;Chris Riddell spoke to pupils from two Bradford primary schools yesterday when he visited City Library as part of a national tour. &#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Brent","Sun, 04 Dec 2016 22:13:38 +0000","Brent – We have done it – Kensal Rise Library. &#34;We have just been told that our application for £75,000 to Power to Change (PTC) has been successful! PTC is an independent charitable trust set up with an endowment from The Big Lottery Fund. The PTC grant augments the funds that we have already raised from our events and donations. We have already raised £80,000 for the initial works. This means that altogether we have raised £160,000 in just under seven months – a remarkable achievement by The Friends of Kensal Rise Library and with the generous support of the community, an anonymous donation of £10,000, the Foyle Foundation, The Garfield Weston Foundation, Brent Council and our sponsors Daniels Real Estate, Kensal Rise.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Bristol","Sun, 04 Dec 2016 22:13:38 +0000","Bristol – Can the council justify spending £400,000 a year on library books when only 1 in 16 of us use them? – Bristol Post. &#34;Bristol City Council spends £400,000 a year on books and magazines but only one in 16 of us are regular library users. The sum is about two-thirds of the £630,000 annual spend on books, magazines and materials for the city’s 28 libraries.&#34; … &#34;Ms Murray explains in her report to next Tuesday’s cabinet that the council is one of a group of 14 which operate as a consortium in order to get discount prices for books by buying in bulk. This contract comes to an end in March and she is asking Mayor Marvin Rees to continue with the contract although it does not mean any extra spending.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Central Bedfordshire","Sun, 04 Dec 2016 22:13:38 +0000","Central Bedfordshire – Library as Laboratory – How can Libraries exist in the future? – Bedford Creative Arts. &#34;Bedford Creative Arts has been exploring new ways that libraries can evolve for the future by bringing together artists and libraries. The result is five pioneering projects created by eight artists, ranging from festivals and performances to slot car championships. The project is funded by Arts Council England Libraries fund and sits in the context of the government spending review which has brought about cuts to spending on libraries by local councils. Libraries are now looking at what services and community offers they can provide in order to stay open and working with other local organisations like BCA is a way to deliver this.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Central Bedfordshire","Sun, 04 Dec 2016 22:13:38 +0000","Central Bedfordshire – What the Dickens at Sandy and Barton libraries – Biggleswade Today. &#34;The new adaptation will be performed among the bookshelves, and by pioneering outside the traditional stage environment and into local communities, the company aims to unite and strengthen these two sectors, inspiring new audiences and regenerating interest in libraries&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Cumbria","Sun, 04 Dec 2016 22:13:38 +0000","Cumbria – How to have your say on library cuts – Times and Star. &#34;Libraries across Allerdale could face lunchtime closures, with some not opening on Saturday, under the plans revealed by the county council. Libraries in Aspatria, Cockermouth, Keswick, Maryport, Seaton, and Workington’s Moorclose estate are set to see their opening hours cut under the proposals.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Glasgow","Sun, 04 Dec 2016 22:13:38 +0000","Glasgow – Kids urged to curl up with a book for Christmas – Evening Times. &#34;Glasgow Libraries are challenging young Glaswegians to do just that, as they launch the Christmas Mini Reading Challenge, with a little help from five-year-old reading stars Amelia D’arcy, Abigail Gallacher and Max McLaughlan. &#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Hampshire","Sun, 04 Dec 2016 22:13:38 +0000","Hampshire – East Tisted winner of Hampshire libraries competition – Clanfield Post. &#34;Two new colourful and creative designs will become Hampshire Library cards for children following a popular competition.  …. The panel reviewed a shortlist of nearly 800 entries from across the county, submitted by children who had completed this year’s Summer Reading Challenge. Two winning designs were chosen from two different age groups – four to seven years old, and eight to eleven.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Lancashire","Sun, 04 Dec 2016 22:13:38 +0000","Lancashire – Last chapter for a 50-year-old Lostock Hall Library – Lancashire Evening Post. &#34;The Watkin Lane library closed for the last time at 12.30pm. The local community there have been told they can use other libraries nearby which have escaped the huge cuts. Lancashire County Council warned that it needs to save £200m by 2020. Community groups were invited to come forward to take control of the closing libraries. But no suitable offer came forward for Lostock Hall which was then doomed to closure. &#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Liverpool","Sun, 04 Dec 2016 22:13:38 +0000","Liverpool – Budget Simulator – Liverpool Council. Possible closure of up to seven libraries. The council would look to community organisations to step in or other alternatives, before considering this option. This would mean a significant reduction in the library service across the city.&#34;. 50% cut: &#34;Central Library opening hours reduced by 50% while all other libraries across the city close. The Home Library Service stops. We would risk not meeting the statutory (by law) requirement to provide a ‘comprehensive and efficient’ public library service.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["North Yorkshire","Sun, 04 Dec 2016 22:13:38 +0000","North Yorkshire – Rates for libraries questioned by MP – Darlington and Stockton Times. &#34;Conservatives Thirsk and Malton MP Kevin Hollinrake and Richmond MP Rishi Sunak are understood to be in discussions over Hambleton District Council’s move to only allow 80 per cent relief – which is afforded to all charitable groups – on the rates to community-run libraries, despite the six other district authorities in the county granting full relief. &#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Northern Ireland","Sun, 04 Dec 2016 22:13:38 +0000","Northern Ireland – Close-knit group make knockers and natter – BBC. &#34;Knitting, embroidery and crocheting are the arts activities which most people in Northern Ireland actually participate in, according to the annual arts report published by the Department of Communities. &#34; … &#34;Group members have a cup of tea, chat, and knit like fury. It is one of almost 80 ‘Knit and Natter’ groups that meet weekly in libraries across Northern Ireland.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Redcar and Cleveland","Sun, 04 Dec 2016 22:13:38 +0000","Redcar and Cleveland – Villages in the Redcar and east Cleveland area could lose their mobile library – Northern Echo. &#34;Redcar & Cleveland Borough Council is consulting on whether to axe the service, which visits 35 locations on a two-week rotation and provides a service to those in more remote communities who would find it difficult to visit normal libraries. &#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Sheffield","Sun, 04 Dec 2016 22:13:38 +0000","Sheffield – Chance for a ‘bigger and better five-star arts venue’ in Sheffield – Sheffield Telegraph. &#34;A petition with more than 8,000 signatures calling for the library not to be moved will be debated at a full council meeting next Wednesday, and there will be a public meeting on Tuesday evening at the Town Hall, where the proposals will be discussed.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Sheffield","Sun, 04 Dec 2016 22:13:38 +0000","Sheffield – Huge demand leads to second public meeting on Central Library hotel plans – Sheffield Telegraph. &#34;The proposals have already attracted plenty of opposition, with 8,000 people signing a petition to keep the building for public use, and Michael Palin throwing his weight behind the campaign. The council had already arranged one public meeting, to be held at the Town Hall at 5.30pm on Tuesday. But as demand for the pre-booked places rose quickly, a second meeting has been organised, again at the Town Hall at 4.30pm on December 16. Cabinet member for community services and libraries Jack Scott said: &#34;It’s great that so many people want to be involved. We’re asking people to book a place at the public meetings, rather than just turning up, as we’re expecting a high turn-out.&#34; … &#34;It says it would cost £30 million to bring the library up to modern standards.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Sheffield","Sun, 04 Dec 2016 22:13:38 +0000","Sheffield – Michael Palin ’embarrassed’ by hotel plans for Sheffield Central Library – Star. &#34;He said: &#34;I note, with real regret, and some embarrassment for the city of my birth, that the council is proposing to sell of one of Sheffield’s finest public buildings to a hotel developer.&#34;The Sheffield Central Library embodies the very best aspects of civic pride. It’s a fine building, built to give education and literacy a prominent place at the very heart of the city. &#34;That a building, seeking to improve the lot of all Sheffielders, should end up as a hotel for the rich and privileged, seems a sad reflection on how little the city cares for its public service legacy.&#34; Mr Palin is a vocal supporter of libraries, and a quote from him which reads ‘There is no institution I value more in this country than libraries’ sits at the top of the stairs on the first floor of the Central Library.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["St Helens","Sun, 04 Dec 2016 22:13:38 +0000","St Helens – Libraries to accept food in place of cash for late book returns – Liverpool Echo. &#34;Anyone who returns their book late to a library in the area can reduce the price of their fine by £1 for every item donated – up to a maximum of £50. The project will run until Saturday, December 31, and all 13 of the borough’s libraries are taking part. St Helens Council cabinet member for public health Cllr Jeanie Bell said: &#34;We’ll be delighted to see as many people as possible paying off their fines with food donations .&#34; … &#34;Under the scheme any fine of £1 or less will be written off per any one item donated.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Swindon","Sun, 04 Dec 2016 22:13:38 +0000","Swindon – Campaigners stage ‘day of action’ in response to library cuts by Swindon Borough Council – This is Wiltshire. &#34;The sit-in, staged by 12 people the oldest of whom was 73, came at the end of a ‘day of action’ by library users, campaigners and supporters across the town. &#34; … &#34;The sit-in was entirely peaceful and lasted just under one hour after closing time. The group said they wanted to speak to a senior council officer and were pleased that the Head of Libraries, Allyson Jordan, was able to make herself available to hear their concerns. &#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Swindon","Sun, 04 Dec 2016 22:13:38 +0000","Swindon – CILIP urges Government to intervene following meaningless consultation on Swindon’s libraries – CILIP. &#34;We have therefore taken the extraordinary step of issuing this statement expressing our serious concerns at the proposals set out by Swindon Borough Council in the paper Securing a sustainable future for Swindon’s Library Services and the process by which they have been reached.&#34; … &#34;In short, we believe from the papers that rather than entering into the process of consultation without prejudice, a highly prejudicial decision was made concerning budget allocation to the library service and that the end result is a service that has been hollowed-out to the point at which it can no longer be considered ‘comprehensive and efficient’.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Swindon","Sun, 04 Dec 2016 22:13:38 +0000","Swindon – Park library campaigners to continue fight over reduction in staffed hours – This is Wiltshire.","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Swindon","Sun, 04 Dec 2016 22:13:38 +0000","Swindon – ‘Read in’ staged to save Swindon’s libraries – ITV. &#34;As you might expect from a library protest – it wasn’t particularly loud, it was very eloquent – but the anger was unmistakable.&#34; … &#34;What we really want is the core purpose of libraries and access to literature and learning to be safeguarded, so that when council’s are under strain those services can’t just be pulled away as maybe the low hanging fruit when they’re making cuts.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Swindon","Sun, 04 Dec 2016 22:13:38 +0000","Swindon – There will be new chapter for libraries, says council chief – Swindon Advertiser. &#34;Council officers and my cabinet colleague Coun Mary Martin have been working incredibly hard to squeeze as much out of the funding envelope as they can and I also thank them for their dedication. We are aiming to keep all the libraries open but we are looking for potential partners to come forward to work with us. Unfortunately the climate the council is operating in is far from ideal.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Swindon","Sun, 04 Dec 2016 22:13:38 +0000","Swindon – We need to throw our weight behind a Trust for libraries, says MP – This is Wiltshire. Justin Tomlinson MP: &#34;I am an unashamed library fan. I have previously served as the Lead Member for Libraries on SBC and was the Chair of the All-Party Parliamentary Group on Libraries. I have led Parliamentary debates on the future of libraries, have spoken at numerous library conferences, launched the annual children’s Summer Reading challenges and crucially, I am a regular user (including overdue fines!) of our fantastic library network.&#34; … &#34;there is real potential for a Library Trust to be set up. Devon County Council did so in April this year with their Libraries Unlimited social enterprise. As a charity they are able to reclaim business rates (worth about £400,000 for Swindon’s libraries), apply for grants and encourage philanthropy. Their mission is to bring ideas, imagination, knowledge and creativity to people’s lives and communities, focusing on promoting and encouraging a love of reading. &#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Waltham Forest","Sun, 04 Dec 2016 22:13:38 +0000","Waltham Forest – Council to consult public on closure of Walthamstow libraries after protests – Guardian series. &#34;Libraries users are being asked if they want to see some services moved after council plans to close two sites caused a public backlash. Waltham Forest council has extended its consultation on proposals to reshape the borough’s library services until January 31 next year. The local authority is planning to close Higham Hill and Wood Street Libraries and the branches to Library Local &#34;multi-purpose hubs&#34;. However, campaigns have been launched to keep both sites open, with online petitions collecting close to 2,000 signatures.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["West Berkshire","Sun, 04 Dec 2016 22:13:38 +0000","West Berkshire – Residents could end up paying more to keep libraries open – Newbury Today. &#34;Precepts set to rise as towns and parishes asked to cough up £150,000″ … &#34;West Berkshire Council wants every town and parish council to make a contribution so it can raise £150,000 towards the cost of running the library service. How much each parish is being asked to pay depends on its population, but will equate to approximately £1 for every person. And with many town and parish councils facing significant financial challenges of their own, many will be forced to consider raising their precepts – the amount of council tax they collect from residents. In addition, volunteers are still being asked to come forward to help run libraries as West Berkshire Council needs to save £690,000 from its budget.&#34;","2016/12/public-libraries-now-have-ambition-well-perhaps.html"],["Birmingham","Tue, 06 Dec 2016 21:02:54 +0000","Birmingham – Make some noise! Join the Save our Libraries rally this Saturday – Sutton Coldfield News. &#34;Sutton Coldfield campaign group, The Library Lobby, are inviting everyone keen to show their support for Sutton Coldfield public library, or their own local library, to join them on Saturday 10th December in a march against the proposed cuts by Birmingham City Council&#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["Hertfordshire","Tue, 06 Dec 2016 21:02:54 +0000","Hertfordshire – Libraries lead the way in attracting visitors – Hertfordshire County Council. &#34;Last year the county’s libraries were visited by 3.7m people (and 2m people visited online); more than the Science Museum (3.4m), the Tower of London (2.8m) and London Zoo (1.3m). The popularity of Hertfordshire’s libraries is due to the wide range of events and activities for young and old alike; from baby rhyme time and toddler tales to coding clubs for youngsters and tablet taster sessions for older people. These events ensure that libraries remain a place for everyone and help to create a community hub where people can meet like-minded others, learn new skills and get involved&#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["Leeds","Tue, 06 Dec 2016 21:02:54 +0000","Leeds – Commoners Choir: Mechanical Movable Type – Commoners Choir / YouTube. &#34;A short film of a Commoners Choir event held at Leeds Central Library in November 2016 to celebrate print, literacy and libraries. As well as a full choir concert (including this song in homage to Johannes Gutenberg, inventor of type) the walls were covered in words – quotes from the incredible history of the type revolution – and a letterpress printer made on-site souvenirs for everyone to take away.&#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["North Lanarkshire","Tue, 06 Dec 2016 21:02:54 +0000","North Lanarkshire – Writer Kathleen Ruddy latest name to back campaign to save Newarthill Library – Daily Record. &#34;The library is currently set to close on January 31 and a committee has set up a constituted community group to fight the decision. Kathleen said: &#34;Libraries were important to me as a kid. I’d usually be found in the dictionary section looking up all the bad words. &#34;Bless our libraries and all who read in them.&#34; Earlier this year CultureNL announced that they could no longer afford to operate services from Newarthill Library. Local residents are seeking a judicial review over the consultation process by CultureNL which they claim was flawed. Since the new group was formed a huge online campaign with the Twitter hashtag #savenewarthilllibrary has helped show the level of support for the residents.&#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["Northern Ireland","Tue, 06 Dec 2016 21:02:54 +0000","Northern Ireland – Libraries NI announces plans for a Big Armagh Read – Portadown Times. &#34;During March 2017, Libraries NI will encourage as many people as possible across County Armagh to read the selected book with the nine public libraries across County Armagh (Armagh City, Bessbrook, Brownlow, Crossmaglen, Keady, Lurgan, Portadown, Richhill and Tandragee) stocking multiple copies of the book for people to borrow for free.&#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["Sandwell","Tue, 06 Dec 2016 21:02:54 +0000","Sandwell – Santa Claus planning breakfast in Blackheath before festive rush – Halesowen News. &#34;On Monday, December 19 Santa will be at Bleakhouse Library, Bleakhouse Road, Oldbury from 9.15am until 9.45am. Children can enjoy Christmas stories and breakfast with Santa before he goes off to prepare for the big day with tea and toast provided. Councillor Richard Marshall, cabinet member for leisure, said: &#34;There’s a wide range of activities at Sandwell’s libraries in the run up to Christmas.&#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["Sheffield","Tue, 06 Dec 2016 21:02:54 +0000","Sheffield – Campaigners try to save Sheffield library from becoming five-star hotel – Guardian. &#34;Actor Michael Palin has described the proposals as an embarrassment for the city of his birth and is among nearly 9,000 people to have signed a petition calling for the building to be kept as a public resource. The local authority says the art deco, grade II-listed building needs £30m worth of repairs, which it cannot afford after cuts to its budget by central government. Sichuan Guodong Construction Group has been given 12 months to explore the possibility of turning the building into the city’s first five-star hotel, which would result in library services being moved to a new, purpose-built building.&#34; … &#34;Scott said the proposals were for the building to be leased to the Chinese company, not sold, and that the hotel would raise an estimated £1m a year from business rates, which could be spent on a new library&#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["St Helens","Tue, 06 Dec 2016 21:02:54 +0000","St Helens – Libraries to accept food in place of cash for late book returns – Liverpool Echo. &#34;Anyone who returns their book late to a library in the area can reduce the price of their fine by £1 for every item donated – up to a maximum of £50. The project will run until Saturday, December 31, and all 13 of the borough’s libraries are taking part&#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["Swindon","Tue, 06 Dec 2016 21:02:54 +0000","Swindon – Parish council is first to give hope as Swindon libraries face closure – Swindon Advertiser. &#34;Stratton St Margaret Parish Council has been holding talks with Swindon Borough Council and looks set to be a part of the first wave of community libraries with the transfer of Upper Stratton Library in Beechcroft Road. &#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["Swindon","Tue, 06 Dec 2016 21:02:54 +0000","Swindon – Shadow culture minister and CILIP push for Swindon libraries intervention – BookSeller. &#34;Shadow culture minister Kevin Brennan [pictured] has called on the Secretary of State for Culture, Karen Bradley, to intervene in Swindon Council’s plans to close two thirds of the borough’s libraries. Posing a written question in parliament, Brennan has asked Bradley to make an assessment of whether Swindon Borough Council’s plans to close 10 out of 15 of its libraries comply with the duty to provide a comprehensive and efficient library service. Nick Poole, the c.e.o. of the Chartered Institute of Library and Information Professionals, also pushed the government for intervention and slammed the consultation period which resulted in the proposed closures as &#34;highly prejudicial&#34;.&#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["Swindon","Tue, 06 Dec 2016 21:02:54 +0000","Swindon – Swindon: Library automation equipment – Tenders Electronic Daily. &#34;SBC is looking at ways to enhance the core service by extending opening beyond staffed hours by using technology that will enable a library to stay open unstaffed for permitted users to obtain services they require as if the library was staffed. The framework may cover any libraries in Swindon borough. It is anticipated that libraries will need the same technology therefore the contract will need to include potential future purchases.&#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["Swindon","Tue, 06 Dec 2016 21:02:54 +0000","Swindon – Your chance to give library a new chapter – Swindon Advertiser. &#34;…. groups wishing to take on the running of a library have until January to submit an expression of interest. By the end of March they will have to complete a full application. Among the requirements are audited accounts and an agreed constitution, as well as a full business plan with financial forecasts and funding proposals for the next five years. Prospective library providers must have, or be willing to acquire, public liability insurance for not less than £5,000,000.&#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["Warrington","Tue, 06 Dec 2016 21:02:54 +0000","Warrington – Councillors set to debate library petitions at meeting – Warrington Guardian. &#34;More than 10,000 people signed the Save Warrington’s Libraries petition in protest against community interest company LiveWire’s plans to make savings of £300,000 from the library service. The 10,711 signatures far exceeds the 1,500 names needed to force councillors to debate a petition.&#34;","2016/12/charging-for-events-can-be-good-for-you.html"],["Barnet","Thu, 08 Dec 2016 21:23:06 +0000","Barnet – ‘There’s still time to stop our library being turned into office space,’ say campaigners – Barnet Today. &#34;Campaigners staged a demonstration outside Chipping Barnet Library in protest over plans to convert part of the building into commercial office space as well the installation of self-service machinery, which will partly replace the jobs of library staff. Around 30 campaigners staged a &#34;read-in&#34; outside the closed front doors of the library building yesterday (December 5) on the day it was closed for two months for the refurbishment work.&#34;","2016/12/cilip-figures-despair-and-hope.html"],["Bristol","Thu, 08 Dec 2016 21:23:06 +0000","Bristol – £92 million council cuts: Bristol’s libraries back in the frontline for shake up – Bristol Post. &#34;During the next four years, the council is expected to commit itself to saving up to £1million in running the city’s 28 libraries. The council backed off making the saving a few years ago after an outcry by campaigners when plans were revealed to close down seven libraries. Now council officials are taking a different tack. Instead of closing down libraries, they are suggesting they could be run by volunteers or share buildings with other council services.&#34;","2016/12/cilip-figures-despair-and-hope.html"],["Devon","Thu, 08 Dec 2016 21:23:06 +0000","Devon – Devon libraries promote Christmas reading challenge – View News. &#34;More than 11,000 children across Devon took part in the annual Summer Reading Challenge, a national initiative that challenges children to read at least six books during the school holidays. Now children are being encouraged to take up the Christmas Mini-Challenge and read three books of their choice from a local library in return for milestone rewards. The challenge runs online till Friday. January 6th 2017. To take part children are asked to create a profile on the Summer Reading Challenge website and log their reading achievements over the Christmas holidays. Upon completion, children will be awarded with a virtual badge, reward video and a certificate.&#34;","2016/12/cilip-figures-despair-and-hope.html"],["East Sussex","Thu, 08 Dec 2016 21:23:06 +0000","East Sussex – New computers boost for libraries’ network – Uckfield FM. &#34;New computer terminals have been installed at all of the county’s 24 libraries in a nine-month scheme to improve East Sussex County Council’s network of free-to-access PCs.&#34; … &#34;Among those benefitting from the £477,000 upgrade are users of the IT For You scheme, which offers advice and support on using IT to prepare a CV and apply for jobs.&#34;","2016/12/cilip-figures-despair-and-hope.html"],["Norfolk","Thu, 08 Dec 2016 21:23:06 +0000","Norfolk – The top 10 books borrowed from the Forum library in Norwich last year – Eastern Daily Press. &#34;New figures from the Chartered Institute of Public Finance and Accountancy (CIPFA) found that the Norfolk and Norwich Millennium Library, based at the Forum in Norwich, saw 984,445 items borrowed during 2015 to 2016, the highest number in the UK. In previous years, the popular library has been named the busiest in the UK – a title this year scooped by the Library of Birmingham – with six consecutive wins up to 2013.&#34;","2016/12/cilip-figures-despair-and-hope.html"],["North Somerset","Thu, 08 Dec 2016 21:23:06 +0000","North Somerset – Self service libraries in North Somerset ‘to cut costs’ – BBC. &#34;Reducing staffed library opening hours and sharing buildings in North Somerset will save £250,000 per year, the council has said. Under the plan, five libraries will introduce self service operation and one will be run by a parish council. The equivalent of 11 jobs will be lost while some sites will also move and merge with children’s centres, meaning a loss of six full time roles.&#34;","2016/12/cilip-figures-despair-and-hope.html"],["North Yorkshire","Thu, 08 Dec 2016 21:23:06 +0000","North Yorkshire – Library Volunteers Needed In North Yorkshire Libraries – Yorkshire Coast Radio. &#34;North Yorkshire County Council are launching a campaign to get people to volunteer in libraries. The campaign, which launches later this month, encourages people to make a difference in their communities by helping to keep libraries open. Currently, there are 10 community-managed libraries operating up and down the county, with a further 20 planned for the new year. The change comes as a result of government cuts in funding which has seen the library budget reduced from £7.8 million in 2010 to £4.3 million in 2017/18″","2016/12/cilip-figures-despair-and-hope.html"],["Nottingham","Thu, 08 Dec 2016 21:23:06 +0000","Nottingham – Sale of Nottingham Central Library will go ahead – Business Desk. &#34;By selling the Angel Row site to developers, we can invest in a new and updated library facility which otherwise we couldn’t do. By bringing inward investment to the city, Nottingham gets a new library, new grade A office space and new jobs.&#34; … &#34;Developer Henry Boot revealed last month that it is set to transform Nottingham’s Central Library into a 120,000 sq ft Grade A office scheme after the City Council said that it was offloading the building.&#34;","2016/12/cilip-figures-despair-and-hope.html"],["Rotherham","Thu, 08 Dec 2016 21:23:06 +0000","Rotherham – Libraries to loan out life-saving equipment and training at the heart of South Yorkshire communities – Sheffield Telegraph. &#34;The British Heart Foundation (BHF)’s Rotherham Heart Town partnership will deliver life saving community CPR training kits and public access defibrillators (PADs) to all libraries over the next few months. Under the pilot project, the BHF is funding community CPR training kits for all 15 libraries. These innovative Call Push Rescue training kits include everything needed to learn CPR in half an hour. Members of the public will be able to borrow the kit for local community organisations and return it after their training session, just as they would a book. &#34;","2016/12/cilip-figures-despair-and-hope.html"],["Swindon","Thu, 08 Dec 2016 21:23:06 +0000","Swindon – Councillors in Stratton raise doubts over library takeover plans – Swindon Advertiser. &#34;On Tuesday evening, members of the Stratton St Margaret Parish Council met with representatives from Swindon Borough Council to discuss handing control of Upper Stratton Library in Beechcroft Road to the parish council. But after a lengthy debate, councillors decided they had insufficient information to proceed and deferred their decision until January. Despite parish council chairman Joe Tray’s enthusiasm for the takeover, there was a noticeable air of scepticism, though Coun Tray insisted there was never any intention to proceed without the full support of members.&#34;","2016/12/cilip-figures-despair-and-hope.html"],["Swindon","Thu, 08 Dec 2016 21:23:06 +0000","Swindon – The future of libraries in Swindon to be decided – ITV.","2016/12/cilip-figures-despair-and-hope.html"],["Swindon","Thu, 08 Dec 2016 21:23:06 +0000","Swindon – Hours cut at five core libraries while 10 face uncertain fate – Swindon Advertiser. &#34;Cabinet members voted unanimously to approve a strategy which will see funding withdrawn from ten of the town’s 15 existing libraries – the remaining five will see significant reductions in staffed hours. The plans are the latest in a series of restructuring efforts aimed at reducing the amount the council spends on services as it looks to save almost £50 million by 2020, the library cuts are expected to save £1.5 million.&#34;","2016/12/cilip-figures-despair-and-hope.html"],["Swindon","Thu, 08 Dec 2016 21:23:06 +0000","Swindon – &#34;Libraries can saved&#34; – Swindon Advertiser / Letters. &#34;Justin Tomlinson, the MP for North Swindon suddenly pops up in Friday’s Adver stating that he is an unashamed library fan. He also says that he knows that Coun David Renard, the leader of SBC is passionate about our local libraries. Both of these men belong to the Tory Party, which is responsible for the cuts causing the closures of our libraries. Justin states that he has been meeting with the Save Swindon’s Libraries Group and representatives of the community libraries, to look at options to protect our libraries. He speaks as if the lack of money is an inevitable result of circumstances. Actually it is his government’s political choice and not an economic necessity.&#34;","2016/12/cilip-figures-despair-and-hope.html"],["Swindon","Thu, 08 Dec 2016 21:23:06 +0000","Swindon – Swindon libraries campaigners ‘need more time’ – BBC. &#34;Sarah Church, from Save Swindon Libraries, said &#34;even established community groups&#34; would struggle to come up with a plan in that time. She added: &#34;We need to look carefully at what steps the group can now take to save the smaller libraries.&#34;&#34;","2016/12/cilip-figures-despair-and-hope.html"],["Birmingham","Sun, 11 Dec 2016 20:18:00 +0000","Birmingham – Protestors battling to save Sutton Coldfield Library to lead march from Aldi through town centre – Sutton Coldfield Observer. &#34;Members of The Library Lobby will be showing their support for the much-loved facility, which is facing the axe due to Birmingham City Council budget cuts, at a protest being held tomorrow (Saturday, December 10). The group is now inviting everyone who wants to see the facility stay open to join them outside Aldi in The Parade at 11am.&#34;","2016/12/minister-leads-fight-back-torfaen.html"],["Derby","Sun, 11 Dec 2016 20:18:00 +0000","Derby – Online petition launched in bid to save Derby’s Central Library – Derby Telegraph. &#34;Rob Fisher is hoping to have at least 3,000 signatures on his petition, which he intends to present to Derby City Council to demonstrate the strength of people’s feeling against the move.&#34; … &#34;&#34;There would be much less room in the Council House and not a good combination with the other business that goes on there.&#34;","2016/12/minister-leads-fight-back-torfaen.html"],["Dundee","Sun, 11 Dec 2016 20:18:00 +0000","Dundee – Visitors up at city pools and libraries – Evening Telegraph. &#34;And the city hosted 5,577 digital literacy sessions across the six-month period — a substantial rise from the 3,916 held 12 months previously. The figures were revealed in a report going before the council’s scrutiny committee next week. The report said that library visitor numbers included virtual visits — which are expected to increase in the future. It also detailed how digital literacy volunteers had delivered 1,956 hours of support throughout this period. And the rise in e-reading resources is attributed to the addition of links to library website homepages, to make access easier.&#34;","2016/12/minister-leads-fight-back-torfaen.html"],["Lancashire","Sun, 11 Dec 2016 20:18:00 +0000","Lancashire – New chapter for axed Trawden Library thanks to community focus – Lancashire Telegraph. &#34;The former Trawden Library will reopen as a community shop, a Post Office and bring back a library service to the village. &#34;","2016/12/minister-leads-fight-back-torfaen.html"],["Lancashire","Sun, 11 Dec 2016 20:18:00 +0000","Lancashire – Changes to where we provide your services – Lancashire County Council. &#34;The former Fulwood and Freckleton library buildings are now for sale.&#34; [Fulwood had 48,000 visits p.a. – Ed.]","2016/12/minister-leads-fight-back-torfaen.html"],["Lancashire","Sun, 11 Dec 2016 20:18:00 +0000","Lancashire – Joy as library and community centre saved from the axe – Rossendale Free Press. &#34;Lancashire County Council (LCC) has approved a community asset transfer for the Crawshawbooth Community Association to take over Crawshawbooth Library and Community Centre and for Whitewell Bottom Community Centre to be transferred to Whitewell Bottom Community Association&#34;","2016/12/minister-leads-fight-back-torfaen.html"],["North Lanarkshire","Sun, 11 Dec 2016 20:18:00 +0000","North Lanarkshire – Big Issue columnist Damian Barr helps to save Newarthill library – Big Issue. &#34;Following an extensive and heartfelt community campaign, councillors have voted to keep Newarthill library open. The library in North Lanarkshire, Scotland had been earmarked for closure along with six others, but a community campaign – which included Big Issue columnist Damian Barr – has managed to prevent the closure of a much loved and used library.&#34;","2016/12/minister-leads-fight-back-torfaen.html"],["Nottingham","Sun, 11 Dec 2016 20:18:00 +0000","Nottingham – Plans to create a new library in Nottingham will go ahead – West Bridgford Wire. &#34;Nottingham City Council will go ahead with its earlier decision to develop a new Central Library after a meeting to review it agreed to the move. Earlier this month the council had decided in principle to sell the library building on Angel Row to construction and property business Henry Boot Developments Limited, in a deal which would see new Central Library facilities developed, as well as high-grade office space.&#34;","2016/12/minister-leads-fight-back-torfaen.html"],["Swindon","Sun, 11 Dec 2016 20:18:00 +0000","Swindon – An open letter to Swindon Council – BookSeller. Steve Antony: &#34;As Swindon Libraries Patron to Children’s Reading Services I want to speak up for the hundreds of children whose lives could be negatively impacted by these plans. Since the publication of my first children’s book, in 2014, I’ve visited many libraries in towns and cities across the UK, including my hometown of Swindon, and I have seen first-hand just how effectively our librarians positively impact the lives of children in their local communities. I’ve seen how Swindon librarians inspire and nurture a love of reading amongst children by reaching out to local schools, holding weekly story time sessions, running regular contests and competitions, celebrating nationwide reading campaigns, and so much more.&#34;","2016/12/minister-leads-fight-back-torfaen.html"],["Swindon","Sun, 11 Dec 2016 20:18:00 +0000","Swindon – Council’s vision for libraries could change within months – Swindon Advertiser. &#34;The council is now considering adopting a trust model for the service, a move that could alter the financial modelling around which the latest plans are built. &#34;","2016/12/minister-leads-fight-back-torfaen.html"],["Swindon","Sun, 11 Dec 2016 20:18:00 +0000","Swindon – We have won Parliamentary support for Library Trust, says MP – Swindon Advertiser. &#34;… following on from my article last week we have had further progress towards establishing a Swindon Library Trust. I arranged a meeting with the minister responsible for libraries on Monday, which I attended with SBC Cabinet Member Mary Martin, despite the short notice.&#34; … &#34;Mary was very impressive and helped us make the most of this opportunity. The Minister spoke of his support for setting up a Library Trust and agreed to provide financial assistance to help with the set-up. This was overwhelmingly supported at the SBC Cabinet meeting on Wednesday and provides a real opportunity to safeguard our library network.&#34;","2016/12/minister-leads-fight-back-torfaen.html"],["Torfaen","Sun, 11 Dec 2016 20:18:00 +0000","Torfaen – Cleaner Communities Overview & Scrutiny Committee – Torfaen Council. &#34;The HEEE outlined a report and responded to members’ questions regarding options for the reconfiguration of the Library and Information Service to achieve the Council’s stated budget set for 2017/18. In particular the following was noted: that a consultation on the proposals would be undertaken; consideration had been given to the impact on staff and timeliness of required savings; further cuts make it increasingly difficult to achieve the Wales Library Standards and Torfaen would be placed further down the league table; the options presented require a reduction in the book loan service …&#34;","2016/12/minister-leads-fight-back-torfaen.html"],["Torfaen","Sun, 11 Dec 2016 20:18:00 +0000","Torfaen – The future of the library service in Torfaen – Torfaen Council. £250k cut. &#34;Reducing the manned book loan service in all three libraries to the equivalent of three days per week. Self-service options will be available on the non-manned days that will enable customers to check out and return books themselves; Reducing the manned book loan service in Blaenavon and Pontypool to the equivalent of two and a half days per week, and Cwmbran to the equivalent of four days per week. Self-service options will be available on the non-manned days that will enable customers to check out and return books themselves. (This option is calculated to recognise the spread of customers using the library service across the borough. It also takes into account Cwmbran Library’s position as one of Wales’s libraries of strategic importance, and the range of the resources on offer there); Closing a library.&#34;","2016/12/minister-leads-fight-back-torfaen.html"],["Worcestershire","Sun, 11 Dec 2016 20:18:00 +0000","Worcestershire – It’s secured a gong again! Worcester’s gold-cladded £60m Hive handed another top British accolade – Worcester News. &#34;The gold-cladded venue, which has become one of Britain’s most popular libraries since opening four-and-half years ago, has triumphed in the Library Design Awards 2016. A panel of experts from the Society of College, National and University Libraries decided it was the best development of over 2,000 square metres floorspace. The society, which represents learning institutions across the UK and Ireland, handed out the gong on the basis of the library’s functionality as well as its appearance.&#34;","2016/12/minister-leads-fight-back-torfaen.html"],["Barnsley","Wed, 14 Dec 2016 20:31:01 +0000","Barnsley – Jayne Dowle: Libraries should be places to cherish, not shut down – North Yorkshire Post. &#34;…his library was replaced by an excellent new sixth form college. The howls of indignation subsided, the library has a temporary home and a brand-new replacement will be built as part of Barnsley’s town centre improvements. In my town at least, the library will continue to be cherished. I just wish I could say the same for the rest of the country.&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Calderdale","Wed, 14 Dec 2016 20:31:01 +0000","Calderdale – New plan for the future of libraries – Telegraph and Argus. &#34;The three-year strategy is based around promoting digital access and inclusion as well as skills acquisition and access to employment, among other things. &#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Cheshire West and Chester","Wed, 14 Dec 2016 20:31:01 +0000","Cheshire West and Chester – Star Wars fans to be out in force for Northwich Library event – Northwich Guardian. &#34;Superfan Mike Holman, from Northwich, will be in costume along with others from around 10am to 12.30pm. Mike, who owns a comic distribution company, and his troops will also be handing out free comics and those who attend. Mike said: &#34;I’ve had a love for Star Wars and all things ‘geeky’ since I was young and am excited about the fact that all of the things I still love and enjoy today are now popular amongst everyone and how it’s now trendy to be a ‘geek’.&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Devon","Wed, 14 Dec 2016 20:31:01 +0000","Devon – Rare and ancient books in Exeter to be given new lease of life – Libraries Unlimited. &#34;Joanne Cousins, senior supervisor at the library, was granted funding from Carnegie Library Lab, a created by the Carnegie UK Trust to support and develop innovation and leadership in the public library sector across the UK and Ireland. Joanne received £5,000 to put towards the launch of a new ‘Adopt a Book’ initiative, after she fell in love with the collection of ancient books stored in the library’s archives. The scheme will allow people to ‘adopt’ an item of their choice and help fund its restoration. The special collections archive at Exeter Library consists of around 6000 items dating from 1480 to 1900. The oldest is an ‘Incunable’ (a book that was printed rather than written before 1501 in Europe) written by a Benedictine monk born in Sicily in 1386. This book dates back to 1480 and is one of only 80 copies in existence.&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Durham","Wed, 14 Dec 2016 20:31:01 +0000","Durham – Volunteers fight back against library funding cuts – Durham Advertiser. &#34; more than 100 volunteers are rallying around to help keep a community library open. Like hundreds across the country, Belmont Library, near Durham, was threatened with closure due to reducing local government budgets. But thanks to the support of the Friends of Belmont Library – a community orientated band of volunteers – it is still able to put on events for residents.&#34; … &#34;Though library hours have been reduced by half, the group puts on coffee mornings and talks by local authors such as Helen Cadbury, winner of the Northern Crime Competition for her novel, To Catch a Rabbit&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Lancashire","Wed, 14 Dec 2016 20:31:01 +0000","Lancashire – Lancashire County Council agrees to hand over three libraries – BBC. &#34;The council has agreed to support the libraries at Crawshawbooth, Oswaldtwistle and Trawden with £5,000 each and an annual £1,000 grant. But it has declined applications to hand over former libraries in Earby, Barrowford and Whalley. Lancashire County Council (LCC) has also agreed that, in principle, an independent community library can be established in Hyndburn at the Arthur Wilson Centre, which is not a council building. Whitewell Bottom Community Centre and Stoops and Hargher Clough Community Centre will also be handed over to local independent organisations.&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Leicestershire","Wed, 14 Dec 2016 20:31:01 +0000","Leicestershire – Validation of the proposed service model for Leicestershire Library Services – Pro Contract.  &#34;Quotations are invited for the provision of a validation of the proposed operating model for Leicestershire Library Services against the &#34;comprehensive and efficient&#34; duty of the 1964 Public Libraries and Museums Act and to identify potential further efficiencies whilst maintaining the &#34;comprehensive and efficient&#34; duty&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Rochdale","Wed, 14 Dec 2016 20:31:01 +0000","Rochdale – Balderstone Library to open on Christmas Day – Rochdale Borough Council. &#34;Balderstone Library in Balderstone Park will be serving up a late Christmas Breakfast from 11.30am to 1pm on Sunday, 25 December 2016, along with board games, carols, music and conversation.  There will be coffee, pastries and festive treats too.&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Sheffield","Wed, 14 Dec 2016 20:31:01 +0000","Sheffield – Sheffield Council facing ‘significant costs’ for planned library move – Star. &#34;A report going to a council scrutiny meeting on Thursday said full estimated costs for the proposed scheme are yet to be finalised.&#34; … &#34;A report by Alice Nicholson, policy and improvement officer for Sheffield Council, said the authority may have to fund the relocation of the library itself if the scheme goes ahead. She said: &#34;It may likely require the council to commit to some up-front costs to relocate the Central Library service and potentially undertake other enabling works.&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Stockton","Wed, 14 Dec 2016 20:31:01 +0000","Stockton – Yarm Library co-locates with Newcastle Building Society – Libraries Taskforce. &#34;Yarm Library’s recent refurbishment is the last of our town centre &#34;main library&#34; developments following the adoption of a hub and spoke approach by Stockton Borough Council in 2011. The High Street location of the building means it is a prime site not only for us, but also for potential partners. In 2014 we were approached by Newcastle Building Society who were looking for potential co-location sites for small branches in areas which weren’t served by a main branch.&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Swindon","Wed, 14 Dec 2016 20:31:01 +0000","Swindon – Libraries proposal given the green light by committee – but only by one vote – Swindon Advertiser. &#34;The council’s scrutiny committee voted by seven votes to six to allow the proposals to proceed to the implementation stage. The narrow vote followed a lengthy and passionate debate in which Labour councillors accused the administration of pushing ahead with plans that were too unclear to be properly enacted.&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Swindon","Wed, 14 Dec 2016 20:31:01 +0000","Swindon – Ministers suggest libraries could stay – Swindon Advertiser. &#34;The council is now considering adopting a trust model for the service, a move that could alter the financial modelling around which the latest plans are built. Coun Martin said: &#34;We are very keen to move to a trust or mutual model, subject to cabinet approval, and we have agreement in principle from Libraries Minister Rob Wilson that we can have some assistance in getting this in place.&#34;&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Swindon","Wed, 14 Dec 2016 20:31:01 +0000","Swindon – New library model approved by Council’s Cabinet – Swindon News. &#34;The new model, which will be examined by the scrutiny committee next Monday (12 Dec), would see a core network of five libraries operate throughout the town which meet 80 per cent of current visits. The core provision would mean that 84 per cent of current library users and 91 per cent of Swindon households are within two miles of a library.&#34; … &#34;&#34;We have been accused of dismissing the staff-led trust model which came out of the consultation, yet that could not be further from the truth as we have brought forward our work to consider trusts and mutual models as a result of the feedback we received.&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Walsall","Wed, 14 Dec 2016 20:31:01 +0000","Walsall – Have your say on possible closure of Bloxwich Library and Theatre – Bloxwich Telegraph. &#34;Walsall Council is seriously considering, amongst other options, closing all of the Borough’s branch libraries, including Bloxwich Library and Theatre (aka Bookmark Bloxwich) in Elmore Row.   This is due to the swingeing and cruel national government budget cuts being inflicted on the borough. Amongst the many other possible ‘culture cuts’ (including massive reductions in funding to the New Art Gallery and major cutbacks involving the potential downsizing and moving of Walsall Leather Museum and Walsall Local History Centre in with the Central Library in Lichfield Street), such a closure would be a huge blow to Bloxwich and district both in cultural and educational terms.&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["West Berkshire","Wed, 14 Dec 2016 20:31:01 +0000","West Berkshire – Revealed: The cost of keeping libraries open – Newbury Today. &#34;Council has written to every town and parish council in the district asking them to make a contribution towards the cost of running the library service. How much each parish is being asked to pay depends on its population, but equates to approximately £1 for every person. Newbury Town Council is being asked to stump up £31,275 and Thatcham Town Council £24,480. By contrast, Stanford Dingley is being asked to pay £195. With many town and parish councils facing significant financial challenges of their own, some will be forced to consider raising their precepts – the amount of council tax they collect from residents – or simply not making a contribution at all.&#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Wirral","Wed, 14 Dec 2016 20:31:01 +0000","Wirral – Reminiscence boxes bring back memories for Wirral dementia patients – Wirral Globe. &#34;Reminiscence boxes containing retro household items, clothes and music will help dementia sufferers recall memories. Wirral’s libraries will have an important role in collating and distributing them. &#34;","2016/12/reading-feeding-and-staying-open-on-christmas-day-innovation-continues.html"],["Barnet","Mon, 19 Dec 2016 20:59:48 +0000","Barnet – Campaigners seek government intervention to prevent library cuts – Enfield Today. &#34;The Save Barnet Libraries campaign is demanding an inquiry into the cuts by the council, which has submitted 12 separate planning applications to remove more than half of the current library space in the borough and turn it into private offices. The group has highlighted a procurement document which shows that the local authority has earmarked £12million to implement the changes – yet other figures show that forecasted savings are about £2.2m a year. Under the cuts, self-service machinery and CCTV will be installed so libraries can remain open without staff.&#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Bath and North East Somerset","Mon, 19 Dec 2016 20:59:48 +0000","Bath and North East Somerset – Bath Central Library on the move as part of Council plans to modernise services – Bath Echo. &#34;Bath & North East Somerset Council has announced further plans to modernise library services across the area, including relocating Bath Central Library to Lewis House on Manvers Street.&#34; … &#34;Following the success of the joint library and One Stop Shop in Keynsham, plans have been announced that will also see Bath’s Central Library and Midsomer Norton Library modernised to reflect the changing way people use the library service.&#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Birmingham","Mon, 19 Dec 2016 20:59:48 +0000","Birmingham – Powerful plea from Abisha Sharon, 8, to save Sutton Coldfield Library receives town council support – Sutton Coldfield Observer.","2016/12/celebrating-celebrating-shakespeare.html"],["Brent","Mon, 19 Dec 2016 20:59:48 +0000","Brent – Wembley Library named as the third busiest in Britain – Brent and Kilburn Times. &#34;According to a public survey carried out by the Chartered Institute of Public Finance and Accountancy only the Library of Birmingham and Manchester Central Library are busier.&#34; … &#34;The library, which is located inside Brent Civic Centre, recorded 1.38 million visits this year which is an increase on last year when it was visited 1.17million times. In addition all six libraries in the borough have been slightly busier than this time last year with a 0.6 per cent increase in visitor numbers.&#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Devon","Mon, 19 Dec 2016 20:59:48 +0000","Devon – Adopt A Book – BBC Spotlight. Television clip of two minutes showing the old stock at Exeter Library and a scheme to encourage the public to pay for their preservation via &#34;adoption&#34;/sponsorship.","2016/12/celebrating-celebrating-shakespeare.html"],["Dorset","Mon, 19 Dec 2016 20:59:48 +0000","Dorset – Building disposals in bid to meet budget cuts – Dorset Echo. &#34;Out of the 60 buildings sold or ‘given up’ 14 of them were libraries, day centres or learning centres. Other buildings included residential care homes, depots and workshops, offices and admin buildings. &#34; … &#34;In the space of nine months from June 2012 to February 2013 six libraries were either sold or ‘given up’ by DCC. Portland Underhill Library, Chickerell Library, Wool Library and Puddletown Library were ‘given up’ and Charmouth Library and Stalbridge Library were sold. &#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Greenwich","Mon, 19 Dec 2016 20:59:48 +0000","Greenwich – Greenwich people love libraries more than everyone else in the UK, figures show – This is Local London. &#34;Libraries in Greenwich had the highest visits per residents of any borough in the UK last year. The 12 local libraries in the London borough saw 2,408,866 visits to its libraries in 2015/2016 according to statistics from the Chartered Institute for Public Financing and Accounting (CIPFA). This is the highest footfall in libraries out of all the London boroughs. This means 8,766 library visits per 1,000 residents – the highest visit rate across the whole of the UK.&#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Lancashire","Mon, 19 Dec 2016 20:59:48 +0000","Lancashire – Eight more libraries may be saved as part of cuts reversals – Lancashire Telegraph. &#34;Under a first wave of ‘asset transfers’ former county council buildings are being handed over to community interest groups in Oswaldtwistle, Crawshawbooth, Trawden and Clayton-le-Moors. County Cllr Marcus Johnstone, cultural services cabinet member, who also represents Burnley West and Padiham division, said there was now a community libraries manager in post to assist with future similar bids.&#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Lancashire","Mon, 19 Dec 2016 20:59:48 +0000","Lancashire – MP demands answer on community library bid – Friends of Thornton & Cleveleys Libraries. &#34;A Wyre MP today demands answers on the future of Cleveleys and Thornton libraries following separate community bids to save them. Paul Maynard MP for Blackpool North & Cleveleys has written to Lancashire Councils boss, Jo Turton, asking for a situation report on the two outstanding community bids to rescue the closed libraries for community use. Thornton Gala Committee has put in a plan to re-open Thornton Library, and UR Potential, a young person’s charity based on the Fylde Coast, has put in a bid to open and run Cleveleys Library. Both bids have been supported by local county councillor Andrea Kay. The bids were put in before the closure date for consultation, since which neither organisation has heard from the County, despite 3 libraries in East Lancashire having their community bids agreed and funded.&#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Lincolnshire","Mon, 19 Dec 2016 20:59:48 +0000","Lincolnshire – Massive £40m council cuts will slash social care, libraries and gritting – Lincolnshire Live. &#34;Lincolnshire County Council is proposing cuts in order to balance the books and deliver its £452m worth of public services in 2017/18. Services will be squeezed despite the authority looking to use £27,000 in reserves and increasing its portion of the council tax by 3.95 per cent.&#34; … &#34;Much of the library service has become a network of community-run hubs which is expected to save £400,000 in 2017/18.&#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Newcastle Upon Tyne","Mon, 19 Dec 2016 20:59:48 +0000","Newcastle Upon Tyne – Between digital inclusion and social equality: the role of public libraries in Newcastle upon Tyne – Massimo Ragneda. &#34; This paper is based on findings obtained from qualitative research on the role of the public library service in reducing digital inequalities in disadvantaged neighbourhoods in Newcastle upon Tyne.&#34;","2016/12/celebrating-celebrating-shakespeare.html"],["North Yorkshire","Mon, 19 Dec 2016 20:59:48 +0000","North Yorkshire – Plea to help action group keep Ripon library open – Harrogate Advertiser. &#34;From April 1 next year, Ripon library will become a hybrid library due to cuts in funding, which means that there will be only one member of employed staff, with a team of volunteers working alongside them. The Ripon Library Action Group held a drop-in session at the library on Saturday, December 10, to encourage people to sign up and volunteer.&#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Sunderland","Mon, 19 Dec 2016 20:59:48 +0000","Sunderland – What we learned at Sunderland Council Cabinet: Expenses, libraries and football pitches – Chronicle Live. &#34;Spare a thought for the humble library. They’ve had their funding cut year on year, many have been closed and several are now run on a purely voluntary basis. It is, in short, an awful time to be a library – and that isn’t going to change any time soon. Initial cuts of around £850,000 were confirmed in 2013 and the council intend to find more savings in the budget for the next financial year. The council need to have a new library strategy in place by April 2017 in order to hit their target of providing library services at a cost of £509,000 by 2019/20.&#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Swindon","Mon, 19 Dec 2016 20:59:48 +0000","Swindon – ‘Heartbreaking’ cuts to Swindon library service finalised – BookSeller. &#34;Shirley Burnham, library campaigner with Save Swindon’s Libraries, described the &#34;annihilation&#34; of its service as &#34;heartbreaking&#34;. &#34;It is important that the borough council acknowledges that to act in haste, without due care, is reckless&#34;, she said. &#34;All the ideas that have been touched on to date are untried and untested. If these are not viable for the long term they risk damaging future generations who live here. No doubt the Libraries Taskforce when describing inroads made into the integrity of the professional service as ‘innovations’, has done little to discourage Swindon and others from believing they have the green light to annihilate their service while getting rid of as many staff as they can get away with. This is heartbreaking for us all. We hope that there will be a complete re-think — locally and in Westminster.&#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Swindon","Mon, 19 Dec 2016 20:59:48 +0000","Swindon – Ministers suggest libraries could stay – Swindon Advertiser. &#34;Minister Rob Wilson met officials from Swindon Council last week in a bid to seek a possible solution before the cuts are actually made. He said: &#34;If we are going to build a country that works for everyone then we need to recognise that libraries are among our most valuable community assets and they remain hugely popular.&#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Warrington","Mon, 19 Dec 2016 20:59:48 +0000","Warrington – Helen Jones MP clashes with LiveWire boss over plans to close libraries – Warrington Guardian. &#34;Livewire has clashed with MP Helen Jones after claiming she was unwilling to meet with them about plans to close libraries across the town. But Mrs Jones hit back, saying she would not be pushed around by the company, which she claims only wanted to speak to her after they started to receive ‘bad publicity’ about their proposals.&#34;.  MP says &#34;I am here to represent my constituents. I do not jump when an unelected and unaccountable body tells me to do so. &#34;","2016/12/celebrating-celebrating-shakespeare.html"],["Barnet","Wed, 21 Dec 2016 21:03:09 +0000","Barnet – Council unveils four charities which will run libraries following service cuts – Barnet and Whetstone Press. &#34;Learning disability charities Kisharon and Mencap will join forces to run Childs Hill Library, while local residents’ charity NW7 Hub will operate Mill Hill Library. Inclusion Barnet, a charity which supports disabled people to live independently, will operate both East Barnet and South Friern libraries. Under a ten-year agreement, the council will lease the library premises to the partners as well as providing equipment and book stock and a small grant for running costs.&#34; … &#34;Last week campaigners called for an inquiry into cuts to the Barnet library service which they described as &#34;the most extreme destruction of a local library service in British history&#34;. The Save Barnet Libraries Campaign sent an official notice to Karen Bradley, the Secretary of State for Culture, Media and Sport, asking her to act immediately to protect libraries in Barnet. Concerns include that salaried staff are being repla&#8230;","2016/12/merry-christmas-see-you-in-the-new-year.html"],["Bath and North East Somerset","Wed, 21 Dec 2016 21:03:09 +0000","Bath and North East Somerset – Could this be the end of our traditional libraries? – Midsomer Norton Radstock and District Journal. &#34;Data collected by Bath Central Library over an average week shows how people use the library. 52% wanted to book a computer or print something out, 19% wanted information, 9% wanted to renew or borrow books, 6% wanted a specific item, 5% wanted help with their account, 4% wanted help with computers or photocopiers, 2% wanted access to newspapers, 2% wanted to hand items in and 1% wanted to join the library.&#34; … &#34;&#34;We will seek to work with volunteers where appropriate, but in Midsomer Norton, we would like to build on the success of our Keynsham model of joint One Stop Shop and library, making the best use of digital services and meeting the changing needs of our community.&#34;&#34;","2016/12/merry-christmas-see-you-in-the-new-year.html"],["Cumbria","Wed, 21 Dec 2016 21:03:09 +0000","Cumbria – Cockermouth library campaigners refused consultation extension by Cumbria County Council – News and Star. &#34;A public consultation was launched earlier this month and was due to close on Friday. It has since been extended until January 4. Richard Watson, one of the leaders of the Friends of Cockermouth Library, presented the petition – signed by about 450 people with more than 200 more signatures online – at the county council’s cabinet meeting on Thursday and asked for a further extension.&#34;","2016/12/merry-christmas-see-you-in-the-new-year.html"],["Cumbria","Wed, 21 Dec 2016 21:03:09 +0000","Cumbria – Leftwich brings latest effort to library – North West Evening Mail. &#34; British singer-songwriter Benjamin Francis Leftwich will be the first visitor to Cumbria as part of the Get It Loud In Libraries programme in 2017. The York-based artist performs at Kendal Library on Saturday March 11″","2016/12/merry-christmas-see-you-in-the-new-year.html"],["Durham","Wed, 21 Dec 2016 21:03:09 +0000","Durham – New Newton Aycliffe Library open to public – North East Connected. &#34;The move from the library’s former base is part of a wider £1million scheme being carried out by Durham County Council to help regenerate the town centre. It has involved refurbishing a number of shop units adjoining the leisure centre and creating a shared entrance for the library and leisure centre. Cllr Maria Plews, Durham County Council’s Cabinet member for leisure, libraries and lifelong learning, said: &#34;The new location is a light, bright space with modern décor and up- to-date facilities.&#34;","2016/12/merry-christmas-see-you-in-the-new-year.html"],["Harrow","Wed, 21 Dec 2016 21:03:09 +0000","Harrow – Roxeth Library and Residential Scheme – TED Tenders Electronic Daily. &#34;The Council wishes to proceed with the regeneration of the Roxeth Library site on Northolt Road as a residential scheme combined with re-provision and improvement of the existing library&#34;","2016/12/merry-christmas-see-you-in-the-new-year.html"],["Lancashire","Wed, 21 Dec 2016 21:03:09 +0000","Lancashire – Lancaster and Morecambe library staff told to re-apply for their jobs – Visitor. &#34;An anonymous caller to the Guardian said that last week all staff at the library, along with employees in Lancaster library, were given letters telling them they would need to re-apply for their current positions.&#34; … &#34;Some have worked at Morecambe library for up to 40 years. A Lancashire County Council spokesman said the letters formed part of a review of the county’s whole library service.&#34;","2016/12/merry-christmas-see-you-in-the-new-year.html"],["Lancashire","Wed, 21 Dec 2016 21:03:09 +0000","Lancashire – Much loved Lancashire library goes on sale for £475,000 despite protests – Lancashire Evening Post. &#34;Despite thousands of local signatures on a protest petition and appeals from local MP Ben Wallace, the council decided it must close the well used library to save cash. But Mr Wallace claims the county council may be being premature in putting the 1930s’ prime site building up for sale so soon. Yesterday the Wyre and Preston North MP was planning to contact Junior Government minister Rob Wilson to see if the Government is agreeable to the sale going ahead.&#34;.  Council says &#34;&#34;Our property agents have begun to market the former Fulwood Library building for sale. We are asking for offers over £475,000 and would ask anyone who may be interested to contact HDAK Preston.&#34;&#34;","2016/12/merry-christmas-see-you-in-the-new-year.html"],["Lancashire","Wed, 21 Dec 2016 21:03:09 +0000","Lancashire – ‘Silence is deafening’ row in library axe controversy – Blackpool Gazette. &#34;Paul Maynard MP for Blackpool North and Cleveleys has written to Lancashire County Council boss, Jo Turton, asking for an update … Thornton Gala Committee has put in a plan to re-open Thornton Library, and UR Potential, a young person’s charity based on the Fylde Coast, has put in a bid to open and run Cleveleys Library. Both bids have been supported by Coun Andrea Kay who led the battle to save the libraries, leading dozens of primary school pupils on a protest march … The bids were put in before the closure date for consultation. But since then neither organisation has heard from the County, despite three libraries in East Lancashire having their community bids agreed and funded…&#34;","2016/12/merry-christmas-see-you-in-the-new-year.html"],["North Yorkshire","Wed, 21 Dec 2016 21:03:09 +0000","North Yorkshire – The Girl on the Train pulls ahead at county libraries – NE Connected. &#34;Hard copies of the novel were borrowed 1,735 times from libraries across the county up to the end of November, 250 times more than the second-placed title, Make Me, the 20th Jack Reacher story by author Lee Child. The e-book version of The Girl on the Train was borrowed 131 times, again beating Make Me into second place with 118″","2016/12/merry-christmas-see-you-in-the-new-year.html"],["Warrington","Wed, 21 Dec 2016 21:03:09 +0000","Warrington – My resolution – Warrington Guardian. &#34;The main argument for closing them is visitor figures. We already know they are accessible, that they are at the heart of our communities, that they are a ‘hub’ for various activities for everyone. Our ancestors built 13 libraries around Warrington, they believed that they contributed to the health and wellbeing of all the residents…&#34;","2016/12/merry-christmas-see-you-in-the-new-year.html"],["Worcestershire","Wed, 21 Dec 2016 21:03:09 +0000","Worcestershire – We are &#34;not just stopping doing things&#34;, says council deputy leader as he defends budget – Bromsgrove Advertiser. &#34;&#34;When you look around other parts of the country, and you see people wanting to shut 12 out of 14 libraries and seriously curtail an awful lot of other services, plus putting up their council tax – we are not in that position,&#34; he said. &#34; … &#34;The comments come amid criticism from the opposition Labour group that areas like libraries have been squeezed badly, despite none of them closing. &#34; … &#34;Back in the summer the leadership published controversial proposals to shave 78.5 hours off library opening hours, but rocked back on it and ending up reducing it by 55 instead – with 17 sites being affected&#34;","2016/12/merry-christmas-see-you-in-the-new-year.html"]]