[["Bristol","Sun, 01 Mar 2015 21:27:12 +0000","Bristol – Lobby of Bristol City Council Cabinet – Save Our Libraries – Bristol Trades Union Council. &#34;Mayor George Ferguson and his Conservative – Liberal – Labour – Green rainbow cabinet are proposing the possible closure of seven of our public libraries and the slashing up to a third of library staff. users and thousands more occasional users. Behind their florid propaganda however lies a savage cut of £1.1 million per year – or 20% – from the budget.&#34;","2015/03/a-weekend-of-library-news.html"],["Worcestershire","Sun, 01 Mar 2015 21:27:12 +0000","Worcestershire – Michael and the Hive Library Worcester - Vimeo. &#34;Michael’s Mid Term Project was to create something to show his favourite building. His choice was the Hive Library in Worcester. Michael explains some of his favourite things about the library and thanks to the lovely staff we even got an interview to explain when it was built and how big it is.&#34;","2015/03/a-weekend-of-library-news.html"],["Bromley","Sun, 01 Mar 2015 21:27:12 +0000","Bromley – Bromley staff balloted for strike action over ‘privatisation’ plans – Localgov. &#34;Unite regional officer, Onay Kasab, said: ‘Unite is drawing a line in the sand over the drive by this Tory council hell-bent on privatising and outsourcing much valued public services, such as libraries. ‘The council has declared war on public services, public service workers and the trade unions. It is not acting on behalf of residents.’&#34;","2015/03/a-weekend-of-library-news.html"],["Edinburgh","Sun, 01 Mar 2015 21:27:12 +0000","Edinburgh – Airgun-wielding kids among 72 hit with library ban - Edinburgh Evening News. &#34;Setting fire to leaflets, physical assault, racist abuse and riding bikes on library premises all appear in a new list of antisocial behaviour incidents. In total, around 72 people were told to stay away from libraries for up to a month between April 2012 and March last year. As young people spend more time in libraries thanks to services such as free internet, professionals said it was unacceptable that staff face threats of assault.&#34;","2015/03/a-weekend-of-library-news.html"],["Bromley","Sun, 01 Mar 2015 21:27:12 +0000","Bromley – Lambeth and Stop the privatisation of public libraries.  Summary of recent news for Bromley. &#34;Bromley are taking a leaf or two out of Barnet’s book and looking to privatise most of their services and workforce, withdraw union facility time and last but not least decimate it’s library service.&#34;","2015/03/a-weekend-of-library-news.html"],["Scottish Borders","Sun, 01 Mar 2015 21:27:12 +0000","Scottish Borders – Hawick wealth could be run by pool group – Hawick News. &#34;Councillor Watson McAteer said: &#34;Like others I will need convinced this is in the best interests of Hawick. BSLT appear to operate their trust well but whether or not taking on board museums, libraries and other public buildings fits their operating model will be a matter for them to agree.&#34; And voicing his concerns for the town, he added: &#34;I have a concern that Hawick’s common good moveable assets are not catalogued and in such circumstances handing over any of our heritable artefacts is not something I would support.&#34;&#34;","2015/03/a-weekend-of-library-news.html"],["Fife","Sun, 01 Mar 2015 21:27:12 +0000","Fife – Fears ‘funding crisis’ will see library service cuts in Fife – Courier. &#34;Fears are mounting that swingeing cuts are on the way for Fife’s library service as staff were called to a crunch meeting to discuss a &#34;funding crisis&#34;. After the meeting staff have been left feeling the service — in what is the home of the world’s first Carnegie Library — is going to be hit hard as bosses try to bridge a yawning financial gap.&#34; … &#34; &#34;Labour are using the Fife Cultural Trust as a way of blaming somebody else when Labour votes to close libraries.&#34; Council leader David Ross said: &#34;For the SNP to claim their alternative budget proposals would have solved this financial problem is laughable.&#34;&#34;\nIslington – Islington Council pass budget cutting 188 jobs but saving ‘key services’ – Islington Gazette. &#34;As reported in the Gazette in May a number of crucial services such as libraries, leisure centres and the PlusBus for disabled residents had been weighed up by council officers as potential casualties. Coun&#8230;","2015/03/a-weekend-of-library-news.html"],["Lambeth","Sun, 01 Mar 2015 21:27:12 +0000","Lambeth – Campaigners loudly protest latest budget cuts - Brixton Blog. &#34;Targets for cutbacks this year include library closures, children centres and &#34;integration&#34; within the council’s health programme. News of the dramatic scaling down of council expenditure – imposed by the government – was greeted with dismay by campaigners outside Lambeth town hall. &#34;As well as libraries, children’s centres and day centres are also in the firing line,&#34; said Jon Rogers, Lambeth Unison branch secretary. &#34;We will contest every single cut.&#34; Others involved in the protest included the unions GMB, Unite and the National Union of Teachers, as well as supporters from the &#34;Save Cressingham&#34; campaign, Guinness Trust activists and protesters of the cuts to Lambeth’s Libraries.&#34;","2015/03/a-weekend-of-library-news.html"],["Lambeth","Sun, 01 Mar 2015 21:27:12 +0000","Lambeth – Lambeth and Bromley – Stop the privatisaiton of public libraries. Summary of recent news for Lambeth. &#34;Lambeth are once again looking to cut their library service, not very ‘co-operative’ of the ‘co-operative council&#39;&#34;","2015/03/a-weekend-of-library-news.html"],["Lincolnshire","Sun, 01 Mar 2015 21:27:12 +0000","Lincolnshire – Cuts to frontline services such as fire service and libraries should be last resort – Lincolnshire Echo. Letter from Labour councillor chief.  &#34;In Lincolnshire, the ruling Tory-led council is sitting on millions of pounds in reserves, and is still cutting services. An example of this is the farce over the libraries. The county council used a mere £100,000 of tax payers’ money to carry out a consultation and the conclusion was that the people of Lincolnshire wanted to keep their libraries.&#34;","2015/03/a-weekend-of-library-news.html"],["Walsall","Sun, 01 Mar 2015 21:27:12 +0000","Walsall – Five Walsall libraries saved in budget deal – Birmingham Mail. &#34;The ruling Labour group announced a climb down on two of the most controversial areas of its proposed £29 million budget cuts for 2015/16. The Libraries, including Pheasey, Walsall Wood and Streetly, and green waste services were only given a one year stay of execution as £655,000 funding was found from reserve to cover costs.&#34;","2015/03/a-weekend-of-library-news.html"],["Lincolnshire","Sun, 01 Mar 2015 21:27:12 +0000","Lincolnshire – Government probes council’s library service – East Lindsey Target. &#34;This investigation will help Culture Secretary Sajid Javid determine if a local inquiry is needed in response to a complaint from retired chief librarian Maurice Nauta. Mr Nauta, from Nettleham, wrote to the Department for Culture, Media and Sport objecting to the council’s plans for Lincolnshire’s library service and the DCMS confirms the matter is being treated as a formal complaint.&#34;","2015/03/a-weekend-of-library-news.html"],["Lincolnshire","Sun, 01 Mar 2015 21:27:12 +0000","Lincolnshire – Lincoln Parliamentary hopeful Elaine Smith vows to take just £24k of her salary if elected - Lincolnshire Echo. Trade Unionist and Socialist Coalition candidate says &#34;&#34;Any money on top of this will be put towards a solidarity fund to support grassroots community and workers’ campaigns like Save Lincolnshire Libraries, Defend Our Fire Services and Lincolnshire Disabled People Against Cuts.&#34;","2015/03/a-weekend-of-library-news.html"],["Peterborough","Sun, 01 Mar 2015 21:27:12 +0000","Peterborough – Library is vital to literacy levels – Peterborough Today / Letters. &#34;Whilst fully appreciating the pressure on spending that the council and Vivacity are under we find it difficult to accept the drastic proposals that are being made for the libraries in general and in particular those affecting the Werrington Community Library. Levels of literacy in the country are falling and Peterborough is no exception. At the same time we are cutting an area that is trying to help to stem this decline, namely the effectiveness of the local libraries.&#34;","2015/03/a-weekend-of-library-news.html"],["Trafford","Sun, 01 Mar 2015 21:27:12 +0000","Trafford – Hale businesses say village library plans are ‘detrimental’ to enterprise – Messenger. &#34;Hale Business Association has warned that the reduction of services at the village library would be ‘detrimental to the viability’ of future enterprise in the area.In an open letter to Trafford Council, the association said borough authority proposals that include downsizing the facility to make room for residential homes are ‘driven by the potentially high value of the site for redevelopment’. They point to the Government-commissioned ‘Portas Report’, that found high streets needed to retain ‘community hub’ regions to remain viable and vibrant.&#34;","2015/03/a-weekend-of-library-news.html"],["Scottish Borders","Sun, 01 Mar 2015 21:27:12 +0000","Scottish Borders – Councillors sceptical that sports trust can run region’s libraries etc - Border Telegraph. &#34;&#34;I am sceptical and remain to be convinced this is the best way forward,&#34; said Councillor Ron Smith at last week’s full council meeting. &#34;I can see the pros and cons of such an arrangement, but the pros all appear to be financial while the cons relate to the continued provision of these important services which enrich the lives of so many Borderers,&#34; added the executive member for planning and the environment.&#34;","2015/03/a-weekend-of-library-news.html"],["Barnet","Sun, 08 Mar 2015 20:47:06 +0000","Barnet – Protesters storm council chamber during Barnet Borough Council meeting over library cuts – This is Local London. &#34;Protesters stormed the council chamber and called on the Mayor of Barnet to resign during a debate on halting library cuts. The meeting descended into chaos after opposition Labour councillors called for a halt to £2.85m cuts to Barnet Borough Council’s libraries and a new consultation on the service’s future at the authority’s budget meeting last night. Dozens of library campaigners, trade unionists and other activists had gathered outside Hendon Town Hall before the meeting, waving books and placards and shouting for the libraries to be saved.&#34; … &#34;Councillors were also presented with a petition signed by more than 9,000 people opposing library cuts by campaigner Alasdair Hill. Mr Hill told the chamber: &#34;Libraries are the temples of civic society. They go beyond books.&#34; see also Campaigners protest over library closure plans – Barnet and Whetstone Press.","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Powys","Sun, 08 Mar 2015 20:47:06 +0000","Powys – 19 – Jayne Evans, Hay-on-Wye - 23 Librarians. &#34;I am the Branch Librarian at Hay-on-Wye Library, which is no ordinary joint because there is a little annual festival held down the road and there are a few bookshops about the place. Hay has a population of about 1400, and many of  our users live in the surrounding villages in Powys and Herefordshire&#34; … &#34;Naturally folk feel positive when they come to the library because we are seen as enablers, which is a great basis for any relationship.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Barnet","Sun, 08 Mar 2015 20:47:06 +0000","Barnet – Shadow Culture Minister Chris Bryant MP visits Golders Green Library – Times series. &#34;A shadow minister accused the Government of a &#34;dereliction of duty&#34; over library closures during a visit to Golders Green. Shadow Culture Minister Chris Bryant visited Golders Green Library yesterday with Sarah Sackman, Labour’s parliamentary candidate for Finchley and Golders Green, to discuss the future of the borough’s libraries. The Labour frontbencher claimed that more than one in ten libraries had closed since 2010, which amounted to a &#34;dereliction of duty&#34; from the Government.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Sheffield","Tue, 10 Mar 2015 21:36:30 +0000","Sheffield – Local inquiry into library provision in Google Docs.  Copy of the letter from Ed Vaizey confirming he won’t be intervening in Sheffield.","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["Bolton","Sun, 08 Mar 2015 20:47:06 +0000","Bolton – ‘Libraries are vital to this country,’ says award-winning crime writer during visit to Bolton – Bolton News. Anne Cleves says &#34;This country earns £8 million an hour from its creative industries and the arts. &#34;Cutting funding to libraries is like wanting people to go into manufacturing, but not teaching physics in schools.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Coventry","Sun, 08 Mar 2015 20:47:06 +0000","Coventry – Coventry council leader Lucas’s attack on ‘middle class’ was ‘disrespectful’ - Coventry Observer. &#34;Speaking with the Coventry Observer, Coun Blundell said a large number of Coventry people considered themselves to be middle class, or aspired to be middle class. He said they were entitled to oppose proposed Labour council cuts to services such as libraries, which Labour council leaders themselves have said they could be forced to impose, whichever party or parties form the next government.&#34; … &#34;He accused her of effectively attacking many of his constituents who signed a petition against the potential closure of Finham Library, which provided a range of crucial community services for people from all backgrounds. Coun Blundell added that ruling Labour councillors had publicly mooted closing libraries and most council services in most communities under their ‘City Centre First’ proposal, and had still not identified which might close from next year.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Northern Ireland","Sun, 08 Mar 2015 20:47:06 +0000","Northern Ireland – Government funding cut for Northern Ireland – BookTrust. &#34;Booktrust are very disappointed to announce that the Northern Ireland government will no longer be funding the Bookstart programme. Up to 50,000 babies and children could miss out on the Bookstart packs, which are given to babies aged 0-1 and children aged 3-4.&#34; … &#34;The new system will use Open+ self-service technology, currently used in libraries in Leeds and London, which will enable people to access libraries for 383 hours per week as opposed to the current 261. Staffed hours would be reduced from the current 261 to 149.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Bristol","Sun, 08 Mar 2015 20:47:06 +0000","Bristol – Bristol mayor George Ferguson opposed by deputy over libraries - BBC. &#34;Bristol City Council needs to slash £1.1m from its library budget by 2016-17 and 40 jobs are under threat. Mayor George Ferguson approves of the plans, but his deputy Geoff Gollop, said it does not reflect users’ wishes. The plans are part of a continuing consultation into the future of the city’s library service. Following a council cabinet meeting where he voted against the plans, Mr Gollop said people have been consulted about the library service, but &#34;no one has been asked whether the libraries should close&#34;.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Cambridgeshire","Sun, 08 Mar 2015 20:47:06 +0000","Cambridgeshire – Cambridge library plans for £600K enterprise centre - BBC. &#34;Plans for a £600,000 enterprise centre at Cambridge Central Library are being recommended for approval by councillors. Cambridgeshire County Council is looking at teaming up with private firm Kora to create the centre. It would be on the third floor of the library and would work with the council’s career advice service.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Lincolnshire","Sun, 08 Mar 2015 20:47:06 +0000","Lincolnshire – Lincolnshire County Council to improve online library service – Lincolnite. &#34;Lincolnshire County Council’s online management system Discover Libraries will be in place from March 19 with a new look and feel.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Somerset","Sun, 08 Mar 2015 20:47:06 +0000","Somerset – Somerset libraries measures to save £472,000 a year – Somerset County Gazette. &#34;Free wi-fi and computer usage and an extra £10,000 a year for outreach library services are among changes being made to Somerset’s Library Service. The initiatives, approved by Somerset County Council’s cabinet today (Monday, March 2), will help save £472,000 in the year from April.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["South Tyneside","Sun, 08 Mar 2015 20:47:06 +0000","South Tyneside – The Word is on the street - South Tyneside.info. &#34;‘The Word’ has been revealed as the name of the new library and digital media centre which will be the jewel in the crown of the £100 million regeneration of South Shields town centre. The state-of-the-art facility will be a regional centre inspired by all aspects of the written word. The three-storey building, being built on the town’s Market Place, will celebrate the Borough’s literary heritage.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Vale of Glamorgan","Sun, 08 Mar 2015 20:47:06 +0000","Vale of Glamorgan – Shake-up of library services given the go-ahead – Barry and District News. &#34;Campaignershave failed in their bid to halt radical changes to library services after the Vale Council announced final plans for community led facilities today. Following a public consultation last year, the Vale Council announced a timetable for implementing plans to ‘safeguard the future of library services’. Opening hours will change and community groups are invited to help run Dinas Powys, Rhoose, St Athan, Wenvoe and Sully following Vale residents’ endorsement of the strategy to reshape library services.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Bristol","Sun, 08 Mar 2015 20:47:06 +0000","Bristol – Libraries They are now out of date and they need to go – Bristol Post. &#34;my seven-year-old grandson’s confidence in the use of an iPod confirms my opinion of just how anachronistic public libraries are.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Devon","Sun, 08 Mar 2015 20:47:06 +0000","Devon – &#34;Mutual&#34; approach for Devon libraries – Express and Echo. &#34;The new community-owned ‘mutual’ would be commissioned by Devon County Council to run the library service on its behalf. The authority has already shaved £3 million off its library service budget over the past three years, and aims to save a further £1.5 million by April 2016. Despite the cuts no library has closed in Devon.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Northamptonshire","Sun, 08 Mar 2015 20:47:06 +0000","Northamptonshire – ‘Thriving’ Northampton library praised by culture minister who says donation scheme is a great idea - Northants Herald and Post. &#34;Mr Vaizey toured the Weston Favell Centre library this morning (Thursday) with Northamptonshire County Council chief executive Dr Paul Blantern and Northampton North MP Michael Ellis to find out more about the work of Northamptonshire libraries. During the visit, which fittingly comes on World Book Day, he was introduced to a wide range of services for adults and children at the library – such as after school homework classes, lessons in how to use computers and book clubs.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Bristol","Sun, 08 Mar 2015 20:47:06 +0000","Bristol – Reader’s letter: We fear that libraries’ consultation is a sham - Bristol Post. &#34;Can I just say that it is astonishing to see energetic campaigns to save Bristol Libraries by the same two local parties – the Lib Dems and the Conservatives – who as a coalition government have delivered such severe cuts to local government budgets&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Bristol","Sun, 08 Mar 2015 20:47:06 +0000","Bristol – Threat to close seven Bristol libraries is bonkers says one regular user – Bristol Post. A look at one of the threatened libraries, the work that it does and the consultation process.","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Coventry","Sun, 08 Mar 2015 20:47:06 +0000","Coventry – Alan Gibbons interview -Youtube. Alan argues against a director of the Adam Smith Institute.","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Coventry","Sun, 08 Mar 2015 20:47:06 +0000","Coventry – Tile Hill Library campaigner – &#34;Why I fought to save our libraries&#34; – Coventry Socialists. &#34;On Monday 23rd February scores of protestors held a &#34;read-in&#34; at Coventry Council House to protest at the councils proposals to close libraries in the city.&#34; … &#34;It’s thanks to Libraries and adult education classes that I learned how to read and write and got diagnosed with Dyslexia aged 25. So when I heard of the threatened closures I knew I had to get involved and started the &#34;Save Tile Hill Library&#34; petition, taking it in to every shop on Jardine Crescent. By standing with a stall in Tile Hill, and thanks to the shops support in having the petition, it has gained further support and well over 1000 signatures.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Leicestershire","Sun, 08 Mar 2015 20:47:06 +0000","Leicestershire – Community groups for libraries in Leicestershire step up - Burton Mail. &#34;Richard Blunt, cabinet member for libraries, said: &#34;I appreciate that some groups have not expressed an interest yet, so we’re going to carry out further work to encourage them to come forward. I’m confident that local groups know how best to make their libraries the vibrant heart of their community.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["West Lothian","Sun, 08 Mar 2015 20:47:06 +0000","West Lothian – Chapter closes on mobile libraries – Linlithgow Gazette. &#34;The council’s budget cuts are starting to bite with news this week that West Lothian is set to axe its mobile library service. Customer demand for the mobile library van service is low which makes the cost of delivering the existing service unsustainable in the current financial climate.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Bromley","Sun, 08 Mar 2015 20:47:06 +0000","Bromley – For Sale: Chislehurst Library - Meridian (received via email) &#34;The future of Chislehurst Library will finally be decided following news that Bromley Council has put the freehold up for sale.  This follows cuts of £300,000 from the Council’s library service in the 2014/15 budget.  Commercial and residential options will be considered but prospective developers will have to incorporate a library into the exisitng site or provide a new library on an alternative site.  Alison Stammers, chairwoman of the Chislehurst Town Team said: &#34;After years of uncertainty regarding the future of the library, we are looking forward to moving towards a decision.&#34;  She added: &#34;With 6 local libraries already scheduled for closure, we do appreciate that this way the Council will be safeguarding our library’s future.&#34;  The closing date for offers is 22 April and it is hoped a decision will be made by June.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Camden","Sun, 08 Mar 2015 20:47:06 +0000","Camden – Camden library room hires set to be hiked 600% – Ham and High. &#34;This includes tripling the price of hiring the atrium in Swiss Cottage Library on weeknights from £35 to £140 and quadrupling the cost of hiring an office in Kentish Town Library on weeknights from £35 to £180. From April 1, Holborn Library will begin charging £350 for the hire of its fourth floor event space on weekend evenings, more than six times higher than its current price (£45). Cllr Theo Blackwell, cabinet member for finance and technology policy, said: &#34;We have got a £73m gap to fill [over the next three years] and the council went out and asked people if we could raise money from library spaces. &#34;Overwhelmingly people said if it contributes to keeping libraries open they are prepared to see it happen. No one has complained.&#34;&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Sunderland","Sun, 08 Mar 2015 20:47:06 +0000","Sunderland – New chapter for Sunderland library building – Sunderland Echo.  Library &#34;closed following budget cuts to the public purse – could soon be turned into an office for a media company. &#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Buckinghamshire","Sun, 08 Mar 2015 20:47:06 +0000","Buckinghamshire – Library hours could be cut in budget cuts – Get Bucks. £270k cut. &#34;The plan – reducing opening hours between 5.5 and 8.5 hrs a week – affects only the county-run branch libraries at Aylesbury, Amersham, Beaconsfield, Buckingham, Chesham, Hazlemere, High Wycombe, Marlow, Micklefield and Princes Risborough.  Comments can be made via the County Council’s Have Your Say web page www.buckscc.gov.uk/haveyoursay or in writing at all libraries. &#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Somerset","Sun, 08 Mar 2015 20:47:06 +0000","Somerset – Somerset mobile libraries cut as services handed to volunteers – Western Daily Press. &#34;Mobile library services in Somerset are to be cut back from August, with &#34;a number&#34; of stops amalgamated or withdrawn. The Home Library Service will be handed responsibility for 17 stops at sheltered and residential housing, with the county council increasing its budget by £10,000. The savings as a result of the cuts will contribute to an overall reduction in the council budget of £472,000. Groups wishing to use the Performing Arts Library in Yeovil will also have to pay a subscription.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["South Gloucestershire","Sun, 08 Mar 2015 20:47:06 +0000","South Gloucestershire – New campaign to get people in South Gloucestershire reading is launched – Gazette Series. &#34;Through South Gloucestershire Council’s Time 4 Reading scheme, the council is challenging people to take five minutes out of their day to read and talk about books … For more information visit www.southglos.gov.uk/time4reading&#34;.","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Devon","Sun, 08 Mar 2015 20:47:06 +0000","Devon – Innovative plans to safeguard Devon’s library service – Devon Council. &#34;Plans to set up a new independent organisation to run Devon’s libraries have been unveiled. The new community-owned ‘mutual’ would be commissioned by Devon County Council to run the library service on its behalf. Similar models are successfully running library services in other parts of the country and saving council taxpayers’ money.&#34; … &#34;in response to overwhelming support from communities prepared to work more closely with their local libraries, the council is now looking to set up an independent, community led organisation to continue to deliver an affordable, sustainable and innovative library service that keeps the community at its heart.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Kirklees","Sun, 08 Mar 2015 20:47:06 +0000","Kirklees – 3000 have a say on future of Kirklees library service as museums come under the spotlight - Huddersfield Daily Examiner.  Councillor says he &#34;understood why the library service &#34;was something dear to the hearts of people&#34;. He has been touring libraries and speaking to groups keen to save the service and is due to visit libraries in south Kirklees soon. Later this week he will also visit York libraries to learn more about the community trust model to see if it’s something Kirklees Council should explore.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Thurrock","Sun, 08 Mar 2015 20:47:06 +0000","Thurrock – Job losses expected as part of library cuts – Thurrock Gazette. &#34;Documents made available online by Thurrock Council ahead of next week’s cabinet meeting confirm that the authority are looking to &#34;reduce staffing costs&#34; at a number of the borough’s nine libraries by introducing more volunteer workers. The documents also suggest that the one proposal being looked at is relocating the Thameside library in Orsett Road, Grays, to the Civic Offices. &#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Lambeth","Sun, 08 Mar 2015 20:47:06 +0000","Lambeth – 10 things that are wrong with the Culture2020 proposals for libraries – Herne Hill Forum. Many issues including &#34;They will create a £10m endowment fund from the sales of the Minet and Waterloo libraries, to &#34;promote literacy and the love of reading&#34;. This fund is supposed to replace the library budget for the 3 libraries (including the Carnegie) whose council funding will be stopped in 2016. But nowhere is it stated that the fund will actually be ringfenced for these libraries. Instead it will &#34;support charities, social enterprises and community groups in Lambeth&#34; and &#34;the closures and withdrawals of library services will leave large areas of Lambeth without any library service, requiring Herne Hill or Vassall residents to travel to Brixton to access a Lambeth library. In the Friends of Carnegie survey of 2800 local households, 40% of respondants said they would stop using libraries altogether if the Carnegie closed.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Leicestershire","Sun, 08 Mar 2015 20:47:06 +0000","Leicestershire – Villagers set to take over their library - Hinckley Times. &#34;Volunteers in Market Bosworth are pressing ahead with plans to take over the village library amid county council cutbacks. The steering group behind the project has submitted and had accepted a formal register of interest and work is now ongoing into preparing an outline business plan. This must be sent in to Leicestershire County Council by March 13 with a decision as to its viability expected in April.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Poole","Sun, 08 Mar 2015 20:47:06 +0000","Poole – Bookworms celebrate as first community library opens in Poole – Bournemouth Echo. Bearwood Community Library &#34;Borough of Poole library staff have been working with a team of dedicated volunteers to set up the new library, an initiative to replace the ageing mobile library, which last December was reprieved until the middle of this year.  The library is being run by the community centre and its volunteers, opening every Wednesday morning between 10.15am and 12.30pm.&#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Southampton","Sun, 08 Mar 2015 20:47:06 +0000","Southampton – Just days left for campaign to save Southampton libraries - Daily Echo. &#34;So far more than 3,000 people have responded to consultation on the proposals, which ends on Friday, and civic chiefs have urged more people to have their say. &#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Bristol","Tue, 10 Mar 2015 21:36:30 +0000","Bristol – Green Party should leave libraries alone – Bristol Post / Letters. &#34;note with a great deal of anger and scepticism that it is Green councillor and Assistant Mayor, Daniela Radice who is responsible for libraries. I noted that none of the threatened libraries are in her Bishopston ward. This is the same Green Party which, two years ago, tried to close down the adult education service in Bristol and then had to backtrack when no other party would support them. Since when was it Green Party policy to cut these services? It’s all very well for them to celebrate Green city status of Bristol but libraries and adult education classes are fundamental, communal services which have taken years to build up indicate a civilised, decent society.&#34;","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["East Riding of Yorkshire","Tue, 10 Mar 2015 21:36:30 +0000","East Riding of Yorkshire – Most Pencils Laid End To End In A Public Library – RecordSetter. A video of the record of 1200 pencils in honour of National Libraries Day.  And why not?","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["Peterborough","Sun, 08 Mar 2015 20:47:06 +0000","Peterborough – Just three weeks left to comment on changes to Peterborough libraries - Peterborough Today. &#34;Originally the new model would have saved £350,000 in a full year. However, at the Cabinet meeting on 23 February 2015 councillors agreed to recommend to Council that £45,000 is put back into the libraries budget, reducing the saving to £305,000. &#34;","2015/03/libraries-on-the-edge-some-great-ideas.html"],["Brighton and Hove","Tue, 10 Mar 2015 21:36:30 +0000","Brighton and Hove – 10 things you might not know about Brighton’s Jubilee Library as it celebrates ten years’ service – Argus. &#34;To celebrate its first ten years, volunteers and young people joined together on World Book Day to enjoy birthday cake and ice cream and to listen to the work of local writers as part of a new installation. The Young City Reads programme, which encourages children to read for pleasure, was also launched on Thursday. This year’s chosen book is William Sutcliffe’s Circus of Thieves and the Raffle of Doom. Brighton ice cream parlour Boho Gelato created a new flavour, Big Top Banan(z)a, inspired by the book.&#34;.  Some interesting Top Ten lists.","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["Buckinghamshire","Tue, 10 Mar 2015 21:36:30 +0000","Buckinghamshire – Library cuts ‘concerning’, says top councillor Richard Scott – Bucks Free Press. &#34;the Conservative believes the service it is too important to residents to make wholesale changes without proving it is necessary. He said: &#34;I am very concerned to see the possible reduction in hours at Marlow Library. &#34;I have asked the council for information that supports the change. &#34;In principle I am opposed to changing what is a well used service not just by people borrowing books but using it for the internet and students for research.&#34;","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["Herefordshire","Tue, 10 Mar 2015 21:36:30 +0000","Herefordshire – Two weeks of celebrations to mark the opening of the Master’s House – Ledbury Reporter. &#34;Th&#34;e fifteenth century Master’s House, on St Katherine’s car park, has undergone a £2.9m restoration and Ledbury’s new library is now housed there, following its move from the Elizabeth Barrett Browning Institute. One of the first through the doors was Jan Long of Bromsberrow, who said: &#34;The interior looked simply stunning, with user-friendly lighting and signage, and a sympathetically engineered juxtaposition between historic building and brand new library facilities.&#34;","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["Bristol","Tue, 10 Mar 2015 21:36:30 +0000","Bristol – Reader’s letter: Bristol libraries need to be saved - Bristol Post / Letters. &#34;I am writing to let you know how disappointed I was by your comment &#34;Closure of Libraries is inevitable&#34; … &#34;I disagree that the internet has undermined their position. On the contrary, as a provider of free internet access on the computers provided their existence is even more vital in this day and age. We hear often about the widening gap between rich and poor and not every family owns a PC.&#34;","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["Staffordshire","Tue, 10 Mar 2015 21:36:30 +0000","Staffordshire – Library cutbacks are controversial move – Sentinel. &#34;Staffordshire County Council is planning to publish adverts this summer asking for community groups to come forward to manage some of the county’s smaller libraries. They will then receive support to work up business cases and will be handed the keys to the buildings this autumn. The approach will be initially trialled in six libraries, including Silverdale, Loggerheads and Werrington.&#34;","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["Wirral","Tue, 10 Mar 2015 21:36:30 +0000","Wirral – Save Wirral’s Library Service – 38 Degrees. &#34;Wirral Metropolitan Borough Council is attempting to save money by drastically cutting the staffing levels of its library service to the point where we question whether it is in danger of breaching its obligations under the Public Libraries and Museums Act 1964. It is proposing to reduce the opening hours of libraries at a time when it is also requiring Wirral residents to communicate with the authority digitally via the internet … &#34; 2830 signatures so far.","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["Leicestershire","Tue, 10 Mar 2015 21:36:30 +0000","Leicestershire – Rothley residents plan the library’s future - Loughborough Echo. &#34;Villagers filled the meeting room at Rothley centre on Tuesday, February 24 to discuss the threat with the view of saving the village facility. The Rothley Community Library Group set up with that purpose says the facility has nearly a 1,000 users – which is 20 per cent of the village. The team leader Steve Mitchell explained that the county council is prepared to lease the current premises and provide books and the library system at the county’s expense.&#34;","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["Vale of Glamorgan","Tue, 10 Mar 2015 21:36:30 +0000","Vale of Glamorgan – Over 2,000 object to Vale library shake-up - Barry and District News. &#34;A 2,000-plus strong petition objecting to Vale library changes was presented to the Vale Council – hours before councillors told residents no volunteers would mean closures. Councillors said groups would need to express interest and produce business plans to establish community-led libraries in Dinas Powys, Rhoose, Wenvoe, St Athan and Sully. The interest would need to be lodged before May 18, with the plan put together before July, decision-makers announced at their community cabinet meeting on Monday, March 9.&#34;","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["Inverclyde","Tue, 10 Mar 2015 21:36:30 +0000","Inverclyde – Greenock author’s call to save school libraries from council cuts – Greenock Telegraph. &#34;Award-winning author Cathy MacPhail is urging Inverclyde Council to protect school libraries from cuts. Her call comes as council leaders warn that there will be more savings needed over the next couple of years to balance the books. A £27,000-a-year school librarian resources post has already disappeared and writer Cathy fears that libraries are always vulnerable when there are budget cuts to be made.&#34;","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["York","Tue, 10 Mar 2015 21:36:30 +0000","York – Exploring the Stadium Library - York Community Stadium. &#34;Almost a year since Explore left council control, the community benefit society are hoping to add a new kind of venture to their books. Fiona Williams, Chief Executive of Explore, said the fact that a library may be unexpected in a sports facility, is exactly why they want to be there. She said: &#34;We are aiming to reach non-traditional library users and surprise people with something unusual. Our vision is to enable everyone to lead better, more connected and engaged lives and the stadium offers us a chance to develop a whole new way of delivering our services.&#34; The library will offer all the normal services you would expect, but there will be a focus on health and sports information. This includes the creation of a Community Sports Archive, documenting the history of local sports clubs and the stadium site.&#34;","2015/03/ed-vaizey-there-appear-to-be-no-grounds-on-which-he-would-intervene-in-libraries.html"],["Barnet","Thu, 12 Mar 2015 21:40:34 +0000","Barnet – Finchley: few seats can boast such stark differences in wealth - Guardian. &#34;Sackman’s campaign is concentrated elsewhere, defending local services from ill-focused austerity: disabled children’s services, a popular nursery and libraries. The last is a particularly hot topic in East Finchley, where the local library occupies an imposing Grade II-listed art deco building, which is a sacred monument to civic pride or an inefficient use of municipal resources, depending on your view. A recent council meeting descended into chaos when the Conservative mayor accidentally sided with the opposition and had to retract his vote. The chamber was stormed by grey-haired protesters brandishing paperback books.&#34;","2015/03/ook-sir-terry-pratchett-obe-1948-2015.html"],["Harrow","Thu, 12 Mar 2015 21:40:34 +0000","Harrow – Four libraries to close according to Harrow Council’s library strategy – Harrow Times. &#34;Library closures have been ‘rubber stamped’ despite objections from almost two thirds of consultation responses. As part of Harrow Council’s budget, funding for libraries across the borough has been slashed by £500,000 for 2015/6, with further cuts expected in the coming years. Yet despite 71.48 per cent of consultation responses stating they were against the closure of libraries, the council’s report states that it still plans to go ahead with the closure of Bob Lawrence, Hatch End, North Harrow and Rayners Lane Libraries – despite pledging to open a new library in Harrow town centre.&#34;","2015/03/ook-sir-terry-pratchett-obe-1948-2015.html"],["Bristol","Thu, 12 Mar 2015 21:40:34 +0000","Bristol – Bristol’s deputy mayor calls for rethink of plan for library closures – Bristol Post. &#34;First he broke ranks with Mayor George Ferguson over the threat of library closures in Bristol – now he is starting to put the boot in. Deputy Mayor Geoff Gollop, a member of Mr Ferguson’s inner sanctum and his second in command, is calling for a cross-party working group to be set up to reconsider a shake-up of the library service which puts seven of them at risk of closure. Mr Gollop – pictured – has tabled a motion at next Tuesday’s full council meeting for the new group which would effectively end the threat of closures. And the Liberal Democrats have waded in with their own motion which calls for the current plans to be withdrawn – in other words, scrap plans to close any libraries. Mr Ferguson decided to go ahead with a review at a cabinet meeting last week, despite objections from councillors and campaigners.&#34;","2015/03/ook-sir-terry-pratchett-obe-1948-2015.html"],["Herefordshire","Thu, 12 Mar 2015 21:40:34 +0000","Herefordshire – Completion – Ledbury Master’s House. Some beautiful pictures of the completed joint museum / library.","2015/03/ook-sir-terry-pratchett-obe-1948-2015.html"],["Milton Keynes","Thu, 12 Mar 2015 21:40:34 +0000","Milton Keynes – Kingston Library: Is this the most modern library in the country? – MK Web. &#34;Shadow Culture Minister Chris Bryant visited the new Kingston Library alongside Andrew Pakes, Labour’s Parliamentary Candidate and Milton Keynes Council’s cabinet members for community services Pete Marland and Liz Gifford.&#34; … &#34;The library has a community focus, hosting a children’s hour, story time, play activities, screenings and music. The library closes its doors for an hour to host exclusive and private story time sessions for children and their parents. This activity in itself brings in around 50 visitors a week.&#34;","2015/03/ook-sir-terry-pratchett-obe-1948-2015.html"],["Stoke","Thu, 12 Mar 2015 21:40:34 +0000","Stoke – Burslem Book Room is banking on being an inspiration - Sentinel. &#34;A band of volunteers based at Swan Bank Methodist Church took on responsibility for manning the mini-library. Now they have secured a £40,000 grant from the People’s Health Trust to expand their activities and employ a part-time member of staff to coordinate the work over the next two years. Burslem Book Room’s approach could also provide a model for other North Staffordshire communities as more council libraries are handed over to volunteer groups to run.&#34;","2015/03/ook-sir-terry-pratchett-obe-1948-2015.html"],["Coventry","Thu, 12 Mar 2015 21:40:34 +0000","Coventry – Coventry library staff could be replaced by volunteers and new self-service technology – Coventry Telegraph. &#34;Fears jobs could be lost at Coventry’s libraries have grown after the man tasked with restructuring the service indicated volunteers and self-service technology could replace staff. Labour Coun David Kershaw, Coventry City Council cabinet member for education, has pledged no library service jobs will be axed during 2015. But the future of workers beyond that point has grown increasingly uncertain after Coun Kershaw told library campaigners at a public council meeting that he saw self-service technology and volunteers as playing a crucial role&#34; Poll on &#34;Would you pay extra council tax to save your library?&#34; is currently 50/50.","2015/03/ook-sir-terry-pratchett-obe-1948-2015.html"],["Lincolnshire","Thu, 12 Mar 2015 21:40:34 +0000","Lincolnshire – John Hayes invites FoDL and Nick Worth to a meeting in Downing Street – Friends of Deeping Library. &#34;John Hayes, Conservative MP for South Holland and the Deepings, has long been an outspoken opponent of the plan to close our library. With the deadline for the decision looming at the end of this month, and in the face of a lack of any acceptable proposal from Lincolnshire County Council (LCC), he asked Nick Worth, the member with responsibility for libraries, to his ministerial office to meet representatives from the FoDL Committee. The meeting took place on March 9th and was an attempt to find a way forward.&#34; AGM delayed until results know.","2015/03/ook-sir-terry-pratchett-obe-1948-2015.html"],["Devon","Thu, 12 Mar 2015 21:40:34 +0000","Devon – Devon confirms mutual move for libraries – BookSeller. &#34;Councillors approved the plans at a cabinet meeting yesterday (11th March), following in the footsteps of other councils, including Suffolk and the City of York. The new structure will see the creation of a mutual, an independent charitable organisation owned by the community which will have the responsibility of running the county’s library service. It will mean that it will be eligible for 80% discount on business rates, and will be able to apply for grants and funds not open to local authorities.&#34;","2015/03/ook-sir-terry-pratchett-obe-1948-2015.html"],["Glasgow","Thu, 12 Mar 2015 21:40:34 +0000","Glasgow – Review of Glasgow libraries launched - Evening Times. &#34;In recent years, the number of people borrowing books has declined while digital services such as downloading ebooks or magazines has increased. At the same time, the use of space in libraries has been changing with developments such as the partnership with Macmillan Cancer Support.&#34; … &#34;Glasgow Life insists there are no plans to close any of its 33 libraries which get 5.5million visitors a year but to ensure they remain in full use in the future.&#34;","2015/03/ook-sir-terry-pratchett-obe-1948-2015.html"],["Lambeth","Thu, 12 Mar 2015 21:40:34 +0000","Lambeth – Save Our Libraries public meeting tonight, 11th March - Brixton Blog. &#34;A public meeting is being held tonight at Brixton Library, 7 pm, to discuss fighting the cuts to Lambeth’s libraries. Lambeth council has launched a consultation on Cultural Services by 2020. Save Our Services campaigners are hoping to find ways to fight the cuts that are proposed for the borough’s libraries.&#34;","2015/03/ook-sir-terry-pratchett-obe-1948-2015.html"],["Bristol","Tue, 17 Mar 2015 22:24:21 +0000","Bristol – Don’t close Bristol libraries – Bristol Post / Letters. &#34;I used Central, Redland and Henleaze every week, Clifton and Westbury-on-Trym occasionally, at various hours on various days. I found all well used, young families in the Children’s Library, people at the shelves, tables and screens. I did not use the other at-risk libraries, so cannot comment on their usage. They are, however, some distance from other libraries, a disadvantage to elderly and disabled people. I still visit Bristol about once per week and still use its libraries, now mainly Central and Redland (where this letter is being copied). Some years ago, the opening days and hours of many Bristol libraries were reduced to save money. Could the at-risk libraries be saved by reducing these further?&#34;","2015/03/task-forces-and-tardises.html"],["Bristol","Tue, 17 Mar 2015 22:24:21 +0000","Bristol – Plans to close seven Bristol libraries on hold - BBC. &#34;The council said there were still likely to be job cuts. Forty posts were under threat in the original plans. It has guaranteed the libraries will not close in this financial year and consultation will run until 30 June. The city’s elected mayor George Ferguson, an independent, said they were trying to find &#34;creative community solutions&#34;. This could include using volunteers to help run libraries.&#34;","2015/03/task-forces-and-tardises.html"],["Telford and Wrekin","Tue, 17 Mar 2015 22:24:21 +0000","Telford and Wrekin – Southwater One, Telford – Designing Libraries. Case study for the new library, linking to a brochure from Opening the Book about their work on the library.","2015/03/task-forces-and-tardises.html"],["Bristol","Tue, 17 Mar 2015 22:24:21 +0000","Bristol – No libraries to close before 2016 - Bristol 247. &#34;No libraries in Bristol will close before 2016, following a cross-party outcry about proposals, which could have seen seven libraries across the city shut … George Ferguson said that he has seen &#34;a tremendous strength of feeling&#34; about the future of libraries and that he had &#34;been listening carefully&#34;. &#34;On one hand this is very encouraging as it means people are more likely to be part of the solution, but on the other hand it drives home that we absolutely need enough time to reduce any unnecessary risk to libraries and make a success of people’s good ideas from all sources,&#34; he added.&#34;","2015/03/task-forces-and-tardises.html"],["Vale of Glamorgan","Tue, 17 Mar 2015 22:24:21 +0000","Vale of Glamorgan – Book thrown at library changes - Penarth Times. &#34;Campaigners opposing Vale Council proposals to change library services had their worst fears confirmed last night (Monday, March 16) when a council committee backed a cabinet decision to close some libraries. The decision means if community groups fail to come forward to take on the libraries on a voluntary basis by May 18 then some libraries will close.&#34; … &#34;If community groups are do not come forward by May 18 and/or a business plan is not submitted or viable, the libraries, where it is proposed are volunteer-led, could close. &#34;","2015/03/task-forces-and-tardises.html"],["Cambridgeshire","Tue, 17 Mar 2015 22:24:21 +0000","Cambridgeshire – Cambridge Central Library could be home to £600k enterprise centre - Cambridge News.&#34;An enterprise centre helping businesses and job seekers could be a key part of a proposed £600,000 renovation of Cambridge Central Library.&#34; … &#34;The council says the changes could bring in &#34;significant income&#34; via charges for the services, as well as helping achieve its objective of boosting economic growth.&#34;","2015/03/task-forces-and-tardises.html"],["Southampton","Tue, 17 Mar 2015 22:24:21 +0000","Southampton – Ideas to keep libraries open ‘need proper council research’ - Bitterne Park Info. &#34;Now the library consultation period has ended and before decisions are taken, we understand there will be an &#34;evaluation&#34;, &#34;and all viable options&#34; will be presented to cabinet – although it currently seems unclear precisely how &#34;viability&#34; will be assessed and tested, and by whom. Friends of Cobbett Road Library (FOCRL) have put in a number of suggestions that could help the library stay open, which were also discussed at a packed community meeting held on February 23, which was attended by a plethora of local politicians from across the spectrum.&#34;","2015/03/task-forces-and-tardises.html"],["Cambridgeshire","Tue, 17 Mar 2015 22:24:21 +0000","Cambridgeshire – Don’t privatise the third floor of Cambridge Central Library - 38 Degrees. &#34;We urge Cambridgeshire County Council to consider alternative proposals that will retain the library’s community focus, and we do not believe this to be incompatible with financially viable solutions. The proposal report acknowledges that there are alternative options that might &#34;respond to community demand and be installed at lower cost&#34;. As members of the community the library serves, we demand that these be adequately explored before valuable community resources are lost for good.&#34;","2015/03/task-forces-and-tardises.html"],["Lambeth","Tue, 17 Mar 2015 22:24:21 +0000","Lambeth – Library trust is ‘shellshocked’ at Lambeth’s 60% funding cut – Inside Croydon. &#34;The future of Upper Norwood Library has been thrown into doubt once again, this time after a Labour-run local authority announced its intention to reduce funding by 60 per cent in 2016″ … &#34;Lambeth has issued no fewer than 22 hefty documents as its &#34;Cultural Services by 2020″ consultation, which it expects residents to read. This all includes plans to sell-off two libraries elsewhere in the borough and to reduce funding to another two in addition to Upper Norwood.&#34;","2015/03/task-forces-and-tardises.html"],["Solihull","Tue, 17 Mar 2015 22:24:21 +0000","Solihull – Fears for future of Dickens Heath library - Solihull News. &#34;Council bosses have produced a draft report which looks at ways of &#34;improving&#34; library facilities across the borough, which includes plans for an &#34;exit strategy&#34; for Dickens Heath Library. But a Solihull Council spokesman was this week keen to stress that the authority was not looking to close the library but could relocate it to another building.&#34;","2015/03/task-forces-and-tardises.html"],["Kent","Tue, 17 Mar 2015 22:24:21 +0000","Kent – Faversham consultation: What you think about your library – Canterbury Times. &#34;Kent County Council currently run the libraries but is looking at creating a charitable trust to take them on.&#34;","2015/03/task-forces-and-tardises.html"],["Kent","Tue, 17 Mar 2015 22:24:21 +0000","Kent – Hundreds sign libraries petition, says Herne Bay Labour group - Canterbury Times. &#34;Hundreds of people have signed a petition asking the county council not to transfer its library services to a charitable trust, Herne Bay Labour Party has said.&#34;","2015/03/task-forces-and-tardises.html"],["South Tyneside","Tue, 17 Mar 2015 22:24:21 +0000","South Tyneside – The Word is out in South Shields – Designing Libraries. &#34;The centre will boast an impressive range of facilities including exhibition space, computer gaming area, design and innovation studio with 3D printers, digitised archives, meeting rooms, children’s immersive storytelling area, OpenZone IT suite, café and a rooftop restaurant and terrace providing stunning views over the river.&#34; Includes images and full list of facilities.","2015/03/task-forces-and-tardises.html"],["Trafford","Tue, 17 Mar 2015 22:24:21 +0000","Trafford – Council receives &#34;expressions of interest&#34; in all three options for future of Hale Library – Altrincham Today. The &#34;Council has received a number of &#34;expressions of interest&#34; in all three potential outcomes for the future of Hale Library. A report summing up the findings from the consultation period held in respect of the future of all libraries in the borough will be published tomorrow. It will reveal that there has been expressions of interest in all three proposals for the Leigh Road facility – the redevelopment of the current site to include a smaller library and residential homes; the development of a new library elsewhere in Hale; and the sale of the current library and replacement with a temporary library for the period up to the opening of the new Altrincham Library in 2017.&#34; … &#34;A petition set up in support of keeping Hale Library on its current site has already attracted over 1,600 signatures. Friends of Hale Library, who set up the petition, say it is a &#34;well loved and vibrant commu&#8230;","2015/03/task-forces-and-tardises.html"],["Blackpool","Thu, 19 Mar 2015 20:48:10 +0000","Blackpool – The many flavours of Pi - Blackpool Raspberry Jam. Layton Library session includes programming bananas to play music. Seriously.","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Harrow","Thu, 19 Mar 2015 20:48:10 +0000","Harrow – May 16 is a black day for libraries - Harrow Times / Letters. &#34;Empty words and broken promises are what come to mind — 15,000 signed petitions, 140 posters from schoolchildren, an open letter with 31 community leaders as signatories, and more than 71 per cent of respondent in the Take Part consultation in favour of keeping libraries open — all pleading to keep four libraries from closing. … If Harrow’s Labour council was truly walking in step with residents and their views, then these four libraries would not be closing its doors to the community come May 16. &#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Brent","Thu, 19 Mar 2015 20:48:10 +0000","Brent – Fresh bid for community-run library in Sudbury – Kilburn Times. &#34;Friends of Barham Library (FOBL) have submitted a bid to the Barham Park Committee Trust (BPCT), which manages the defunct Barham Library (BL), in Harrow Road, to takeover the vacant card room on the suit. As well as providing a community run library, the group proposes to supply computers, host arts and crafts, a tuck shop and a community and information centre.&#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Flintshire","Thu, 19 Mar 2015 20:48:10 +0000","Flintshire – Community libraries in Flintshire facing transformation - News North Wales. &#34;The proposals could see libraries in Hawarden, Mancot and Queensferry moved to a new hub at Deeside Leisure Centre at a cost of £130,000. And the council said libraries in Saltney, Hope and Mynydd Isa are considered ‘unsustainable’. Cllr Helen Brown, Flintshire Council cabinet member for housing, denied the local authority is closing libraries at a cabinet meeting on Tuesday. She said: &#34;This is not about closing libraries. This is about saving services the best we can for the people of Flintshire.&#34;&#34; … &#34;&#34;Deeside Leisure Centre could provide space to co-locate the libraries of Queensferry, Mancot and Hawarden. It is our hope and intention to enable users to have greater access at the leisure centre which has longer opening hours. &#34;Libraries in Mynydd Isa, Saltney and Hope suffer from low footfall and are also not considered sustainable.&#34;&#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Caerphilly","Thu, 19 Mar 2015 20:48:10 +0000","Caerphilly – Readers levitate to Caerphilly County libraries’ Harry Potter Book Night – Caerphilly Observer. &#34;More than 650 young readers flew, levitated and took the night bus to their local library to celebrate Harry Potter Book Night.&#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Harrow","Thu, 19 Mar 2015 20:48:10 +0000","Harrow – Meeting tonight to approve library closures – Harrow Times. &#34;Councillors will be recommended to approve the closures of four libraries at a meeting this evening. Harrow Council’s cabinet will meet this evening to discuss its Library Strategy document after the approved budget included cuts of £500,000 to library services&#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Hartlepool","Thu, 19 Mar 2015 20:48:10 +0000","Hartlepool – Make your opinion count on the future of Hartlepool libraries - Hartlepool Mail. &#34;since 2013 the Library Service budget has had to be reduced by almost 16 per cent but the savings have been achieved without any direct impact on library opening hours or the branch library network. But, the Library Service now has to find further savings from 2016 and these cannot be achieved without reviewing the whole service, including front-line operations.&#34;. Consultation.","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Herefordshire","Thu, 19 Mar 2015 20:48:10 +0000","Herefordshire – I’m paying more and more for less and less – Hereford Times / Letters. &#34;I look at recent council decisions and think ‘what exactly is our council for?’ My local library at Bromyard is never open when I call in and a number of villages are setting up libraries in adopted phone boxes. &#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Cambridgeshire","Thu, 19 Mar 2015 20:48:10 +0000","Cambridgeshire – Enterprise centre plans for Cambridge Central Library approved - Cambridge News. &#34;Cambridgeshire County Council will partner with Kora to deliver the new project on the library’s third floor. The council and Kora will pay £300,000 each towards the project, with Kora paying the council an annual service charge. The other floors will be renovated as part of the project. The entire library faces closure for between one and three weeks, with the third floor shut for eight weeks. There were some protests about the loss of the existing cafe on the third floor, which will be replaced by a smaller coffee bar. This is the first time a council has partnered with a private company to deliver such an enterprise centre, which pledges to &#34;provide cutting edge business and learning services&#34;.&#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Leeds","Thu, 19 Mar 2015 20:48:10 +0000","Leeds – The Leeds Library opens its doors - Yorkshire Evening Post. &#34;The Leeds Library has been at its present home on Commercial Street for more than two centuries, yet there are people who have worked on this busy street for years who don’t know it’s here .. The programme revolves around the motif of a diamond and the idea of the library being a &#34;hidden gem&#34; in the city, and has been funded by Leeds Inspired, Arts Council Yorkshire and the Leeds Philosophical and Literary Society. As part of the project the library, in collaboration with Leeds-based organisation Alchemy, has commissioned local artists, musicians and poets to come up with ways of celebrating the library.&#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Southampton","Thu, 19 Mar 2015 20:48:10 +0000","Southampton – Protesters marching to save Southampton libraries - Daily Echo. &#34;Around 150 residents, from children to pensioners, representing numerous facilities walked through the city centre in dignified silent protest … They wore black and carried books, many with library protest themed handwritten titles like Wind in the Library, The Importance of Libraries, The Famous 5 Libraries, A Brief History of Libraries and A Tale of Two Libraries. Other carried placards which held messages like ‘let our libraries live’, ‘Save Cobbett’ and ‘Love our Libraries’.&#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Cambridgeshire","Sun, 22 Mar 2015 21:08:04 +0000","Cambridgeshire – Cambridge Library innovation and enterprise Centre - Girl in the Moon. &#34;I’m not perfectly sure what I think, but it seems to have sprung from nowhere rather quickly, which isn’t great. And I don’t like the idea of private running of library spaces, or of serious charging for space use.&#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Cambridgeshire","Sun, 22 Mar 2015 21:08:04 +0000","Cambridgeshire – Why there’s furore at Cambridge Central Library and anger at Alexandra Gardens trees – Cambridge News. &#34;There was a protest outside Cambridge Central Library yesterday against the county council’s decision to transform the library’s third floor into an enterprise centre to encourage business growth and boost employment prospects.&#34; … &#34;&#34;It is a huge change for the library which means involving an outside company and the loss of a café which is popular with a cross-section of our community,&#34; said Dr Huppert. &#34;While I am completely committed to doing everything we can to support people looking for work and make it easier for them to do so, I am concerned that this project has not been properly thought through. &#34;It would be completely wrong to go-ahead with such a project without a full consultation with library users and detailed information about the project and Kora.&#34; A petition set up by Claire Dylan had been signed more than 1,400 times.&#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Harrow","Sun, 22 Mar 2015 21:08:04 +0000","Harrow – Harrow Council pledge to work with community over Bob Lawrence, North Harrow, Rayners Lane and Hatch End library options – Harrow Times. &#34;Harrow Council’s cabinet met at the Civic Centre, off Station Road, Harrow, last night to plans to make £500,000 worth of cuts to library services across the borough. &#34; … &#34;&#34;Council officers are still in discussions with campaigners to explore options that could involve co-sharing or community run library facilities, but the proposals must be financially viable so that community run libraries are self sustaining. &#34;I know that the potential closures are deeply disappointing for all the residents and campaigners who have supported their community libraries. The reality is that we are not able to keep ten libraries open in the face of £83 million budget cuts and declining usage.&#34;&#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Southend on Sea","Sun, 22 Mar 2015 21:08:04 +0000","Southend on Sea – The burning issue: Libraries – Echo. Looks at the political position on libraries of the councillors standing for election.","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Thurrock","Sun, 22 Mar 2015 21:08:04 +0000","Thurrock – Thurrock libraries: Read my lips: &#34;Jobs will go&#34; – Your Thurrock. &#34;we asked Thurrock Council leader, John Kent a simple question: &#34;Will there be job losses?&#34; The answer was &#34;Yes: We trust that, as there was a campaign to ‘Save the libraries&#34; so there will also be a campaign to &#34;Save the librarians&#34; Or, are they two different issues?&#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Northamptonshire","Thu, 19 Mar 2015 20:48:10 +0000","Northamptonshire – Kate Stretton celebrates 25 years at Towcester library - Northampton News. &#34;Towcester Library has three landmarks taking place this year. The first is the old library at the Old Church of England School building is moving to The Forum in Moat Lane, where South Northamptonshire Council is building its new headquarters. The new library will open its doors to the public on April 9. Two days later, a human chain will be created from the old library to the new library as the last 40 books are passed by hand from the old library to the new library. And the third landmark concerns library manager, Kate Stretton who celebrates 25 years as a librarian in Towcester library. The former radiographer to paraphrase the words of a famous poet came to the library and never left.&#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Northamptonshire","Thu, 19 Mar 2015 20:48:10 +0000","Northamptonshire – Northamptonshire libraries chosen to pilot projects to launch a Business and IP Centre service – Northampton News. &#34;Northamptonshire libraries has been chosen as one of two pilot projects to launch a Business and IP Centre service to support new businesses. The county council has been awarded a share of £400,000 from the Department for Communities and Local Government and Arts Council England to introduce the service, which will offer help and advice to local entrepreneurs about copyright and protecting their ideas.\nThis builds on the work of the Northamptonshire Enterprise Hubs, launched in 2012 to provide coaching, advice and access to office space and IT facilities in libraries for people interested in developing a business idea.&#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Southampton","Thu, 19 Mar 2015 20:48:10 +0000","Southampton – Audio: Huge support for libraries - Bitterne Park Info. &#34;There was substantial support for the campaign to save threatened Southampton libraries on Wednesday lunchtime. Protesters assembled dressed in black at the Bargate before walking single file to the council offices carrying books, to greet councillors arriving for a full council meeting – at which it was revealed that there had been 6,300 responses to the recent consultation.&#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Southampton","Thu, 19 Mar 2015 20:48:10 +0000","Southampton – Campaigners protest against cuts to Southampton libraries – ITV. &#34;Up to five in the city could be closed and 18 jobs could be at risk if community groups do not come forward to take over running them. The council would save around £300,000 a year if they shut. &#34;","2015/03/7-4m-for-wifi-success-in-the-arts.html"],["Bristol","Sun, 22 Mar 2015 21:08:04 +0000","Bristol – Disappointment at Central Library decision - Bristol 247. &#34;We have seen with sadness and disappointment that a Bristol Council Development Control Committee meeting voted seven to three (with one abstention) to stop two floors of the Bristol Central Library being used as library space. Cathedral Primary School has finally achieved its ambition of installing children’s classrooms into subterranean library basements.&#34; … &#34;This would be distressing at any time – we have advocated the folly of such a short-sighted act from the beginning – but that it should come now in the middle of a public consultation on libraries is grossly ill-timed.&#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Bristol","Sun, 22 Mar 2015 21:08:04 +0000","Bristol – Reader’s letter: Library consultation must be transparent – Bristol Post. &#34;if the public are being asked to comment then the criteria for the decisions taken needs to be transparent and fairly applied. At present I don’t feel that it is either consistent or clear. I have read the current library consultation document and would encourage the Bristol Post to highlight that the City Council is withholding the specific reasons for the proposed closures.&#34; … &#34;Questions need to be asked about the validity of the council’s evidence, as it appears that the financial cuts to date have left the library service without the skills or capacity to actually undertaken a robust and consistent assessment of existing provision. &#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Cambridgeshire","Sun, 22 Mar 2015 21:08:04 +0000","Cambridgeshire – Controversy over future of Cambridge library – Cambridge Student. A look at the different political positions. &#34;The decision has now been called in for review by the County Council’s executive board in light of concerns regarding a lack of adequate public consultation.&#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Cambridgeshire","Sun, 22 Mar 2015 21:08:04 +0000","Cambridgeshire – Library: huge public outcry – Councillor Amanda Taylor. &#34;We have big doubts about KORA, the company set to take over the third floor of the library, and we need much more information on them and how they would be operating: for example, would people have to pay to sit and read in that part of the library under their management in future? We also strongly believe that the library members should have a say in such a huge change, as well as the public of Cambridge. It is after all a public library.","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Lambeth","Sun, 22 Mar 2015 21:08:04 +0000","Lambeth – Waterloo Library: little enthusiasm for volunteer-run service – London SE1. &#34;The council is suggesting selling Waterloo Library and replacing it with a community library run by a social enterprise or charity using volunteers. Lambeth cabinet member for neighbourhoods Cllr Jane Edbrooke, who recently faced a hostile audience at the South Bank Forum, was heard in silence as she outlined possible changes to library provision in Waterloo. &#34;Like you I hate these cuts,&#34; said Cllr Edbrooke in her five minute address. &#34;I don’t want to be making them.&#34;&#34; … &#34;However, during the round table discussions there was strong opposition to a new Waterloo library being run by volunteers. Working people lacked time and were not experienced to so without professional leadership, said a resident from The Cut. One table voted to maintain the council’s direct control rather than outsource the service.&#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Croydon","Sun, 22 Mar 2015 21:08:04 +0000","Croydon – Closing libraries an ‘attack on the soul of the country’ – Secret Life of God. &#34;Library services have been the low-hanging fruit of the recession … Do the politicians know what they’re doing? The decade 2008-2018 (the year when the current deficit-focused spending plans end) will see the dismantling of the national network of libraries that has put free books and a quiet place to read in the heart of every community. As I wrote in my last blog, this kind of provision hasn’t been in place very long: the public library movement that our Victorian forebears began only came to fruition with the 1964 Act. That it should have lasted so short a time and be extinguished so soon makes me sad. &#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Devon","Sun, 22 Mar 2015 21:08:04 +0000","Devon – Library shake-up – Kingsbridge Gazette. &#34; franchised out to an independent operation in the latest county council move to save cash. Hundreds of staff working at all 50 Devon libraries could end up working for a community owned ‘mutual’ not for profit body which would run the library service instead of the county council. &#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Croydon","Sun, 22 Mar 2015 21:08:04 +0000","Croydon – Library closure would be ‘disaster’ warns Society chairman – Inside Croydon. &#34;The chairman of the Norwood Society has sent an open letter to the Croydon councillors who represent Upper Norwood, and to the MP for Lambeth South, Steve Reed OBE, to appeal for help in raising more funds for Upper Norwood Joint Library, which he says will not survive the cuts announced in the past month by Lambeth and Croydon councils.&#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Lambeth","Sun, 22 Mar 2015 21:08:04 +0000","Lambeth – Lambeth Culture 2020: do we feel consulted? – Brixton Blog. &#34;I was shocked at the transparency of box-ticking at last night’s Lambeth Council’s  Culture 2020 consultation, where local residents were ‘consulted’ on Lambeth Council’s proposals as to how they should run our parks, libraries and leisure facilities with a reduced budget.&#34; … &#34;The meeting seemed to rely on people having done extensive research into funding options, or to blindly trust our council and their own research.&#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Manchester","Sun, 22 Mar 2015 21:08:04 +0000","Manchester – Ten of Manchester’s hidden gems – Time Out. Chetham’s Library is top: &#34;The UK’s oldest public library, this one is often overlooked in favour of the limelight-hogging John Rylands. Tucked away behind Chetham’s School of Music, the library was founded by Humphrey Chetham back in 1653 and now houses over 100,000 books. The clinchers, though, are the moody decor and imposing architectural features that give the building its character, along with its perfect city-centre location.&#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Oxfordshire","Sun, 22 Mar 2015 21:08:04 +0000","Oxfordshire – Makeover complete at Bodleian libraries - ITV News. Loads of money spent on new building for rare and in demand items.","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Peterborough","Sun, 22 Mar 2015 21:08:04 +0000","Peterborough – Fifteen voluntary redundancies expected across Peterborough’s libraries – Peterborough Today. &#34;The redundancies are anticipated to cost £120,000-£150,000 but mean nobody will be forced to leave their job.&#34;","2015/03/why-buy-happiness-when-the-library-shares-it.html"],["Bolton","Tue, 24 Mar 2015 21:12:44 +0000","Bolton – Children’s centres, library service and sheltered housing to be hit by more Bolton Council cuts – Bolton News. &#34;Libraries in Bolton could be run by a not-for-profit trust — while children’s centres and housing for the elderly also face massive cuts as Bolton Council looks to save £43 million. &#34; … &#34;No libraries will be closed, but up to 10 jobs will be lost as the library and museum service is asked to cut between £300,000 and £500,000 from its budget — with bosses examining the possibility of turning the library into a not-for-profit trust.&#34;","2015/03/a-noble-librarian-faced-with-adversity-triumphs.html"],["Bristol","Tue, 24 Mar 2015 21:12:44 +0000","Bristol – Take on young as trainees in libraries – Bristol Post / Letters. &#34; instead of having all these comfortably-off old people running our libraries for nothing, how about taking on some young people as trainees to work in the libraries?&#34; … &#34; find it very distasteful that the mayor is expecting volunteers to run libraries – he is contributing to the unemployment situation and lack of opportunities for young people. Young or even middle-aged people can’t afford to work for nothing.&#34;","2015/03/a-noble-librarian-faced-with-adversity-triumphs.html"],["Lincolnshire","Tue, 24 Mar 2015 21:12:44 +0000","Lincolnshire – Internal Audit of the Libraries Project to be discussed by county council - Lincolnshire Echo. &#34;The audit was commissioned following the outcome of the judicial review around the lawfulness of the council’s decision making process to reduce the Library Services within Lincolnshire. It suggests that decision-makers should be presented with alternatives to any preferred model or intuitive solution and any constraints on the timing of public consultations should trigger a risk assessment and appropriate actions to mitigate the potential impact.&#34;","2015/03/a-noble-librarian-faced-with-adversity-triumphs.html"],["Lincolnshire","Tue, 24 Mar 2015 21:12:44 +0000","Lincolnshire – Lincolnshire County Council apologises to Pauline Palmer: &#34;we have learned our lessons&#34; - Save Lincolnshire Libraries. Letter reproduced sent to creator of alternative proposal for library service.","2015/03/a-noble-librarian-faced-with-adversity-triumphs.html"],["Manchester","Tue, 24 Mar 2015 21:12:44 +0000","Manchester – Hark! Rare Shakespearean music to go on display in Manchester this Friday – one of only two copies in world - Manchester Evening News. &#34;The score for ‘Hark, Hark The Lark’ was chosen by Shakespeare to be used in his production of the play ‘Cymbeline’ in the early seventeenth century. Then for over 300 years the music was believed lost – until a copy was discovered in the Henry Watson Music Library in Manchester back in 1936. A music historian using the music library at the time spotted the documents and was the first to make the connection to Shakespeare. The manuscript is now known to be just one of two remaining in the world – the other being kept at the British Museum in London. It has now gone on display at Central Library in Manchester city centre to coincide with Shakespeare Week, held every year to mark the playwright’s work.&#34;","2015/03/a-noble-librarian-faced-with-adversity-triumphs.html"],["Wakefield","Tue, 24 Mar 2015 21:12:44 +0000","Wakefield – Wakefield’s dementia-friendly library – Designing Libraries. &#34;This very special project was designed in partnership with The Alzheimer’s Society. In practical terms it means that the library includes a number of features that will help people who are living with dementia. A colour scheme which is deep red making it warm, friendly and calming; furniture such as chairs and sofas which have a plain design and are easy to get in and out of; a reduction of reflective surfaces; grey skirting boards and door frames making it easier for people to recognise them against the magnolia coloured walls; as well as signage and guiding to help people recognise symbols and words.&#34;","2015/03/a-noble-librarian-faced-with-adversity-triumphs.html"],["Camden","Tue, 24 Mar 2015 21:12:44 +0000","Camden – Camden Future Libraries: What role is there for public libraries in the 21st century? – Camden Council / Eventbrite. &#34;Camden Council will be hosting a lively question time style debate on the role of public libraries in the 21st century at the British Library Conference Centre … Dr Kristen Jensen Head of Collections and Curation, British Library, Brian Ashley, Director of Libraries, Art Council England, Tony Durcan OBE, Assistant Director Digital Newcastle, Newcastle City Council, Annemarie Naylor MBE, Director, Common Futures. The panel will discuss the changing role of libraries, whether libraries need to be all things to all people, what should the priorities for a modern library be and, ultimately, if there a role for public libraries in the 21st century?","2015/03/a-noble-librarian-faced-with-adversity-triumphs.html"],["Kent","Tue, 24 Mar 2015 21:12:44 +0000","Kent – Hope for libraries in Kent – Clikent. Looks at actions those against Kent libraries moving into running by a Trust can do.","2015/03/a-noble-librarian-faced-with-adversity-triumphs.html"],["Kent","Tue, 24 Mar 2015 21:12:44 +0000","Kent – Residents in Sandwich told a charitable trust would enable libraries to be &#34;bespoke&#34; – Kent Online. &#34;Residents in Sandwich have been told a charitable trust would enable libraries to get rid of &#34;one size fits all&#34; policies. This was the message at the public meeting at the Guildhall on Wednesday, from James Pearson, project manager at Kent Libraries. He said he understands services need to be &#34;bespoke&#34; after concerns were raised about the future of libraries under a charitable trust and its opening hours.&#34;","2015/03/a-noble-librarian-faced-with-adversity-triumphs.html"],["Manchester","Tue, 24 Mar 2015 21:12:44 +0000","Manchester – Manchester Central Library throws party to mark a year since £48m revamp - Manchester Evening News. &#34;Bookworms donned their finest party hats to celebrate a year since the grand re-opening of Manchester Central Library. The doors were thrown open for a special &#34;Sunday Funday&#34; of creative activities, live music and tours of the historic building. Staff bought the past to life with characters from the Shakespearean times and World War I while tiny readers enjoyed interactive features in the children’s library.&#34; Some lovely images from the day include a performance poet, a theatrical company, hat-making, Victorian classroom and World War One.","2015/03/a-noble-librarian-faced-with-adversity-triumphs.html"],["Southampton","Tue, 24 Mar 2015 21:12:44 +0000","Southampton – Council decision to spend £99,000 on heating system at Cobbett Road Library branded ‘shambolic’ – Daily Echo. Library is included on list for closure and the current heating system is still working. &#34;Conservative opponents labelled the situation where Cobbett Road Library, in Bitterne, is getting the new system despite its future hanging in the balance as &#34;shambolic&#34;. &#34;","2015/03/a-noble-librarian-faced-with-adversity-triumphs.html"],["Bristol","Thu, 26 Mar 2015 21:18:33 +0000","Bristol – Libraries Something clearly wrong with funding - Bristol Post. Previous experience and large amounts of money spent elsewhere suggests to one writer that the council is not entirely correct in needing to cut libraries spending.","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Leicestershire","Thu, 26 Mar 2015 21:18:33 +0000","Leicestershire – Residents unite with plans to run Hathern Library – Loughborough Echo. &#34;Following the proposal, as part of a cost saving initiative in late 2014 by Leicestershire County Council, to transfer the operation of the county’s libraries into community hands, Hathern Community Library Group has been formed out of a series of public meetings facilitated by Hathern Parish Council. &#34;","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Birmingham","Sun, 29 Mar 2015 20:22:31 +0000","Birmingham – Council’s 39 under-threat community libraries could be saved by deal - Birmingham Mail. &#34;Coun Ian Ward, Labour deputy leader, told the Mail that feared closures are now ‘very unlikely’, although he warned that some jobs would go as they look to reduce the running costs. … After a year of talks and pouring over business plans city council bosses are now in the final stages of negotiating a staff cooperative deal under which the librarians would run the service and keep the much valued community facilities open to the public. Confirmation of the deal is not expected until after the May 7 election.&#34;","2015/03/getting-it-loud.html"],["Birmingham","Tue, 31 Mar 2015 21:07:18 +0000","Birmingham – Birmingham moots library cooperative model – BookSeller.","2015/03/2000-fewer-libraries-ed-vaizey-again-decides-not-to-intervene.html"],["Hackney","Tue, 31 Mar 2015 21:07:18 +0000","Hackney – The secret’s out: advocating for housebound library services in Hackney – CILIP. &#34;Hackney’s best kept secret&#34; was the tantalisingly modest claim in its promotional leaflet when I joined the Community Library Service in 2008. I realised that the key to success could be letting people in on the so-called ‘secret’ so that they could help us grow, improve our service offer, better serve our users and – ultimately – safeguard the service for the future. But how to proceed… We started a targeted promotion of our service.  We used the skills, time and expertise of our staff and local people to make a short film about the service which was shown in common rooms and daycentres and uploaded on YouTube.  Our worth was recognised outside libraries when a link to the film was prominent on the front page of Hackney’s Adult Social Care ‘iCare’ webpage. We had tables at health related events and I ran and presented training for health-associated workers and professionals. With national news reporting the growth of isolation in the e&#8230;","2015/03/2000-fewer-libraries-ed-vaizey-again-decides-not-to-intervene.html"],["Bristol","Thu, 26 Mar 2015 21:18:33 +0000","Bristol – Rationale for Libraries not in Group 1 or 2 – Supporting Information - Bristol Council. Additional information on the proposed threatened libraries.","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Sandwell","Sun, 29 Mar 2015 20:22:31 +0000","Sandwell – Sandwell Libraries to celebrate local First World War heroes – Halesowen News. &#34;Over the next eight months, specially-commissioned pull-up banners featuring heroes from each town will be travelling around the borough’s libraries and museums. &#34;","2015/03/getting-it-loud.html"],["Harrow","Thu, 26 Mar 2015 21:18:33 +0000","Harrow – ‘Full steam ahead’ as campaigners prepare business plans for North Harrow library and Bob Lawrence library – Harrow Times. &#34;campaigners now hope to develop a comprehensive business plan with the help of volunteers, and welcome any suggestions to help guarantee the future of the library. North Harrow library campaigner Garry Davine said: &#34;We have to secure sufficient funding, which will be a challenge, but it is vital that the library is kept open and we will do everything possible to ensure this.&#34;�&#34;","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Herefordshire","Thu, 26 Mar 2015 21:18:33 +0000","Herefordshire – New wellbeing centre could change care in Kington – Hereford Times. &#34;An ambitious project could see Kington’s library transformed into a wellbeing centre, where residents can get counselling, blood pressure checks and even video-call their GP. While the project is still in its early stages, it is hoped that the centre could become a hub for a variety of services in the town, filling in some of the gaps in care that are often found in rural areas.&#34; [This article dates from October 2014 but the vacancies are now available – Ed.]","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Dundee","Sun, 29 Mar 2015 20:22:31 +0000","Dundee – New Books on Pain Management Available in all libraries- Leisure and Culture Dundee. &#34;New books on pain management are now available in every library and mobile library in Dundee, Perth & Kinross and Angus thanks to funding from NHS Tayside. According to the NHS, 14% of the population suffer with chronic pain and that suggests 56350 people in Tayside are suffering with the condition. Last year the local Chronic Pain Improvement Board made a successful application to the NHS Tayside Board Endowment Fund to provide readily accessible public information on chronic pain. As a result, a selection of approved books has been purchased for every library.&#34;","2015/03/getting-it-loud.html"],["Kent","Thu, 26 Mar 2015 21:18:33 +0000","Kent – Good news for library users: a cut in fees…of 35p - Folkestone Herald. &#34;Customers are currently charged a 35p fee if they order and reserve any item stocked within the county, but that service will be provided free of charge from April 1.&#34;","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Knowsley","Thu, 26 Mar 2015 21:18:33 +0000","Knowsley – Knowsley Reader Scheme – Reader Organisation. &#34;Our Knowsley Reader Scheme seeks to develop a team of volunteers who will read one to one with older people in Knowsley care homes. As part of the programme, volunteers will be fully trained and supported by The Reader Organisation staff, with a focus on their own personal development and an impact on their wider lives. Volunteers will receive regular feedback from The Reader Organisation staff, through which their achievements will be recognised and celebrated.&#34;","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Manchester","Thu, 26 Mar 2015 21:18:33 +0000","Manchester – New library opens its doors in Hulme – Manchester Council. &#34;The library, on the ground floor of the leisure centre on Hulme High Street, will be jointly operated by Manchester City Council and the leisure centre operators, GLL. A new joint reception area for the library and leisure centre will create a welcome environment for everyone who wants to use the new facility. The library will be open the same hours as the leisure centre, with self-service facilities available when library staff aren’t there, to collect, borrow, return and renew books and to log on to internet-ready compurters. Library staff will be there throughout the week at the following times … The new library will be officially launched at 1.30pm on Saturday 28 March with Councillor Rosa battle who will be cutting the cake. Executive Member for Culture and Leisure, Councillor Rosa Battle, said: &#34;The opening of the new library on Hulme High Street brings our leisure and library facility together under one roof. The move means that we can offer a bett&#8230;","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Manchester + Salford","Thu, 26 Mar 2015 21:18:33 +0000","Manchester + Salford – Manchester and Salford grow major free Wifi network, bringing superfast surfing to millions - Manchester Council. &#34;The innovative £7.25m scheme is being run by Manchester City Council, Salford City Council and Transport for Greater Manchester (TfGM) – with funding from Broadband Delivery UK (BDUK), part of the Department for Culture, Media and Sport. Thanks to the scheme, Manchester and Salford are providing superfast free Wifi in public buildings right across the cities and on Metrolink trams. Free superfast wifi is to be made available in more than 120 Manchester council buildings including all libraries&#34; … &#34;Free Wifi has already been switched on at Central Library and at the Town Hall Extension, with a further 119 sites set to be up and running by the end of March.  The WiFi is under the name _BusyBeeMcr and users can surf from with no time limit throughout the week, when these venues are open. &#34;","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Lambeth","Tue, 31 Mar 2015 21:07:18 +0000","Lambeth – Anger at cultural cutback – Brixton Blog. &#34;Friends of Lambeth’s libraries and parks, including those in Brixton, have criticised Lambeth council for its proposals to reduce cultural services. They have branded its Culture 2020 consultation &#34;pointless&#34; and said that the council do not understand the seriousness of what they are doing. The proposals include the sale of Waterloo and Minet Libraries, having community groups take over running three others, cuts to the remaining five libraries, as well as cuts to park budgets and having friends’ groups or communities take over the running of the borough’s green spaces as &#34;charitable trusts&#34;.&#34; … &#34;The consultation is open until April 24 and we really want to make sure people get involved and tell us their views and ideas.&#34;&#34;","2015/03/2000-fewer-libraries-ed-vaizey-again-decides-not-to-intervene.html"],["Manchester","Thu, 26 Mar 2015 21:18:33 +0000","Manchester – £45,000 funding boost for Manchester’s Business & IP Centre – Manchester Council. &#34;Manchester’s Business & IP Centre at Central Library will receive £45,000 in new funding from the Department for Communities & Local Government (DCLG), Arts Council England and The British Library. &#34;","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Manchester","Thu, 26 Mar 2015 21:18:33 +0000","Manchester – Manchester Libraries awarded £250,000 to enhance children’s libraries – Manchester Council. &#34;The funding boost from the foundation – a funding charity supporting excellence across the UK – will benefit Wythenshawe Forum Library, Withington Library, Longsight Library, Gorton Library, Newton Heath Library and North City Library in Harpurhey. Part of the funding will be used to enhance and create new informal ‘reading den’ spaces, with storytelling, play, discovery and learning as the focus.  &#34;","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Shropshire","Thu, 26 Mar 2015 21:18:33 +0000","Shropshire – Star comment: Libraries a challenge for groups – Shropshire Star. &#34;The good news is that under new Shropshire Council proposals many libraries will be immune from council cuts. The bad news is that this will be because these libraries will no longer be a council-run service.&#34; Council &#34;hoping to see all of its 22 libraries, except those in the main six market towns, transferred to community groups.&#34;","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Shropshire","Sun, 29 Mar 2015 20:22:31 +0000","Shropshire – Shropshire to make 16 libraries volunteer-run – BookSeller. &#34;The Shropshire Star quoted Teresa Ecclestone, area manager for north Shropshire libraries&#34;","2015/03/getting-it-loud.html"],["Hertfordshire","Tue, 31 Mar 2015 21:07:18 +0000","Hertfordshire – Merger plans look healthy for Knebworth library and surgery – Mercury. &#34;Hertfordshire County Council has been given the green light to negotiate a fee to bring Knebworth’s surgery and library together. The Knebworth and Marymead Medical Practice has decided its demand has outgrown the current building, in Station Road. The move to the library was suggested to the council by General Practice Investments, which is footing the bill for the redevelopment.&#34;","2015/03/2000-fewer-libraries-ed-vaizey-again-decides-not-to-intervene.html"],["Kent","Tue, 31 Mar 2015 21:07:18 +0000","Kent – Last chance to have a say on libraries consultation – Kent Media Hub. &#34;An extensive 12-week public consultation on KCC’s plans to modernise its Libraries, Registration and Archives service by the creation of a charitable trust closes next week (Wednesday, 8 April). Since the consultation’s launch on 12 January, KCC’s Libraries, Registration and Archives service has organised a series of 27 roadshows across the county to give Kent residents the chance to learn more about KCC’s plans. In addition, residents have been invited to register their views online at www.kent.gov.uk/libraries and a questionnaire contained in an explanatory booklet has been available in county libraries.&#34;","2015/03/2000-fewer-libraries-ed-vaizey-again-decides-not-to-intervene.html"],["North Yorkshire","Thu, 26 Mar 2015 21:18:33 +0000","North Yorkshire – Views sought on Norton library’s future as community &#34;hub&#34; – Gazette and Herald. &#34;People are being asked for their views on how Norton library should be used to help secure its future. A steering group has been established to help transform the library in Commercial Street into a community &#34;hub&#34; ahead of financial cuts from North Yorkshire County Council.&#34; … &#34;&#34;The help we have received is fantastic and we can now look at making a positive application to the county council to retain the library and develop it.&#34;","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Wiltshire","Thu, 26 Mar 2015 21:18:33 +0000","Wiltshire – The Reader South West wins at Wiltshire Public Health Awards – The Reader. &#34;Our Wiltshire shared reading project, running in partnership with Wiltshire Libraries, picked up the prize for improved mental health and wellbeing across the area. Running since January 2014, Library Memory Groups bring the shared reading experience to people living with dementia and memory loss on a weekly basis. With poems and short stories that are read aloud, group members are immersed in a calm and relaxed atmosphere, with the texts being read and digested allowing people to piece together collective personal memories related to the stories and poems, which in turn encourages feelings of wellbeing.&#34;","2015/03/shropshire-22-out-of-28-to-be-community-run-ace-research.html"],["Dudley","Sun, 29 Mar 2015 20:22:31 +0000","Dudley – Dudley libraries shortlisted for top award - Stourbridge News. &#34;For a third consecutive year, the Dudley team is in the final of the national Bookseller Industry Awards 2015. &#34;","2015/03/getting-it-loud.html"],["Dundee","Sun, 29 Mar 2015 20:22:31 +0000","Dundee – Winner of Great War Dundee Children’s Book Prize Competition Announced – Leisure and Culture Dundee. &#34;John Fulton has been announced as the first winner of the Great War Dundee Children’s Book Prize competition at a ceremony in Dundee’s Central Library. Theresa Breslin, Vice President of CILIPS (Chartered Institute of Library and Information Professionals in Scotland) and Carnegie Award winning author, announced the winner and presented him with his prize of a cheque for £2,500. The winning story, The Wreck of the Argyll, will be published by Cargo Publishing later this year on 25th September.&#34; … &#34;The competition came about after Dundee Library and Information Service made a successful bid to the Scottish Library and Information Council for funding to support a children’s book prize competition to mark Dundee’s experience of the Great War.&#34;","2015/03/getting-it-loud.html"],["Peterborough","Sun, 29 Mar 2015 20:22:31 +0000","Peterborough – Vivacity respond over ‘voluntary’ Peterborough library job cuts – Peterborough Telegraph. &#34;Peterborough City Council has guaranteed that no one will be forced out of a job during sweeping changes to city libraries. Peterborough City Councillor cabinet member Lucia Serluca, whose portfolio includes libraries, assured councillors at a scrutiny meeting that any staff who take redundancy will do so voluntarily. However, Vivacity, the trust which runs Peterborough’s 10 libraries and will make the decision over job losses, says a final decision has not been taken.&#34; … &#34;Cllr Serluca told councillors: &#34;There will be 15 job losses, but I can say with absolute confidence they have all come from voluntary redundancies.&#34;","2015/03/getting-it-loud.html"],["Shropshire","Sun, 29 Mar 2015 20:22:31 +0000","Shropshire – Shropshire libraries in limbo as cuts loom – Shropshire Star. &#34;Shropshire Council hopes to find &#34;alternative management&#34; for a total of 14 library services in a bid to save £1.3 million. … If no solution can be found, services could be reduced or in some cases replaced with a mobile library service.&#34; … &#34;It was revealed that Shawbury library, based in the village hall, could possibly be reduced to a mobile library. Michael Lewis, head of the library service, said he understand concerns, but  he had &#34;a very limited time to make the £1.3 million savings&#34;. He said he could give the village until  September to find a group to take the library on, but then a six-week consultation into other options would have to begin.&#34;","2015/03/getting-it-loud.html"],["Barnet","Tue, 31 Mar 2015 21:07:18 +0000","Barnet – Author’s plea to stop library cuts at demo – Barnet Today. &#34;Nicole Burstein was speaking outside Edgware Library on Saturday before a march by Save Barnet Libraries. Protesters walked to Mill Hill Library via Burnt Oak Library – two buildings which could be closed altogether under Barnet Council’s plans to cut 60 per cent from the libraries budget. Nicole, who grew up round the corner in Penshurst Gardens, said: &#34;I have been using Edgware Library for as long as I can remember. It is because of my passion for reading that I ended up doing a degree in English literature, and a masters in creative writing.&#34;&#34;","2015/03/2000-fewer-libraries-ed-vaizey-again-decides-not-to-intervene.html"],["Harrow","Tue, 31 Mar 2015 21:07:18 +0000","Harrow – Harrow library strategy 2015-2018 - Harrow Council. Full details of proposed changes to the service.","2015/03/2000-fewer-libraries-ed-vaizey-again-decides-not-to-intervene.html"],["Pembrokeshire","Tue, 31 Mar 2015 21:07:18 +0000","Pembrokeshire – ‘Adventures start at the library’ says TV wildlife expert - Western Telegraph. &#34;Pembrokeshire County Council libraries and primary schools have joined forces to provide library cards to children in 12 local schools. The move is part of a national initiative called ‘Every Child a Library Member’, launched in ten Welsh counties. Launching the initiative in Milford Haven Library, Dr Rhys Jones – best known for his hit BBC series ‘Rhys to the Rescue’ and ‘Dr Rhys Jones’s Wildlife Patrol’ – said: &#34;Libraries are such an important resource – they are a great place for children to let their imagination grow and to develop and it is vitally important that we encourage our children to read more not only to improve their literacy levels but also to help them with life skills and future opportunities.&#34;&#34;","2015/03/2000-fewer-libraries-ed-vaizey-again-decides-not-to-intervene.html"],["Lincolnshire","Tue, 31 Mar 2015 21:07:18 +0000","Lincolnshire – Letter :  Ed Vaizey MP to Leader, LCC | Local inquiry into library provision in Lincolnshire – Gov.uk. Government decides 15 static libraries, online provision and a housebound book delivery service meets statutory requirement for provision and accepts that the other 30 branches can be closed or passed to volunteers. Comments required before 24th April.","2015/03/2000-fewer-libraries-ed-vaizey-again-decides-not-to-intervene.html"],["Newport","Tue, 31 Mar 2015 21:07:18 +0000","Newport – Public consultation open on hours-cut proposal for saved Malpas library – South Wales Argus. &#34;PUBLIC consultation is open on plans to save a Newport library which would see its opening hours cut, … During a Malpas ward meeting last night, residents were informed that Newport City Council’s initial decision to close the Malpas library had been overturned, with the council now proposing to keep the library open for 20 hours per week. Malpas residents now have until April 29 to voice their opinion, with the council running a public consultation on the new proposal.&#34;","2015/03/2000-fewer-libraries-ed-vaizey-again-decides-not-to-intervene.html"],["Sussex","Tue, 31 Mar 2015 21:07:18 +0000","Sussex – New way of working for police officers in Bognor – Bognor Regis Observer. &#34;The policemen and women are being equipped with the latest hi-tech equipment, like the phones and tablet computers, to enable them to stay connected while they are out on the beat around Bognor Regis … Officers will be using their mobile phones while they are sitting in Costa Coffee or the local libraries. That has got to be a good thing. &#34;In the future, I would encourage my staff to be out there and engaging with the public in that way&#34;","2015/03/2000-fewer-libraries-ed-vaizey-again-decides-not-to-intervene.html"]]