[["Cambridgeshire","Thu, 01 Sep 2016 20:35:30 +0000","Cambridgeshire – Calling all bookworms! Littleport to host its first ever literary festival – Ely News. &#34;The festival is being funded by the Arts Council as part of Cambridgeshire County Council’s Arts Alive in Libraries programme&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Cumbria","Thu, 01 Sep 2016 20:35:30 +0000","Cumbria – Keeping libraries relevant and enhancing community wellbeing – Public Sector Executive. &#34;Cllr Ian Stewart, cabinet member for Public Health and Community Services at Cumbria County Council, in his Libraries Taskforce blog, explains why we all must step up and meet the challenge of ensuring libraries are relevant to this day and age&#34; … &#34;we have library services that are open and outward facing, not inward or &#34;reverential&#34;.  The skills of engagement with people which are core to many library functions are needed by the whole council in these times of change. The listening skills of library staff, allied to a deep knowledge of their community can also be harnessed and utilised to make that community a better place for all.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – Anger as it’s confirmed LCC to close three Hyndburn libraries – Accrington Observer. Teacher says &#34;We are absolutely devastated at the announcements to date as we feel a strong viable solution has been proposed by ourselves which would benefit all residents of Rishton. We would very much welcome the opportunity to discuss our proposal further with LCC. If we lose this our village will be decimated.&#34;&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – Final chapter as library faces the axe – Clitheroe Advertiser. &#34;Disappointed campaigners, who submitted petitions and battled for months to keep the crucial services open, are refusing to back down and have vowed to continue fighting. Mr Neil Martin, a spokesman for the Save Whalley Library campaign, said: &#34;This is very disappointing news, and a great blow to the community, along with the other cuts the residents of the Ribble Valley have experienced such as bus services. &#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – Lancashire council to close more than 20 libraries – Guardian. &#34;Lancashire author Andrew Michael Hurley, the Costa award-winning novelist, has warned that &#34;once libraries are closed down that’s it, they don’t come back&#34;, after Lancashire county council confirmed it was set to go ahead with plans to close more than 20 local libraries. The council proposed reducing its library network from 73 to 44 branches in May, in response to government cuts to its budget. After a consultation to which it received more than 7,000 responses, it recommended in a report on Friday that while a few libraries were facing a reprieve, more than 20 others would still be closed. The report goes to the council’s cabinet on 8 September.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – Last-ditch bid to save libraries – Blackpool Gazette. &#34;Angry MP Mark Menzies is pressing for central Government intervention after Lancashire County Council earmarked Lytham, Ansdell, Freckleton and Kirkham libraries for closure in their current form.&#34; … &#34;These include the Friends of Ansdell Library, who have ‘reluctantly’ submitted a business case for a community library in the event that they lose their fight to keep the village library open, and a cartel of parish and town councils in rural Fylde, who are keen to run a range of services from the Kirkham library building.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – MP says time to let local councils hold the budget strings – Lancashire Evening Post. &#34;Tory MP Nigel Evans has hit back at new county council (LCC) cuts by calling for funding to be taken from county councils and given to local borough councils instead.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – Three libraries in Pendle set to close – Pendle Today. &#34;Although there has been criticism from the Conservatives that the cuts have been politically motivated, the Labour administration at County Hall has defended its actions in the circumstances and said that even though some buildings will close, services will continue to be run from elsewhere.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – Two libraries and a children’s centre could be closed down – Wigan Today.","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["South Gloucestershire","Thu, 01 Sep 2016 20:35:30 +0000","South Gloucestershire – Council backtracks on plans to close South Gloucestershire libraries after thousands sign petitions – Bristol Post. &#34;It came up with a plan in January to save £650,000 from its libraries, which cost £2.8million to run last year alone. The plan included cutting services, using volunteers to staff libraries, and closing branches around South Gloucestershire except for five. Council agreed to keep the main libraries open with the others turned into satellite libraries. There are 14 in the area, including the mobile library.&#34; … &#34;That plan was met with derision…&#34; … Open+ and volunteers seen as alternative instead. Staff reduced.","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["South Gloucestershire","Thu, 01 Sep 2016 20:35:30 +0000","South Gloucestershire – Library Review – South Gloucestershire Council. &#34;The savings target has been reduced from £650,000 to £500,000 (within a budget of £2.6 million); Staffed opening hours will reflect usage and be more consistent across South Gloucestershire; The service will introduce a technology (commonly known as Open Plus) to enable libraries to open without staff, extending opening times by up to 100% on current hours; The mobile library service will be replaced with community centre based libraries; South Gloucestershire  Council  will fund the building costs of Chipping Sodbury Library with the service being delivered by volunteers&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Wakefield","Thu, 01 Sep 2016 20:35:30 +0000","Wakefield – Library shuts after asbestos uncovered – Brief Report. &#34;Wakefield Council planned to shut Ossett library on September 10 for nine weeks whilst refurbishment work took place.  But it has now brought forward the closure over safety concerns. It said the health and wellbeing of staff and visitors was a &#34;priority&#34; and it closed the building yesterday as &#34;a precautionary measure&#34;. Work to upgrade the library will now take longer than planned and it is expected to be shut until Spring.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Warrington","Thu, 01 Sep 2016 20:35:30 +0000","Warrington – Meetings set to discuss future of town’s libraries – Warrington Guardian. &#34;LiveWire, which runs the libraries in the town, is hosting the events throughout September. Earlier this years hours were cut at libraries across Warrington as bosses said usage had fallen. Plans have already been announced to move Warrington Central Library into a base in the Golden Square Shopping Centre. Sessions start on Monday at 6pm in Stockton Heath Library.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Aberdeen","Sun, 04 Sep 2016 20:00:18 +0000","Aberdeen – Aberdeen libraries make plea for lego – Evening Express. &#34;Inspired by the success of Lego Literacy clubs in libraries all over the world, City Libraries decided to establish a free club in the Central Library and launched an appeal for unwanted Lego.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Bedford","Sun, 04 Sep 2016 20:00:18 +0000","Bedford – Consultation may have saved Bedford Borough’s libraries from closure – Bedfordshire on Sunday. &#34;No libraries will be closed across Bedford Borough if a recommendation to the council’s executive is approved next week. This year Bedford Borough Council undertook a two-stage consultation, asking people what they felt about the library service and what was important to them.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Caerphilly","Sun, 04 Sep 2016 20:00:18 +0000","Caerphilly – Ystrad Mynach Library to close for £48,000 refurbishment – Caerphilly Observer. &#34;The library, on High Street, will close its doors to members of the public on Monday, September 5, while £48,000 worth of improvement works take place. It is scheduled to reopen on Monday, October 10. The improvement works will include new furniture, shelving and central staff desk, as well as new carpets and a fresh decor throughout the interior. The refurbishment will also ensure the important town centre amenity is able to offer modern facilities for years to come.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Lancashire","Sun, 04 Sep 2016 20:00:18 +0000","Lancashire – Council jobs at risk when buildings close – 2BR. &#34;More than 125 staff risk losing their jobs and countless others could take pay cuts, as a result of building closures in Lancashire.&#34; but &#34;Following the proposed closure of council owned buildings, the County anticipates that a similar number of [library] jobs will be available, but it’s likely that staff will be forced to take pay cuts, change jobs or work bases. A spokesperson from Lancashire County Council was unavailable to comment on the staffing implications until the proposals have been discussed at cabinet next week.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Lancashire","Sun, 04 Sep 2016 20:00:18 +0000","Lancashire – ‘We’ll carry on fight for our libraries’ – new petition launched – Lancashire Telegraph. &#34;Cllr Atkinson said: &#34;The Conservative Group has an alternative proposal which would enable all of these facilities to remain open. &#34;These issues will be debated at an LCC Scrutiny meeting on September 6 at 2pm.&#34;. The petition will be distributed county wide by all Conservative county councillors and physical copies will also be placed in the library in Whalley, Clitheroe and Longridge as well as the Youth Centre in Berry Lane, Longridge.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Norfolk","Sun, 04 Sep 2016 20:00:18 +0000","Norfolk – Head of libraries service to retire after 35 years – Eastern Daily Press. &#34;Jennifer Holland, Assistant Director for Cultural Services and Head of Norfolk’s Library and Information Service is to retire from Norfolk County Council at the end of September, after 35 years working for the authority. Steve Miller has been appointed as Acting Assistant Director for Culture and Lifelong Learning, pending any decisions on a permanent replacement, and will take up his role when Jennifer retires. Steve is currently Head of Museums and Head of Arts and in addition to his new role will continue to lead on museums and the arts. Jan Holden has been appointed Head of Service for the Norfolk Library and Information Service and will take up her appointment at the beginning of October.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Northamptonshire","Sun, 04 Sep 2016 20:00:18 +0000","Northamptonshire – Tell the county council what you think of the library service in Northamptonshire – Northants Herald and Post. &#34;The library service, delivered by First for Wellbeing on behalf of Northamptonshire County Council, is carrying out a survey of its customers to find out what they think about their library and what could be made better. It runs for the whole of September on the mobile library and for one week in county libraries from October 10 to 16. The Adult Public Library User Survey (APLUS) is a national survey which is carried out every other year.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["North Yorkshire","Sun, 04 Sep 2016 20:00:18 +0000","North Yorkshire – Volunteers take on South Craven libraries provision – Keighley News. &#34;South Craven Library Services will be based at the current Cross Hills premises. Residents will run it, with backing from parish councils. The Stronger Communities programme has provided £200 to help cover start-up costs and the group is seeking charitable status to unlock more potential funding avenues.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Nottingham","Sun, 04 Sep 2016 20:00:18 +0000","Nottingham – Nottingham UNESCO City of Literature appoints Director – Leftlion. Sandy (Sandeep) Mahal appointed. &#34;Sandy worked in libraries for ten years and was named one of the UK’s top ten librarians by the Love Libraries campaign; was formerly Head of Partnerships at The Reading Agency; and for the last eighteen months was director of BBC/Arts Council The Space – a commissioning agency supporting greater digital access to the arts.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Staffordshire","Sun, 04 Sep 2016 20:00:18 +0000","Staffordshire – Community group to take over management of Shenstone Library – Lichfield Live. &#34;The Shenstone Community Group will take on the management of the library after being offered a contract.&#34; … &#34;The council says the plans will &#34;re-energise&#34; libraries which have seen the number of people using them decline.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Staffordshire","Sun, 04 Sep 2016 20:00:18 +0000","Staffordshire – Second round of community library transfers announced – Staffordshire Newsletter. &#34;Eight contracts have been offered to community bodies, schools and a business enterprise group in the second phase of transfers, bringing the total number of libraries transferred from council management, or in the process of transferring, to 19.&#34; … &#34;Twenty of the council’s 43 libraries will be managed and staffed by the county council’s library service, while 23 will be supported by not-for-profit groups in the community.&#34; … &#34;Management groups still have to be appointed for the libraries at Cheslyn Hay, Great Wyrley, Loggerheads and Talke and they will be the subject of a third round of bid development.&#34; … &#34;Community libraries are supported by the county council to take over the day-to-day running and management of the library. They will have access to the library service’s stock and IT network, while the county council remains responsible for agreed utility and maintenance costs.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Sunderland","Sun, 04 Sep 2016 20:00:18 +0000","Sunderland – Future of Sunderland library services to be discussed as part of seven-week consultation – Chronicle. &#34;The council is asking both people who use the libraries and those who don’t what is most important to them about what’s on offer in the city’s libraries, if they don’t use the service, what could be done to change that. Councillor John Kelly, portfolio holder for Public Health, Culture and Wellness at Sunderland City Council, said: &#34;We want to find out how people are using library services, whether they’re aware of the range of library services available and what we can do to encourage them to use them more within the reduced budget we have available. &#34;When we last reviewed library services in 2013 it was on the understanding that the Government’s austerity programme was due to end in 2015.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Swindon","Sun, 04 Sep 2016 20:00:18 +0000","Swindon – Campaign to save Park Library is launched ahead of public meeting showdown – Swindon Advertiser. &#34;Save Swindon’s Libraries campaign is calling on library users across the town to turn out for a public meeting next Tuesday to make their voices heard. The event, which will be held from 7pm to 9pm at St Joseph’s College on Ocotal Way, forms a key part of the ongoing consultation into the council’s library strategy. It is the only opportunity for councillors to hear the views of the public in an open forum setting as all the other events are in the form of drop-in sessions.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Wigan","Sun, 04 Sep 2016 20:00:18 +0000","Wigan – Trend-bucking council defies the savage cuts – Wigan Today. &#34;while many parts of the country have seen mass closures of such institutions, Wigan has managed to maintain virtually all such services, perhaps by reducing staff and/or hours or, through the council’s Deal, by handing over the running of operations to volunteers, trusts, charities and other organisations.&#34; … &#34;Beech Hill Library did close but has been replaced with a Book Cycle outlet where people can still obtain books for free.&#34; … &#34;. Aspull library, which is now being run by the community.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Argyll and Bute","Tue, 06 Sep 2016 18:39:53 +0000","Argyll and Bute – Julia Donaldson writes to Sturgeon in ‘dismay’ over librarian cuts – Herald Scotland. &#34;Julia Donaldson cautioned against a decision to remove the librarian at Oban High School, in Argyll and Bute, to budget constraints writing of her &#34;dismay&#34; after learning of the move from distressed pupils. The pupils wrote to the author pleading with her to intervene prompting an open letter from the former Children’s Laureate to Nicola Sturgeon, also know to be an avowed book lover.&#34; see also Julia Donaldson protests to Nicola Sturgeon about axing of school librarians – Guardian and Donaldson criticises school library cuts in Scotland – BookSeller.","2016/09/theres-consultations-and-then-theres.html"],["Darlington","Tue, 06 Sep 2016 18:39:53 +0000","Darlington – Library report – Darlington Council. &#34;It is now clear that what had been previously described as a covenant in the statutory declaration more accurately should have been a reference that Crown Street was held on trust for the purposes of a public library.&#34; … &#34;It is officers’ view that while the legal challenge is defendable, given the risks, expense and delay created by litigation and the developing situation since June, a more considered response is to continue the development of the proposals for the Dolphin Centre, carry out further focussed consultation on the service in this location and then for a more detailed report to be presented to members. At the same time the Cabinet as trustee can meet to consider the implications should the library service relocate to the Dolphin Centre and the future of the Crown Street building.&#34;","2016/09/theres-consultations-and-then-theres.html"],["Darlington","Tue, 06 Sep 2016 18:39:53 +0000","Darlington – Plans to close Darlington library may be ‘set aside’ following legal challenge – Northern Echo.  &#34;Borough Council has announced plans to &#34;set aside&#34; their contentious decision to close Crown Street Library. On the day the authority was due to respond to a legal challenge in relation to the historic library, a lengthy statement was issued saying a &#34;fresh decision&#34; would be made in around three months. Councillors attending a cabinet meeting next week (Tuesday, September 13), are set to approve the proposal to postpone the relocation of the library to the Dolphin Centre.&#34; … &#34;Although the Council is confident that it has grounds on which to defend the legal challenge, it is keen to avoid the substantial cost to the public purse a full judicial review hearing would incur and the delay that would be caused. In light of the issues relating to the Crown Street building and the threat of a judicial review, together with the planned further consultation, it is being recommended that Cabinet members set &#8230;","2016/09/theres-consultations-and-then-theres.html"],["Gateshead","Tue, 06 Sep 2016 18:39:53 +0000","Gateshead – Gateshead’s libraries should not be run by ‘amateur’ volunteers, campaigners say – Chronicle Live. &#34;It was suggested by cost-cutting Gateshead councillors that libraries across the borough could be staffed by volunteers. But anti-closure protesters say volunteers are &#34;amateurs&#34; without training or experience, and that the facilities need to be properly staffed.&#34;. Consultation running until October 8th.","2016/09/theres-consultations-and-then-theres.html"],["Herefordshire","Tue, 06 Sep 2016 18:39:53 +0000","Herefordshire – Library campaign group says fewer people are using libraries due to cut in hours – Ledbury Reporter. &#34;Joint Action for Herefordshire Libraries (JAHL), which represents library users throughout the county, recently submitted a Freedom of Information request to find out how Herefordshire Council cuts have had an impact on library opening hours. It revealed that ten years ago libraries around the county opened for more than 407 hours a week but by 2015/16 they only opened for 253 hours, a drop of nearly 40 per cent.&#34;","2016/09/theres-consultations-and-then-theres.html"],["Lancashire","Tue, 06 Sep 2016 18:39:53 +0000","Lancashire – Councillor slams building closure consultation as ‘a sham’ – 2BR. &#34;Conservative Councillor Terry Hill, who is also Ward Councillor for Whalley, believes the planned closure of more than 100 buildings in Lancashire was decided, even before the consultation went live. He’s shared his views in response to the closure of Whalley Library. He claims the decisions have been made with political motives, and that most of the libraries and children’s centres earmarked for closure are in non-labour areas.&#34;","2016/09/theres-consultations-and-then-theres.html"],["Lancashire","Tue, 06 Sep 2016 18:39:53 +0000","Lancashire – Show support for libraries plea from campaigner Jane – Lancashire Evening Post. Library user &#34;protesting outside county hall in Preston and is urging members of the public to attend two key county council meetings to show the strength of feeling against proposed library closures.&#34; … &#34;Jane, who organised a Save Our Library petition which gained nearly 4,000 signatures, said: &#34;The more members of the public who want to attend or watch the meetings on webcam at 2pm the better.&#34;","2016/09/theres-consultations-and-then-theres.html"],["Lincolnshire","Tue, 06 Sep 2016 18:39:53 +0000","Lincolnshire – Uncertain future for Caistor Arts & Heritage Centre – Market Rasen Mail. &#34;After receiving a Big Lottery grant of £430,000, the creation of Caistor Arts and Heritage Centre was one of six projects featured in the BBC’s Village SOS programme to revitalise rural communities.It is one of only two of the projects still running, but now the future is looking uncertain. &#34;.  Lacks funding.","2016/09/theres-consultations-and-then-theres.html"],["Pembrokeshire","Tue, 06 Sep 2016 18:39:53 +0000","Pembrokeshire – Go digital at Pembrokeshire libraries – Tenby Observer. First Click.","2016/09/theres-consultations-and-then-theres.html"],["Pembrokeshire","Tue, 06 Sep 2016 18:39:53 +0000","Pembrokeshire – Power to approve £3.4m library, gallery and cafe in Haverfordwest granted – Western Telegraph. &#34;The site will become home to the new county library, art and exhibition gallery, play and learn facilities, a tourist information centre, and coffee shop&#34; … &#34;The new library will feature a number of glazed reading pods which will extend onto the overhanging walkway by the river. &#34; … &#34;The £3.4m scheme, supported by Welsh Government funding of £285,000, will feature a ‘ground-breaking’ partnership with the National Library of Wales. &#34;","2016/09/theres-consultations-and-then-theres.html"],["Staffordshire","Tue, 06 Sep 2016 18:39:53 +0000","Staffordshire – Staffordshire libraries get Great War puppy book exclusive – Leek Post and Times. &#34;Now, following a kind donation of 20 copies of the book by The Friends of Cannock Chase, Staffordshire Library Service now has additional copies in all its libraries.&#34;","2016/09/theres-consultations-and-then-theres.html"],["Wakefield","Tue, 06 Sep 2016 18:39:53 +0000","Wakefield – Library closes for refurbishment after asbestos find – Wakefield Express. &#34;Wakefield Council planned to shut Ossett Library on September 10 for nine weeks whilst refurbishment work took place. But it brought forward the closure after the asbestos was found during preparatory work.&#34;","2016/09/theres-consultations-and-then-theres.html"],["Warrington","Tue, 06 Sep 2016 18:39:53 +0000","Warrington – Fate of town’s libraries uncertain after public consultation launched – Warrington Guardian. 30-day consultation, &#34;Since 2010, library visits have decreased by an average of 32 per cent at all libraries in Warrington with the exception of integrated hub libraries in Orford and Woolston which have seen visits increase by an average of 96 per cent over the last six years. &#34; … &#34;The company will spend this month speaking to residents about plans to shut libraries in Stockton Heath, Penketh, Lymm, Culcheth, Warrington Town Centre and Padgate. &#34;","2016/09/theres-consultations-and-then-theres.html"],["Warrington","Tue, 06 Sep 2016 18:39:53 +0000","Warrington – Libraries /  Modernisation Consultation / Proposals – Warrington Livewire. &#34;The 30 day public consultation into the proposed changes to their library and learning offer in Warrington will run from 5th September until 4th October. The neighbourhood wellbeing company has had success in increasing participation and memberships in integrated library sites since it took over the management of 11 libraries in Warrington in 2012, but stand-alone library sites have continued to see a decline in lending and memberships in line with the national trend. Since 2010, library visits have decreased by an average of 32% at all libraries in Warrington with the exception of integrated hub libraries in Orford and Woolston which have seen visits increase by an average of 96% over the last six years. As a result of this and funding cuts to library services from central government, LiveWire and Warrington Borough Council are looking at alternative ways to improve library and learning provision so it is cost effective and more accessible.&#&#8230;","2016/09/theres-consultations-and-then-theres.html"],["Lancashire","Sun, 11 Sep 2016 20:34:46 +0000","Lancashire – Austerity bites as council votes through closures – Lancashire Evening Post. &#34; Labour’s cabinet was keen to stress it was a choice they never wished to make.&#34;","2016/09/the-library-news-since-8th-september.html"],["Lancashire","Sun, 11 Sep 2016 20:34:46 +0000","Lancashire – County Council announces cuts and closures – Lancashire Headline News.  Council looks to volunteers but will only £5k granr first year and £1k in future years (to allow Wifi).","2016/09/the-library-news-since-8th-september.html"],["Lancashire","Sun, 11 Sep 2016 20:34:46 +0000","Lancashire – Death knell sounded for Up Holland, Burscough and Parbold libraries – Champion.","2016/09/the-library-news-since-8th-september.html"],["Lancashire","Sun, 11 Sep 2016 20:34:46 +0000","Lancashire – Fulwood Library fight ‘not over’ as Preston MP to call-in closure decision with government – Blog Preston. &#34;Campaigners fighting to save Fulwood Library from closure say a Preston MP has triggered a ‘call-in’ process to have Lancashire County Council’s plans examined. The library is one of many due to close on Friday 30 September after the county council’s cabinet approved the closure plans. Mary Duckett, one of the team leading the fight to save Fulwood’s library in Garstang Road, said: &#34;We wanted to speak at the council meeting but were told we couldn’t, so we asked our county councillors to ask a question on our behalf.&#34;","2016/09/the-library-news-since-8th-september.html"],["Lancashire","Sun, 11 Sep 2016 20:34:46 +0000","Lancashire – Lancashire CC to close services at more than 100 sites – Public Sector Executive.","2016/09/the-library-news-since-8th-september.html"],["Lancashire","Sun, 11 Sep 2016 20:34:46 +0000","Lancashire – MP calls for Lancashire County Council to be abolished after closure of community facilities – Lancashire Telegraph. &#34;Nigel Evans, who represents the Ribble Valley, has said that he would be lobbying ministers to close the council and that it was unfit to run the services. &#34;","2016/09/the-library-news-since-8th-september.html"],["Lancashire","Sun, 11 Sep 2016 20:34:46 +0000","Lancashire – Tory anger at ‘union staff’ amid huge cuts – Lancashire Telegraph. Conservatives link paid union staff to cuts.","2016/09/the-library-news-since-8th-september.html"],["North Tyneside","Sun, 11 Sep 2016 20:34:46 +0000","North Tyneside – Views sought on five-year library strategy – News Guardian. &#34;North Tyneside Council is drawing up a new five year strategy for its libraries to build on the success of the last five years which saw more than 6.5m visitors and more than four million items loaned out.&#34; … &#34;The new draft strategy also sets out the work the council carries out with communities including prevention and wellbeing through its outreach teams, working with troubled families, providing resources to housebound residents, engaging with schools and offering residents the chance to access cultural events and community activities.&#34;","2016/09/the-library-news-since-8th-september.html"],["Northumberland","Sun, 11 Sep 2016 20:34:46 +0000","Northumberland – Libraries: Where are the priorities? – Morpeth Herald. County councillor had claimed &#34;the county council has not closed one single library. This is not really true: a number of libraries – for example, those at Hadston, Ellington and Haydon Bridge – have in fact been handed over to volunteers to run and offer a much-reduced service. While they are not, therefore, technically ‘closed’, to all intents and purposes they are no longer county libraries.She claims further that Morpeth library was in a ‘terrible condition’ after the 2008 floods and needed massive investment. This is not an accurate picture as the library was substantially re-furbished from insurance money in the wake of the flood…&#34;","2016/09/the-library-news-since-8th-september.html"],["Northumberland","Sun, 11 Sep 2016 20:34:46 +0000","Northumberland – New £3.5m Cramlington leisure centre is officially open for business – Chronicle. Include library. &#34;The town’s library services have also been moved into the centre, providing a one-stop shop for council services.&#34;","2016/09/the-library-news-since-8th-september.html"],["Pembrokeshire","Sun, 11 Sep 2016 20:34:46 +0000","Pembrokeshire – Consultations need to be taken ‘seriously’ – Tenby Observer. &#34;Pembrokeshire County Council have recently conducted a series of consultation meetings across the county, asking the community, service users and other stakeholders to help inform the decision making process, on alternative ways these services, such as – leisure centres, swimming pools, libraries, museums, and tourism marketing support, can be delivered in the future, with unprecedented budget reductions to take place over the next few years.&#34;","2016/09/the-library-news-since-8th-september.html"],["Rotherham","Sun, 11 Sep 2016 20:34:46 +0000","Rotherham – £474,000 to be cut from libraries budget – Rotherham Advertiser. &#34;Rotherham Borough Council proposals to save £474,000 by 2019 will see all 15 libraries stay open but some will move to single staffing &#34;where appropriate and safe&#34;.&#34; … &#34;Maltby library is moving to the neighbouring customer service centre and the mobile service, which has 337 users, will be axed.&#34;.  Local opposition councillor not impressed &#34;&#34;The next library is either Greasbrough or Kimberworth, which are miles away for people who don’t have cars, who rely on public transport.&#34;&#34;","2016/09/the-library-news-since-8th-september.html"],["St Helens","Sun, 11 Sep 2016 20:34:46 +0000","St Helens – Well done to libraries arts project – St Helens Star / Letters. &#34;many thanks to all the staff working for St Helens Arts & Libraries. Well done&#34;","2016/09/the-library-news-since-8th-september.html"],["Shropshire","Sun, 11 Sep 2016 20:34:46 +0000","Shropshire – Closure date set for Shawbury Library – Shropshire Star. &#34;The library will close on September 24. It will be replaced with a mobile service, which will run in the village hall car park, starting on October 4.&#34;","2016/09/the-library-news-since-8th-september.html"],["Southend","Sun, 11 Sep 2016 20:34:46 +0000","Southend – Kent Elms library to temporarily close to give it new look – Echo. &#34;Kent Elms Library on Rayleigh Road is set for a major refurbishment that will reinvent the layout of the main library. The work will create a fresh new welcoming area for customers as well as changes to the entrance to provide better access for those with mobility needs and pushchairs. A private meeting room is also being created as a space which can be hired out.&#34;","2016/09/the-library-news-since-8th-september.html"],["Sunderland","Sun, 11 Sep 2016 20:34:46 +0000","Sunderland – Sunderland councillors to debate controversial library move– Sunderland Echo. &#34;The Conservative group, a Liberal Democrat member, and an Independent member of the council have set their differences aside, and tabled two motions to discuss the future of the service, at the meeting on September 21.&#34; … &#34;Coun Hodson said: &#34;Moving the city library and arts centre will have a massive impact on library users, on the work that takes place in Sunderland museum, and on our bid to become City of Culture in 2021.&#34;","2016/09/the-library-news-since-8th-september.html"],["Telford and Wrekin","Sun, 11 Sep 2016 20:34:46 +0000","Telford and Wrekin – New proposals to save Telford libraries – Shropshire Star. &#34;The plans follow two consultations earlier this year and mean original proposals to close six of the borough’s nine libraries have been thrown out. Three of those six libraries – Donnington, Dawley and Stirchley – will now be run by town or parish councils. However, no organisation has come forward to help fund or run the mobile library service, which will now end from March 31 next year&#34;","2016/09/the-library-news-since-8th-september.html"],["Warrington","Sun, 11 Sep 2016 20:34:46 +0000","Warrington – Councillors hit back at plans to close libraries – Warrington Guardian. &#34;Councillors have hit back at plans to close libraries in their neighbourhoods, with some claiming they had not even been told about the proposals. Culcheth Library is one of the buildings set to close if plans go ahead and Cllr Matt Smith (LAB) hit out at LiveWire for ‘intentionally misleading’ residents with statistics. The Culcheth, Glazebury and Croft councillor said: &#34;LiveWire provided figures showing that library use in Orford has increased, whilst library use in Culcheth has decreased.&#34; 93% of those polled say they do not support the LiveWire proposals (survey accessed 11/9/16).","2016/09/the-library-news-since-8th-september.html"],["Barnet","Tue, 13 Sep 2016 20:27:29 +0000","Barnet – ‘It is not a transformation, it is a destruction’ – Barnet’s Unison branch call to save library jobs – Times Series. &#34;Barnet’s Unison members are calling for an extension on the library staff consultation period, as 46% could lose their jobs. A meeting was held in Chipping Barnet library Stapylton Road this morning (Sep 12), where staff and Unison members were told of the cuts. &#34; … &#34;They are increasing spend and decreasing staff. It is not a transformation, it is a destruction. I have heard of three accounts where people have been unwell at the library, and there have been little or no staff to help them, this includes a situation where one person was very ill.&#34; &#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Bromley","Tue, 13 Sep 2016 20:27:29 +0000","Bromley – Bromley council’s plan to run-down and break-up local libraries falls apart – Unite the union. &#34;Britain’s biggest union, has won a significant victory in Bromley against the fragmentation of the borough’s library service.  The proposal from the council to turn 8 community libraries into volunteer outfits, effectively killing them off as properly resourced libraries, has been thrown into disarray. &#34; … &#34;A letter dated 6 September seen by Unite from Colin Brand, assistant director of environment and community services, states Bromley Community Link the preferred bidder for the volunteer library contract has now decided to &#34;withdraw from the tender process and will take no further part .&#34; Over the last year there has been a sustained campaign by workers and residents against the closures and other cuts to services across the borough, including a series of strikes and well supported demonstrations.&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Buckinghamshire","Tue, 13 Sep 2016 20:27:29 +0000","Buckinghamshire – Little Chalfont Knit & Knatter Group – Skipton Building Society. Group is in the running for funding, depending on public votes. &#34;The group was founded by Christine Crease and Susan Keir in Little Chalfont Community Library to bring together the ladies of the local community to share their skills and to teach non knitters and crocheters. No charge is made but donations are given towards the Little Chalfont Community Library which is a charity for using their premises.&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Coventry","Tue, 13 Sep 2016 20:27:29 +0000","Coventry – Libraries are a basic human right say campaign group as petition is handed to Council – Coventry Observer. &#34;Campaigners from Save Coventry Libraries last week handed in a petition signed by nearly 2,000 residents against the plans by the Council to reduce library services and replace fully trained, paid, staff with volunteers. Campaign organiser Sarah Smith handed over the 1,886 strong petition – with an additional 456 online signatures – and further protests are planned amid doubts surrounding the future of children and youth services across the city.&#34; … &#34;Community-led libraries are at the greatest risk of closing unless no community organisations come forward to run them – Cauldon Castle School in Wyken, Cheylesmore, Coundon, Finham and Earlsdon fall into this category&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Devon","Tue, 13 Sep 2016 20:27:29 +0000","Devon – Okehampton Library celebrates 100th anniversary of author Roald Dahl – Okehampton Times. &#34;The [Summer Reading] The challenge had been kindly supported by the friends of Okehampton Library and Merlin Cinemas and was an event organised by The Reading Agency and was available to children in a number of libraries across the UK. The afternoon of activities hosted by the library featured some of Roald Dahl’s most-loved characters and the incredible artwork of his principal illustrator, Sir Quentin Blake.&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Gwynedd","Tue, 13 Sep 2016 20:27:29 +0000","Gwynedd – Four libraries to close in Gwynedd as part of major shakeup to service – Daily Post. &#34;Deiniolen councillor Elfed Williams described the news as a &#34;massive blow&#34; for the community. Cllr Williams said: &#34;I’m really disappointed as the community have made so much effort to oppose these plans with petitions and letters&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Gwynedd","Tue, 13 Sep 2016 20:27:29 +0000","Gwynedd – New strategy for library service – Cumbrian News. &#34;The ‘More than Books’ strategy which will be considered by the council’s Cabinet will set an objective of maintaining an efficient and comprehensive library service for the people of Gwynedd that will be within reach to anyone wishing to use the service, while simultaneously meeting national requirements at a time where money available to sustain services is decreasing.&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Hertfordshire","Tue, 13 Sep 2016 20:27:29 +0000","Hertfordshire – Buntingford Library to stay on the High Street but modernisation improvements delayed – Hertfordshire Mercury. &#34;Campaigners were left with mixed emotions after Hertfordshire County Council decided to keep Buntingford Library on the High Street – but delayed improvements for 18 months. A meeting of the Public Health, Localism and Libraries Cabinet Panel voted overwhelmingly to support a recommendation to keep the library in its home after public opposition to plans to move it to the fire station. However the councillors also passed a motion that the director of resources at the council would review the position and opportunities of the Buntingford Library in 18 months.&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Lancashire","Tue, 13 Sep 2016 20:27:29 +0000","Lancashire – Adlington Community Library – Survey Monkey. &#34;LCC have sealed the fate of Adlington Library and it is set to close at some point between 1st Oct-30th Nov. Friends of Adlington Library (FoAL) aim to set up and run an Independent Community Library in conjunction with Chorley Borough Council. We would love to know if you use Adlington Library, how you use it and what you might like from an Independent Community Library. Please complete this quick survey.&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Lancashire","Tue, 13 Sep 2016 20:27:29 +0000","Lancashire – Final chapter for Burnley libraries – and community centres also get the axe – Burnley Express. &#34;The death knell was sounded for numerous Burnley libraries and community centres in the latest round of county council cost-saving measures. Four Burnley libraries – Briercliffe, Rosegrove, Pike Hill and Burnley Campus – will close on September 30th after the county council’s cabinet met to approve major cuts to services, reorganisation of others and the closure of more than 100 of its buildings.&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Lincolnshire","Tue, 13 Sep 2016 20:27:29 +0000","Lincolnshire – Book loan period reduced for Grantham Library customers – Grantham Journal. &#34;Visitors to Grantham Library will only be able to loan a book for three weeks, instead of four, from the start of next month. The move is aimed at enabling a greater turnover of stock so customers get a wider selection of titles to choose from. It is part of a drive by charitable social enterprise GLL to improve the library service across the county&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["North Yorkshire","Tue, 13 Sep 2016 20:27:29 +0000","North Yorkshire – Letter: Library cuts caused by government – Bridlington Free Press / Letters. &#34;When this present Government states that they have created a good economy, yes they have but at the expense to the general public with cuts to public services. &#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Shropshire","Tue, 13 Sep 2016 20:27:29 +0000","Shropshire – Work to start on turning Shrewsbury Library into council’s new home – Shropshire Star. &#34;Builders will moving into Shrewsbury’s Library next week to begin work for the historic building to become the new home of the town’s council.&#34; £200k. &#34;Shrewsbury Town Council is also in negotiations with Shropshire Council to take over the running of the library service at the building. Shropshire Council has been seeking to reduce its libraries budget and has been seeking new management for its libraries across the county.&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["St Helens","Tue, 13 Sep 2016 20:27:29 +0000","St Helens – Arts stars to shine in TV appearance – St Helens Star. The &#34; team behind the success of St Helens libraries’ Cultural Hubs will feature in a TV awards ceremony tonight (September 12) as they celebrate being voted the nation’s best arts project in this year’s National Lottery Awards. They will be joined on the red carpet by celebs including actor John Barrowman, singer Kimberly Wyatt and many of Team GB’s Olympic heroes as they accept their honour in front of a star-studded audience. Millions of TV viewers will hear about the project, which was recognised for its inspirational work using £249,600 of Lottery funding to run a series of arts, music and drama sessions in libraries for more than 4,000 people across St Helens.&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Slough","Tue, 13 Sep 2016 20:27:29 +0000","Slough – Heart of Slough transformed as The Curve opens – Slough and South Bucks Observer. &#34;the heart of Slough was transformed overnight last week as the town’s new £22million Curve library and cultural centre was finally opened to the public on Friday morning. Suddenly the 90m long, 15.5m high building covered by boardings and steel barriers for so many months was open to reveal a library boasting 44,000 books, a 280 seater performance space, 35 public computers plus exhibits from Slough Museum all scattered over all three floors. The building may have been pure 21st century. But a sense of history was everywhere – and not just in the museum exhibits.&#34;","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Aberdeenshire","Tue, 20 Sep 2016 21:16:05 +0000","Aberdeenshire – Union urges &#34;fight&#34; to keep council leisure services in-house – Press and Journal. &#34;Aberdeenshire Council has drafted in consultants to examine options for a shake-up of facilities such as swimming pools and libraries. The cash-strapped authority considered setting up a separate charitable trust in a bid to slash costs six years ago but dropped the idea. It said then that an arm’s-length external organisation could save hundreds of thousands of pounds in costs such as VAT and rates. And now the authority has revived the prospect, by commissioning Ernst and Young to carry out a study looking at various options.&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Bromley","Tue, 20 Sep 2016 21:16:05 +0000","Bromley – Unite hails ‘significant victory’ as group pulls out of community library takeovers – Bromley Times. &#34;The ongoing feud over Bromley’s library services took another turn this week, as Community Links Bromley announced it would not be taking over a handful of libraries. Following strike action in July, Unite has called the move &#34;a significant victory against the fragmentation of the borough’s library service&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Cheshire West and Chester","Tue, 20 Sep 2016 21:16:05 +0000","Cheshire West and Chester – IOP Physics in the Field activities for children : Illustrating the Impacts of the STEM Ambassadors programme  – All About STEM. &#34;Over the summer holidays, the libraries within Cheshire West & Chester took part in a national initiative called the ‘Big Friendly Read’. To supplement their activities, STEM Ambassador, Harold Stockdale, and colleagues from the Merseyside branch of the IOP were invited to provide PitF activities for children, their parents/guardians and members of the public attending particular libraries.  The PitF activities are relatively simple demonstrations of phenomena usually involving everyday objects.  These activities are very much &#34;hands-on&#34; and visitors to the PitF are encouraged to try the activities for themselves. The PitF volunteers are able to provide explanations of what happens (sometimes what happens is counterintuitive) and this hopefully encourages children and adults to try the activities at home and think about the science behind what’s happening.&#34; [I’m q&#8230;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Essex","Tue, 20 Sep 2016 21:16:05 +0000","Essex – Computers and WiFi in Epping Forest libraries to be unavailable tomorrow – Epping Forest Guardian. &#34;Essex County Council says an &#34;essential upgrade&#34; means the PCs and Wi-Fi will be unavailable all day&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Essex","Tue, 20 Sep 2016 21:16:05 +0000","Essex – @FunPalaces project becomes a reality through Essex libraries – Essex TV. &#34;This year for the first time a number of Essex Libraries will become Fun Palaces on Saturday 1st October. Witham Library will be transformed with hands-on science and art activities for children and adults. Based around the events of Hans Christian Andersen’s ‘The Snow Queen’, the day will see science experiments, craft projects and group activities aimed at children.&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Lambeth","Tue, 20 Sep 2016 21:16:05 +0000","Lambeth – Library campaigners target Rec – Brixton Blog. &#34;At 2pm, children will gather at Brixton Library for a party to celebrate the [summe reading] challenge in Lambeth. The campaigners say the scheme keeps children entertained and reading through the summer holidays – preventing the &#34;dip&#34; in reading skills that sets back progress until school starts again. Numbers attending have grown spectacularly in Lambeth, year by year. Last year 409 children completed the challenge at the now-closed Carnegie Library, which campaigners say was the busiest children’s library in the borough and another 196 at Minet Library, also now closed.&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Lancashire","Tue, 20 Sep 2016 21:16:05 +0000","Lancashire – Bid for call-in on county council’s controversial library cuts – Lancashire Evening Post. &#34;A cross party group of councillors comprising four Conservatives, two Labour and one Green councillor – Tory opposition group leader Coun Geoff Driver, his deputy Coun Albert Atkinson and Tories Coun Michael Green and Susie Charles, Green Councillor Gina Dowding and Labour councillors Kim Snape and Bev Murray.&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Lancashire","Tue, 20 Sep 2016 21:16:05 +0000","Lancashire – Closing a vibrant venue – Lancashire Evening Post / Letters. &#34;My hopes were raised when they produced a consultation document to take my views into consideration but, even before it had ended, they had again appeared to have announced the sale of the building. What was the point of paying for the consultation if it was already being ignored? The people of Fulwood pay their community charge the same as all the other areas of the city, so why are we being singled out? I know that year on year the Government gives less money to councils, but shouldn’t they be less wasteful rather than take from some and not others?&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Lancashire","Tue, 20 Sep 2016 21:16:05 +0000","Lancashire – Cuts to buildings confirmed – Blackpool Gazette. &#34;Lancashire County Council has now confirmed it will sell off more than 100 buildings which house libraries and children’s services as it looks to make £150m of savings by 2020. Among those to be sold off are Fleetwood’s Northfleet, Cleveleys and Thornton Libraries…&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Lancashire","Tue, 20 Sep 2016 21:16:05 +0000","Lancashire – Former MP David Borrow to quit county politics – Lancashire Evening Post. &#34;The controversial cutbacks the Preston North West councillor is currently presiding over placed him on a collision course not just with members of the public appalled at plans for closure of libraries, Children’s and Young People’s centres, but also with some within his own party who have been angered at the prospect of a Labour led authority imposing what they regard as Tory Government imposed cuts.&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Lancashire","Tue, 20 Sep 2016 21:16:05 +0000","Lancashire – How do you use Adlington Library? What would you like to see in an Independent Community Library?  – Surveymonkey.  Volunteers run own survey for taking over council library.","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Lancashire","Tue, 20 Sep 2016 21:16:05 +0000","Lancashire – Last chance talks on future of libraries and children’s centres – Visitor. &#34;A cross party group of councillors will make an eleventh hour appeal next week in a bid to reverse cuts to libraries and children’s centres. A special meeting of Lancashire County Council’s scrutiny committee will be held on September 22 to consider whether to call in last week’s cabinet decision to close more than 100 buildings and shake up or close care services for some of the most needy in the county.&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Lancashire","Tue, 20 Sep 2016 21:16:05 +0000","Lancashire – MP asks minister to intervene to stop Lancashire library closure – Lancashire Evening Post. &#34;Wyre and Preston North MP Ben Wallace has asked Culture Minister Karen Bradley to investigate Lancashire County Council’s decision to close numerous libraries including Fulwood library.&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Lancashire","Tue, 20 Sep 2016 21:16:05 +0000","Lancashire – Politically Correct – Blackpool Gazette. &#34;  Labour’s public consultation on their library closure plan was a sham. Nothing changed, despite the public outcry, despite the petitions, despite the submissions, despite the hard work of the friends groups, and despite the alternative plan suggested by Wyre Conservative Councillors&#34; …&#34;This is despite the county’s annual underspend of short of £1m, or the £15m they forgot about, or the fact their annual budget is just over £2bn, or the fact that an alternative Conservative budget in March showed a balanced budget without any library closures. &#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Lancashire","Tue, 20 Sep 2016 21:16:05 +0000","Lancashire – Pressure grows to reverse Fulwood library decision – Blog Preston. &#34;The fight to save Fulwood Library from closure is not over, with a &#34;Call In&#34; meeting now being held on Thursday 22 September to challenge the council decision. Campaigners fighting to save Fulwood Library from closure urged a Preston MP to trigger a ‘call-in’ process to have Lancashire County Council’s plans examined&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Lancashire","Tue, 20 Sep 2016 21:16:05 +0000","Lancashire – Silverdale villagers protest against library closure – while Carnforth wins reprieve – Westmoreland Gazette. &#34;Margaret Mackintosh, one of the organisers, told the Gazette of their frustration that Silverdale had been poised to be the country’s first &#34;one-gigabit library&#34; with the arrival of hyperfast broadband in the village last week. &#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Leeds","Tue, 20 Sep 2016 21:16:05 +0000","Leeds – Leeds library closure ‘tragedy’: Funding cut by more than £1 million – Yorkshire Evening Post. &#34;The figures, uncovered through a Freedom of Information (FOI) request, shows that cash sums spent on library services have fallen by 12 per cent since 2011.A total of 19 out of 53 have been closed, with three of its remaining 34 now run by volunteers. &#34;This is a tragedy,&#34; said Dr Lauren Smith, of the national Voices for the Library campaign. &#34;There’s a real feeling of hopelessness. It’s absolutely not alright. Libraries are not just about book provision. They help with improving life skills, access to information, lots and lots of support. &#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Sheffield","Tue, 20 Sep 2016 21:16:05 +0000","Sheffield – Libraries need staff – Sheffield Star / Letters. &#34;The politicians seem to have got off lightly, with no awkward questions asked of councillors to justify their supporting of policies which have led to the decline in and lack of statutory status (and therefore easier closure of) 16 out of 28 of the city’s libraries.&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Shropshire","Tue, 20 Sep 2016 21:16:05 +0000","Shropshire – February deadline set for Church Stretton Library decision – Shropshire Star. &#34;After being in limbo due to a legal wrangle, Shropshire Council has released a &#34;timeline&#34; for fresh decisions over the future of the the library – and expects to be discussing applicants at a cabinet meeting on February 8. The &#34;proposed next steps&#34; for seeking a new group to take the library were discussed by Church Stretton Town Council last night&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Telford and Wrekin","Tue, 20 Sep 2016 21:16:05 +0000","Telford and Wrekin – Telford library reorganisation approved by councillors – Shropshire Star. &#34;Six libraries had faced the axe as part of Telford & Wrekin Council’s cost-cutting budget proposals. But cabinet chiefs last night met at Addenbrooke House, in Telford, and unanimously voted in favour of plans that will see the services continue. Three of the six under-threat libraries – Donnington, Dawley and Stirchley – will be run by town or parish councils.&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Wakefield","Tue, 20 Sep 2016 21:16:05 +0000","Wakefield – Have your say on changes to library opening times – Wakefield Express. &#34;Wakefield Council has amended its proposed changes to library opening hours after listening to feedback from residents. The council is to reduce opening times at all 13 of its libraries in order to make a saving of £150k as identified in this year’s budget report. By introducing a small reduction to opening times at all its libraries, the council will be able to continue to provide these services right across the district.&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Warrington","Tue, 20 Sep 2016 21:16:05 +0000","Warrington – Famous firsts, figures and important dates – Warrington Council. &#34;1848 The first public library in the country is opened in Warrington, supporting the town’s museum&#34; [This library is due to close, with the library being moved into a retail unit in the town centre – Ed.] see petition Save Warrington’s Libraries – 38 Degrees.","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Warrington","Tue, 20 Sep 2016 21:16:05 +0000","Warrington – Residents turn out in force to oppose Stockton Heath Library closure proposals – Warrington Guardian. &#34;Around 30 residents made their way to Sandy Lane Centre to have their voices heard over the threat to the future of the village site. Those in attendance had the support of each parish councillor and members agreed to write to council leader Cllr Terry O’Neill and LiveWire to make their objections known. Parish councillors urged all residents who want to save Stockton Heath Library to e-mail senior councillors, respond to the LiveWire consultation, sign the public petition and join the ‘Save Warrington’s Libraries’ Facebook group to ‘pile on the pressure’ to get the ‘terrible plans dropped’.&#34;","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Warrington","Tue, 20 Sep 2016 21:16:05 +0000","Warrington – UK’s first public library threatened with closure – BookSeller. &#34;Warrington Central Library originally opened in 1848 as the first rate-supported library in the UK, before moving to its current premises in 1858. Rates were the local tax-raising system in place at the time. A petition has been launched to save the libraries from closure. It currently has 5,801 signatures.&#34; … &#34;However, Livewire insists that the central library will not close. Managing director, Emma Hutchinson told The Bookseller: &#34;Warrington Central Library is not being closed.  The plans are to move it to a new location in the centre of town – less than a five minute walk from where it is now.  This will make the library more visible and more accessible for a larger number of people.&#34; [This will actually be a retail unit – and I understand a lot smaller than it is now – Ed.]","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Wigan","Tue, 20 Sep 2016 21:16:05 +0000","Wigan – Library shake-up is next savings plan – Wigan Today. &#34;More than half of the current library budget has been earmarked as part of cutbacks prompting the plans for a shake-up. A public consultation will be launched before the end of this year with council bosses pledging to keep as much of the current service open as possible.&#34;. £1.4m cut. Cuts in staff, merging services and volunteers considered.","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Bolton","Sun, 25 Sep 2016 19:19:25 +0000","Bolton – Plans submitted to create new modern library in Little Lever – Bolton News. &#34; new modern library and community centre in Little Lever. An application has been submitted by Bolton Council for the library to be built on the site of a former Tesco Metro store in Market Street. It is suggested that along with the library facility, there could be a range of other community facilities involved in the new development — potentially including a healthcare centre. The council has acquired the building which has been closed for some time, with a new superstore opening to replace it in Crossley Street in the village in 2014.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Bradford","Sun, 25 Sep 2016 19:19:25 +0000","Bradford – Thousands of children benefit from Bradford libraries literacy schemes – Telegraph and Argus. &#34; thousands of young readers take part in the past year, with almost 10,000 books given out to young children. The district’s libraries run Rhyme Time challenges, which bring together parents and under fives to learn five specific rhymes together over a set period of time. This year saw the library services working with more than 2,000 children and about 1,100 adults as part of the challenge. Funded by the council’s early childhood services, the scheme saw a big leap in families taking part compared to last year, when 1,500 children and 1,000 adults took part.&#34; … &#34;Meanwhile the Bookstart programme, organised through Bradford Libraries, gifted 9,658 &#34;treasure&#34; gifts to children in the district’s nurseries during the 2015-16 school year.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Bristol","Sun, 25 Sep 2016 19:19:25 +0000","Bristol – Helping library users to go online in Bristol libraries – Libraries Taskforce. &#34;Bristol libraries have partnered with HM Revenue & Customs (HMRC) to provide volunteers to support digital skills in libraries. HMRC bring 6-9 volunteers to give 1:1 support to attendees for a 2 hour session over a cup of tea.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Bury","Sun, 25 Sep 2016 19:19:25 +0000","Bury – 4,000 people have say on libraries shake up as councillors consider next move – Bury Times. &#34;More than 4,000 people have had their say on the possible closure of libraries in Bury. In June, the Bury Times reported town-hall bosses were considering making major changes to the borough’s library services to save cash. The council’s ruling Labour group spent £13,000 appointing an external consultant to lead a lengthy consultation process. The first phase of that began on June 13 and ended on September 5. Data out this week shows 3,536 people filled in surveys and 500 others were interviewed over the telephone.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Cambridgeshire","Sun, 25 Sep 2016 19:19:25 +0000","Cambridgeshire – Closing Milton Road Library doesn’t add up, says campaigner – Cambridge News. &#34;Milton Road Library is under threat of demolition so that a block of flats can be built in its place. But city resident Martin Aitken says the library has &#34;an illustrious past&#34; and is famous worldwide for its connection with renowned Cambridge mathematician Prof Sir Andrew Wiles.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Cheshire West and Chester","Sun, 25 Sep 2016 19:19:25 +0000","Cheshire West and Chester – Remember when: A tale of two Northwich libraries – Northwich Guardian. &#34;Every local resident will be familiar with the imposing, if a little faded Brunner public library on Witton Street, but not everyone might know that this was not the first library to occupy this position…&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Fife","Sun, 25 Sep 2016 19:19:25 +0000","Fife – Saved: new future for Glenwood Library – Fife Today. &#34;Now an ambitious business plan drawn up by two leading tenant organisations – Glenrothes Area Residents Federation (GARF) and West Glenrothes Tenant’s Association – which would not only retain the existing library facility, but also utilise the building turning it into a ‘community hub’, has this week been accepted by the Trust&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Halton","Sun, 25 Sep 2016 19:19:25 +0000","Halton – Fun palaces at Halton’s libraries offer chance to try new hobby – Runcorn and Widnes World. &#34;People will be able to try lots of different things which could inspire a new hobby or interest. The idea is part of a free, nationwide celebration of community to bring people together with arts and science.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Lambeth","Sun, 25 Sep 2016 19:19:25 +0000","Lambeth – Waterloo Library: council leader opens temporary venue – London SE1. &#34;In July Waterloo Library left its Lower Marsh home for temporary premises at the Oasis Centre in Kennington Road. As well as the change of location, the new library has less space and a limited library staff presence, although overall opening hours have been extended. This week Lambeth Council leader Lib Peck visited the library to perform the official opening in the presence of pupils from Oasis Academy Johanna and Oasis Academy South Bank. Talking about Lambeth’s controversial reshaping of its library service amid sharp cuts to funding, the council leader said: &#34;What we wanted to do was to try and creatively redevelop some of those libraries so that we could make sure that they were still there, providing that bedrock of local neighbourhoods that we know and cherish…&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Lancashire","Sun, 25 Sep 2016 19:19:25 +0000","Lancashire – Friends of Adlington Library  – Facebook. &#34;Great news for Friends of Adlington Library. Our funding was boosted today by the magnificent sum of £3000. The donation was made by MMA Construction Plant of Adlington. This donation makes our hopes for an Independent Community Library much more possible.  LCC will be closing our Library in the near future and we have to have funding in place to set up a library in the existing building.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Lancashire","Sun, 25 Sep 2016 19:19:25 +0000","Lancashire – Legal vow over East Lancashire libraries review – Lancashire Telegraph. &#34;Campaigners have vowed to seek a judicial review or lobby Culture Secretary Karen Bradley over controversial plans to close more than 20 libraries in East Lancashire. An 11th-hour bid to halt Lancashire County Council’s property review, also affecting children’s and day care centres, was successful last night.&#34; … &#34;Cllr Richard Redicliffe, a Fylde borough councillor, said the wider cuts plan &#34;could lead to a judicial review&#34; on the grounds closure decisions were &#34;pre-determined&#34; before the property consultation, or lead to a challenge being lodged with the Department of Culture, Media and Sport. &#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Lancashire","Sun, 25 Sep 2016 19:19:25 +0000","Lancashire – Lifeline for Lancashire libraries? – That;s Lancashire. &#34;That’s Lancashire can reveal that a £50 million change in Lancashire County Council’s finances lies at the heart of a bid to save dozens of libraries and children’s centres across the county.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Lancashire","Sun, 25 Sep 2016 19:19:25 +0000","Lancashire – Plan to close libraries to be debated again after protests – Lancashire Evening Post. &#34;The authority’s scrutiny committee has voted to &#34;call in&#34; the cost-cutting plan which is a key part of the Labour council’s strategy to cope with swingeing Government economies.&#34; see also Scrutiny committee to review decision to close libraries and children’s centres – Southport Visiter and Fresh hope for Lancashire’s libraries and children’s centres – 2BR and Cabinet to reconsider the future of libraries & children’s centres – Lancashire Headline News and Lancashire County Council told to re-consider Fulwood library closure – Blog Preston. &#34;A meeting of the county council’s scrutiny committee said the property strategy, which earmarks which buildings are to be closed and sold off, should be debated again. The county council’s cabinet is to meet on Monday (26 September) at 10am to consider whether to ‘affirm, amend or rescind the decision’.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Leicester","Sun, 25 Sep 2016 19:19:25 +0000","Leicester – City council still needs to cut £23.5 million from spending – Leicester Mercury. &#34;&#34;The savings will have to come from our other services – street cleaning , libraries, parks, highways maintenance, children’s centres and youth services. &#34;There will be no disguising the impact.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Leicestershire","Sun, 25 Sep 2016 19:19:25 +0000","Leicestershire – Sponsored walk to raise funds for Hathern Library – Loughborough Echo. &#34;Volunteers in Hathern have organised a sponsored walk to raise funds to help keep their library alive. Fifteen volunteers will take part in the walk as they are hoping to raise £1,000 to help with running the library. Hathern Library has been run by volunteers since late 2014, following a cost saving initiative in late 2014 by Leicestershire County Council to transfer the operation of the county’s libraries into community hands.&#34; … &#34;&#34;We need about £10,000 a year to keep it open so any donations are always welcome, and if you’re not busy at the weekend please come down and support us.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Lincolnshire","Sun, 25 Sep 2016 19:19:25 +0000","Lincolnshire – Help get new Wainfleet library running in listed building – Skegness Standard. &#34;Residents have been without a library for more than a year, when Lincolnshire County Council closed the grade one listed building for renovation. A public meeting in the Magdalen building is taking place tomorrow (Thursday) at 7pm to rally volunteers to get it up and running. &#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Norfolk","Sun, 25 Sep 2016 19:19:25 +0000","Norfolk – Embrace your love of reading at Norfolk’s first ever Festival of Storytelling – EDP. &#34;A two-week festival organised by the Norfolk Library Service is set to begin tomorrow, with the aim of encouraging people to embrace their love of reading through various storytelling sessions. Several famous faces will be getting involved, including the likes of Taffy Thomas, Giles Abbott, Dave Tonge, Mandy Hartley and Daniel Morden, who are all signed up to host events, most of which will be free to attend.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["North Somerset","Sun, 25 Sep 2016 19:19:25 +0000","North Somerset – Last chance to have your say on future of libraries and children’s centres – Weston Mercury. &#34;North Somerset Council is reviewing its services, and may merge some of them under one roof as a way of cutting costs. The review covers services in Worle, Congresbury and Yatton, and finishes on September 30.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["North Yorkshire","Sun, 25 Sep 2016 19:19:25 +0000","North Yorkshire – Call for volunteers to help run Ryedale libraries – Gazette Herald. &#34;Both Pickering and Norton libraries are hosting special volunteer sessions this week in a bid to encourage people to get involved with managing the facilities. Under proposals put forward by North Yorkshire County Council (NYCC), from April, Pickering’s library will become a hybrid library run by paid staff and volunteers, while Norton will become a community library, which will receive regular professional support from core libraries.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Oxfordshire","Sun, 25 Sep 2016 19:19:25 +0000","Oxfordshire – Retired librarian appeals for more volunteers to help expand home library service – Bicester Advertiser. &#34;Edna Malcher, who lives in Banbury, gets books delivered to her front door as part of a home library service. But the 88-year-old is urging for more people to give up their time and allow the county council to expand its current service. She said: &#34;The person who comes to visit is very nice and friendly&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Plymouth","Sun, 25 Sep 2016 19:19:25 +0000","Plymouth – Plymouth union leader vows to fight council’s library closures – Herald. Unison leader argues library workers need to know what is happening to them.","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Plymouth","Sun, 25 Sep 2016 19:19:25 +0000","Plymouth – Two Plymouth libraries could close in £48,000 budget cut plans – Herald. &#34;At least two libraries could be earmarked for closure under council plans to save £48,000 from the service by the end of the year. Plymouth City Council leader Ian Bowyer says he and his cabinet colleagues will &#34;look carefully&#34; at the city’s 17 libraries, suggesting any which are under-used could be at risk.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Sheffield","Sun, 25 Sep 2016 19:19:25 +0000","Sheffield – Community centres? – Star / Letters. &#34;It is time we stopped celebrating the policy of volunteer-led libraries as it has seen library visits drop considerably, library staff lose their jobs and library users across the city (including many in deprived areas), lose access to a professionally run library service. I do wish that councilors of all parties would wake up and realise that we need change quick, before we lose 16 libraries for good. &#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Sheffield","Sun, 25 Sep 2016 19:19:25 +0000","Sheffield – Without trained professional staff, a library is not a library – Yorkshire Post / Letters. &#34;Please can we stop referring to volunteer libraries in Sheffield as &#34;libraries&#34; (The Yorkshire Post, September 21). If these facilities were indeed libraries, the council would be classing them as such under the 1964 Act of Parliament covering libraries&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Shropshire","Sun, 25 Sep 2016 19:19:25 +0000","Shropshire – Church Stretton Library campaigners claim strong support – Advertiser. &#34;The Church Stretton Library Support Group Ltd says it is delighted that the results from a community survey about the swimming pool, leisure centre and library produced an 84 per cent response in support of keeping the library where it is with just seven per cent in favour moving it to the school. Of the 2,700 households eligible to participate in the survey, only 47 did not want to keep the library where it is and 80 per cent of those who responded to the survey voted to increase the precept to keep the library where it is&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Shropshire","Sun, 25 Sep 2016 19:19:25 +0000","Shropshire – Final chapter as Shropshire village library shuts – Shropshire Star. &#34;Meanwhile, Shawbury’s library will close today and be replaced with a mobile service.&#34; … &#34;Across 11 of the county’s libraries the council will cut a total of 57 opening hours.&#34; … &#34;Three of the six under-threat libraries in the county – Donnington, Dawley and Stirchley – will now be run by town or parish councils. A fourth library in Hadley will be run by Hadley Learning Community, supported by Hadley & Leegomery Parish Council. Telford & Wrekin Council will also continue to run and operate Newport and Madeley Library with some changes to opening hours.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Staffordshire","Sun, 25 Sep 2016 19:19:25 +0000","Staffordshire – Threat to slash opening hours at libraries in Talke and Loggerheads – Stoke Sentinel. &#34;Residents have been warned opening hours face being cut at two libraries – unless volunteers come forward to run them. Staffordshire County Council has previously failed to find community groups willing to take over the running of its libraries in Talke and Loggerheads. The process was put in place as part of council plans to save £1.3 million from the library service. Now council leaders are once again trying to sort out the long-term future of the two libraries. But groups in Talke have already warned they have no intention of taking over their village library.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Suffolk","Sun, 25 Sep 2016 19:19:25 +0000","Suffolk – Suffolk Libraries Bookfest – Suffolk Libraries. &#34;Launched in 2015, this is an annual event celebrating books and reading throughout Suffolk. We will be hosting novelists and poets, biographers and historians, children’s illustrators and storytellers in libraries in Beccles to the north of the county, along the coast at Southwold, Aldeburgh and Felixstowe, and down to Newmarket and Sudbury in the south.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Sunderland","Sun, 25 Sep 2016 19:19:25 +0000","Sunderland – Library’s move to museum could be key to boosting work of both services, say city chiefs – Sunderland Echo. &#34;Cabinet member John Kelly, portfolio holder for safer city and culture on Sunderland City Council, believes bringing together teams through the potential closure of the central library in Fawcett Street and the shift to Sunderland Museum and Winter Gardens could be key in expanding what is on offer.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Waltham Forest","Sun, 25 Sep 2016 19:19:25 +0000","Waltham Forest – How often do you use your library? – Guardian series. &#34;The council wants to hear your views ahead of its plan to relocate and refurbish several libraries. You can take part in a survey answering questions about Chingford Library Plus, Hale End Library, Higham Hill Library, Wood Street Library, Walthamstow Library, Lea Bridge Library, in Lea Bridge Road and Leytonstone Library. The survey hopes to find out how you use the library, how often and what services are most important to you. It also hopes to see what direction you hope to see your library heading with exercise classes and community groups listed as potential new facilities.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Warrington","Sun, 25 Sep 2016 19:19:25 +0000","Warrington – Britain’s oldest public lending library faces closure due to Tory cuts – Mirror. &#34;Warrington Central Library in Cheshire first opened its doors in 1848 and moved to its current home nine years later.&#34; … &#34;Warrington North Labour MP Helen Jones said: &#34;Lockers cannot replace a library. People will not have the opportunity to get advice from librarians or to browse and come upon books they might otherwise not have read. This proposal will simply hit the life chances of our children and reduce opportunities for older people&#34;.","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Warrington","Sun, 25 Sep 2016 19:19:25 +0000","Warrington – Communities ignored, people left isolated, more than books – your letters on library closure plans – Warrington Guardian. Several letters including worries over reduced services to the disadvantaged, isolation, death of the high street, cold financial analysis ignores benefits of libraries, &#34;Amazon&#34; lockers expensive and little used.","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Warrington","Sun, 25 Sep 2016 19:19:25 +0000","Warrington – In pictures: Campaigners protest to save Warrington’s libraries – Warrington Guardian. &#34;Campaigners of all ages gathered outside Warrington Library on Museum Street today, Friday, to protest against LiveWire’s plans to shut nine libraries across the town. A camera crew from ITV was on the scene speaking to members of the Save Warrington’s Libraries group and LiveWire managing director Emma Hutchinson. Among the protestors were councillors and authors who object to the proposals, including Curtis Jobling, the creator of Bob the Builder who lives in Old Hall.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Warrington","Sun, 25 Sep 2016 19:19:25 +0000","Warrington – Lymm residents launch petition over plans to close library – Warrington Guardian. &#34;Parish Cllr Graham Gowland (LD) launched a campaign to save the Davies Way library after more than 150 people attended LiveWire’s meeting at Lymm Hotel to hear about the proposed closures. He said: &#34;It was clear from the meeting that feelings were very strong. People hold their library in very high esteem and don’t want to lose it.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Warrington","Sun, 25 Sep 2016 19:19:25 +0000","Warrington – MP David Mowat ‘cautiously welcomes’ LiveWire’s library plans – Warrington Guardian.  Conservative MP. &#34; LiveWire’s plans to close libraries in the town in favour of grouping them with other services. But he raised concerns about the proposal to close libraries in places like Stockton Heath and Lymm where there is nowhere else to browse and borrow books.&#34; … &#34;He said Lymm in particular would be hit by the closure of its library and five miles is a ‘considerable distance’ to travel to browse the shelves. But Mr Mowat praised LiveWire’s handling of the consultation and added that the plan to move the central library to Golden Square is ‘eminently sensible’.&#34; … &#34;LiveWire extended its consultation period for an extra 17 days, until October 21, to allow more people to get involved. &#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Warrington","Sun, 25 Sep 2016 19:19:25 +0000","Warrington – Runners campaign to save libraries at half marathon – Warrington Guardian. &#34;RUNNERS protesting against cuts to Warrington’s libraries wore campaign t-shirts and carried banners to raise awareness of the issue as they raced in the English Half Marathon on Sunday. Campaigners from the Save Warrington’s Libraries group invited residents of all ages to pick up a free blue t-shirt pledging their support. People also carried a large banner to promote the protest and asked spectators to sign a petition calling on LiveWire to scrap plans to replace some libraries with lending lockers.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Warrington","Sun, 25 Sep 2016 19:19:25 +0000","Warrington – Warrington library consultation to be extended – Cheshire Today. &#34;The extension of the consultation will allow LiveWire to attend follow up meetings in areas that have requested them and will also give residents longer to have their say following the final public consultation session at Walton Hall on Tuesday 4 October. Over the last two weeks, LiveWire has held a number of public consultation sessions across the town with more than 900 residents attending the eleven sessions held so far and LiveWire has received a significant amount of feedback about the proposals.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["West Berkshire","Sun, 25 Sep 2016 19:19:25 +0000","West Berkshire – Town council hears fears that library report is being watered down – Newbury Today. &#34;&#34;Town Council has heard claims that a crucial report into the future of West Berkshire’s library service is being &#34;tweaked&#34; ahead of publication.","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["West Berkshire","Sun, 25 Sep 2016 19:19:25 +0000","West Berkshire – Under threat West Berkshire libraries plan to be discussed next month – Get Reading. &#34;A report has been put together on behalf of the authority by Red Quadrant Ltd and will soon be made available to the council. This will be considered by the council as part of the review. The review will then be discussed by the authority’s executive committee at a meeting on Thursday, October 20.&#34;","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Devon","Tue, 27 Sep 2016 19:37:14 +0000","Devon – Exciting plans for Ottery St Mary’s long-awaited new library are on display – Sidmouth Herald. &#34;Exciting new plans for the long-awaited library in Ottery St Mary will be revealed this week and people are invited to give their feedback. A dedicated ‘teen zone’, a ‘bigger and better’ children’s area, greater selection of books, more reading space and step-free access are among the benefits being proposed for the facility’s relocation to the former NatWest Bank premises in Silver Street. Libraries Unlimited – the social enterprise responsible for running Devon’s libraries – have put plans for the layout of the new library on display as part of a two-week consultation and members of the public are invited to give their views by Friday, October 7.&#34;","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Lancashire","Tue, 27 Sep 2016 19:37:14 +0000","Lancashire – Cabinet dismisses pleas to save county libraries – Lancashire Evening Post. &#34;It took less than two hours today for Lancashire County Council’s cabinet to sign the final execution papers for a host of Lancashire libraries and children’s centres – despite being forced to think again.&#34; … &#34;This followed a cross party demand from Conservative, Labour and Green councillors for a re-think&#34;  see also Decision upheld on Lancashire’s at risk libraries and children’s centres – 2BR.","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Lancashire","Tue, 27 Sep 2016 19:37:14 +0000","Lancashire – Independent review confirms scale of challenge to county council finances – Lancashire County Council. Price Waterhouse Coopers consultancy report says &#34;The report has identified that the Council will need to make savings of £148m in 2020/21, &#34;even allowing for council tax increases of 3.99% every year for the next four years&#34; [I understand this report that tells the council it has no money has cost them over £1 million in consultancy fees so far – Ed.]","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Lancashire","Tue, 27 Sep 2016 19:37:14 +0000","Lancashire – Lancashire libraries – closures confirmed – Lancashire Headline News. Video. &#34;The fate of dozens of libraries and children’s centres across Lancashire was sealed today – with confirmation they would be shutting their doors.&#34;","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Lancashire","Tue, 27 Sep 2016 19:37:14 +0000","Lancashire – Library campaigners react to news 100 buildings will be closed – 2BR. &#34;It’s a kick in the teeth for residents, who have been fighting for the future of their libraries and children’s centres since news broke they were in jeopardy.&#34; … &#34;&#34;It’s going to be a huge loss to all of Lancashire. Children won’t have anywhere to study after school. We’re telling older people to stay at home, offsetting huge mental health issues, and be part of a community. We’re underiming communities right across Lancashire&#34;","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Lancashire","Tue, 27 Sep 2016 19:37:14 +0000","Lancashire – We all need more libraries, not fewer – Blackpool Gazette / Letters. &#34;Today, in the name of austerity, libraries are being closed or staffed by volunteers. However willing they are, they are not qualified librarians. For several decades now, I have argued for more and extended, libraries, incorporating modern technology. Libraries with children’s corners. Reading is a first step on the road to life and culture, education and work. Let us have more libraries and, yes, adult education centres .The money is there. Better books, not bombs.&#34;","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Leicestershire","Tue, 27 Sep 2016 19:37:14 +0000","Leicestershire – Fresh calls to save Desford Library from the axe – Hinckley Times. &#34;Liberal Democrat councillor Michael Mullaney (Hinckley) urged County Hall bosses to rethink plans to turn the village library into a mobile service.&#34; … &#34;The future of the library appeared to be secure after an agreement was reached between Desford Community Group and Leicestershire County Council to hand over control to the volunteers. However following legal advice, the group says it wants the council to spend £45,000 on repairs, mainly to its slate roof, before it signs a 10-year lease agreement.&#34;","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Sheffield","Tue, 27 Sep 2016 19:37:14 +0000","Sheffield –  Don’t belittle the efforts of library volunteers – Yorkshire Post / Letters. &#34; Definitions of &#34;library&#34; do not necessarily include the presence of paid and trained staff. The books are the important element. Public libraries have a remit to serve the community, which they continue to do by the teams of volunteers who have freely given of their time and interest to provide facilities for others: not just the lending of books but also reading groups, story times for young children and computer access – all facilities provided by council-run branches.&#34; … &#34; In the face of so many library closures and the resulting detriment to local activities, volunteers are essential, and it is mean-spirited and patronising of your correspondent to belittle their efforts.&#34;","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Swindon","Tue, 27 Sep 2016 19:37:14 +0000","Swindon – Petition to save Park Library passes 800 names – This is Wiltshire. &#34;Current proposals would see the Cavendish Square facility closed by the middle of next year unless the community can come up with a way of securing the funds to run, stock and staff it. &#34; … &#34;Park Library was a surprise omission from the core service that the council plan to maintain – set as it is in an economically deprived area, it is an obvious candidate for continued support on the grounds of social and educational need alone. &#34;","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Wakefield","Tue, 27 Sep 2016 19:37:14 +0000","Wakefield – Wakefield Library opening hours cut down to save £150,000 – Yorkshire Evening Post. &#34;From next week all of the council’s 13 libraries will operate on reduced hours.The council held a public consultation in June and said that the new opening times will help it to continue offering library services across the district. About 2,000 people took part in the consultation and many of them were in favour of the libraries opening later in the day and keeping late night opening. Coun Les Shaw, Wakefield Council’s Cabinet Member for Culture, Leisure and Sport, said: &#34;Unfortunately in the current climate we simply have no choice to reduce our spending and cut opening hours. We have listened to what people have said and have made changes to the original proposals.&#34;  The changes come into effect on Monday October 3. &#34;","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Warrington","Tue, 27 Sep 2016 19:37:14 +0000","Warrington – Green Party urges LiveWire to reconsider library closure proposals – Warrington Guardian. &#34;Warrington and Halton Green Party has slammed LiveWire over its library closure proposals and urged it to reconsider immediately. The Greens also believe replacing libraries with lending lockers will be detrimental to communities across the town. The party’s education spokesman Harry Gibbins said: &#34;What’s most alarming about LiveWire’s proposals for Warrington’s libraries is the suggestion that the only options available are doing nothing, massively cutting opening hours, or so-called ‘future proofing’, which consists largely of replacing libraries with book lockers.&#34; … &#34;The ‘cultural hubs’ system in St Helens, for instance, has proven that we can reinvigorate our libraries and turn them into multi-purpose, sustainable and local facilities. &#34;On this basis, Warrington and Halton Green Party urges LiveWire to reconsider its proposals.&#34;&#34;","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Warrington","Tue, 27 Sep 2016 19:37:14 +0000","Warrington – Save Warrington’s Libraries – Campaign group website. &#34;Warrington is proud to have the oldest public library in the country – our central library set up in 1848. The town also hosts a wonderful and valued network of community libraries used by thousands of people. But Livewire, the community interest company responsible for running Warrington’s libraries, sports centres and cultural centres, is proposing a swathe of cuts and reductions to quality libraries across Warrington. Warrington Borough Council will decide on the future of libraries and must reject these proposals and save all of our libraries.&#34;","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Cheshire East","Thu, 29 Sep 2016 20:40:00 +0000","Cheshire East – Plea for Lego bricks to help build up kids’ club – So Cheshire. &#34;Macclesfield Library is on the hunt for toy bricks in order to boost its popular children’s club. The Jordangate library in the town centre held a hugely successful Lego Club over the summer and now Macclesfield librarians are hoping to make it a regular thing – but they needs more bricks&#34;","2016/09/viciously-reducing-bookfunds.html"],["Dundee","Thu, 29 Sep 2016 20:40:00 +0000","Dundee – Challenges for Dundee library after huge slump in visitors – Evening Telegraph. 33,000 fewer visitors in one year: reduction of around 15%, which was 30% up on previous year [Sounds to me like they’re simply not counting visitors accurately – Ed.]","2016/09/viciously-reducing-bookfunds.html"],["Essex","Thu, 29 Sep 2016 20:40:00 +0000","Essex – #Harlow: Essex mobile librarian has receives a national award – Essex TV. &#34;Tom Colloff, a supervisor with Essex Libraries, received the ‘Mobile Library Champion of the Year’ award for helping deliver a mobile service across hard to reach parts of the town.&#34; … &#34;I consider myself very fortunate to be a part of two such great teams at Harlow and in the Mobile Library Service and to have the support of so many wonderful customers around the county&#34;","2016/09/viciously-reducing-bookfunds.html"],["Lancashire","Thu, 29 Sep 2016 20:40:00 +0000","Lancashire – £128,000 facelift for Silverdale library – Lancashire Council. [This news article from 2012 has been deleted from the council website, possibly because the library is closing this week – Ed.]","2016/09/viciously-reducing-bookfunds.html"],["Lancashire","Thu, 29 Sep 2016 20:40:00 +0000","Lancashire – Blackpool MP calls for public inquiry on Lancashire libraries closures – Blackpool Gazette. &#34;Paul Maynard, the Conservative MP for Blackpool North and Cleveleys, has written to libraries minister Matt Hancock calling for a formal investigation into the decision to shut 29 libraries across the county including those in Thornton, Cleveleys, Lytham and Freckleton.&#34;","2016/09/viciously-reducing-bookfunds.html"],["Lancashire","Thu, 29 Sep 2016 20:40:00 +0000","Lancashire – Building consultation decision – Lancashire Council. Map showing where the children’s centres and libraries will be closed.","2016/09/viciously-reducing-bookfunds.html"],["Lancashire","Thu, 29 Sep 2016 20:40:00 +0000","Lancashire – Final chapter for Lytham and Freckleton libraries – Blackpool Gazette. &#34;In the meantime, bids to run Lytham and Ansdell libraries as community libraries, staffed by volunteers, are being considered and it is understood that it will be next month before the outcome of those is known.&#34; … &#34;Fylde MP Mark Menzies [Conservative] has asked Culture Secretary Karen Bradley to review the decision. &#34;","2016/09/viciously-reducing-bookfunds.html"],["Lancashire","Thu, 29 Sep 2016 20:40:00 +0000","Lancashire – Prepare to pay more for less from Lancashire County Council – 2BR. &#34;Our top priority has to be looking after people with disabilities, the frail elderly and vulnerable children – which is why we’ve had a big row over the last few weeks over library closures and various other cuts in the budget. The key thing that the County Council has to find in the budget is money to look after the most vulnerable people in our society. And right now, I can’t guarantee that in three years’ time we will have sufficient resources to look after all of those people in the way in which they and their families would like them to be cared for.&#34;","2016/09/viciously-reducing-bookfunds.html"],["Lancashire","Thu, 29 Sep 2016 20:40:00 +0000","Lancashire – Silverdale library finally shelved this week as eleventh-hour hopes dashed – Westmorland Gazette. &#34;Margaret Mackintosh, a leading light in the Facebook campaign to keep Silverdale library open, described the decision by Lancashire County Council as &#34;depressing and disturbing&#34; as well as &#34;predetermined, cold and calculated&#34;. Campaigners had hoped that the arrival of hyperfast, fibre optic broadband in Silverdale could lead to the Emesgate Lane building becoming the country’s first &#34;one-gigabit library&#34; – leading to a transformation of digital services and even a potentially crucial role during emergencies and disasters.&#34;","2016/09/viciously-reducing-bookfunds.html"],["Lancashire","Thu, 29 Sep 2016 20:40:00 +0000","Lancashire – These libraries in Preston and South Ribble close on Friday – Blog Preston. &#34;These buildings which have provided learning and information for people for decades are to close their doors on Friday for a final time.&#34;","2016/09/viciously-reducing-bookfunds.html"],["Lancashire","Thu, 29 Sep 2016 20:40:00 +0000","Lancashire – What next for two Hyndburn libraries to close at end of this week – Accrington Observer. &#34;Oswaldtwistle and Clayton-le-Moors libraries will be mothballed on Friday, September 30 while Lancashire County Council (LCC) considers expressions of interest in transferring them to community hands. Wendy Sanderson, a member of the LAMP group which has expressed an interest in taking on Oswaldtwistle library, said the closure of the town’s 100-year-old library is upsetting. She said: &#34;It is D-day for the libraries. Everybody is very upset – we don’t know whether they’re just going to board the library up and leave it derelict.&#34;","2016/09/viciously-reducing-bookfunds.html"],["North Yorkshire","Thu, 29 Sep 2016 20:40:00 +0000","North Yorkshire – Libraries are more than just books – Yorkshire Post / Letters. Wide range of services offered. Canadian writes that Canadian libraries doing very well and a library, once closed, will never reopen.","2016/09/viciously-reducing-bookfunds.html"],["Oxfordshire","Thu, 29 Sep 2016 20:40:00 +0000","Oxfordshire – Night time access to books with out-of-hours library scheme in Summertown – Oxford Mail. &#34;£25,000 ‘out-of-hours’ service was launched. Libraries in Summertown and Eynsham have been chosen for a trial scheme, that if successful, could be rolled out across the county’s 43 libraries.&#34; … &#34;&#34;The people of Summertown love their library, we showed that by fighting to save it from the threat of closure five years ago. &#34;People in the area have also been donating money for an upgrade ever since and we are about three-quarters of the way to our £80,000 target. He added: &#34;Residents have been pushing for an extension to opening hours for a while, and this is great news.&#34;","2016/09/viciously-reducing-bookfunds.html"],["Swindon","Thu, 29 Sep 2016 20:40:00 +0000","Swindon – We want your views and we listen to your ideas, says David Renard – Swindon Advertiser. &#34;We have contacted as many groups and people who would be interested or affected by these potential changes as we can, and for some time – it was actually back in December when we started consultation on the parishes issue, and February for our proposals for libraries, so it’s been the best part of a year. &#34;","2016/09/viciously-reducing-bookfunds.html"],["Warrington","Thu, 29 Sep 2016 20:40:00 +0000","Warrington – Annual library spend on books slashed over past three years – Warrington Guardian. &#34;Figures revealed that the company’s budget for books was £231,496 for 2012 to 2013 but the amount fell year on year, with the 2016 to 2017 budget at £103,944. In 2013 LiveWire budgeted to spend £1.14 per resident on books but in the 2016 budget that number fell to just 50p per person.&#34;","2016/09/viciously-reducing-bookfunds.html"],["Warrington","Thu, 29 Sep 2016 20:40:00 +0000","Warrington – Country’s oldest public lending library at risk – ITV. &#34;Warrington was the birthplace of the public lending library, but now its own services are under threat.&#34;.  TV interviews include with boss of Livewire, who claims decline in usage leads them no choice, and many users who say how much they value the libraries soon to be closed.","2016/09/viciously-reducing-bookfunds.html"]]