[["Cambridgeshire","Sun, 02 Oct 2016 19:00:07 +0000","Cambridgeshire – Cambridgeshire’s community and mobile libraries boosted courtesy of online giant Amazon – Wisbech Standard. &#34;The online retailer has contributed 800 non-fiction books to the county’s four mobile libraries, and has donated 50 Amazon Fire tablets to the council’s volunteer-led ‘Library at Home’ service, which supports housebound and vulnerable people across the country. The donations come as part of Amazon’s ‘Amazon in the Community’ programme, which will see the county’s libraries develop six new roving book collections which are aimed at young people and aimed around science, technology and encouraging youngsters to broaden their horizons and develop new skills.&#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Lancashire","Sun, 02 Oct 2016 19:00:07 +0000","Lancashire – Campaigners warn museums and libraries could be closed for good – Lancashire Telegraph. &#34;Ribble Valley Tory MP Nigel Evans said: &#34;I believe these cruel library and museums closures are final. Holding out a false hopes about negotiations to reopen them is a disgrace. If they intended to save them, they would have kept them open during talks.&#34; &#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Lancashire","Sun, 02 Oct 2016 19:00:07 +0000","Lancashire – Lancashire’s cash crisis – museums and libraries close – ITV. &#34;Five museums and six libraries are closing in Lancashire as part of a package of cuts totalling £200 million. The county council says it’s being forced to make savings because of the Government’s austerity measures. But one Lancashire MP says the council is turning the county into a desert&#34;. Video.","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Lancashire","Sun, 02 Oct 2016 19:00:07 +0000","Lancashire – Library closures not the end of the story, vow protesters – Lancashire Evening Post. &#34;Fulwood is one of the first six to shut up shop tonight – the others are Penwortham, Bamber Bridge, Freckleton, Lytham and Thornton. The next batch, including Lostock Hall and Adlington, will follow by the end of November.&#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Lancashire","Sun, 02 Oct 2016 19:00:07 +0000","Lancashire – Lifeline bid submitted for shut down library – Gazette. &#34;The idea is to have a library and a community hub. There as well thought out plans and it is a strong bid with genuine local backing.&#34; … &#34;The Gazette understands the bid has been made by an established community group. It has not come from the Friends of Thornton and Cleveleys Libraries, which had campaigned against the closures.&#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Lancashire","Sun, 02 Oct 2016 19:00:07 +0000","Lancashire – Watch how this boy’s response to Fulwood library closure says it better than most – Blog Preston. &#34;He explains his anger and frustration at the closure of the library as part of Lancashire County Council’s plan to save millions of pounds by closing community buildings.&#34; … &#34;In the video his seven-year-old boy explains he’s even written to the Queen about the closure, and his fears for the future of the staff there.&#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Stockton","Sun, 02 Oct 2016 19:00:07 +0000","Stockton – D-day looms for two popular libraries that face the axe as council tries to save £130k – Gazette. &#34;Stockton Council will decide the fate of both Fairfield and Egglescliffe libraries on next week &#34; … &#34;During a lengthy consultation process, a 3,217 name petition protesting at the possible closure of Fairfield was received, as well as a 659 name petition protesting the possible closure of Egglescliffe. But a new proposal to retain Fairfield Library by sharing the building with a nursery provider will now be considered by the Cabinet.&#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Swindon","Sun, 02 Oct 2016 19:00:07 +0000","Swindon – Arts Council England chief exec visits Swindon – Swindon Advertiser. &#34;Leon Flower, lead librarian, said he was delighted to welcome Darren to town. &#34;It’s a difficult time for the libraries so something like this is what we look forward to,&#34; he said. &#34;We’re really pleased to have Darren here. Arts and culture have a really important place in the town and this enables people to focus on the rich variety we have here.&#34;&#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Swindon","Sun, 02 Oct 2016 19:00:07 +0000","Swindon – Council urged to think again on library closures by 25 headteachers – Swindon Advertiser. &#34;25 primary school headteachers who, in a letter to the council, called for a reconsideration of the ‘drastic’ plans.&#34; … &#34;the headteachers say they believe that such a significant reduction in branch and mobile library provision will be &#34;very detrimental to Swindon children.&#34; &#34; … &#34;Sarah Church, chairman of Save Swindon’s Libraries, said: &#34;We very much hope that the borough council will listen to Swindon’s most experienced teaching professionals now they have written to highlight the importance of the library service and its staff to the school children of Swindon. &#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Warrington","Sun, 02 Oct 2016 19:00:07 +0000","Warrington – MP Helen Jones calls on LiveWire to be more ‘transparent’ with library meetings – Warrington Guardian. Labour MP. &#34;MP Helen Jones has asked LiveWire what it is hiding after reports that there are no briefing notes for one of the library consultation meetings. The Labour politician called on LiveWire to be more transparent about their public consultation regarding the future of the town’s libraries. A spokesman for Ms Jones said briefing notes were circulated after each meeting to summarise the key points raised by residents. But there is no note for the meeting at Culcheth Library, which is described as a ‘highly charged, emotional and eventful’ session by LiveWire’s managing director Emma Hutchinson, who would apparently prefer to give verbal feedback about the meeting to board members.&#34; … &#34;Additionally, the accuracy of the other briefing notes is also questionable, with a number who were present asking ‘were they at the same meeting as I was?’ &#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Worcestershire","Sun, 02 Oct 2016 19:00:07 +0000","Worcestershire – Council property sell off to continue in £19m bonanza for taxpayers – Bromsgrove Advertiser. &#34;Since 2011 more than 100 pieces of council property have been sold ranging from large-scale office blocks to old community halls, day centres, libraries, commercial units, workshops, school sites and more. &#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Barnet","Tue, 04 Oct 2016 19:20:32 +0000","Barnet – Volunteers running Libraries is Outsourcing – John Burgess. &#34;This is critical moment in the future of Libraries. Volunteers are being used now to push through brutal austerity policies and take the livelihoods of thousands of low paid Library workers. Imagine if you will, going into work today. There you are carrying out your job, earning your living, paying your bills feeding your family. Next you receive a tap on the shoulder, you look up and a stranger says &#34; excuse me, erm, this is all a bit awkward for me, I really am unhappy about this but if I don’t do this there will be nothing left.&#34;. You reply &#34;What?&#34;&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Bexley","Tue, 04 Oct 2016 19:20:32 +0000","Bexley – Council scraps library privatisation plans – Bexley Times. &#34;Bexley Council has scrapped plans to privatise the borough’s libraries under a joint outsourcing exercise with Bromley Council. Proposals to outsource the borough’s libraries were revealed last October, but the council has decided to continue running the library service in-house following the receipt of tenders. Joint outsourcing was originally mooted because the two boroughs share the responsibility and cost of managing their back office library services. Cabinet member councillor Peter Craske said: &#34;We have worked really hard to keep our libraries open and we are looking forward to making them even more of a focus for a wide range of leisure and community activities in the future.&#34;&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Bromley","Tue, 04 Oct 2016 19:20:32 +0000","Bromley – Council refuses to back down on library ‘privatisation’ after Bexley scraps outsourcing plan – Bromley Times. &#34;Bromley Council has pledged to continue with plans to ‘privatise’ its libraries after Bexley Council announced its withdrawal from a joint outsourcing project.&#34; … &#34;the council says it will continue to press ahead with the tendering process and sought to reassure residents that there would be no sell-off of assets. Executive councillor for renewal and recreation Peter Morgan said: &#34;The council’s plans have not changed and the tendering process is continuing, with proposals being evaluated and when we can say more, we will.&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Coventry","Tue, 04 Oct 2016 19:20:32 +0000","Coventry – ‘Our council seem to take more notice of outsiders so perhaps they will take note’ – Coventry Telegraph. &#34;The Midlands TUC Creative & Leisure Industries Committee (CLIC) has been disturbed to hear of the proposed cuts to the libraries and museums of Coventry. The Midlands CLIC is made up of unions from across the cultural sector including BECTU, Equity, MU, NUJ, PCS, Unison, NUT, UCU and WGGB.&#34; … &#34;We urge Coventry City Council to end the diminishing of public cultural facilities and services in the city. By doing so you would make a public statement about the type of city you are aspiring to build&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Derby","Tue, 04 Oct 2016 19:20:32 +0000","Derby – Campaigners fighting to save Mickleover Library to hold meeting to discuss their plans – Derby Telegraph. &#34;Derby City Council wants to close 11 of Derby’s 15 libraries, including Mickleover, in a bid to save £648,000 a year. Now, Conservative councillors have called on residents to air their views on the plan.&#34;.  44 out of 100 jobs at risk.","2016/10/dont-keep-it-to-your-shelves.html"],["Lancashire","Tue, 04 Oct 2016 19:20:32 +0000","Lancashire – Campaigners aren’t giving up on Adlington library yet – 2BR. &#34;Lancashire County Council’s executive scrutiny committee will meet later today to consider a number of business cases from groups hoping to keep some libraries in the county open.&#34; … &#34;Friends of Adllington library are now hoping that they’ll be able to take over the running of it after working with Chorley Borough Council to produce a business plan. It’s the latest in a long road for people in the village who are desperate to keep it running&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Lancashire","Tue, 04 Oct 2016 19:20:32 +0000","Lancashire – Chorley residents could be forced to use Horwich library after closure despite recent rivalry – This is Lancashire. &#34;A report that went to the council’s cabinet meeting earlier this month indicates that users of the soon-to-close Adlington facility could travel the 2.6 miles into neighbouring Horwich to use the services at the Lord Street premises, once the closure takes place. &#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Lincolnshire","Tue, 04 Oct 2016 19:20:32 +0000","Lincolnshire – Volunteer Crisis – Save Lincolnshire Libraries. &#34;we continue our campaign by recording what is happening to the service. This includes libraries that have closed for good, volunteers that confirm they are not genuine volunteers but feel forced into saving their community resources and volunteers withdrawing their offers. Help us make this record a true account by letting us know what’s happening with your library, community hub or volunteer group via our contact page.&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Sheffield","Tue, 04 Oct 2016 19:20:32 +0000","Sheffield – Fully-staffed libraries affordable and essential – Yorkshire Post / Letters. &#34;With the total libraries budget comprising less than one per centof the total spend of Sheffield City Council, it’s not as though campaigners and library users are asking for the moon on a stick to have 16 small libraries staffed on a part-time basis. &#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Swindon","Tue, 04 Oct 2016 19:20:32 +0000","Swindon – Headteachers slam Swindon’s plans to close 11 libraries – BookSeller. &#34;Twenty-five headteachers have written an open letter to the council urging it to reconsider the &#34;drastic&#34; plans to close most of the region’s libraries and the mobile library provision.&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Swindon","Tue, 04 Oct 2016 19:20:32 +0000","Swindon – Libraries are haunts of the vulnerable so easy targets, says Barrie Hudson – Swindon Advertiser. &#34; head teachers have written a letter of protest at council plans to shut down all but a handful of our libraries … They are among thousands of people who voiced their horror during the consultation period, so you may be wondering why the local authority hasn’t thrown the scheme out like something mouldy from the back of a fridge.&#34;.  Points out council consultations have no real meaning and are a formality. Also says that the most vulnerable are keen users of libraries but are least likely to protest.","2016/10/dont-keep-it-to-your-shelves.html"],["Wakefield","Tue, 04 Oct 2016 19:20:32 +0000","Wakefield – Warning to ‘use it or lose it’ over local libraries across Yorkshire – Yorkshire Post. &#34; one such library in Wakefield, which has actually seen an increase in membership and longer opening hours since being taken over, says it is possible to make it work. But, organisers have warned, there is only a limited amount of money available. &#34;I dread to think what the future is for libraries,&#34; said Philippa Petty, business co-ordinator at Ackworth Community Library near Wakefield. &#34;Hours are being cut, staffing is being cut. It doesn’t bode well. &#34;I don’t think the future will be volunteer led libraries. Where the funding will come from, I don’t know. There’s only finite amounts of money for a finite amount of libraries.&#34; … &#34;&#34;We now have 1,400 members – more than when it was a local authority library,&#34; she said. &#34;We are open more hours – it was four part days a week, it’s now six. Our library has become a community library. It’s come alive.&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Warwickshire","Tue, 04 Oct 2016 19:20:32 +0000","Warwickshire – Police offer front of counter services at Wellesbourne Library – Herald. &#34;Wellesbourne Library has joined others across the area in offering front of counter police services as the force looks to improve access to its services across the county. Wellesbourne, Alcester, Shipston, Warwick and a number of other libraries across the county are now offering police services as the force works in partnership with Warwickshire County Council. Front of counter services at Stratford Police Station will not be affected and will continue as normal.&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Wokingham","Tue, 04 Oct 2016 19:20:32 +0000","Wokingham – No danger to library – Henley Standard. &#34;The council says it needs to save £20million over the next three years due to a cut in its government grant but it says that libraries, including the one in Church Street, Wargrave, will not be affected.  In 2011 residents fought plans to privatise the library after the council announced that companies were being sought to take over the service in order to save £170,000 a year. More than 2,000 people signed a petition opposing the plans, which were later scrapped. The council will hold drop- in sessions for residents to discuss the latest cuts, including one at the St Mary’s Church Centre in Twyford on October 17 from 7pm to 9pm.","2016/10/dont-keep-it-to-your-shelves.html"],["Bath and North East Somerset","Thu, 06 Oct 2016 20:15:08 +0000","Bath and North East Somerset – Bath libraries to be open less under changes introduced by Bath and North East Somerset Council – Bath Chronicle. &#34;Bath’s libraries will be open 8.5 hours less a week under new changes coming into effect at the end of the month. The Bath Central Library above Waitrose will be open three hours less, Moorland Road will close for two-and-a-half hours and Weston will be shut an extra three hours a week, Monday to Sunday.&#34; … &#34;The Library Service needs to make significant financial savings over the next few years.&#34;","2016/10/minister-says-the-future-is-social-enterprises.html"],["Dundee","Thu, 06 Oct 2016 20:15:08 +0000","Dundee – Dundee Libraries up for Digital Award – Leisure and Culture Dundee. &#34;Dundee Library & Information Services hope to pick up a prestigious award for work undertaken by their Opportunities project tackling social, digital and economic deprivation. They have been shortlisted for the O2 NextGen Digital Challenge Awards 2016 that celebrate innovation, success and leadership in the UK’s digitally transformed economy.&#34;","2016/10/minister-says-the-future-is-social-enterprises.html"],["Edinburgh","Thu, 06 Oct 2016 20:15:08 +0000","Edinburgh – Your Services Are Changing – Play Your Part – Edinburgh Council. &#34;We want a) to support individuals and community groups to become more involved in delivering library services b) more Council and partner services to operate from shared hubs (like Drumbrae and the East Neighbourhood Centre) c) explore opportunities to provide access to facilities after normal opening hours – for example through swipecard access to unstaffed facilities.&#34; [I think this is the first Scottish authority to publicly consider Open+ etc – Ed.]","2016/10/minister-says-the-future-is-social-enterprises.html"],["Hampshire and Southampton","Thu, 06 Oct 2016 20:15:08 +0000","Hampshire and Southampton – The Berry Theatre launches innovative writing project in Eastleigh and Southampton schools – Tec Hub Eastleigh. &#34;The Berry Theatre has launched its innovative Story Shuffle creative writing project for 7-11 year olds across 10 pairs of schools and libraries in Eastleigh and Southampton. The project will encourage pupils to complete 10 writing challenges throughout the Autumn term, which will then be fed into a mobile app, created by Digital Arts Programme associate, TinRaven. Once completed, stories in the app will be unlocked by visiting the school’s partnering library, allowing the children to read their own individual creations and introducing them to an even wider range of books. Following an initial workshop with the Hedge End-based theatre’s Drama Development team, the schools will use the story of Southampton’s legendary hero, Sir Bevis, as the basis for the challenges, devised by the theatre’s associate writer, Matt Beames.&#34; … &#34;The project has been supported by a £50,000-investment from &#8230;","2016/10/minister-says-the-future-is-social-enterprises.html"],["Lambeth","Thu, 06 Oct 2016 20:15:08 +0000","Lambeth – Stand Up To Lambeth Council March, 8th Oct: powerful new video released – Brixton Buzz. &#34;There appears to be growing discontent with many of Lambeth’s policies, in particular their treatment of Cressingham Gardens residents, their support for Network Rail’s plans to evict traders in the Brixton arches and their utterly bonkers scheme to turn popular libraries into privately run gyms with some books on the side.&#34;","2016/10/minister-says-the-future-is-social-enterprises.html"],["Lancashire","Thu, 06 Oct 2016 20:15:08 +0000","Lancashire – Adlington Library looks set to escape permanent closure – 2BR. &#34;a business plan put forward by Friends of Adlington Library and Chorley Borough Council has been recommended for acceptance. It means, with further planning, the service should escape permanent closure.&#34;","2016/10/minister-says-the-future-is-social-enterprises.html"],["Sheffield","Thu, 06 Oct 2016 20:15:08 +0000","Sheffield – Ailing library service – Star / Letters. Smaller branches need professional library staff instead of self-service machines. Volunteer libraries &#34;have failed&#34;.","2016/10/minister-says-the-future-is-social-enterprises.html"],["Sunderland","Thu, 06 Oct 2016 20:15:08 +0000","Sunderland – Chance to have say on future of library services in Sunderland – Sunderland Echo. &#34;A consultation seeking the views of library users and non users including children, young people and families as well as potential partners in the voluntary, community, public and private sectors ends on Friday, October 21.&#34;","2016/10/minister-says-the-future-is-social-enterprises.html"],["Warrington","Thu, 06 Oct 2016 20:15:08 +0000","Warrington – Appleton Parish Council &#34;strongly objects&#34; closure of any library in town – Warrjngton Guardian. Council not impressed by &#34;lending lockers&#34; replacing closed libraries.","2016/10/minister-says-the-future-is-social-enterprises.html"],["Warrington","Thu, 06 Oct 2016 20:15:08 +0000","Warrington – Borrow-A-Book-Day, Saturday October 15th at libraries across Warrington – 38 Degrees. &#34;We are calling on everyone to go to their local library any time it’s open on Saturday October 15th and borrow a book (or two!). And take friends and family along with you! All library details are on our site at www.SaveWarringtonsLibraries.org/borrow-a-book-day. We’re also putting on special activities at 11am on October 15th at several of the libraries under threat, including special talks by famous authors that support the campaign and fun activities for the family.&#34;","2016/10/minister-says-the-future-is-social-enterprises.html"],["Warrington","Thu, 06 Oct 2016 20:15:08 +0000","Warrington – Video: Library campaigners protest at Stockton Heath Library – Warrington Guardian. &#34;The Save Warrington’s Libraries campaign has attracted attention from national media and residents spoke to a presenter from the BBC at the protest. A petition asking Warrington Borough Council to scrap LiveWire’s proposals has already been signed by more than 7,500 people. Campaigners have organised a Borrow a Book Day on October 15 and are inviting residents to visit their neighbourhood library to take part in free events.&#34;","2016/10/minister-says-the-future-is-social-enterprises.html"],["West Berkshire","Thu, 06 Oct 2016 20:15:08 +0000","West Berkshire – Date set for debate on the future of libraries – Newbury Today. &#34;A vital report that outlines the future of West Berkshire’s library service will be discussed and debated by councillors at a public meeting on Thursday, October 20. As part of its plan to save £730,000, West Berkshire Council announced hugely controversial proposals to close eight of the district’s nine libraries – leaving just Newbury open.&#34;","2016/10/minister-says-the-future-is-social-enterprises.html"],["Worcestershire","Thu, 06 Oct 2016 20:15:08 +0000","Worcestershire – Young people invited to join a ground-breaking arts project – Bromsgrove Advertiser. &#34;Eight young people in the county have already been involved in the major innovative venture called A Place Free Of Judgement enabling them to work with internationally renowned artists. Two other library services – Telford and Wrekin and Staffordshire – are also taking part in this three-way project. &#34; … &#34;During the summer months the Worcestershire young people attended workshops run by artists group Blast Theory where they learned to use cameras and recording equipment, do live streaming and webcasting and contribute to story writing with acclaimed author Tony White. &#34;","2016/10/minister-says-the-future-is-social-enterprises.html"],["Aberdeenshire","Sun, 09 Oct 2016 18:31:47 +0000","Aberdeenshire – Crimefest at K&M libraries – Mearns Leader. Murder mysteries and thriller writer talks.","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Bath and North East Somerset","Sun, 09 Oct 2016 18:31:47 +0000","Bath and North East Somerset – Book-loving 11-year-old from Batheaston pens ‘Ode to the B&NES Mobile Library’ after hearing of cuts – Bath Chronicle.","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Birmingham","Sun, 09 Oct 2016 18:31:47 +0000","Birmingham – Council cuts blamed as Library of Birmingham trust wound up – Birmingham Mail. &#34;Trustees claim council cuts made it impossible to attract more private funding into the Library of Birmingham after its charity arm was wound up.&#34;. Had &#34;plans to raise more than £2 million a year – although never got near those lofty heights.&#34; … &#34;Trustee Randall Brew, the Conservative councillor who took over from Lord Whitby on the board, said swingeing cuts to the library – which have seen around half of staff axed – made it hard for the trust to attract philanthropists.&#34; … &#34;Running the Library of Birmingham costs close to £2 million a month – more than half of which is down to interest payments on the £187 million build. More than half of 188 members of staff were axed as a result of cuts in 2014 which saw its opening hours reduced to 40 a week.&#34;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Darlington","Sun, 09 Oct 2016 18:31:47 +0000","Darlington – Friends of Darlington Libraries need volunteers – Darlington and Stockton Times. &#34;Campaigners hoping to save the Crown Street library from closure are appealing for help. Next week, the Friends of Darlington Libraries will take to the streets to drum up responses to Darlington Borough Council’s (DBC) public consultation. The authority is currently asking the town’s residents for their views on changes to library services.&#34; … &#34;They need volunteers to help them distribute the surveys&#34;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Devon","Sun, 09 Oct 2016 18:31:47 +0000","Devon – Libraries Unlimited and University of Exeter secure £200,000 Arts Council England research grant – Libraries Unlimited. &#34;A two-year research project to understand the impact of libraries on local communities in Devon has been awarded a £200,000 grant from Arts Council England (ACE). Libraries Unlimited and the University of Exeter Business School have teamed up to undertake research into the value of our libraries, and how they can best meet the needs of their users.&#34; … &#34;&#34;Our findings will be incredibly useful not only to libraries but other cultural organisations such as museums and galleries as they seek to better understand the value they create for society as well as understand and face the challenges that lie ahead.&#34;&#34;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Devon","Sun, 09 Oct 2016 18:31:47 +0000","Devon – Libraries Unlimited: the journey so far – Libraries Taskforce / Ciara Eastell. &#34;Libraries Unlimited was established as an independent staff and community owned mutual and came into operation on 1st April 2016. Staff transferred across and I became the organisation’s Chief Executive, having previously been the Head of Libraries, Culture and Heritage whilst in the Council.&#34; … &#34;Key ingredients we had which – together – helped make the process of transfer a success included:&#34; [Long list] … &#34;. Behind the scenes though, the sense of pace and forward momentum has been palpable.&#34; … &#34;In 18 months, we have seen our network of Friends Groups grown from 14 to 44 providing us with a ready source of support and funding for our libraries at a local level and input into the governance of the organisation as a whole. Other exciting partnerships include our growing links with the University of Exeter. &#34;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Glasgow","Sun, 09 Oct 2016 18:31:47 +0000","Glasgow – Day of poetry will get Glasgow rhyming for a reason – Evening Times. &#34;Railway stations, street corners, bus stations and libraries will today be challenged to ‘say it with a poem’ as part of a partnership between Glasgow Libraries and The Big Issue. on October 6. Big Issue vendors and performance poets will be delivering impromptu poetry performances and passing on the message to ‘love your library’ at many of the city’s landmarks, including pop-up events at Central and Queen Street railway stations and Buchanan bus station&#34;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Herefordshire","Sun, 09 Oct 2016 18:31:47 +0000","Herefordshire – Proposals to centralise customer services but retain county libraries – Hereford Times. &#34;Council customer services could be centralised in Hereford and Belmont library could be run by the community under new proposalsThe future of the library service in the county will be discussed at Herefordshire Council‘s cabinet on Thursday in light of budget pressures- the council needs to save £760,000 of a £1.8m budget. The proposals include retaining the library service in Hereford city and the five market towns. But forming a centralised face to face customer service in Hereford city, supported by improved online access.&#34;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Lancashire","Sun, 09 Oct 2016 18:31:47 +0000","Lancashire – Gala team’s library hopes – Blackpool Gazette. Thornton Cleveleys Gala Committee looks to take over Cleveleys Library with volunteers.","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Lancashire","Sun, 09 Oct 2016 18:31:47 +0000","Lancashire – Government confirms it will investigate Preston library closures – Blog Preston. &#34;The county council has received notification that the Minister for Civil Society Rob Wilson MP is treating the comments made by Mr Wallace as a formal complaint. A letter from Mr Wilson states: &#34;As part of the process for consideration of the complaint, I have written to the Leader of Lancashire County Council to notify her that we are treating representations received as a formal complaint. Officials will also be requesting from LCC all the relevant information regarding changes to the library services. This detail will be carefully considered and analysed by the Department. &#34;There is not a set timetable for the Secretary of State to consider a complaint that a local authority may be failing to carry out its duties in accordance with the Act. The timescale will vary and is dependant upon a number of factors including the complexity of issues to be addressed and the volume of detail to be analysed. All relevant detail will be car&#8230;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Lancashire","Sun, 09 Oct 2016 18:31:47 +0000","Lancashire – One library is saved but other buildings need bids – Lancashire Evening Post. &#34;there was joy in the community of Adlington with the news that agreement has been reached with Chorley Borough Council to keep Adlington Library open. This is now guaranteed to stay open thanks to the borough’s financial support and be staffed until March 2018.&#34; … &#34;The Chorley news was announced by the County Council’s Deputy Leader County Coun David Borrow, who said it was also hoped agreement could be reached on keeping library services in Coppull and Eccleston&#34;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Lancashire","Sun, 09 Oct 2016 18:31:47 +0000","Lancashire – Thirteen business plans to save libraries and children’s centres accepted – 2BR. &#34;A total of 119 expressions of interest were submitted which led to 49 detailed business cases. Those business cases were assessed against the criteria in the council’s Community Asset Transfer Policy&#34;. Councillor says &#34; &#34;In normal circumstances we would not have been forced to take the decisions we have but the financial challenge we face is anything but normal. Through the property review we have done all we can to ensure that people still have good access to good services while delivering millions of pounds of savings.&#34;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["North Lanarkshire","Sun, 09 Oct 2016 18:31:47 +0000","North Lanarkshire – Final chapter as libraries in Airdrie and Coatbridge to close – Daily Record. Old Monkland and Petersburn Libraries close at end of October.","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["North Somerset","Sun, 09 Oct 2016 18:31:47 +0000","North Somerset – Congresbury Library plan may lead to council tax rise – North Somerset Times. &#34;Congresbury Parish Council has confirmed it intends to take on the management of the village’s library in order to safeguard its future. The library is one of several across the district which are part of a consultation process being carried out by North Somerset.&#34; … &#34;The parish council estimates the library will cost about £4,000 per year to run, and would fund it by raising the council tax precept – but this would only amount to a £3 increase for a band D property each year.&#34;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["North Yorkshire","Sun, 09 Oct 2016 18:31:47 +0000","North Yorkshire – Cross Hills Library supports learning festival – Keighley News. &#34;North Yorkshire are staging activities as part of the annual Family Learning Festival. Families will be able to take part in a range of events during the UK-wide initiative, from October 15 to 30. The theme this year is It’s a Wonderful World&#34;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Renfrewshire","Sun, 09 Oct 2016 18:31:47 +0000","Renfrewshire – Skoobmobile library bus praised in national awards – Renfrewshire 24. &#34;The children’s mobile outreach service – featuring friendly book monsters known as Skoobs – had been one of three finalists shortlisted in the Chartered Institute of Library and Information Professionals’ Change Lives Award for best practice in UK library services. The Skoobmobile, operated by Renfrewshire Leisure, stocks a broad range of children’s books in a flexible space with a range of activities based around play, reading, physical and digital activity for children up to the age of 12.&#34;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Warrington","Sun, 09 Oct 2016 18:31:47 +0000","Warrington – 70 oppose plans for library closures  – Warrington Worldwide. &#34;More than 70 people – including school children, teachers, a head teacher, parents and other library users – demonstrated outside Stockton Heath library to oppose any plan to close libraries in Warrington.  Only 24 hours notice was given of the demonstration or, organisers believe, even more people have turned up.  BBC television were present to film the protest.  At the same time, organisers announced plans for a &#34;Borrow-a-book&#34; day on Saturday, October 15.  The aim is to encourage people to borrow a book on that day.&#34;","2016/10/dcms-intervenes-in-lancashire-delay-or-something-more.html"],["Birmingham","Tue, 11 Oct 2016 20:51:39 +0000","Birmingham – Rent library space to coffee shops to prevent cuts and closures say Tories – Birmingham Mail. &#34;Opposition Conservatives have outlined a plan to save Birmingham’s threatened libraries from closure and reduced hours – including renting out space to coffee shops&#34; … &#34;Conservative group leader Robert Alden (Erdington) says the cuts could be avoided if the council made savings elsewhere – including £1 million reductions in marketing and communications and some back office cuts. The group also argues that leasing library and leisure centre space to coffee shops or similar businesses could raise £690,000.&#34; … &#34;Libraries are currently open of 1,134.5 hours per week and would be reduced to 1,019 per week according to the council’s consultation document.&#34;","2016/10/birmingham-and-westminster.html"],["Birmingham","Tue, 11 Oct 2016 20:51:39 +0000","Birmingham – Sutton Coldfield Town Library to close in latest council cut – Birmingham Post. Petition started.","2016/10/birmingham-and-westminster.html"],["Birmingham","Tue, 11 Oct 2016 20:51:39 +0000","Birmingham – Two libraries to shut and 24 jobs to go in Birmingham – BBC. &#34;Aston and Sutton Coldfield libraries are earmarked for closure and a total of 24 jobs are set to be cut across the service. Other community libraries could see their opening hours changed, Birmingham City Council said. Opponents to the plans said the services could be saved by bringing other services into the buildings. The Labour-run council currently has 37 community libraries, and has the equivalent of 112 full-time jobs&#34; see also Two of Birmingham’s community libraries are set to close – ITV News and Two Birmingham libraries close and others have hours cut in major cull – Birmingham Mail. &#34;Plans are being put out for consultation over the next three months and an appeal has been issued to residents and community groups to come forward with plans to run their own services offering access to information, offer internet access or loan books.&#34;","2016/10/birmingham-and-westminster.html"],["Cheshire East","Tue, 11 Oct 2016 20:51:39 +0000","Cheshire East – Funny Sunny delights audience with her one woman show – Wilmslow. &#34;Sunny Ormonde, also known as the gin-swigging, chain-smoking Lilian Bellamy from Radio 4’s The Archers, kept the audience entertained as she dipped in and out of Lilian’s character. Sunny also performed scenes from other productions in which she had starred throughout her diverse career. Cheshire Libraries are currently hosting a number of theatrical productions as part of the ‘See it Live in Libraries’ project run in conjunction with Cheshire Rural Touring Arts, which aims to bring professional performers and performances to your local libraries.&#34;","2016/10/birmingham-and-westminster.html"],["Devon","Tue, 11 Oct 2016 20:51:39 +0000","Devon – £200,000 Arts Council grant to fund research into impact of Devon libraries – Exeter Express and Echo. Libraries Unlimited and Exeter University say research will produce report useful to all public libraries.","2016/10/birmingham-and-westminster.html"],["Devon","Tue, 11 Oct 2016 20:51:39 +0000","Devon – Thousands borrow mental health books from Devon libraries – North Devon Gazette. &#34;New figures released on World Mental Health Day today (Monday) reveal more than 6,500 people have borrowed mental health and wellbeing books since April.&#34; …&#34;To continue the activities and promote positive mental health and wellbeing across the county, Libraries Unlimited will be hosting a range of events and workshops as part of its Active Life Active Mind campaign.&#34;","2016/10/birmingham-and-westminster.html"],["Dudley","Tue, 11 Oct 2016 20:51:39 +0000","Dudley – Netherton and Brierley Hill libraries to host Halloween bat trails during half term – Stourbridge News.","2016/10/birmingham-and-westminster.html"],["Dudley","Tue, 11 Oct 2016 20:51:39 +0000","Dudley – Survey wants kids’ thoughts on Dudley borough’s libraries – Stourbridge News. &#34;Between Monday (October 17) and Sunday, October 30, Dudley Council will be running a survey asking how children and young people use the library and how satisfied they are with particular services and with the library overall. From these results, the Chartered Institute of Public Finance and Accountancy’s (CIPFA) library survey gathers information to map the recent trends for local authority run libraries across the UK.&#34;","2016/10/birmingham-and-westminster.html"],["Haringey","Tue, 11 Oct 2016 20:51:39 +0000","Haringey – #18: My local library – Objects of Interest. &#34;Perhaps most of what we get from books can’t be expressed simply, let alone measured. I can say though that the NHS has already saved something due to the health-related book I read (and subsequently bought a copy of) and might save more if Daniel Lieberman is right and the Paleo diet keeps people healthier for longer.  What I particularly love about libraries is the way you discover things by accident – this doesn’t happen so much on the cookie-controlled web. It happens in bookshops too of course, but those are diminishing even more than libraries&#34;","2016/10/birmingham-and-westminster.html"],["Hertfordshire","Tue, 11 Oct 2016 20:51:39 +0000","Hertfordshire – First community archive network day – Hertfordshire Council. &#34;Capturing local memories and knowledge is essential to building the local and social history for Hertfordshire. I am sure that this fascinating event will provide a useful resource to all our residents who are passionate about community archives. My thanks to everyone involved for helping this to happen.&#34; The community archive network day is at Welwyn Garden City library on Saturday 15 October, from 10.30am to 3pm. Tickets cost £7 and include a light lunch, with concessions for Herts Memories network associate members and volunteers. &#34;","2016/10/birmingham-and-westminster.html"],["Lambeth","Tue, 11 Oct 2016 20:51:39 +0000","Lambeth – Carnegie Library: Lambeth announce short notice exhibition with wildly inconvenient times – Brixton Buzz. &#34;Herne Hill locals have tried for a full year to find out the truth about Lambeth’s plans to turn their much-used, highly popular Carnegie Library into a ‘book-ish gym,’ and – absurdly – the only hours offered at this week’s exhibition at nearby St Saviour’s church hall are: Wednesday October 12: 9am- 1pm;  Thursday October 13: 12pm-6pm.&#34;","2016/10/birmingham-and-westminster.html"],["Lancashire","Tue, 11 Oct 2016 20:51:39 +0000","Lancashire – County agrees next steps in process of handing over buildings to community groups – Champion. Council says &#34;&#34;In line with our community asset transfer policy, we need to work with these groups to make sure that we are handing over these valuable assets to groups which have a sustainable business plan that will benefit the local community. I’m pleased that we have taken another step towards making that a reality.&#34;&#34;","2016/10/birmingham-and-westminster.html"],["Lancashire","Tue, 11 Oct 2016 20:51:39 +0000","Lancashire – Culture Secretary steps in to question library closures – Lancashire Evening Post. &#34;David Borrow, LCC deputy leader, said: &#34;We have carried out a great deal of detailed work to ensure our proposals fulfil the council’s statutory duty to provide a comprehensive and efficient library service. I’m happy for them to be scrutinised by the Secretary of State.&#34;","2016/10/birmingham-and-westminster.html"],["Lancashire","Tue, 11 Oct 2016 20:51:39 +0000","Lancashire – DCMS to investigate ‘disgraceful’ Lancashire library cuts – BookSeller. &#34;The government is to investigate plans by Lancashire County Council to close 21 libraries in a move which has been slammed as &#34;disgraceful&#34; by campaigners. The council intends to close the libraries in a bid to make £200m worth of cuts by 2020. Ben Wallace, MP for Wyre and Preston North, raised a formal complaint against the council, saying that it has broken its requirement to provide a &#34;comprehensive and efficient&#34; service under the Public Libraries and Museums Act 1964, according to the Lancashire Evening Post.&#34; see also Government investigating complaints about Lancashire library closures – Public Sector Executive.","2016/10/birmingham-and-westminster.html"],["Lancashire","Tue, 11 Oct 2016 20:51:39 +0000","Lancashire – Government to probe ‘devastating’ Lancashire library closures – Guardian. &#34;following letters from two Conservative MPs – Ben Wallace, member for Wyre and Preston North, and Paul Maynard, MP for Blackpool North and Cleveleys –complaining about the cuts, the Department for Culture, Media and Sport has confirmed that it will investigate the situation.&#34;","2016/10/birmingham-and-westminster.html"],["Lancashire","Tue, 11 Oct 2016 20:51:39 +0000","Lancashire – Penwortham library could re-open as a museum – Blog Preston. &#34;plans lodged by Penwortham Town Council outline how a ‘library theatre incorporation information desk and a small museum’ are part of a ‘well-developed business case’. The county council closed Penwortham’s library on 30 September but is facing increasing pressure to review its decision.&#34;","2016/10/birmingham-and-westminster.html"],["Sandwell","Tue, 11 Oct 2016 20:51:39 +0000","Sandwell – Shhh Sandwell libraries invent quiet zones because they are now &#34;community hubs&#34; – Halesowen News. &#34;Sandwell libraries are proving so popular quiet zones for people to read and study are being set up because of the din other users make. Library staff are setting up dedicated quiet ‘sssh zones’ in all libraries for those visitors who want a bit of silence. Over the years all Sandwell libraries have become busy community hubs offering much more than just borrowing books. They are used by community groups, for art exhibitions, craft clubs, children’s holiday activities, for gigs, drama and dance – and now a little bit of them will be set aside during the day for quiet reading.&#34;","2016/10/birmingham-and-westminster.html"],["Sefton","Tue, 11 Oct 2016 20:51:39 +0000","Sefton – Libraries in Sefton launch new e-lending service – and it’s free – Southport Visiter. &#34;Working in partnership with the Borrowbox platform, Sefton’s Library service are now offering a variety of titles which can be downloaded to a mobile device or pc. This means that Sefton’s library patrons can look forward to reading their favourite authors online, whether relaxing at home or on the move.&#34;","2016/10/birmingham-and-westminster.html"],["Sheffield","Tue, 11 Oct 2016 20:51:39 +0000","Sheffield – Steve Ayris loves Ikea – hates libraries – Star / Letters. &#34;I do not think any of us need lectures from Steve Ayris over business sense or libraries. This is the same Steve Ayris who tried to close Hillsborough Library in 2010 and then seemed hurt when we in Hillsborough got rid of him in 2011.  This is the same Lib Dem Steve Aryis who failed to get elected in 2012 whilst standing for Beauchief and Greenhill as the voters deserted him and his Dodo party. &#34;","2016/10/birmingham-and-westminster.html"],["South Tyneside","Tue, 11 Oct 2016 20:51:39 +0000","South Tyneside – BT shows support for new library The Word – Shileds Gazette. &#34;BT is supporting The Word, National Centre for the Written Word, which is due to open near to its South Shields offices on October 22.&#34; … &#34;The company is sponsoring the Market Place site’s FabLab area. FabLab @ The Word will feature 3D printers and vinyl and laser cutters which will allow visitors to design and produce items such as fridge magnets, and keyrings.&#34;","2016/10/birmingham-and-westminster.html"],["Stoke on Trent","Tue, 11 Oct 2016 20:51:39 +0000","Stoke on Trent – Library in Burslem run by volunteers is becoming a community hub – Stoke Sentinel. &#34;A volunteer-led library is set to become a community hub thanks to funding from a software firm. Burslem Book Room is currently based in the prayer chapel in Swan Bank methodist church but will be taking over the entire church keepers’ house in the new year thanks to help from Newcastle-based company Synectics Solutions. The business is paying for rooms at the house to be renovated and for computers to be installed.&#34;. 1000 books, provided by the council.","2016/10/birmingham-and-westminster.html"],["Warrington","Tue, 11 Oct 2016 20:51:39 +0000","Warrington – Councillor vows to fight closure of Penketh Library – Warrington Guardian. &#34; Linda Dirir has said she will fight the closure of Penketh Library and criticised LiveWire for suggesting elderly people travel to Great Sankey to browse the shelves at a new neighbourhood hub. Cllr Dirir (Lab) criticised LiveWire’s plans to replace nine libraries, including Penketh, with lending lockers and said the company had ignored the challenge of making libraries sustainable.&#34;","2016/10/birmingham-and-westminster.html"],["West Berkshire","Tue, 11 Oct 2016 20:51:39 +0000","West Berkshire – Communities to be more involved in library service – West Berks. &#34;In recent months a review of the library service has been taking place as the Council seeks to reduce  costs as part of a wider programme of savings. A report detailing the findings of the review and recommending a further public consultation on possible changes will be considered by the Executive on Thursday 20 October. The consultation will consider a mix of volunteers and library staff across the service. In each option Newbury library would remain fully staffed, one mobile library would remain and Wash Common library would close.","2016/10/birmingham-and-westminster.html"],["Westminster","Tue, 11 Oct 2016 20:51:39 +0000","Westminster – Westminster Labour anger at Tory plans for huge library cuts – Labour Westminster. &#34;The Conservative Council has produced plans that would cut £750,000 per year from the Westminster Libraries budget and at the heart of these cuts are plans to remove the equivalent of 17 ½ full-time members of staff. Overwhelmingly the roles that would be lost are the qualified librarians whose expertise and passion for reading help make Westminster’s libraries a hugely valued part of our community&#34;","2016/10/birmingham-and-westminster.html"],["Aberdeen","Sun, 16 Oct 2016 19:19:36 +0000","Aberdeen – North-east Lego club set to launch after successful appeal – Evening Express. Large amounts of lego donated to libraries due to appeal to the public. see also Maersk donates Lego boat to Aberdeen library club – Energy Voice.","2016/10/house-of-lords-debate-and-the-uk-public-library-skills-strategy.html"],["Bath and North East Somerset","Sun, 16 Oct 2016 19:19:36 +0000","Bath and North East Somerset – Cuts made to Midsomer Norton, Paulton and Radstock library opening hours – Somerset Live. &#34;While all three libraries will open for the same number of days a week, Midsomer Norton library will no longer open late on a Monday closing at 5pm instead of 7pm and will also have reduced hours on Saturday closing at 2pm instead of 4pm&#34;","2016/10/house-of-lords-debate-and-the-uk-public-library-skills-strategy.html"],["Bedford","Sun, 16 Oct 2016 19:19:36 +0000","Bedford – Library consultation extended after bin cut ‘rush through’ slammed for ignoring residents’ concerns – Bedfordshire on Sunday. &#34;She questioned why the consultation was planned to finish on Monday (October 17) when meetings were planned at libraries across the borough to inform residents of the proposals on either the same day or after the consultation period closed. She said: &#34;Surely we want people to make informed decisions rather than knee jerk reactions so I ask the Mayor whether we can extend the consultation date?&#34; Following this, the mayor agreed to extend the consultation period for an extra four days until Friday October 21.&#34;","2016/10/house-of-lords-debate-and-the-uk-public-library-skills-strategy.html"],["Birmingham","Sun, 16 Oct 2016 19:19:36 +0000","Birmingham – Business Improvement District calls for support in battle to save library – Sutton Coldfield Local News. &#34;We deplore the closure of the library in Sutton Coldfield. The BID and its members are committed to promoting the town centre as a place to work, live and visit, and the closure of such an important part of the social fabric has to be questioned. &#34;With Sutton Coldfield being the only town centre in Birmingham we have to ask; why the council is looking to close a library that is centrally located and well served by transport links including buses, trains and car park? Surely, this should be prioritised as a library to keep open. &#34;The closure announcement also raises a number of pertinent questions on what the council ownership of the Red Rose Centre will mean for town centre. The council recently purchased the centre for £10.4m and one of the first acts as owners appears to be closing the library, which will dramatically affect footfall and could undermine the other businesses.&#34;&#34;","2016/10/house-of-lords-debate-and-the-uk-public-library-skills-strategy.html"],["Birmingham","Sun, 16 Oct 2016 19:19:36 +0000","Birmingham – Frankley Library avoids axe but faces reduced opening hours under Birmingham City Council consultation – Bromsgrove Advertiser. &#34;Birmingham City Council announced on Monday (October 10) that two of the city’s 37 libraries will shut as part of proposals to make savings of £1.95 million per year. The library in Frankley, which has operated under reduced temporary opening hours since July, has avoided the axe but will see its current opening times made permanent&#34;","2016/10/house-of-lords-debate-and-the-uk-public-library-skills-strategy.html"],["Bristol","Sun, 16 Oct 2016 19:19:36 +0000","Bristol – Business Plan for 2017/18 – Bristol Council, p.56. &#34;We will be exploring options such as: • Community groups to run local community hubs which include library services; Running some services from shared buildings; Developing an alternative model to run the remaining Bristol City Council owned libraries as a Trust or a Mutual. The level of savings will depend on the approach taken.","2016/10/house-of-lords-debate-and-the-uk-public-library-skills-strategy.html"],["Bedford","Sun, 23 Oct 2016 14:47:37 +0000","Bedford – ‘Frustration, anger and upset&#39;: Residents hit back at library proposals as deadline approaches – Bedfordshire News. &#34;Bedford Borough Council first proposed closing some libraries as part of their plans to save £21 million over the next four years, but dropped the option after ‘strong opposition’ from the public. Instead, the authority introduced a ‘digital library service’ model among the plans, as reported by Bedfordshire On Sunday at the start of October, which would see users enter buildings to take out books and use computers using a library card and unique PIN during unmanned hours. The consultation was extended from Monday, October 17 to Friday, October 21 after Councillor Sue Oliver questioned why meetings were planned at libraries across the borough to inform residents of proposals on either the same day, or after the consultation period closed&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Bedford","Sun, 23 Oct 2016 14:47:37 +0000","Bedford – Letters: ​Our vital libraries – Bedfordshire on Sunday. &#34;On 17.10.16 Andy Collins on BBC Three Counties Radio was discussing the proposed ‘Digital Libraries’ plan for our local Libraries. I had attended a Consultation Meeting at Putnoe Library on 5.10.16 (along with approx 60 others) and chaired by a library boss, a member of the Consultation Team and Cllr Holland&#34; … &#34;If the council have not got the facts on how much each of the proposed options will save, why are they hell-bent on implementing ‘Digital Libraries’, and how can they possibly justify doing this when it will have a drastic effect on the users of Libraries?&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Birmingham","Sun, 23 Oct 2016 14:47:37 +0000","Birmingham – Library cuts to open north-south divide with just two to serve quarter of Birmingham – Birmingham Mail. Only two libraries will still be open north of the M6.","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Brent","Sun, 23 Oct 2016 14:47:37 +0000","Brent – Brent SOS Libraries Organised it’s Fifth Light of Learning Relay – Preston Library and Community Hub. &#34;Brent SOS Libraries organised its fifth light of learning relay to celebrate our steadfast commitment to our libraries. A torch was carried in relay from Kensal to Cricklewood to Tokyngton to Barham and finishing at Preston, with readings at each stop. This year the theme was celebrating community libraries across Brent&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Bury","Sun, 23 Oct 2016 14:47:37 +0000","Bury – Revealed: What Bury residents think about proposed shake up of borough’s libraries – Guide. &#34;Some 3,536 took part in a consultation process and 500 others were interviewed over the telephone. Last month, the council’s support services representative Cllr Sandra Walmersley said: &#34;The consultation has shown clear support for the six principles on which to base the future of the library service.&#34;&#34; but FOI shows less support &#34;The library was described as a &#34;lifeline&#34; by one interviewee, while another said: &#34;Views include: &#34;Don’t close local libraries, think of the visitors,&#34; and &#34;The library is a lifeline for many people. &#34;Another said: &#34;It’s not just about visitor numbers, it’s the difference it makes to people’s lives and that includes young and old.&#34; Many raised concerns about the possibility of staff being replaced by volunteers. &#34;People should be paid to run libraries,&#34; said One resident said: &#34;Volunteers are not always as capable or well-informed as paid, pur&#8230;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Ceredigion","Sun, 23 Oct 2016 14:47:37 +0000","Ceredigion – Free rent offer for Cardigan Library turned down – Tivy-Side Advertiser. &#34;Cardigan Library will be on the move following a decision to turn down an offer of five years free rent at its current site. Cabinet Members meeting on Tuesday agreed with a proposal to move a smaller Cardigan Library to the council’s Morgan Street office. The decision comes after the landlord of Canolfan Teifi offered Ceredigion County Council the opportunity to stay where it is with five years free rent. A petition from Cardigan residents gained well over 800 signatures following concerns for the future of the ‘essential’ services provided by the library.&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Cheshire West and Chester","Sun, 23 Oct 2016 14:47:37 +0000","Cheshire West and Chester – Upton and Alsager libraries to welcome children’s puppet musical – Chester Chronicle. &#34;In Brian’s library the books are all in a muddle. The romance is sweet talking the DIY manual, the dictionary is editing the whodunnit, and it is all getting too much for hapless librarian Brian. The only ones who can help him are the squabbling books themselves, but in order to do that they must first face their deadliest enemy. To save their confused library (and its confused librarian) the books must work together – but how?&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Cumbria","Sun, 23 Oct 2016 14:47:37 +0000","Cumbria – Library date for acclaimed Welsh solo artist Meilyr Jones – North West Evening Mail. Part of Get It Loud In Libraries.","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Fife","Sun, 23 Oct 2016 14:47:37 +0000","Fife – Plans to keep libraries in three Fife communities progressed – Courier. &#34;Members of the region’s executive committee have approved Falkland Village Hall Trust’s plan for a community takeover of the library facility in Falkland. Meanwhile, a joint business plan from the Glenrothes Area Residents Association (GARF) and West Glenrothes Tenants and Residents Association for a community-run library in Glenwood — replacing the town’s Glenwood Library — has also been given the go ahead for further progression.&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Lancashire","Sun, 23 Oct 2016 14:47:37 +0000","Lancashire – Calls for culture minister to visit Lancashire library that’s due to close – 2BR. &#34;Ribble Valley MP Nigel Evans has called on the secretary of state for culture to visit Whalley library.&#34; …&#34;&#34;It was felt that it was important that the Secretary of State should view the situation on the ground for herself. The recent decision to refer the closure of Libraries across Lancashire direct to the Secretary of State, who is ultimately responsible for the provision of Library Services across England & Wales under the terms of the 1964 Public Libraries & Museums Act, which requires Local Authorities to provide a Comprehensive Library Service to residents, will give Karen an opportunity to see what a vital community asset the Library is.&#34;&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Lancashire","Sun, 23 Oct 2016 14:47:37 +0000","Lancashire – Civic party visit in last-ditch bid to save library – Clitheroe Advertiser and Times. MP Nigel Evans invites culture secretary to come to Lancashire and see the problem of cutting libraries rather than just doing a paper exercise in Whitehall.","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Lancashire","Sun, 23 Oct 2016 14:47:37 +0000","Lancashire – Deadline set for county building transfer – Lancashire Council. &#34;Anyone who would like to make an expression of interest in buildings which the council has said it no longer needs following agreement of a new Property Strategy, has until Monday 31 October to do so. &#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Lancashire","Sun, 23 Oct 2016 14:47:37 +0000","Lancashire – Harris proposals polarise opinion – Lancashire Evening Post. &#34;Some readers raised fears over the funding of the project, in the wake of library closures and major budget cuts to councils, but bosses said up to 90 per cent of the cash would come from external sources. Jon Finch, re-imagining the Harris project leader, said: &#34;We are already progressing plans to secure as much as 90 per cent of the funding for the Harris from external sources. &#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Lancashire","Sun, 23 Oct 2016 14:47:37 +0000","Lancashire – Hyperfast broadband to breathe new life into village – Westmorland Gazette. [Silverdale Library had the chance to be the first Gigabit Library in the UK but was closed by the council this year – Ed.]","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["North Yorkshire","Sun, 23 Oct 2016 14:47:37 +0000","North Yorkshire – Town considers paying its own librarian tax to keep library afloat – Darlington and Stockton Times. &#34;Stokesley Parish Council is hoping the chance of making the town’s library sustainable has improved dramatically, after negotiating a reduction in the landlord’s £9,000 service charge for the premises. &#34; … &#34;The parish council is also going to consult with residents about the prospect of funding a full-time librarian by increasing the parish council precept by an amount that is likely to be equivalent to about 15p per household per week. &#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Oxfordshire","Sun, 23 Oct 2016 14:47:37 +0000","Oxfordshire – Library will offer more than just books when it reopens as budget rises by £2m – Oxford Times. &#34;revamp of Oxford’s central library will be expanded to make it a ‘community hub’ thanks to a £2.1m cash boost. As well as a new entrance, extra windows and a bigger children’s area, the library in the Westgate Shopping Centre will now receive a major refurbishment, better disabled facilities and improved wireless internet. It comes after Oxfordshire County Council’s cabinet pledged on Tuesday to increase the project’s budget from £1.5m to £3.6m. Cabinet member for culture Lorraine Lindsay-Gale said it meant the flagship facility could make ‘a big return’ when it reopens in Autumn 2017.&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Powys","Sun, 23 Oct 2016 14:47:37 +0000","Powys – It is world famous as the town of books but Hay-on-Wye could lose its library – Wales Online. &#34;Powys council says huge financial pressures from central government mean it has to slash spending. Part of that is funding for libraries, with the authority hoping communities are prepared to take on the running of smaller branch libraries.&#34; see also Hay-on-Wye: Town of books could lose its library – BBC. &#34;Town mayor Fiona Howard called the move &#34;not morally right&#34;, saying residents had been asked to raise £18,000 a year to keep it open. If a funding solution cannot be found by the end of October, a consultation on closure could start&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["South Gloucestershire","Sun, 23 Oct 2016 14:47:37 +0000","South Gloucestershire – Council backtracks on proposed library cuts – Bradley Stoke Journal. &#34;South Gloucestershire Council has backtracked on controversial plans to close or severely restrict opening hours at many of its libraries after thousands of people voiced opposition to a range of cost-cutting options outlined in a recent public consultation. Instead, councillors have voted to investigate the use of a new technology, known as ‘Open Plus’, which it is claimed allows users to access the full range of library services without the need for staffing&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Suffolk","Sun, 23 Oct 2016 14:47:37 +0000","Suffolk – Will library services be provided like for like in the future? – Suffolk Libraries. &#34;theres a lot of competition out there. Twenty years ago, we had a monopoly on providing books and information for those who didn’t automatically stroll into a bookshop. That’s changed. With Google, Wikipedia, Amazon, charity shops and community bookswaps, we no longer have a monopoly and we appear to be irrelevant and anachronistic to the influential decision makers. Our greatest strength is that we offer great people services by great people. Let’s keep that high on our own agenda, and everyone else’s.&#34; … &#34;Our library mutual is in its fifth year, and it’s been a steady slog to establish a new organisation with community ownership, keep all our libraries open and ensure we still have expert staff. In the beginning it was especially hard to do all of this while running the service, reassure the customers and motivate the staff&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Walsall","Sun, 23 Oct 2016 14:47:37 +0000","Walsall – Walsall plans to slash libraries from 16 to one – BookSeller. &#34;Walsall Council has revealed plans to cut the libraries in the borough from 16 to one in a bid to help make £86m worth of savings, the BBC has reported. The council will need to make the savings by the end of the 2019-20 financial year. The authority, a Labour-Liberal Democrat coalition, said it had to &#34;look at everything… on the table&#34;.&#34; see also Plans to cut Walsall Council libraries from 16 to one revealed – BBC &#34;Asked why leader Sean Coughlan had previously said in opposition there would be no library closures, deputy leader Lee Jeavons told the BBC: &#34;When we looked at that last year, obviously we were in opposition.&#34; and Council cuts could close Caruso St John’s Walsall art gallery – Architects Journal.","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Warrington","Sun, 23 Oct 2016 14:47:37 +0000","Warrington – Emotions run high as ‘exceptionally damaging’ library closure proposals come before full council – Warrington Guardian. &#34;Determined campaigners staged a protest outside the Town Hall ahead of the meeting to make their stance clear to councillors. The Save Warrington’s Libraries campaign continues to gather momentum, and, following the protest, those involved got the chance to have their say in the chamber&#34;.  Council says &#34;The consultation is ongoing – until then we know nothing at all&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Warrington","Sun, 23 Oct 2016 14:47:37 +0000","Warrington – MP questions rationale over cuts to library services – Warrington Worldwide. &#34;Warrington North MP Helen Jones has questioned the rationale behind the £300K cuts being proposed for library services when compared to the overall cuts operators LiveWire are having to make. Ms Jones said :&#34;I understand that Live Wire’s Chief Executive has publicly stated that the organisation is making £300K cuts in the library services and £350K cuts across the rest of its activities.&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Warrington","Sun, 23 Oct 2016 14:47:37 +0000","Warrington – My Local Council Wants To Close My Library – This Is My Contribution To The Public Consultation – Mr Carapace. &#34;The hard-won status quo, a shared belief of our society, is that libraries are vital. Want to argue against that? Then do a damn better job than this one. Advertise your consultation, don’t just spit out a couple of open meetings and hope everyone is too tired to do anything about it. LiveWire, for god’s sake, I assume you *want* to provide these services, don’t you?&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Warrington","Sun, 23 Oct 2016 14:47:37 +0000","Warrington – Stockton Heath parish councillors call for parish donation to save village library – Warrington Guardian. &#34;Labour parish councillors are calling for a ‘modest, ring-fenced contribution’ from parish funds to help save the village library as fears intensify&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Westminster","Sun, 23 Oct 2016 14:47:37 +0000","Westminster – Opposition to council plans to save £750,000 by axing librarian jobs – West End Extra. &#34;Labour leader Cllr Adam Hug said: ‘In Westminster we’ve seen this story before many times, most notably in our children’s centres, where skilled staff were steadily removed through ‘salami-slicing’ cuts and now they provide only a fraction of the vital services that they used to&#39;&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Westminster","Sun, 23 Oct 2016 14:47:37 +0000","Westminster – Protect the Unique Cultural Institution of Westminster Reference Library – Change. &#34;The library has a designated status as a specialist collection of over 15,000 books on the performing arts, a third of which are available to borrow.  It also houses a unique archive of arts publications, some going back to the 19th century.&#34; … &#34;Staff surviving the proposed cuts at the reference library will have to manage on a skeleton rota with no time to maintain activity beyond basic services. This will lead to an inevitable decline in service making the library vulnerable to a future potential case made for its closure.&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Wigan","Sun, 23 Oct 2016 14:47:37 +0000","Wigan – Libraries safe for now, claims council bosses – Leigh Journal. &#34;…public consultation will be launched by the end of the year pledging to keep as much of the current service open as possible as part of The Deal. However proposals include the libraries being run by community groups.&#34;","2016/10/say-national-libraries-week-not-save-our-libraries-day.html"],["Birmingham","Tue, 25 Oct 2016 19:18:24 +0000","Birmingham – Deputy Leader Ian Ward to attend library closure public meeting – Sutton Coldfield Local News. &#34;Birmingham City Council Deputy Leader Councillor Ian Ward will be in attendance on November 8 to take questions on the proposals to close Sutton Coldfield Library as part of those plans.&#34;","2016/10/why-some-libraries-should-close-but-some-others-definitely-should-not.html"],["Buckinghamshire","Tue, 25 Oct 2016 19:18:24 +0000","Buckinghamshire – Chalfont St Giles Library celebrates its 50th birthday in style… with a cake and balloons – Get Bucks. &#34;The County ran the library from 1966 until November 2006 when it was closed together with seven other small County libraries. With village support the Friends of the Library re-opened the library with volunteers in January 2007.&#34; … Volunteer chairman says &#34;Last Saturday we had many well wishers into the library, most of whom enjoyed a slice of our 50th birthday cake. Overall I’m optimistic for the library’s future. &#34;&#34;","2016/10/why-some-libraries-should-close-but-some-others-definitely-should-not.html"],["East Riding of Yorkshire","Tue, 25 Oct 2016 19:18:24 +0000","East Riding of Yorkshire – Future of library service and multi-service centres – ERYC statement – HU12. &#34;&#34;We have listened to people’s views,&#34; says Darren Stevens, head of culture and information at the council. If agreed, the recommendations will save the council around £1.2 million, from the combined library and customer service budgets. According to the council statement, the savings would be achieved without closing a single library or multi-service centre or the mobile library service.&#34; … &#34; the Cabinet is being asked to consider three recommendations: Retaining a library or multi-service centre in every town and larger village in the East Riding but with reduced opening hours; Retaining a mobile library service across the East Riding but with a reduced level of service; Retaining both libraries in Bridlington, but reducing the opening hours.&#34;","2016/10/why-some-libraries-should-close-but-some-others-definitely-should-not.html"],["Herefordshire","Tue, 25 Oct 2016 19:18:24 +0000","Herefordshire – Council to explore whether relocation of Leominster Library would be ‘financially viable’ and useful to community – Ledbury Reporter. &#34;A business case will be developed to see whether the relocation of Leominster Library to an extended leisure centre is ‘financially viable’ and useful to the community. That was one of the developments agreed by councillors last week when they also pledged to maintain opening hours at county libraries while investing in them to bring them up to date. Last week’s cabinet meeting heard consideration will be given to the possibility of relocating Leominster’s Library to the town’s leisure centre.&#34;","2016/10/why-some-libraries-should-close-but-some-others-definitely-should-not.html"],["Manchester","Tue, 25 Oct 2016 19:18:24 +0000","Manchester – Iconic BookBenches heading to Manchester to inspire a city of readers – Manchester City Council. &#34;As part of Manchester City Council’s Read Manchester campaign with the National Literacy Trust, benches shaped like open books will be decorated by local schools and community groups, and displayed in public venues to help spark the city’s interest in reading. The year-long Read Manchester campaign was launched back in June this year in partnership with the National Literacy Trust, and with the backing of Coronation Street actress Jennie McAlpine who joined youngsters at the launch in Manchester Central Library to see one of the BookBenches for herself.&#34;","2016/10/why-some-libraries-should-close-but-some-others-definitely-should-not.html"],["Powys","Tue, 25 Oct 2016 19:18:24 +0000","Powys – Authors condemn plans to shut Hay-on-Wye library – BookSeller. &#34;Authors including Joanne Harris, Kathy Lette and Robert Harris have slammed proposals to shut the library in Hay-on-Wye as &#34;blasphemous&#34; and &#34;disastrously short sighted&#34;.&#34;","2016/10/why-some-libraries-should-close-but-some-others-definitely-should-not.html"],["Powys","Tue, 25 Oct 2016 19:18:24 +0000","Powys – Exclusive: British authors condemn ‘blasphemous’ library closure in Hay, the ‘town of books’ – I. &#34;The UK-based Australian novelist Kathy Lette branded the threat to close Hay library &#34;blasphemous&#34;. &#34;How can the country which gave the world its greatest literary giants…keep closing libraries, let alone in a town famous for the literati?&#34; the author asked. &#34;Keep this up and you’ll become a nation of the illiterati,&#34; she warned&#34;","2016/10/why-some-libraries-should-close-but-some-others-definitely-should-not.html"],["Sheffield","Tue, 25 Oct 2016 19:18:24 +0000","Sheffield – Volunteers need a chance – Star / Letters. &#34;Our volunteer run library holds a weekly event where adults can drop in for a chat and take part in craft activities. His librarians sign post homeless people or people who run the risk of eviction or have health problems to the appropriate services for help. We volunteers can do this by finding out where the help is and advising them where to receive the help, we have telephones and the internet and we have done this.&#34;","2016/10/why-some-libraries-should-close-but-some-others-definitely-should-not.html"],["Somerset","Tue, 25 Oct 2016 19:18:24 +0000","Somerset – North Petherton library cuts prevented – This is the West Country. &#34;it has been agreed that North Petherton Library will retain its current level of service and opening hours. It took several meetings between County Council officials and members of North Petherton Town Council to reach the agreement, but Cllr Bill Revans said he was delighted with the outcome. Cllr Revans said: &#34;It is brilliant that we have been able to&#34; … &#34;The library will also now act as an information hub for the Town Council, in return for our financial support.&#34;","2016/10/why-some-libraries-should-close-but-some-others-definitely-should-not.html"],["Walsall","Tue, 25 Oct 2016 19:18:24 +0000","Walsall – Walsall council seeks to close all but one of its 16 libraries – Guardian. &#34;The council fully appreciates that the Art Gallery and libraries are much-loved by those that use them however, like many councils across the country this authority can’t ignore the fact that savings have to be made. This is why we will be consulting with our public on all the budget options. No final decisions have yet been made, nor will they until we have listened to our residents, service users and partners alike to find the best available options for these services.&#34; … &#34;A petition protesting against the closure of the art gallery and libraries, which says that shutting them down &#34;will destroy the atmosphere of many surrounding communities&#34;, has already been signed by almost 2,500 people.&#34;","2016/10/why-some-libraries-should-close-but-some-others-definitely-should-not.html"],["Warrington","Tue, 25 Oct 2016 19:18:24 +0000","Warrington – Library closures will make town a ‘national laughing stock’ says Latchford author – Warrington Guardian. &#34;Award-winning writer Gill Hoffs said that after Warrington was named as the worst town for culture in the country by the Royal Society of Arts last year it would be foolish to get rid of our libraries too. &#34; .. &#34;Now LiveWire are trying to do this – have they learnt absolutely nothing? They’re looking to make Warrington a national laughing stock rather than a jewel in the north west.&#34; &#34;","2016/10/why-some-libraries-should-close-but-some-others-definitely-should-not.html"],["Westminster","Tue, 25 Oct 2016 19:18:24 +0000","Westminster – CILIP urges Westminster to rethink library cuts – BookSeller. &#34;The Chartered Institute of Library and Information Professionals (CILIP) has called on Westminster City Council to halt proposed cuts to the library budget of £750,000 a year &#34;until a proper public consultation has been carried out&#34;. The plans will see the equivalent of 17 and a half full-time staff roles lost. In an open letter, Nick Poole, the c.e.o. of librarians body CILIP, has written to Westminster Council chief executive Charlie Parker with concerns about the proposals and the impact it will have on communities and the local economy. Poole expressed his &#34;profound concern&#34; about the proposals, arguing that the libraries in Westminster are &#34;some of the best in the country, helping 140,000 people to set up a new business, [and] tackle social isolation and exclusion&#34;. He added that the libaries are &#34;cultural beacons in their communities providing space for exhibitions and performances, access to reading and unique archives&#&#8230;","2016/10/why-some-libraries-should-close-but-some-others-definitely-should-not.html"],["Barnet","Thu, 27 Oct 2016 20:18:49 +0000","Barnet – ‘People do not realise how valuable the libraries are, until it is too late’ – Times Series. &#34;&#34;It is shocking to see what Barnet Council is planning for the libraries. If they can get rid of the library in Hendon, which is also within walking distance for me, they can get of anything. These plans are done in the dark, and they spring them on the public at the last minute, when the plans are already made.&#34;","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Bedford","Thu, 27 Oct 2016 20:18:49 +0000","Bedford – Controversial ‘digital’ library model will NOT be introduced at Kempston and Putnoe – Bedfordshire News. &#34;Proposals to create a ‘digital’ model that would see users access unstaffed libraries using key cards sparked fury among residents this month. Bedford Borough Council has now announced it will not introduce the model at Kempston or Putnoe library in response to residents’ concerns the scheme could put vulnerable users at risk.&#34;","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Bradford","Thu, 27 Oct 2016 20:18:49 +0000","Bradford – Pupils invited to various book sessions around district – Telegraph and Argus. Authors will talk to classes in various libraries.","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Bury","Thu, 27 Oct 2016 20:18:49 +0000","Bury – ‘Great care’ needed on decision of future of libraries – Bury Times. &#34;Bury Council is considering making major changes to the borough’s library services to save cash – and it could mean libraries closing and staff axed. More than 4,000 people took part in the first public consultation and, now, those managing the change have introduced a two-step process so a fair decision is made. Bury’s Cabinet has now decided to table proposals at a meeting in January, hold another public consultation, and then make a final decision at a meeting March.&#34;","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Camden","Thu, 27 Oct 2016 20:18:49 +0000","Camden – Fears for Camden’s local history archives if flats scheme at Holborn Library is expanded – Camden New Journal. &#34;The Town Hall has been accused of putting profits before the history of the borough with plans to shrink the archive collection at Holborn Library to make way for more flats on the site. Developers working on a proposed overhaul of the site in Theobald’s Road say they will pay an extra £3.75million if some of the collections in the Local Studies and Archives are moved off-site.&#34;","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Darlington","Thu, 27 Oct 2016 20:18:49 +0000","Darlington – Darlington libraries embrace bookish selfies – Northern Echo. &#34;The #LovetoRead selfie sessions are part of the Society of Chief Librarians support for the BBC’s ongoing Get Reading campaign which aims to promote and encourage reading for pleasure.&#34;","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["East Riding of Yorkshire","Thu, 27 Oct 2016 20:18:49 +0000","East Riding of Yorkshire – Cottingham library set to survive East Riding Council cuts – Hull Daily Mail. Village customer service centre to move into neighbouring library will make saving necessary to keep Cottinghm Library. see also Decisions To Be Made On Bridlington Libraries – Yorkshire Coast Radio.","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Glasgow","Thu, 27 Oct 2016 20:18:49 +0000","Glasgow – Coding in Glasgow’s public libraries – Knowledge Exchange Blog. &#34;Last week saw the annual CILIPS Autumn Gathering take place in Glasgow. CILIPS is the Scottish branch of the professional body for librarians and information professionals in the UK (CILIP). The Autumn Gathering provides professionals in Scotland with an opportunity to get together to discuss issues and trends within the sector and share best practice. The day saw a range of sessions alongside two keynote addresses from Marc Lambert, CEO of the Scottish Book Trust, and Diane Bruxvoort from the University of Aberdeen. One of the most interesting talks I attended was given by Martin Goodfellow, who is the Coder in Residence at Glasgow Life. Martin previously worked on the Future Makers project, providing 5-17 year olds in Glasgow with the opportunity to learn digital making skills. The project was made possible due to the city winning Innovate UK’s Future Cities Demonstrator competition, and £24m in funding to explore ways to improve the city and the quality &#8230;","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Halton","Thu, 27 Oct 2016 20:18:49 +0000","Halton – Love to Read weekend in Halton – Cheshire Today. &#34;All Halton Libraries staff are signed up as reading ambassadors, pledging their commitment to recommend books to library users. If you are having trouble choosing your next book to read, head down to your library for a tailored recommendation.&#34;","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Neath Port Talbot","Thu, 27 Oct 2016 20:18:49 +0000","Neath Port Talbot – Control of two Neath Port Talbot libraries could be transferred to the community – South Wales Evening Post. &#34;Skewen and Baglan Libraries could be losing their funding from the local authority as it looks to save £11.2 million from the budget for the 2017/18 financial year.&#34;","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Poole","Thu, 27 Oct 2016 20:18:49 +0000","Poole – Thousands of children take part in Poole’s summer reading challenge – Daily Echo. 3,300 children took part.","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Powys","Thu, 27 Oct 2016 20:18:49 +0000","Powys – Residents urged to have a say in future of Llanfyllin library – Advertizer. Councils have been given a deadline of November 1st to contribute 50% of library costs or see library closed. Llanyfillin parish council would need to raise £8,000.","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Swindon","Thu, 27 Oct 2016 20:18:49 +0000","Swindon – Libraries campaigners to take their fight to parliament – Swindon Advertiser. &#34;The Save Swindon’s Libraries group will join others from across the UK as they come together in London in support of public libraries, museums and galleries. On November 5, the Swindon campaign will be taking a coach-load of supporters to take part in the demonstration which starts at the British Library, and will finish at the Houses of Parliament.&#34;","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Walsall","Thu, 27 Oct 2016 20:18:49 +0000","Walsall – ‘There’s nowhere else for children&#39;: Walsall locals react to library closure plans – Guardian. &#34;The news of the potential mass closures came as a devastating blow to residents, who have come to rely on the library for more than borrowing books. Janet Hodson, 71, who sat with Chloe, six, Lilly, nine, and Kylie, 11, at her feet as she corrected some missed stitches in a yellow blanket they had been working on, described the proposal as diabolical.&#34;It’s absolutely devastating,&#34; she said. &#34;For an area the size of Walsall to just have one library, which for older people like me is hard to get to, is abso lutely ludicrous.&#34; … &#34;figures show that the 16 libraries are not underused. Over the past two years, the libraries have had about 1 million visits, with approximately 775,000 books borrowed each year.&#34; see also Council proposes closing nearly all of its libraries – LocalGov.","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Westminster","Thu, 27 Oct 2016 20:18:49 +0000","Westminster – Fears for library services following ‘swingeing cuts’ – Get West London. &#34;&#34;Massive cuts&#34; are being planned to library services in Westminster, the opposition Labour group has said. The group is &#34;deeply concerned and angered&#34; by proposals put forward by the Conservative administration to cut £750,000 per year from the Westminster Libraries budget, saying it will result in the loss of 17.5 full time staff.&#34;","2016/10/love-to-read-get-it-loud-and-loop-the-loop.html"],["Barnet","Sun, 30 Oct 2016 18:44:07 +0000","Barnet – Barnet Unison Library workers strike on 5th November – Barnet Unison. &#34;This is in pursuance of our dispute with the Council over the outsourcing of the Library Service. The Council plans to hand 4 of our Libraries to &#34;Community groups, not-for-profit and voluntary organisations&#34; in April 2017. The Council plans to outsource the remaining Libraries at a future date.&#34; … &#34;50.3 Full Time Equivalent Posts to go. Colleagues to be informed that they will lose their jobs in the weeks leading up to Christmas. Building work to reduce library space by 15% to 90% resulting in less stock, study and activities space. Introduction of technology that is being used to replace staffed opening hours. Library staff will be on site only 30% of planned opening hours.&#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"],["Bedford","Sun, 30 Oct 2016 18:44:07 +0000","Bedford – ‘Digital model’ could be end of a chapter for experienced Bedford librarians – Bedfordshire News. &#34;safety concerns over proposals to create ‘digital’ libraries dominated the discussion as councillors and members of the public raised questions about how safe a system that would see users access unstaffed libraries with key cards would be.&#34; … User says &#34;&#34;The digital or library plus model will actually discourage users. For users who want information, to ask questions, who want help accessing reference material, those users will be restricted to hours that staff are available. Children will not be access the library during unmanned hours. This reduction in usage may be wrongly interpreted as the public not wanting to use their library.&#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"],["Bracknell Forest","Sun, 30 Oct 2016 18:44:07 +0000","Bracknell Forest – Changes to Bracknell library service would be an &#34;insult&#34; to the profession – Bracknell News. A group campaigning to protect Bracknell’s community services from budget cuts has responded angrily to news the council are considering replacing paid librarians with volunteers rather than close the borough’s nine libraries completely.&#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"],["Brighton and Hove","Sun, 30 Oct 2016 18:44:07 +0000","Brighton and Hove – Conservative councillor set for discipline hearing for labelling council leader a liar – Argus. &#34;The Wish ward councillor Robert Nemeth is preparing to go before Brighton and Hove City Council’s standards committee for comments made on Twitter during a heated dispute over the future of the Carnegie Library. Cllr Nemeth accused the Labour leader Warren Morgan of misleading the public in his threat that seven libraries would have to close if Hove Library was moved from its Victorian home in Church Road.&#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"],["Cheshire West and Chester","Sun, 30 Oct 2016 18:44:07 +0000","Cheshire West and Chester – New routes for Mobile Library Services will include new and extended stops – Your West Cheshire. &#34;The new routes are the result of a review of the Library Service in 2014, and also a public consultation about the Mobile Library service, which took place during the summer.  The Council’s Cabinet Member for Community and Wellbeing, Councillor Louise Gittins said: &#34;As a result of feedback from residents some Mobile Library stops have been added back into the routes and others have been extended.  We will now visit all stops every three weeks, instead of every four weeks, to bring the service in line with loan periods in static libraries. &#34;Our Mobile Library Service offers a current and wide range of stock including adult and junior books and also audiobooks.&#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"],["Cornwall","Sun, 30 Oct 2016 18:44:07 +0000","Cornwall – Libraries and public toilets could be at risk from plans to cap town and parish council tax rates – West Briton. &#34;Town and parish councils in Cornwall have been approving massive increases in their share of council tax in recent years to help take over services which are being devolved by Cornwall Council. But now the Government is looking to introduce restrictions on such hikes with a proposal to limit them to the 2% which is currently in place for larger authorities.&#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"],["Derbyshire","Sun, 30 Oct 2016 18:44:07 +0000","Derbyshire – Think of Libraries in Devolution debate – Derbyshire Times / Letters. &#34;A big thank to the librarians at Bakewell Library when I visited recently. Having librarians present was a pleasant, if bittersweet reminder of the wonderful library staff we lost at Stannington Library in Sheffield in 2014. I was interested whilst in the library to see a consultation on Chesterfield and parts of Derbyshire joining the Sheffield City Region as part of the devolution deal being negotiated by Sheffield with the government.&#34; … &#34;I would encourage Derbyshire library users to make their feelings known to MPs, councillors and this letters’ page&#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"],["Devon","Sun, 30 Oct 2016 18:44:07 +0000","Devon – Seaton Library friends group appeals for more help – Midweek Herald. &#34;Dubbed FoSeL for short, the organisation is a band of volunteers which supports the library by fundraising for extras and helping out at events like the recent Summer Reading Challenge. Thanks to the efforts of FoSeL members and the generosity of the local community, Seaton library now runs a Lego  club for children of primary school age …&#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"],["Lancashire","Sun, 30 Oct 2016 18:44:07 +0000","Lancashire – First Lancashire building closure dates announced – 2BR News. &#34;Lancashire County Council is to close buildings in Whalley, Cleveleys and Trawden from next week, as part of its plans to reduce the number of buildings it operates.&#34; … &#34;Whalley library – closing 5 November at 12noon&#34; … &#34;Cleveleys library – closing 19 November at 1pm.&#34; … &#34;Trawden library – closing 18 November at 5pm. &#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"],["Northern Ireland","Sun, 30 Oct 2016 18:44:07 +0000","Northern Ireland – BBC NI hosts Book Week with Libraries NI – BBC. &#34;From Saturday morning, BBC Radio Ulster/Foyle’s airwaves will be buzzing with interviews and features about reading for Book Week NI. It is all part of a joint initiative between BBC Northern Ireland and Libraries NI. The week aims to celebrate the pleasures and benefits of reading.&#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"],["Powys","Sun, 30 Oct 2016 18:44:07 +0000","Powys – Hay-on-Wye: ‘Town of books’ library battling closure – BBC. &#34;Residents have now formed a community group to save the facility. They will need to raise £18,000 a year to meet half the running costs, with the council meeting the other half.&#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"],["Warrington","Sun, 30 Oct 2016 18:44:07 +0000","Warrington – In pictures: Campaigners join forces to hand in library petitions – Warrington Guardian. &#34;More  than 10,000 people signed a petition to save Warrington’s libraries after LiveWire unveiled plans to shut nine library services across the town. A public consultation outlining plans to replace libraries with lending lockers and outreach services ended on Friday and protestors gave their petition in at the town hall. Five-year-old Kitty Kingsnorth handed 10,711 signatures and letters from primary school pupils to Cllr Tony Higgins, executive board member for leisure, community and culture.&#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"],["Warrington","Sun, 30 Oct 2016 18:44:07 +0000","Warrington – Union hits back at plan for volunteers to run libraries – Warrington Guardian. &#34;A union representing more than 2,300 staff in the town has slammed LiveWire’s suggestion that neighbourhood libraries could be run by volunteers. Unison Warrington’s joint branch secretary, Jason Horan, said the union is opposed to the closure of public facilities but would wait until the results of the public consultation are published before meeting with the council. In addition the proposed closures, the equivalent of 18 jobs would be cut. In meetings with residents, LiveWire put forward the option for community groups to take over the management of some libraries with volunteers running the service.&#34;","2016/10/keep-an-open-mind-be-innovative-and-keep-smiling-an-interview-with-thomas-colloff.html"]]