[["Herefordshire","Tue, 01 Sep 2015 20:48:20 +0000","Herefordshire – Arts council chief to visit Hereford – Ledbury Reporter. &#34;Mr Henley said: &#34;‘I want our museums, our libraries, our artists and our arts venues to be genuinely popular. &#34;That means I want them to be a part of the life of everyone in England, no matter who they are or where they live.&#34;","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Swansea","Tue, 01 Sep 2015 20:48:20 +0000","Swansea – Has Barack Obama been taking inspiration from this Swansea library? – South Wales Evening Post. &#34;Perhaps he got the idea when he visited Wales last year, but Barack Obama is following in the footsteps of Swansea library service. The US President has announced the American government’s intention for all school pupils there to receive public library cards, a scheme first introduced in Killay Library a number of years ago. The initial Swansea Council pilot project saw all primary schoolchildren within the Killay catchment area given membership to their local library. Membership gave children free access to books, talking books, e-books, e-magazines, comics, homework help, computers, the internet, library clubs, games, events, activities and classes. It has since been rolled out for eight and nine-year-olds at schools across the city with support from the Welsh Government.&#34; … &#34;The original Every Child a Library Member project at Killay Library won a Gold Award at the Welsh Libraries Marketing Awards. The Scottish Gov&#8230;","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Lambeth","Tue, 01 Sep 2015 20:48:20 +0000","Lambeth – Library-Cinema plans – West Norwood Press. &#34;The planning application for West Norwood’s library – cinema in the refurbished Nettlefold Hall at 1 Norwood High Street SE27 9JU has just been submitted.  The plans are for a refurbished library,  4-screen cinema, community space and a café/bar.&#34;","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Herefordshire","Tue, 01 Sep 2015 20:48:20 +0000","Herefordshire – Hub plan for Hereford Library – Hereford Times. &#34;Hereford’s  Broad Street library has been marked for a £145,000 conversion scheme that creates an &#34;information and advice&#34; hub for Herefordshire Council’s contract partner Services for Independent Living (SIL). The council says the cabinet level decision saw several other potential sites ruled out as not meeting the scheme’s &#34;essential requirements&#34; which included the need for a city centre location, disability access, availability, and very limited revenue running costs.&#34; … &#34;The building works – pitched as the minimum required – will convert existing library office and storage areas into interview, reception and office space for the hub, improved accessible toilets facilities on the ground floor and a &#34;working area&#34; elsewhere in the building for library staff displaced by the move. &#34;","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Kirklees","Tue, 01 Sep 2015 20:48:20 +0000","Kirklees – Jo Cox MP – &#34;Our libraries are a lifeline.&#34; – Dewsbury Reporter. &#34;In the last few weeks and months, the public consultation on our local libraries drew to a close and its findings were published. The process rumbles on. Many people don’t realise just what a valuable lifeline libraries can be.&#34; … &#34;I was approached in one library by a woman desperate that it remain open. She’d been an avid reader but lost much of her sight. As a result she stopped reading altogether. She even lost the ability to hold a book in the right way. It was the librarians who reignited her interest in reading, taught her how to read in spite of her sight issue and helped her learn how to hold a book.&#34;","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Shropshire","Tue, 01 Sep 2015 20:48:20 +0000","Shropshire – Costs put brakes on plan to relocate Ellesmere Library – Shropshire Star. &#34;All Together Ellesmere, which runs the market hall in Scotland Street, wants to see the library move in as part of a wider project to breathe new life into the building. The plan includes building a mezzanine floor, opening a café and providing art and music rooms. But Lincoln McMullan, chairman of the group, said early obstacles had been met that would be too expensive to get past – including news that a feasibility study could cost up to £30,000. It has left a question mark over the future of the market hall, as All Together Ellesmere’s lease runs out in 2018 and it is not known if it will have enough money to carry on running the venue.&#34;","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Southampton","Tue, 01 Sep 2015 20:48:20 +0000","Southampton – Resist these cuts – Southern Daily Echo. &#34;Surely you and your colleagues in the Labour party and the Labour Group should end the hollow cries &#34;we have no choice&#34; and the shrugging of shoulders &#34;we don’t like shutting respite centres, care homes, libraries, or sacking council staff, but we have no choice&#34;. How about robustly taking on the government, rather than raising the white flag and doing the dirty work for them implementing the ongoing cuts. &#34;","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Devon","Tue, 01 Sep 2015 20:48:20 +0000","Devon – Roommates: local library moves into town post office in face of budget cuts – ITV. &#34;Ashburton in Devon has become the first town in the UK to trial an innovative way to try to save its local library in the face of budget cuts. The library – with its 7000 books – has moved in to the town Post Office, and occupies what used to be the sorting area.&#34; [It is not the first in the UK: there’s one in Suffolk – Ed.]","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Bristol","Tue, 01 Sep 2015 20:48:20 +0000","Bristol – Eastville Library to close as Bristol City Council’s cabinet agree to cuts – Bristol Post. &#34;Eastville Library will close and others will have their hours cut as Bristol City Council finally decided on controversial cutbacks. The library shake-up will affect all 27 in the city as the council strives to save nearly £500,000 from its budget. Despite protests from more than 600 members of the public, staff and councillors the cabinet agreed it would close Eastville’s library, which is its only community centre.&#34; … &#34;Mr Ferguson confirmed the closure of Eastville Library would save £58,000. But he denied that was the reason for the closure.&#34; … &#34;The council had planned to close down seven libraries but after outcry from the public it agreed to keep all but Eastville open, but reduce the opening hours at 26 of them.&#34;","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Cumbria","Tue, 01 Sep 2015 20:48:20 +0000","Cumbria – Library service is unpredictable – Westmorland Gazette. Letter: &#34;Several weeks ago I went to Kendal Library and found it was unexpectedly closed ‘due to staff issues’. Recently I have been again and found another unscheduled closure. On investigating I find that random closure of libraries across the county has been happening for well over a year and is becoming increasingly frequent. Where is the management and the planning? This unreliable and unpredictable service is not, as the county logo says, ‘serving the people of Cumbria’.&#34;","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Flintshire","Tue, 01 Sep 2015 20:48:20 +0000","Flintshire – Mancot Library saved after determined fight from campaigners – Leader. &#34;Mancot Library will be run for an initial five-year period by volunteers hopeful it will remain open for &#34;the foreseeable future&#34;. The building is being transferred on a community asset transfer basis to Save the Mancot Library Action Group (SMLAG) and principles agreed with Flintshire Council will see existing book stock, shelving and computers retained.&#34;","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Leicestershire","Tue, 01 Sep 2015 20:48:20 +0000","Leicestershire – Second Leicestershire library to be handed over to volunteers to cut costs – Leicester Mercury. &#34;The library will be managed by a group of 50 volunteers and parish councilors. It will offer new possibilities to hold events for the under fives and older children, and adult IT classes with many other ideas in the pipeline. Profits from the café will help to meet the running costs of the library.&#34; … &#34;Glen Parva Parish Council is taking over the running of Glenhills and Leicestershire County Council is about to hand over the keys.&#34; … &#34;The library used to be open for just 13 hours a week, and we now plan to open for 36 hours, with the café open every morning till 12.30pm&#34;","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Staffordshire","Tue, 01 Sep 2015 20:48:20 +0000","Staffordshire – Have your say on future of Staffordshire’s mobile library service – Staffordshire Newsletter. &#34;Since July 1 people have been able to give their opinions at one of the service’s regular stops, or at one of 36 drop-in sessions across Staffordshire, but there’s still time to submit a response online or by completing a form at one of the county’s 43 libraries. The initial proposal concentrates on prioritising the service for those who need it most. Suggestions include retaining popular stops, which are more than two miles from a library building, and maintaining a service for deprived areas.&#34;","2015/09/libraries-change-lives-but-soon-probably-not-in-herefordshire.html"],["Barnet","Thu, 03 Sep 2015 20:43:35 +0000","Barnet – March planned to protest threat to Barnet libraries – BookSeller. &#34;Campaigners will take to the streets of Barnet next week to protest Barnet Council’s proposed £2.85m worth of cuts to the library service, the Times Series has reported. The ‘Children’s March for Libraries’ will see BAFTA award-winning actress Rebecca Front joining those campaigning. She said: &#34;It’s a pretty obvious equation to me. Children reading books is a good thing. Children being denied free access to books is therefore a bad thing and needs to be stopped in Barnet or wherever it’s happening.&#34; On Saturday 12th September campaigners will start at East Finchley Library at 10.15am, before heading to Church End Library, where they will be joined by a brass band. They will end the march at North Finchley Library…. &#34; See also Campaigners to stage march ahead of vote on library cuts – Times Series.","2015/09/amateurisation-and-the-hiding-of-unwelcome-realities.html"],["Herefordshire","Thu, 03 Sep 2015 20:43:35 +0000","Herefordshire – Library consultation &#34;needs to be suspended&#34; – Hereford Times. &#34;Nina Shields, chairman of the Ledbury Library Development Group believes the present online consultation, set to end on October 9, needs to be suspended and replaced with &#34;real&#34; consultation involving her group and others.&#34; … &#34;Ms Shields said of the online consultation process:&#34;It is difficult to believe that you are serious about this – unless you think seeking endorsement for your plans equates to consultation.&#34;. Council says &#34;&#34;We will continue with the consultation in its present form for the above reasons and would ask you to help by encouraging as many people as possible to respond. We will do everything we can to preserve important services like libraries but would ask you to recognise that there simply is no longer enough money to maintain support for everything at previous levels.&#34;","2015/09/amateurisation-and-the-hiding-of-unwelcome-realities.html"],["Manchester","Sun, 06 Sep 2015 21:03:23 +0000","Manchester – Aumbry chef Mary-Ellen McTague to take part in free ‘ask the experts’ event at Central Library – Manchester Evening News. &#34;The award-winning chef will be joined by sustainable food pioneer Vincent Walsh and founding director of the Fazenda restaurant group Tomas Maunier in a special edition of Central Library’s ‘Inspiring Entrepreneurs’ programme of talks.&#34;","2015/09/heres-some-positive-public-libraries-news.html"],["Cambridgeshire","Thu, 03 Sep 2015 20:43:35 +0000","Cambridgeshire – Friends group to be set-up at Cambridge Central Library in wake of enterprise centre saga – Cambridge News. &#34;A friends group dedicated to protecting Cambridge Central Library is due to be set up in the wake of unprecedented community spirit that saved it from becoming home to an enterprise centre. Thoughts yesterday returned to using the county’s library services as a tool to generate income in the wake of the failure to put an enterprise centre on the library’s third floor. The hugely contentious plans were scrapped after local blogger Phil Rodgers uncovered the fact the man behind the proposals was banned from being a director in the UK.&#34;","2015/09/amateurisation-and-the-hiding-of-unwelcome-realities.html"],["Leicester","Thu, 03 Sep 2015 20:43:35 +0000","Leicester – Libraries cut to the bone – Leicester Mercury, Unison warn of further cuts after librarians cut by almost half three years ago and reductions in library assistants.","2015/09/amateurisation-and-the-hiding-of-unwelcome-realities.html"],["Southwark","Sun, 06 Sep 2015 21:03:23 +0000","Southwark – Old Kent Road’s public library to move to Aylesbury Estate site – London SE1. East Street Library – located on the corner of Old Kent Road SE1 and East Street SE17 – opened in 1967 to replace a much grander Edwardian building knocked down to make way for the Bricklayers Arms flyover. In turn, the current library is likely to shut in 2019 when a new ‘community hub’ opens 500 metres away in Thurlow Street. Cllr Ian Wingfield, Southwark’s cabinet member for business, employment and culture, said: &#34;While other councils are closing libraries, in Southwark we have worked hard to keep investing and keeping them in place as a vital community space.&#34;","2015/09/heres-some-positive-public-libraries-news.html"],["Derby","Thu, 03 Sep 2015 20:43:35 +0000","Derby – Council will ask volunteers to help run Derby’s libraries due to cuts – Derby Telegraph. &#34;People will be asked if they would be willing to volunteer at Derby’s libraries as part of a consultation into how they will be run in the future.And councillor Martin Rawson, cabinet member responsible for Derby’s 15 sites, including the new local studies library, has conceded they are likely to need fewer staff.But he said the authority would strive to do this &#34;through not filling posts when people leave&#34;.&#34; … &#34;report drawn up by council officers ahead of the meeting said that a public consultation in 2013-14, saw the 1,000 people who took part suggesting that there should be an average decrease in the city’s libraries budget of 34.45%.It said: &#34;While this result is not binding, it is broadly indicative of the level of savings that many residents want us to consider.&#34;However, given the scale of the budget savings already made since 2010-11, a further reduction of this magnitude would require a fundamental tran&#8230;","2015/09/amateurisation-and-the-hiding-of-unwelcome-realities.html"],["Glasgow","Thu, 03 Sep 2015 20:43:35 +0000","Glasgow – Survey on city libraries – Evening Times. &#34;Both library members and non-members were asked their views and more than 3000 people responded. Their comments will help form a vision for the library which will include Glasgow Life’s five year commitment to the service. &#34;","2015/09/amateurisation-and-the-hiding-of-unwelcome-realities.html"],["Bromley","Sun, 06 Sep 2015 21:03:23 +0000","Bromley – Solidarity to Unite members on strike in Bromley Libraries – Stop the privatisation of public libraries. &#34;Last week Unite members in Bromley Libraries took further strike action against plans to privatise and amateurise the service.  One of the Unite Stewards very kindly sent me some photos … &#34;We have over 1200 signatures on our surveys which just shows the massive support for our campaign. The Council must accept that they cannot go on with their plan to cover up the glaring truth that Bromley residents do not want private companies running their services.&#34;","2015/09/heres-some-positive-public-libraries-news.html"],["Wirral","Sun, 06 Sep 2015 21:03:23 +0000","Wirral – It’s tough for Wirral library staff – Wirral Globe. &#34;.. Wirral libraries have had their opening hours drastically reduced because the council couldn’t afford to keep them open all week. The library staff worked long and hard to stop this happening and to safeguard their jobs, as did many library members. To my horror I have learned the libraries are now to reopen on certain days because they will be staffed by volunteers and not library staff. &#34;","2015/09/heres-some-positive-public-libraries-news.html"],["Hartlepool","Thu, 03 Sep 2015 20:43:35 +0000","Hartlepool – Hartlepool libraries’ hours are cut to save cash – but closures are avoided – Hartlepool Mail. &#34;Branch libraries will close on more days as part of cost-saving measures to the service. Hartlepool Borough Council looked at opening hours, possible mergers and greater use of volunteers as part of a library review. It attracted more than 1,500 responses from users, one of the highest ever for a council consultation exercise.&#34;","2015/09/amateurisation-and-the-hiding-of-unwelcome-realities.html"],["Staffordshire","Thu, 03 Sep 2015 20:43:35 +0000","Staffordshire – In pictures: New chapter for £1 million Stafford library – Express and Star. &#34;The new £1 million facility will open on Wednesday at its new home inside Staffordshire Place in Tipping Street … The opening will please many library users in the town who have been left without a library for almost two weeks because of the closure of the old one in Martin Street.&#34; … &#34;Gone are the lifeless noticeboards which traditionally greet library-users, instead those visiting the new facility will be met by a large state-of-the-art touchscreen display which resembles an iPad and the digital world.&#34; … &#34;The library will be equipped with tablets for web browsing and reading, as well as Raspberry Pi devices which are credit card-sized computers for children that teach programming skills. And one of the eye-catching new additions is the 3D printer where people can see their creative designs come to life before their eyes.&#34;","2015/09/amateurisation-and-the-hiding-of-unwelcome-realities.html"],["Herefordshire","Thu, 03 Sep 2015 20:43:35 +0000","Herefordshire – Threat to our county libraries is absurd – Hereford Times. Letter: &#34;For Herefordshire Council to talk about closing libraries in two of our largest market towns defies belief.  … These are purpose-built libraries, were opened only about 20 years ago, and are busy and well used. &#34; … &#34;To suggest that Hereford Library becomes the only ‘professional’ library and the ‘central hub’ for the county is absurd. Of course it is the busiest library: Hereford is by far the largest population, but its library was built about 150 years ago and is not fit for purpose as it is – let alone its role in the future. &#34;","2015/09/amateurisation-and-the-hiding-of-unwelcome-realities.html"],["Norfolk","Thu, 03 Sep 2015 20:43:35 +0000","Norfolk – What could 25% cuts at Norfolk County Council mean for our services? – Eastern Daily Press. &#34;Norfolk has 47 libraries and cutting 25pc from the budget would mean only around 30 would remain in three years. Options which are likely to be put forward include reducing library stock, cutting mobile-library services, shedding staff and reducing the opening hours of the Norfolk and Norwich Millennium Library at The Forum in Norwich. A new model of delivery, which includes using libraries as venues for early help, is proposed.&#34;","2015/09/amateurisation-and-the-hiding-of-unwelcome-realities.html"],["Norfolk","Thu, 03 Sep 2015 20:43:35 +0000","Norfolk – Hope for Norfolk libraries, but cuts fear hangs over museums – Diss Express. &#34;a working group set up to look at the future of the county’s 47 library buildings has concluded all of them should be saved from the axe. The group’s report said: &#34;Libraries are ideally placed to become community hubs and provide not only the physical infrastructure, but the learning support that individuals will need to access a wide range of services.&#34; However, the group added that savings could still be found by introducing more self-service technology.&#34;","2015/09/amateurisation-and-the-hiding-of-unwelcome-realities.html"],["Southampton","Thu, 03 Sep 2015 20:43:35 +0000","Southampton – Council consultation on libraries’ closure was not fair – Southern Daily Echo. &#34;The council maintains that the majority of respondents to the public consultation supported its preferred option (closing five libraries) yet respondents were given no option to maintain all or even most of the city libraries. They could choose between five or more closures. The survey questionnaire was designed to give the results the council wanted to proceed with its intended plan&#34;","2015/09/amateurisation-and-the-hiding-of-unwelcome-realities.html"],["Cornwall","Sun, 06 Sep 2015 21:03:23 +0000","Cornwall – Battle of Britain fighter pilot opens library in Cornish pub – Pub is the Hub. &#34;The project has been completed in partnership with Cornwall Council’s Library Services and the support of rural pub champions Pub is The Hub.&#34; … &#34;Situated in one of the myriad of small rooms within the pub, the library room boasts several shelves of books, comfy seating and a computer terminal connected to the internet. There, customers can browse the shelves that are managed and monitored by the Library Service or order books online to be delivered weekly.&#34; … &#34;Assisting in the library and funding 50% of the cost with Pub is The Hub has been Pat Terry from Cornwall Council’s Library Services.&#34;","2015/09/heres-some-positive-public-libraries-news.html"],["Kirklees","Sun, 06 Sep 2015 21:03:23 +0000","Kirklees – New campaign to try and save Kirklees’ libraries – Huddersfield Daily Examiner. &#34;Huddersfield, Calderdale and Bradford branch of union Unite Community has now launched a campaign to persuade the council to change its plans&#34; … &#34;Unite Community member Chris Strachan, who began the petition, said: &#34;It’s going very well so far. The petition is against library cuts, and against the use of volunteers to replace paid library staff. We are getting a good response from the public.&#34;","2015/09/heres-some-positive-public-libraries-news.html"],["Leicestershire","Sun, 06 Sep 2015 21:03:23 +0000","Leicestershire – Leicestershire’s second ‘community partnership’ library set to open in Markfield this week – Leicester Mercury. One of 36 withdrawn by council: volunteers have been supported by council. Will be open 18 hours per week.","2015/09/heres-some-positive-public-libraries-news.html"],["Manchester","Sun, 06 Sep 2015 21:03:23 +0000","Manchester – Music, Minecraft and Guy Garvey – Library Live. &#34;Central Library is throwing its doors open for a special Sunday afternoon of free entertainment for the whole family. And the internationally renowned musician Guy Garvey will be broadcasting his BBC 6music radio show, ‘Finest Hour’, live from the library on the day. From stories and songs to Minecraft mask-making and bunting workshops – plus a chance to find your inner rockstar by trying out a range of musical instruments – a host of fun activities for people of all ages will be taking place on Sunday 6 September (12 – 4pm). Music fans are also offered a unique opportunity to see the frontman of Elbow, Guy Garvey, live in the library’s Performance Space as he introduces and shares some of his favourite songs for BBC 6music listeners nationwide (2 – 4pm). Guy will be joined on the show by guests including Radiohead’s Phil Selway and New Order’s Stephen Morris, to discuss the literary influences that have inspired their work.&#34;","2015/09/heres-some-positive-public-libraries-news.html"],["Barnet","Tue, 08 Sep 2015 21:20:49 +0000","Barnet – The Thick of It star launches march against cuts threatening Barnet’s libraries with closure – Ham and High. &#34;The Thick of It actress Rebecca Front is to join a march against £2.85million of cuts threatening the closure of Barnet’s libraries.&#34; … &#34;Ms Front united with a 10-year-old Barnet pupil and literacy campaigner to launch the Children’s March for Libraries on Thursday at East Finchley Library – one of several which could close. The BAFTA-award winning actress, who played MP Nicola Murray on the satirical TV show, said she was inspired to take part in the protest after visiting a Barnet library for the first time a few months ago. She said: &#34;It was buzzing with readers, Internet users, kids doing homework assignments. This is important stuff. Not everyone can afford to buy books. Not everyone has a quiet space in their home to work. Libraries are a triumphant symbol of democracy.&#34;&#34;","2015/09/theres-a-whole-world-out-there-different-levels-of-awareness.html"],["Barnet","Tue, 08 Sep 2015 21:20:49 +0000","Barnet – The Kids4Libraries march – Barnet Unison / YouTube.","2015/09/theres-a-whole-world-out-there-different-levels-of-awareness.html"],["Harrow","Tue, 08 Sep 2015 21:20:49 +0000","Harrow – North Harrow Community Library Newsletter – &#34;We need to build a large pool of volunteers,  to run the library. As part of the agreement the council will give £14,000 to kick start this project. However, the cost of running the library for a year will be £24,000. This leaves a shortfall of £10,000. Please support us finan-cially by becoming a supporter of the North Harrow Community Library. To become a Supporter…&#34;","2015/09/theres-a-whole-world-out-there-different-levels-of-awareness.html"],["Southampton","Thu, 10 Sep 2015 19:52:00 +0000","Southampton – Crunch talks over future of six Southampton libraries – Southern Daily Echo. &#34;Labour council leaders approved the move to stop running five libraries and the mobile service, but their Conservative opponents called it in for further scrutiny. They say they are not happy about a lack of information on the groups which the council says have expressed interest in taking on the five libraries&#34;","2015/09/new-library-pictures-call-centres-missing-out-and-the-rest-of-the-public-libraries-news.html"],["Barnet","Tue, 08 Sep 2015 21:20:49 +0000","Barnet – Special committee meeting to discuss future of Barnet’s libraries – Times Series. &#34;The issue was due to go to a meeting of the children, education, libraries and safeguarding committee (CELS) on Monday, September 21 at Hendon Town Hall. But the council has now scheduled a special meeting for the committee on Monday, October 12 in order to &#34;give the proposals the full consideration they deserve&#34;. &#34;","2015/09/theres-a-whole-world-out-there-different-levels-of-awareness.html"],["Devon","Tue, 08 Sep 2015 21:20:49 +0000","Devon – New chapter for libraries in call boxes and clubs  – Times (behind paywall). &#34;Jackie Fisher-Greene can take her daughter Isabelle, three, to the public library in Plympton, Devon, five miles away, or walk to the old call box in the village of Wotter, where they can choose from more than 100 books. Libraries are making a comeback. In the same way that television did not diminish demand for cinema, it seems that ebooks have not dented our appreciation of paper and ink. Sales of books have fallen since the advent of ereaders, with 23 per cent fewer sold last year than in 2009, but book sharing is growing. The demise of libraries may … &#34;","2015/09/theres-a-whole-world-out-there-different-levels-of-awareness.html"],["Manchester","Tue, 08 Sep 2015 21:20:49 +0000","Manchester – Review: Guy Garvey’s Finest Hour, Manchester Central Library – Northern Soul. &#34;On Sunday, Central Library, that stupendous rotunda in the heart of the city, played host to a special transmission of Guy Garvey’s Finest Hour. It was the duality of a show about drummers in a library that I loved the most. And this is a library which has a well-known echo chamber – the central circular reading room – and makes the least amount of sound resonate as if you are in the bottom of a big bass drum. But the show was being recorded in the new performance space on the entrance floor. Over two hours, Garvey was joined by 6 Music presenter and Radiohead drummer Phil Selway, New Order drummer Stephen Morris, Jim James from My Morning Jacket, and the brilliant Heartless Bastards performed a live set.&#34;","2015/09/theres-a-whole-world-out-there-different-levels-of-awareness.html"],["Brent","Thu, 10 Sep 2015 19:52:00 +0000","Brent – Your chance to see Rugby’s World Cup Trophy in Brent – Brent Council. &#34;Boasting 40,000 books, over 120 study spaces, 66 PCs and 14 iPads for public use, the £10 million Library at Willesden Green has been built to play a role as a 21st century community hub. To highlight how the new Library at Willesden Green will be used by the community in the years to come, Brent Council has pulled together a packed six-hour programme of activities and entertainment for the event, which begins at 12noon on 12 September 2015. Cheerleading, steel bands, children’s theatre, face painting and carnival costume and sari trying, are just some of the highlights of the day, along with a mobile local history cinema, dance sessions, performance arts and a ceilidh session also makes the bill.&#34;","2015/09/new-library-pictures-call-centres-missing-out-and-the-rest-of-the-public-libraries-news.html"],["Brent","Sun, 13 Sep 2015 15:33:51 +0000","Brent – Inside the New Willesden Library Centre  – James Powney’s Blog. &#34;The new Willesden Library opened yesterday, and I must say it is even more spectacular than I imagined.  As you can see from my previous post, the exterior still has builders all round it, who will continue working on the housing that pays for the whole project for quite a while to come, but the inside is now functioning as a library.  he library is on three floors with a central light well in the middle.&#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Brent","Sun, 13 Sep 2015 15:33:51 +0000","Brent – New £10m Willesden Green library and art space opens – BBC. &#34;A new £10m library and community space has opened in north-west London. The Library at Willesden Green in Brent boasts 40,000 books, an art gallery, exhibition area and performance space. Developers Linden Homes re-built the 1980s part of the library, which was deemed &#34;inefficient&#34;, while incorporating elements from its Victorian heritage. The council funded the library by working with developers and selling adjacent land for new homes.&#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Shetland Islands","Sun, 13 Sep 2015 15:33:51 +0000","Shetland Islands – New van arrives for mobile library service – Shetland Times. &#34;new van for Shetland Library was officially revealed today and will take to the road on Monday. The van, bigger and better than the 10-year-old one it is replacing, will be on the North Mainland and North Isles run. Executive manager of the library service Karen Fraser said it was a &#34;super&#34; vehicle, with an easily accessible entrance, more windows, more battery power for the computer and a heater.&#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Buckinghamshire","Tue, 08 Sep 2015 21:20:49 +0000","Buckinghamshire – Friends of Burnham Library Arts Festival 2015 – Friends of Burnham Library. &#34;The Programme of events ranges from participating in four competitions, with cash prizes, in poetry, short story writing, photography, and painting, having a go at arts you have never tried before, or attending one of the exciting entertainment events.&#34;","2015/09/theres-a-whole-world-out-there-different-levels-of-awareness.html"],["Wiltshire","Tue, 08 Sep 2015 21:20:49 +0000","Wiltshire – New chapter for Wiltshire Council’s mobile library service – Swindon Advertiser. &#34;There were nearly 900 responses to an 11-week consultation carried out to ensure people are still able to access a library service in the county. &#34; Council says &#34;I’m delighted we have been able to work with local people to ensure the most well used stops are being retained, however significant pressures on our budget mean we cannot continue operating the service in its current format and the very limited changes being introduced will save the council over £100, 000. &#34; … &#34;From October 26, there will be two public mobile libraries operating in Wiltshire, one each in north and south Wiltshire. &#34; … &#34;Of the 870 responses from current mobile library customers, parish and town councils, 94 per cent of those who responded said they would continue to use the mobile library service with the changed frequency. &#34;","2015/09/theres-a-whole-world-out-there-different-levels-of-awareness.html"],["Devon","Tue, 08 Sep 2015 21:20:49 +0000","Devon – Library access triples following move into Ashburton post office – Borders. &#34;Devon County Council has been working with the Friends of Ashburton Library group (FOAL) to help secure the future of not only the town’s library, but also the local Post Office by housing them both under one roof. Last month dreams became a reality when the new community library opened its doors for the first time in its new home in the Post Office’s refurbished sorting room. The move means residents will have greater access to the library service with the introduction of a new self-service machine allowing people to take out and return books anytime during the Post Office’s opening hours, which are 8.30am – 5.30pm Monday to Saturday.&#34; … &#34;Ashburton is one of twelve communities to have been chosen by Devon County Council to take part in the innovative ‘community pilot project’ to try out new ways of involving local people so they can have more say on how their library is run&#34;","2015/09/theres-a-whole-world-out-there-different-levels-of-awareness.html"],["Edinburgh","Thu, 10 Sep 2015 19:52:00 +0000","Edinburgh – Libraries and hubs to get superfast web extension – Edinburgh News. &#34;Hundreds of council hubs, offices and libraries are set to be kitted out with superfast internet in the latest part of a £186 million boost to the city’s IT infrastructure. The deal will see a 100km extension to the Capital’s brand new &#34;fibre network&#34;, which is ushering in internet speeds up to 100 times faster than currently available.&#34; … &#34;Due to be completed in a year, the project will see computer users in libraries and community centres able to enjoy instant internet connections and improved access to online databases.&#34;","2015/09/new-library-pictures-call-centres-missing-out-and-the-rest-of-the-public-libraries-news.html"],["Brent","Sun, 13 Sep 2015 15:33:51 +0000","Brent – Willesden Library Opening Yesterday – James Powney’s Blog. &#34;The official opening of The Library at Willesden yesterday was fun.  The BBC reported it here.  They correctly link the new Library at Willesden to the successful court action back in 2011.  This is fair.  Building a new library at Willesden was a natural part of the philosophy behind the whole Libraries Transformation Project.  I get the impression that some of the opponents of the Libraries Transformation still don’t really get that.  I hope that now they can see what a success the new library is, they will learn to love Brent libraries.  &#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Devon","Sun, 13 Sep 2015 15:33:51 +0000","Devon – Formal complaint to Devon County Council – Devon Libraries Consultation – Support for Axminster Library / Facebook. Detailed three page complaint focusing on the &#34;the consultation was not conducted in a proper manner&#34;, &#34;unprofessional and incompetent&#34; responses from councillors and officer and Axminster being denied right to have voices heard.","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Poole","Sun, 13 Sep 2015 15:33:51 +0000","Poole – Poole’s mobile library service to go – Blackmore Vale Magazine. Council argues that volunteer libraries will be better than the mobile library service.","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Shropshire","Sun, 13 Sep 2015 15:33:51 +0000","Shropshire – ‘Save our libraries’ – call to arms from Shropshire campaigners – Shropshire Star. &#34;Shropshire Libraries Yes Campaign branded plans to &#34;offload&#34; libraries to volunteers as &#34;totally inadequate&#34;. Members of the group say they want to challenge Shropshire Council to come up with a solution that will ensure facilities remain for future generations. They have called a public meeting to rally support and have demanded talks to find a solution to the crisis.&#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Birmingham","Thu, 10 Sep 2015 19:52:00 +0000","Birmingham – Financial Cuts to the Library of Birmingham – YouTube. Interviews with Laura Swaffield of the Library Campaign, Birmingham Library Campaign, Unison and myself.","2015/09/new-library-pictures-call-centres-missing-out-and-the-rest-of-the-public-libraries-news.html"],["Surrey","Sun, 13 Sep 2015 15:33:51 +0000","Surrey – Sad farewell to Lingfield’s librarians – East Grinstead Courier. &#34;Manager Jane Rayner, who has been with the library for 11 years, and assistant manager Sue Sharp, who had worked there for 23 years, were celebrated at a leaving party in the parish church on Thursday, August 27. About 140 people attended the farewell bash for the former Surrey County Council (SCC) library employees. Among those present were residents, library users and members of the parish council. Members of the library services at the council were not invited. The two librarians were offered redundancy packages from SCC after they turned down their offer of working in a new county-wide restructure of libraries.&#34;.  Trustee says &#34;&#34;Each day we don’t know who will be coming in to manage the library, but we do know it won’t be the same face every day. It’s very sad.&#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Blackpool","Thu, 10 Sep 2015 19:52:00 +0000","Blackpool – Council cuts – Gazette / Letters. &#34;Wherever the cuts bite, people within the community will feel the effects greatly. If you close libraries, which seems the most likely, the elderly who view this service, along with mother groups, would suffer.","2015/09/new-library-pictures-call-centres-missing-out-and-the-rest-of-the-public-libraries-news.html"],["Fife","Thu, 10 Sep 2015 19:52:00 +0000","Fife – Cultural Trust wasn’t set up to cut library services – Fife Today. &#34;The blame for the possible closure of up to 16 libraries across the region must be laid at the door of Fife Council. That was the message at a public meeting called in Markinch this week to consider the controversial shake-up. Fife Cultural Trust has to make savings of £813,000 to Fife Council – and with libraries taking the majority of its budget, they are in the firing line. Laurie Piper, head of customer service and external relations. said: &#34;None of us wanted this to happen. It was not why the trust was set up, but with the fact that we have to find savings and the majority of our business being library provision, it was inevitable that libraries would bare the brunt,&#34;","2015/09/new-library-pictures-call-centres-missing-out-and-the-rest-of-the-public-libraries-news.html"],["Lincolnshire","Sun, 13 Sep 2015 15:33:51 +0000","Lincolnshire – Fears for the future of Grantham Library – Grantham Journal. &#34;A county councillor says there is concern over its future because not only might Morrisons be considering selling that part of the Isaac Newton Shopping Centre, but the running of library services is also out to tender. Coun Charmaine Morgan, who represents Grantham South, says she fears for local library services if a relocation of the library is on the cards.&#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Newham","Thu, 10 Sep 2015 19:52:00 +0000","Newham – Old Manor Park Library set to reopen as art studios – Newham Recorder.  &#34;More than a century ago, the Old Manor Park Library opened to provide somewhere for east Londoners to self-educate. … Now it is set to reopen as a creative space, harnessing the Romford Road site’s history to influence the future. &#34;It was built as a Carnegie library, one of the first free public libraries, and opened in 1905,&#34; explained curator Marijke Steedman. &#34;We want to continue the idea of creativity in east London.&#34; The Grade II listed building is being redesigned by architects Nicholas Lobo Brennan and Astrid Smitham ahead of its reopening.","2015/09/new-library-pictures-call-centres-missing-out-and-the-rest-of-the-public-libraries-news.html"],["Powys","Thu, 10 Sep 2015 19:52:00 +0000","Powys – Libraries face cuts just year after successful protest – Cambrian News. &#34;… libraries in Machynlleth and Llanidloes could once again be under threat, as Powys council cuts deepen. In its latest draft proposals for cuts of £27m by 2019, Powys council has earmarked another £250,000 to be saved from libraries across the county.&#34; … &#34;Councillors in both Machynlleth and Llanidloes &#34;strongly opposed&#34; any changes to the towns’ library services, but admitted that the 20 per cent reduction in opening times was the &#34;least-worst&#34; option&#34;","2015/09/new-library-pictures-call-centres-missing-out-and-the-rest-of-the-public-libraries-news.html"],["Staffordshire","Thu, 10 Sep 2015 19:52:00 +0000","Staffordshire – New £1m Stafford library offers access to 3D printing – BBC. Complaints that Stafford Central is now outside of the town centre.  Moved from centre to make it &#34;more modern&#34;. Coding space, sofas.  &#34;We need flexible, more modern library spaces that suit the way people live now&#34;. … &#34;A new £1m library has opened in Stafford despite nearly 3,000 people signing a petition against the plans. The facility in Stafford Place will stock more than one million books and includes access to 3D printing. Labour councillors disapproved of the new library, which has been relocated from Shire Hall, because it is not in the town centre. Staffordshire County Council said it could be &#34;used flexibly to meet the changing needs of local communities&#34;. An Innovation Suite at the library features technology for local businesses, community groups, schools and individuals, the county council said.&#34; … &#34;The council launched a consultation into the future of its 43 libraries in 2014, after a drop in the number of pe&#8230;","2015/09/new-library-pictures-call-centres-missing-out-and-the-rest-of-the-public-libraries-news.html"],["Worcestershire","Thu, 10 Sep 2015 19:52:00 +0000","Worcestershire – Council’s idea to stave off impact of Government cuts – crowdfunding – Evesham Journal. &#34;Frances Howie, head of public health at the council, said: &#34;We want people to look at the website and if they say ‘I want to help children and young people, I live in (postcode) W14′, it will automatically link you up to local football clubs in that area.&#34; Mr Anderson told the panel crowdfunding was a possible new solution, saying: &#34;It’s a relatively new internet-based way of raising money.&#34; He also told them one of the biggest Act Local successes was libraries, saying the ‘at home’ service is now fully staffed by volunteers. &#34;","2015/09/new-library-pictures-call-centres-missing-out-and-the-rest-of-the-public-libraries-news.html"],["Barnet","Sun, 13 Sep 2015 15:33:51 +0000","Barnet – Trio of authors join children’s march for libraries – Barnet and Whetstone Press. &#34;Alan Gibbons, who wrote The Shadow of the Minotaur, performance poet Joshua Seigal and writer Dan Freedman who created the Jamie Johnson series about football will be taking to the streets of Barnet. They will join actress and writer Rebecca Front, who starred in BBC comedy The Thick of It and ITV detective series Lewis as well as ten-year-old bookworm Ralph Vincent. Ralph wrote to Barnet council’s committee which will be discussing the future of libraries at a meeting next month.&#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Waltham Forest","Sun, 13 Sep 2015 15:33:51 +0000","Waltham Forest – Leytonstone Library is open – Eventbrite. &#34;Explore and celebrate with us at the reopening of our newly refurbished library! Enjoy 15 min flash performances outside the new library entrance Then delve inside to discover the new spaces as you race against time finding clues and completing an interactive trail through the building. Plus enjoy performances, workshops and our giant ribbon cutting ceremony&#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Greenwich / GLL","Sun, 13 Sep 2015 15:33:51 +0000","Greenwich / GLL – Providing easy online payments for Greenwich Leisure Limited – PanLibus / Capita. &#34;On Saturday, 3rd October, eleven venues run by Lambeth Libraries and Lambeth Archives will open their doors for people to try their hand at the arts and sciences, storytelling and play, exploration and adventure. Novelist, therapist, and radio host Lucy Beresford will be joining us at Clapham Library for a Q&A session, as will the entrepreneur Tara Benson, founder and CEO of Here and Now. Staff from City University will be running zine workshops and library tours exploring the science of serendipity. … &#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Herefordshire","Sun, 13 Sep 2015 15:33:51 +0000","Herefordshire – Asbestos scare closes Hereford library – Hereford Times. &#34;the library and museum on Broad Street will remain closed for 12 weeks for &#34;remedial works and improvements&#34;. &#34; … &#34;&#34;The building will be closed for an initial twelve-week period, while the remedial works and improvements to the site are conducted. Air samples had showed there were no airborne particles of asbestos, however trace amounts were found on surfaces near the oldest parts of the buildings’ structure&#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Southampton","Sun, 13 Sep 2015 15:33:51 +0000","Southampton – Campaigners stage protest at Southampton Civic Centre – Southern Daily Echo, &#34;A group demonstrated ahead of the city council overview and scrutiny committee meeting to raise awareness of a variety of causes including the NHS and library provision in Southampton. &#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Waltham Forest","Sun, 13 Sep 2015 15:33:51 +0000","Waltham Forest – History: The Leytonstone Library that became ‘a symbol of freedom and democracy’ in war propaganda – Guardian series. &#34;As a library re-opens after a £1.5 million refurbishment reporter Barnaby Davis looks back at the history of the prominent site described as a ‘symbol for freedom and democracy’ in Second World War propaganda. &#34; … &#34;During the Second World War, in which the building was only slightly damaged, The British Ministry of Information commissioned a series of photographs of the library to be used in illustrated foreign-language magazines and used as cultural propaganda. People were shown browsing through the vast collections of English history, literature and critical essays as a sign of the freedoms on offer in the Allied countries.&#34; … &#34;The new modernised library will hold 19,000 books, the same amount as it did before, whilst still offering flexible space to use including a theatre hall, upgraded ICT facilities, faster Wi-Fi, and dedicated sections for adults, teens and children. It will&#8230;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Isle of Wight","Sun, 13 Sep 2015 15:33:51 +0000","Isle of Wight – If libraries are closed will they ever re-open? – IWCP. &#34;would like to heartily endorse Fred Woodworth’s letter (CP, 27-08-15) about the value of libraries, particularly Ventnor Library. Ventnor Library staff are incredible. They are well trained, always cheerful and friendly, assured and knowledgeable. At one minute they can guide a young reader looking for a new book, at the next they can do the same for an elderly person, then help someone with the computer, advise on local history research, or run a Rhyme Time session for pre-school children. They need a good knowledge of the library computer system for reserving books etc. All that expertise is belittled by the current proposal to replace them with volunteers.&#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Southampton","Sun, 13 Sep 2015 15:33:51 +0000","Southampton – Seven organisations have stepped forward eager to run six under-threat Southampton libraries – Southern Daily Echo. &#34;Southampton City Council cabinet member for leisure Councillor Satvir Kaur confirmed the groups have enquired about the running of five libraries and a mobile library … But she was unable to disclose the organisations names because talks were still in a confidential stage. &#34; … &#34;Plans were approved by Labour civic chiefs to stop running all of the facilities, with community groups invited to take the five buildings on. It has proven controversial with opponents fearing groups will not be able to realistically run libraries forcing their closure.&#34;","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Lambeth","Sun, 13 Sep 2015 15:33:51 +0000","Lambeth – All Your Base Are Belong To Us: Lambeth Library Fun Palaces – Matthew Finch.","2015/09/every-silver-cloud-has-a-darker-lining-stafford-and-willesden-green.html"],["Barnet","Tue, 15 Sep 2015 21:38:24 +0000","Barnet – Library supporters march in protest at cuts – Times series. &#34;Authors and poets also roused the crowds on the children’s march for libraries, which saw campaigners demonstrate through Finchley on Saturday, September 12. &#34; … &#34;Rebecca Front kicked off to rapturous applause when she told the crowd libraries are &#34;essential for civilisation.&#34; Ralph Vincent, a pupil at All Saints CE Primary School in Whetstone, said: &#34;Politicians are always saying how we should help ourselves. Now they want to close down the main tool we use to do just that.&#34;&#34; … &#34;The council carried out a consultation into the library proposals from November 2014 to February 2015, which saw more than 3,800 people submit their opinions. Results, released in July, revealed that 97 per cent said they opposed closing six libraries in the borough, and 92 per cent opposed closing even two of them.&#34;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Kirklees","Tue, 15 Sep 2015 21:38:24 +0000","Kirklees – Jobs gone, opening hours slashed and closures: Full shocking extent of Kirklees Council library cuts revealed  – Huddersfield Daily Examiner. &#34;88 full time roles – possibly over 100 employees – are at threat of losing their jobs, two libraries will definitely close while only eight from 26 libraries will get council funding&#34; … &#34;The six-vehicle strong mobile library service will also be scrapped.&#34; … &#34;The plan, published late this afternoon, also reveals vast cuts to the opening hours of libraries for Kirklees’ 67,000 library card holders. They will be slashed by 40% with Huddersfield and Dewsbury open the longest, 50 hours per week each. The other six will operate more restricted opening hours of between 30 and 40 hours per week.&#34; … &#34;Officials say Kirkheaton library could open for just five hours per week. The other so called Community Supported Libraries would open between 15 and 30 hours per week. Volunteers from ‘Friends Of’ groups will be allowed to open their libraries when the paid staff are&#8230;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Thurrock","Tue, 15 Sep 2015 21:38:24 +0000","Thurrock – Thurrock libraries to reduce opening hours – Your Thurrock. &#34;the council had examined library usage – both the number of visits and the number of items issued – and then made changes to the opening hours in line with those figures. The new hours will come into operation on 5 October and will see Grays library opening at 9am but with two late nights instead of three. All libraries will close at 1pm on a Saturday and details of the new hours are available online at thurrock.gov.uk/libraries&#34;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Barnet","Tue, 15 Sep 2015 21:38:24 +0000","Barnet – No, it’s never just a book: a march for Barnet Libraries – Broken Barnet. &#34;The savings which our Tory councillors insist must come from our public services – whilst unable to demonstrate any that have resulted as a result of the Capita contracts – and specifically here from the library budget, are devastating in terms of impact, yet minimal in scale in the context of council expenditure: £2.85 million – a sum which pales into total insignificance when measured against, say, the salary costs of the many senior officer posts created to enforce the annexation of our public services by Capita ….&#34;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Staffordshire","Tue, 15 Sep 2015 21:38:24 +0000","Staffordshire – Libraries in Staffordshire handed to community groups – Burton Mail. &#34;Eleven contracts have been offered to community bodies, an NHS trust and a church group, while talks are already under way with other organisations ahead of a second phase of applications later this year. Ben Adams, Staffordshire County Council’s cabinet member for learning and skills, said: &#34;The calibre of the applicants was excellent.&#34; … &#34;Of the 23 libraries which are being handed over, 11 will now be run by community organisations, with discussions under way with other groups as to who will run the other 12. One of the affected centres, Barton Library, will now be run by South Staffordshire and Shropshire NHS Foundation Trust.&#34;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Brent","Tue, 15 Sep 2015 21:38:24 +0000","Brent – Rugby World Cup Trophy in Brent  – Brent Council. &#34;Brent residents got the chance to see the Rugby World Cup trophy in all its glory when it came to the borough on Saturday 12 September as part of the official 2015 Rugby World Cup Trophy tour.The Webb Ellis Cup, as it is officially known, was at the official opening event for the new  Library at Willesden Green&#34; … &#34;Boasting 40,000 books, over 120 study spaces, 66 PCs and 14 iPads for public use, the £10 million Library at Willesden Green has been built to play a role as a 21st century community hub. To highlight how the new Library at Willesden Green will be used by the community in the years to come, Brent Council put on a packed six-hour programme of activities and entertainment for the event. Cheerleading, steel bands, children’s theatre, face painting and carnival costume and sari trying were just some of the highlights of the day, along with a mobile local history cinema, dance sessions, performance arts and a ceilidh session.&#34; … &#34;<&#34;;&#34;>In times&#8230;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Central Bedfordshire","Tue, 15 Sep 2015 21:38:24 +0000","Central Bedfordshire – Save Bedfordshire’s library van and door to door service – Happy Salmon. &#34;Central Bedfordshire Coucnil is currently reviewing it’s library van and book delivery service. (The book bundle delivery is currently for those unable to get to a library.) The plans are to stop the library van and to change the book delivery service to one with eligibility criteria to be run by volunteers. I only just found out about the consultation on this and the closing date is this Friday 18th September.&#34;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Kirklees","Tue, 15 Sep 2015 21:38:24 +0000","Kirklees – Mixed reaction to Kirklees Council cost-cutting plans for libraries – Huddersfield Daily Examiner. &#34;The council will vote next week on plans to keep running eight libraries and to try and retain 16 more with help from volunteers. If there are no volunteers, it is likely they will close.&#34;. 8 safe libraries are Huddersfield, Dewsbury, Batley, Cleckheaton, Mirfield, Batley, Birstall, Heckmondwike and Holmfirth. 16 libraries will turn to volunteer or close, mobile library will close.","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Herefordshire","Sun, 20 Sep 2015 20:06:21 +0000","Herefordshire – Libraries are essential service – Hereford Times. &#34;Older members of the community have a chance to meet people and talk to a human being at libraries. All libraries do more than just lend books. Ross-on-Wye library is the Job Centre, a meeting point for local councillors, a point of access to the internet for many and a meeting venue for many local interests. If there are no more local libraries, why pay for them in our council tax?&#34;","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["Camden","Tue, 15 Sep 2015 21:38:24 +0000","Camden – Councillor who quit Labour group says public were ‘manipulated’ over library closure threat – Camden New Journal. &#34;West  Hampstead councillor Angela Pober has given her account of why she has quit Camden’s Labour group. As the New Journal revealed yesterday, she has resigned over concerns about the Save The West Hampstead Library campaign. Now she has released a public statement to clarify her position. It claims that the campaign continued even though it was understood the library would not close, ‘manipulating’ members of the public in a bid to get Labour to ‘look good’ by saving it. The accusation is rejected by the Labour group.&#34;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Stockton on Tees","Tue, 15 Sep 2015 21:38:24 +0000","Stockton on Tees – Billingham Library and Customer Service Centre – Designing Libraries. &#34;the challenge was to create a bright open-plan, welcoming and state of the art environment that would encompass the aspirations of both the Library Service and the Council’s Customer Services team. We wanted to ensure that we encouraged the captive audience using the council’s customer services facilities into the library space even though they may not traditionally be library users. Our brief from client was that the design should facilitate a substantial increase in both the book stock and technology provision without compromising the ease of access and movement throughout the facility. Working within the parameters of the budget constraints we set about designing the space ensuring that both services maintained their own unique brand identity.&#34;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Cornwall","Sun, 20 Sep 2015 20:06:21 +0000","Cornwall – Public consultation launched over future of Camborne Library – West Briton. &#34;Cornwall Council is hoping town and parish councils will take on library services, so the local authority can &#34;meet the required savings. It’s warned some libraries could face closure unless local councils agree to take them. Camborne town councillors are now asking residents if they would support the town council to take on the library, and how much they would be willing to pay in additional council tax to keep it open.&#34;","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["North Yorkshire","Sun, 20 Sep 2015 20:06:21 +0000","North Yorkshire – North Yorkshire library volunteers asked to come forward – Northern Echo. &#34;The controversial move to change the way libraries are run in the county sparked protests and petitions from many communities. But after months of consultation and at times emotional debate, North Yorkshire County Council approved a decision in July to make most of its libraries managed in part – or wholly – by volunteers, as it grappled with making £1.6 million worth of savings. Now those changes are to be explained in a series of information sessions, where residents can speak to library managers and find out more about helping deliver library services.&#34;","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["Herefordshire","Tue, 15 Sep 2015 21:38:24 +0000","Herefordshire – They Are Our Libraries & Museums – The Renewed Threat To Our Libraries 2015 – &#34;After a 2 year gap in which, after stopping the total closure of libraries where instead they have suffered death by a thousand cuts, we returned after the May elections to the same propostion by our out of touch council cabinet. &#34;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Sutton","Tue, 15 Sep 2015 21:38:24 +0000","Sutton – The future of Sutton’s library service: options for savings and permission to consult – Sutton Council. &#34;The purpose of this report is to outline the options for achieving the savings target of c £1m from the library service by 2018/19 from an annual budget of £4.4m. Later savings will also be required while remaining within the Act, delivering excellent services and developing a financially sustainable network which is also compliant with the Council’s public sector equality duty. &#34; … &#34;The council’s options for consultation are: Closure of Beddington library  Discontinuation of the Mobile Library service: Rationalisation of  library opening hours; Consideration of a community library model with the bulk of the workforce comprising volunteers who would work alongside some paid staff; Shared services with a neighbouring authority  Commissioning service from an external provider, such as those currently providing services in Croydon and Wandsworth.:","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Cumbria","Sun, 20 Sep 2015 20:06:21 +0000","Cumbria – Please keep using libraries – Westmorland Gazette / Letters. &#34;after asking why the library may be found shutting early or the computers are ‘playing up’, I was told that the county council offered early retirement to library staff across the county and at the same time put a stop on new recruits. As a result the staff you see there now is all that there is available. So, when a staff member suddenly goes ill or goes on leave, there is not enough staff available, and so the library shuts early.","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["Poole","Tue, 15 Sep 2015 21:38:24 +0000","Poole – Borough of Poole mobile library service to be closed – BBC. &#34;The decision to axe a mobile library in the Borough of Poole will have a &#34;devastating&#34; effect on local people, it has been claimed. The council has voted to cut the service to save £49,000 and replace it with community-led facilities. It is part of a bid to save £100,000 on public libraries in the next year. But Lib Dem councillor David Brown said the council had ignored a consultation that showed 90 per cent of people wanted to keep the service.&#34;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Buckinghamshire","Sun, 20 Sep 2015 20:06:21 +0000","Buckinghamshire – Could Staff Own Bucks’ Libraries? – Mix 96. &#34;A rethink about how Buckinghamshire’s libraries are run is happening, with half a million pounds needing to be saved. One idea is to let the staff own and run each one – something already happening in York, with the set-up meaning they can then generate income.&#34;","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["Southampton","Sun, 20 Sep 2015 20:06:21 +0000","Southampton – ‘We’ll see you in court’ – Legal threat over closure of libraries in Southampton – Daily Echo. &#34;Friends of the Cobbett Road Library are preparing to launch a landmark appeal against Southampton City Council’s decision to stop running five libraries and a mobile library. The shock bid – which is yet to be fully tabled – would follow in the footsteps of community organisations elsewhere in the country who have gone to the courts to try and overturn their respective council’s decisions to axe libraries.&#34; … &#34;But campaigners face an uphill battle to raise thousands of pounds of legal costs and ensure they have enough time to successfully have their case heard ahead of the council;s looming deadline for closures. &#34;","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["Shropshire","Tue, 15 Sep 2015 21:38:24 +0000","Shropshire – Shifnal Town Council to take over the running of Shifnal Library – Shropshire Live. &#34;Shifnal Town Council has agreed to take over the running of Shifnal Library – if the plans get a positive response from the local community. Under the plans, Shifnal Town Council would lease the library from Shropshire Council, and run it on Shropshire Council’s behalf. Opening hours would remain the same and Customer Services hours would be extended. Library staff would become staff members employed by Shifnal Town Council. The proposals would also see Shifnal Town Council take over the running of the Customer Service Point, which is located at the library and provides people with face-to-face information and advice about council services. A public consultation is launched today running through to Monday 26 October 2015 to ask people for their views on the proposed changes.&#34;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Wiltshire","Tue, 15 Sep 2015 21:38:24 +0000","Wiltshire – Wiltshire Council cuts: library staff facing more job losses – Marlborough News. &#34;Wiltshire Council’s library service appears to be facing more job losses.  Library staff have been invited to meetings in Chippenham (September 22) and in Salisbury and Warminster (September 23). The letter inviting them to the meetings tells them that their ‘position has been identified as being at risk’ – it goes on to talk about government policies and a necessary reduction in the number of posts and working hours. The process of which these meetings are part is being termed a ‘formal collective consultation’.&#34;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["East Riding of Yorkshire","Sun, 20 Sep 2015 20:06:21 +0000","East Riding of Yorkshire – East Yorkshire library savings consultation to begin – BBC. &#34;Its current budget for library services is £3.79m, the authority said. Council leader Stephen Parnaby said the consultation, starting on 29 September, would allow people to offer their ideas and views &#34;to help develop a plan&#34;. &#34;We are launching a consultation process to allow people to give us their ideas as to whether this can be done and how we can best achieve a vibrant and sustainable library service which can best meet the needs of our customers,&#34; he said.&#34;","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["Kent","Sun, 20 Sep 2015 20:06:21 +0000","Kent – Councillor calls for ban on Rolf Harris’ books from Kent libraries – Kent News. &#34;Labour councillor Peter Wallace is supporting the removal of all books written by Harris, for which he still earns money from with each sale or lending.&#34; … &#34;&#34;He was imprisoned for paedophilia. It’s such a horrible offence that I didn’t think KCC would still be lending his books.&#34;","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["Staffordshire","Tue, 15 Sep 2015 21:38:24 +0000","Staffordshire – Health trust and baptist church to take over some of Stafford’s libraries – Staffordshire Newsletter. &#34;The trust in charge of mental health services will take over the running of two of Stafford’s libraries as the county council looks to save cash. South Staffordshire and Shropshire Healthcare NHS Foundation Trust will run Baswich and Holmcroft libraries, as well as the one in nearby Brewood. And Rising Brook Baptist Church will take over the running of Rising Brook Library.&#34;","2015/09/kirklees-look-to-lose-two-thirds-staffs-takeovers-a-bibliocommons-draft-report.html"],["Fife","Sun, 20 Sep 2015 20:06:21 +0000","Fife – Crail campaigns to save library – Fife Today. &#34;Local people are mounting their own campaign against controversial proposals by Fife Cultural Trust (FCT) to close libraries across the Kingdom, in the hope of making savings of around £813,000″ … &#34;, Crail Community Council believes children and elderly people would be the biggest casualties of a local closure. Member Eileen Wood said there was a petition in place online through the community council Facebook page, and all the local shops had copies, while signatures may also be collected door to door.&#34;","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["Hampshire","Sun, 20 Sep 2015 20:06:21 +0000","Hampshire – Over 70 library staff take redundancy in Hampshire – BookSeller. &#34;Libraries are among the biggest affected with 74 staff choosing to take redundancy. Most of these are frontline library assistant staff. The cut to the library wage bill is set to save the council £947,000.&#34; … &#34;A report, due to go before the authority’s leader Councillor Roy Perry on Monday (21st September), said there will be a one-off investment to develop &#34;self-service opportunities in larger libraries&#34;.&#34; see also Seventy four library workers take redundancy as council looks to save millions – News.","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["Sutton","Sun, 20 Sep 2015 20:06:21 +0000","Sutton – £1m cuts loom for Sutton’s libraries – Guardian Series. &#34;Sutton Council must slash £1m from its £4.4m library budget and councillors will face off over the cutbacks tonight, September 17. Council leader Ruth Dombey blamed &#34;unprecedented cuts to local authority budgets by the Government&#34;, which will see the council save £74m from its budget by 2019. Diana Gerald, chief executive of reading charity the Book Trust, said: &#34;Well-resourced libraries remain a gateway to equality of educational achievement and are an affordable source of great pleasure for those who could not otherwise afford to read well, and often. &#34;","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["Lincolnshire","Sun, 20 Sep 2015 20:06:21 +0000","Lincolnshire – New volunteer-run library all set to open – Sleaford Standard. &#34;Heckington did not have an existing library building, instead being visited by a mobile library – but the parish council saw an opportunity to expand the service if funding and volunteers came together.\nParish councillors have agreed to take on the service for the next four years initially, receiving a £15,000 one-off grant for set-up costs and 4,000 books. They also saved about £6,000 by acquiring second hand library shelves and furniture from the closure of Coningsby library.&#34; … &#34;Chairman Coun Richard Higgs said they were having a structural engineer inspect the community rooms on St Andrew’s Street to decide whether to have the books on the ground or first-floor due to the weight. &#34;","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["Staffordshire","Sun, 20 Sep 2015 20:06:21 +0000","Staffordshire – NHS trust to take over eight Staffordshire libraries – BBC. &#34;South Staffordshire and Shropshire NHS Foundation Trust (SSSFT) spokesperson said &#34;a period of community engagement&#34; prior to taking over would allow the trust to decide upon opening hours and services provided by the libraries. They were not able to comment on potential running costs.&#34; … &#34;The detail of how the eight libraries would be staffed has yet to be worked out, a trust spokesperson said. County council workers will not be involved in running any of the 11 libraries.&#34; see also Delight as Barton Library is taken over by NHS trust – Burton Mail. &#34;Councillor Kennedy said: &#34;I am delighted that it will stay open. My only concern is the staff, as we still need librarians who are confident with the ins and outs of the library.&#34; see also Werrington and Blythe Bridge libraries to be run by community groups – Leek Post and Times.","2015/09/barbaric-herefordshire-and-rolf-harris.html"],["Camden","Sun, 27 Sep 2015 20:18:25 +0000","Camden – A letter from Camden Unison re proposed library cuts – Stop the privatisation of public libraries. &#34;Whatever the truth of Cllr Angela Pober’s allegations against her former Labour group colleagues regarding the campaign opposing the closure of West Hampstead library, the accusations pose serious questions over the current public consultation over the future of Camden library services. The current consultation is set to run until Tuesday 6 October, and Camden UNISON was already concerned about its weighted design that can only prove divisive. If this were, in fact, a genuine exercise to gauge the views of service users, how can West Hampstead already be safe (at least for now)? And if West Hampstead is secure, what other services face the prospect of further cuts or complete closure?  &#34;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["East Sussex","Sun, 27 Sep 2015 20:18:25 +0000","East Sussex – ‘No red lines’ as county council looks to cut more than £70m – Rye and Battle Observer. &#34;A report entitled ‘State of the County’, agreed by Cabinet in June this year, outlined initial ‘areas of search’ for next year’s savings. It listed adult social care where work could be integrated with health, plans for closer working with partner agencies in children’s services, the re-letting of the highways contract and a review of winter maintenance policy and routes, as well as the possibility of looking at a commissioning strategy for community based services such as libraries and children’s centres.&#34;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["Cheshire West and Chester","Sun, 27 Sep 2015 20:18:25 +0000","Cheshire West and Chester – Have your say on cultural services in the borough – Cheshire West and Chester Council. &#34;Cheshire West and Chester Council is asking for views on the future of its cultural services, which include libraries, museums, arts, events and historic environment (archaeology).  A public consultation on these services has been launched and will continue until Wednesday, December 2.  The consultation document and questionnaire contains background information on each of the services as well as their aspirations for working differently in the future.  Three potential future service delivery options are also explained. These are that the Council continues to retain delivery of these services, that a wholly Council-owned company is established under the direction of the Council; finally an independent social enterprise/charitable organisation could be set up to benefit from the opportunities that arise from having charitable status, e.g. gift aid. &#34; see also Town’s library and museums could be run by a charity – N&#8230;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["Sutton","Sun, 27 Sep 2015 20:18:25 +0000","Sutton – Have your say on £1m cuts to Sutton’s libraries – Sutton Guardian. &#34;The authority said it had been forced to make the cuts by &#34;unprecedented&#34; budget constraints imposed by Government. The mobile library service and Beddington Library could be closed. At a heated meeting last week Liberal Democrat councillor Steve Penneck said: &#34;I want us to try and avoid closures as far as we possibly can. &#34;[But] the fact is that the mobile library is a very expensive service. The cost for each user is relatively high because there are not a large number of users.&#34;&#34;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["Cornwall","Sun, 27 Sep 2015 20:18:25 +0000","Cornwall – Tax rise could finance Launceston library after survey by Town Council – Cornish Guardian. &#34;Taxpayers in Launceston have said they would be happy to pay more to keep the town’s library open. Launceston Town Council surveyed residents after Cornwall Council began consulting with organisations about taking over local libraries. The town council says it would be willing to take it over but only if they believe they can sustain it long term&#34; … &#34;&#34;The financial stability of the library has to be insured long-term; we don’t want to jump in with two feet and find the water’s too deep.&#34; More than 70 per cent of those responding to the survey said they would be willing to pay more tax if it meant the service remained free, and 88 per cent of responders said they used the library.&#34;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["Kirklees","Sun, 27 Sep 2015 20:18:25 +0000","Kirklees – Two libraries, 80 jobs go at Kirklees – BookSeller. &#34;The council’s cabinet members have &#34;reluctantly&#34; agreed to a &#34;huge cost-cutting shake-up&#34; which will see only eight of its current 26 libraries fully controlled and opening hours &#34;vastly&#34; reduced. The plans will mean the loss of 88 full-time roles, which could possibly amount to more than 100 employees as many hold part-time positions. The council has said they will support communities to run a further 16 small libraries with one member of paid staff to advise volunteers.&#34;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["Sandwell","Sun, 27 Sep 2015 20:18:25 +0000","Sandwell – Residents’ opinions sought as council warns frontline services may be cut – Express and Star. &#34;Under the scheme, services will be ranked in order of priority – meaning if more resources are allocated to one service it will mean cuts to another, lower ranked, service. All departments will be under review – with services including libraries, leisure centres and social care all under threat&#34; … &#34;Residents will be asked questions in face-to-face interviews, a workshop, a disabled residents workshop and also with a web-based survey.&#34;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["Enfield","Sun, 27 Sep 2015 20:18:25 +0000","Enfield – Council defends cuts after £4.4 million library refurb – Barnet Today. &#34;The plans passed by councillors before the summer mean that the local authority will concentrate its resources on these four libraries, while the 13 other libraries will be run on a smaller scale in partnership with volunteer organisations and even, Ms Orhan has suggested , business groups. Asked about the fears that focusing on four modern libraries will mean that smaller libraries are neglected and will die, Ms Orhan said she was determined to maintain a strong public library service in Enfield despite deep cuts to the local government grant. &#34;When I took over the library portfolio I knew that I wanted to retain our library service, &#34; she said. &#34;The fundamental issue in my view is that libraries are fundamental to the education, learning and cultural development of people, particularly young people, in the borough. &#34;It was always crucial to me that we retain a strong library service to serve people throughout Enfield.&#34; She said &#8230;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["Manchester","Sun, 27 Sep 2015 20:18:25 +0000","Manchester – Reading Hack Launch  – Mako Education. &#34;We are running a Reading Hack event…… So what’s a Reading Hack event I hear you say. Well basically it’s an event that gives young people aged 13-24 year olds who are interested in books and digital media a chance to try their hand at a range of digital media activities. During this event everyone will get the chance to try their hands at:   * Green Screen  * E.book Creator\n* Stop Motion Animation  * Digital Music Making. The participants will also have the chance to get involved in World Book Night, become a book mentor, help devise digital activities in libraries as well as sign up as a volunteer to gain work experience; accreditation and be able to add to your CV.&#34;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["Enfield","Sun, 27 Sep 2015 20:18:25 +0000","Enfield – Revamped Palmers Green library reopened – Enfield Independent. &#34;Interactive tables have been installed on each floor and a booklet tracing the history of Palmers Green Library has been published by the council’s local history unit, explaining how Palmers Green Library finally opened in September 1939. The improvements come as part of the overhaul of libraries in the borough, with four ‘flagship’ libraries and 13 ‘community libraries’ opening. &#34; … &#34;All flagship libraries will be open seven days a week once refurbished. &#34; … &#34;The plans also included new affordable housing built in place of the old Southgate Town hall. A new housing block has been built and the protected areas of the old building have been transformed into single bed flats for shared ownership.&#34;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["North East Lincolnshire","Sun, 27 Sep 2015 20:18:25 +0000","North East Lincolnshire – Library needs your votes to win cash and reopen – Grimsby Telegraph. &#34;Your Community Hub – the organisation that runs the former Humberston Library – and local charity Care4all have gone into partnership to take over the library, based in Durban Road on the East Marsh, with plans to transform it into a popular community centre. After seeking ideas and input from local community members on how to use the library spaces for the benefit of the local area, the plans have gained further momentum with a Hub In The Park bid being shortlisted for a share of a £400,000 Community Energy Fund run by retailer Marks & Spencer. The competition, which is judged on public votes, is being hotly contested by groups from across the country, and in the South Yorkshire category, the Hub In The Park project is top of the leader boards.&#34;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["North Yorkshire","Sun, 27 Sep 2015 20:18:25 +0000","North Yorkshire – Meetings organised for potential library volunteers – Craven Herald and Pioneer. &#34;From March, 2017, libraries in Cross Hills, Bentham, Ingleton and Settle will become completely community run, with support from the council, whereas the district’s &#34;core&#34; library in Skipton, will see a 40 per cent of current staffing levels replaced by members of the public. &#34;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["Oldham","Sun, 27 Sep 2015 20:18:25 +0000","Oldham – Sweet Dreams…. Bedtime Stories with Oldham Council Libraries (0-6 years old) – Oldham Libraries. New extended storytimes from 6 to 7pm. &#34;Sharing books with your baby or child at bedtime is a fun and loving experience. Ending the day with a story and a cuddle will help your child settle down for a peaceful night’s sleep.&#34;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["Shropshire","Sun, 27 Sep 2015 20:18:25 +0000","Shropshire – Shropshire Council’s plans to hand libraries over to groups opposed by campaigners – Shropshire Star. &#34;Protesters handed a petition to Shropshire Council yesterday against plans to close or reduce services at Shawbury Library, while others met to fight the issue affecting towns and villages across the county. Last night the Shropshire Libraries Yes Campaign was launched during a meeting at Shrewsbury United Reformed Church.&#34; … &#34;Meanwhile, Shropshire Council said that consultation into the proposed closure of Shawbury Library is set to continue – despite a 1,200-strong petition against the plans. The document was presented by Shawbury resident Kevin Richards at a full council meeting yesterday amid fears the library could be cut to a mobile service&#34;","2015/09/cilip-agm-and-the-art-of-not-taking-things-personally.html"],["Gwynedd","Tue, 29 Sep 2015 20:51:14 +0000","Gwynedd – Relocating library to leisure centre ‘offers better facilities’ – Cambrian News. A Welsh Government grant of £250,000 has been secured by Gwynedd Council to relocate the lib­rary from Chapel Street to Porthmadog’s Glaslyn Leisure Centre. The authority says the move will provide library users with better facilities and also save them around £18,000 a year. Gwynedd Council say the remaining £60,000 needed for the building work and the relocation will be funded by themselves, including money raised from the sale of the old library building. The new developments would mean the library will be open for more hours, including over lunchtime. Other improvements will include more tablet computers available to library users, a larger children’s section, a video-conferencing room, better disability access and more parking spaces.&#34;","2015/09/lewisham-claim-making-staff-redundant-enhances-their-service-and-refugees.html"],["Lincolnshire","Tue, 29 Sep 2015 20:51:14 +0000","Lincolnshire – Lincolnshire library to shut for good due to lack of funding – Lincolnshire Echo. &#34;The library at Wragby will shut later today as there are not enough funds to keep it open, volunteers who run it say once rent has been paid there is only £1,000 left to run it for the year. Barbara Bartlett, one of the volunteers set up to run the library, said the decision to shut it was due to a lack of support from Lincolnshire County Council. She told BBC Radio Lincolnshire: &#34;The library will shut at one o’clock today and as I speak now we have no reopening date and I think that is a very poor show from Lincolnshire County Council.&#34;","2015/09/lewisham-claim-making-staff-redundant-enhances-their-service-and-refugees.html"],["Lambeth","Tue, 29 Sep 2015 20:51:14 +0000","Lambeth – Fun Palaces Countdown: Serendipity Tours With Stephann Makri – Signal in Transition. &#34;As the 2015 Fun Palaces launch on Saturday 3rd October approaches, Lambeth Libraries are gearing up for their borough-wide, simultaneous 11-venue celebration of arts and sciences. In the countdown to Lambeth Libraries’ Fun Palaces, I’ll be featuring some of the amazing activities and special guests we’ve got lined up for Londoners this weekend. … &#34;","2015/09/lewisham-claim-making-staff-redundant-enhances-their-service-and-refugees.html"],["Lewisham","Tue, 29 Sep 2015 20:51:14 +0000","Lewisham – Savings report appendix – Lewisham Council –  &#34;creation of three Hub Libraries – Deptford Lounge, Lewisham and Downham Health & Leisure Centre – which will carry an enhanced role for face to face contact between the Local Authority and the public to support the digital by default agenda.. 2.the extension of the Lewisham Community Library Model to Forest Hill, Torridon, and Manor House, in partnership with other council services and community 3. Description of service area and proposal organisations. And the integration of the library provision into the repurposed ground floor space within the Catford complex (Laurence House). 3.the regarding of front line staff to include new functions through the re-training and enhancement of front line roles&#34;","2015/09/lewisham-claim-making-staff-redundant-enhances-their-service-and-refugees.html"],["Newcastle","Tue, 29 Sep 2015 20:51:14 +0000","Newcastle – Primary school pupils put new Newburn library through its paces – Chronicle. &#34;Newburn Library has been closed for seven months of refurbishment, but reopened this week …The renovation – part financed by contributions from Newcastle City Council’s local ward funds and a grant from the Good Stewardship fund – has seen improvements including a ramp from the roadside to a set of new automatic entrance doors, a new lift and staircase, an accessible public toilet and baby changing area, a community room, and new shelving, furniture, and carpets.&#34;","2015/09/lewisham-claim-making-staff-redundant-enhances-their-service-and-refugees.html"],["Sheffield","Tue, 29 Sep 2015 20:51:14 +0000","Sheffield – Sheffield City Council thanks library volunteers – BBC. &#34;Volunteers who have taken control of 14 former local authority libraries in the past 12 months have been praised for their hard work in keeping them open. Labour-run Sheffield City Council relinquished control of the facilities in September 2014 citing government budget cuts. More than 600 volunteers have come forward to ensure they stayed open. Councillor Isobel Bowler said: &#34;We’re deeply grateful for all they work they have done.&#34; Ten of the libraries are classed as &#34;associate&#34; libraries with the council providing up to £262,000 support per year until 2016/17″","2015/09/lewisham-claim-making-staff-redundant-enhances-their-service-and-refugees.html"],["Southampton","Tue, 29 Sep 2015 20:51:14 +0000","Southampton – Council can do job – Daily Echo / Letters. &#34;There is only one community group able to run our library service and that is Southampton City Council. Libraries run by community groups are unlikely to provide the same quality of service over the long-term. If the council does not have the resources it needs it is the duty of councillors to secure more funding from central government, businesses or from the public directly.&#34;","2015/09/lewisham-claim-making-staff-redundant-enhances-their-service-and-refugees.html"]]