[["Barnet","Wed, 01 Jun 2016 19:54:25 +0000","Barnet – Have your say over Barnet’s future library service – This is Local London. &#34;In partnership with Barnet council, individuals, community groups, not-for-profit and voluntary organisations are invited to help run the East Barnet, South Friern, Mill Hill and Childs Hill libraries. The new Partnership libraries are part of recent plans to reshape the library service that will keep all 14 libraries open. Cllr Reuben Thompstone, Chairman of Children Education Libraries and Safeguarding committee, said it is a &#34;unique opportunity for local groups and residents.&#34;","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["Bracknell Forest","Wed, 01 Jun 2016 19:54:25 +0000","Bracknell Forest – Funding cuts at Bracknell Forest Council may see Bracknell library service threatened – Bracknell News. &#34;Four engagement events will be held across the borough this June in addition to an online survey and paper questionnaires. The events will give residents the chance to share their thoughts on how to adapt the library service to meet the financial challenges whilst still providing a good service&#34;","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["Westminster","Wed, 01 Jun 2016 19:54:25 +0000","Westminster – Hamlet Re-telling The Book’s The Thing Comes To Westminster Reference Library – Broadway World. &#34;Librarian Theatre are a new theatre company who create shows based on classic plays and stories, and adapt them to be performed between the bookshelves at libraries and bookshops. Having been on a huge tour of the country they are doing their final date on 3rd June 7.30pm Westminster Reference Library before touring a new show in autumn 2016.&#34; … &#34;Librarian Theatre have been working in partnership with Hertfordshire Libraries since last June, and the initial idea was met with widespread support when they crowdfunded over £6,000 in October to get the project started, with praise shared on Twitter from big literary names such as Margaret Atwood, Mark Haddon and Joanne Harris, and an article about the campaign featured in The Stage. In early 2016 Arts Council England awarded a grant of just under £49,000 from National Lottery funds to support the production on a 10 week tour to over 40 UK libraries.&#34;","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["Bury","Wed, 01 Jun 2016 19:54:25 +0000","Bury – Libraries at risk in Bury as council looks to make further savings after government cuts – Manchester Evening News. &#34;Bury council says it must find ways of delivering savings over the next four years whilst continuing to meet its legal duties to provide ‘comprehensive and efficient’ services. The report says: &#34;The council remains fully committed to retaining a high quality library service in the borough but anticipates that there will need to be changes, including the possibility of a reduction in the number of libraries.&#34;","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["Cumbria","Wed, 01 Jun 2016 19:54:25 +0000","Cumbria – Council consults on changes to library opening hours in South Lakeland – Westmorland Gazette.","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["Oldham","Wed, 01 Jun 2016 19:54:25 +0000","Oldham – Thieves are stealing reference books from Oldham libraries to sell online – Manchester Evening News. &#34;Staff at libraries across Oldham believe about £7,000 worth of reference titles [From context, I think these are non-fiction lending rather than reference stock – Ed.] have been taken in two months – with crooks checking the value of the books first on smart phones&#34; … &#34;The brazen crooks have taken out library membership under false names to get access to non-fiction books and are suspected of selling them via a specialist app. In one incident, a woman member of the gang walked out with scores of books hidden in a pram.&#34; … &#34;They target non-fiction books, manuals, and guides, for things like gardening and plumbing. These books, often with many photographs in, are worth £30 to £40 each.&#34; The gang has struck at about six libraries in Oldham, Failsworth, and Uppermill.&#34;","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["Swindon","Wed, 01 Jun 2016 19:54:25 +0000","Swindon – Youngsters urged to get creative as libraries campaign launches poster and poetry competition – Swindon Advertiser. &#34;&#34;The issue was among the top election topics at the recent Borough Council elections and the campaigners have now been invited as key stakeholders to input to the draft strategy due to be presented to the Cabinet and Council in the next few months&#34; … &#34;The campaign is looking now to younger library users to get creative and write a poem or design a poster under the theme Love My Library.&#34; &#34; [Volunteer from Walcot Library complains campg","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["Darlington","Wed, 01 Jun 2016 19:54:25 +0000","Darlington – Darlington councillors fail to back campaign to save library – Northern Echo. &#34;As few as three councillors have pledged their support to The Northern Echo’s campaign to save Darlington’s central library from imminent closure. A poll of the town’s 50 borough councillors revealed the majority have yet to declare any interest in supporting the campaign or the petition, which has so far attracted almost 7,000 signatures. We contacted all 50 of the borough’s councillors to ask if they had signed the petition to save Crown Street library – but only 20 replied. Of those, seven declared their support although just three said they have actually signed the petition – Liberal Democrats Anne-Marie Curry and Fred Lawton and independent Kevin Nicholson.&#34;","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["Lambeth","Wed, 01 Jun 2016 19:54:25 +0000","Lambeth – Libraries war of words continues – Brixton Blog. &#34;In a letter to Peck, Friends of Lambeth Libraries chair Laura Swaffield appeals for a meeting to discuss the issues, saying that exchanging letters is not a good substitute. She said that there was &#34;no sign – even now – of even a basic business plan&#34; for four of Lambeth’s ten libraries,  which face closure or conversion to &#34;heathy living centres&#34;. &#34;Set against this, all you can do is seize on a mistake I made quoting one figure. That looks a bit desperate.&#34;","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["Sheffield","Wed, 01 Jun 2016 19:54:25 +0000","Sheffield – Festival to inspire city’s outdoor adventurers – Star. &#34;The Outdoor City Adventure Book Festival is a first for Sheffield Libraries and will be an opportunity for people who love outdoor adventure to spend two days immersed in literature, film, poetry and crafts.&#34;","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["Suffolk","Wed, 01 Jun 2016 19:54:25 +0000","Suffolk – ‘Back to school’ for Suffolk’s smallest library that is on the move – Diss Express. &#34;Debenham Resource Centre, in Cross Green, is moving from its current home to take up a larger space within Sir Robert Hitcham Primary School … It will feature wheeled shelving, as well as being more accessible for school children.&#34;","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["Telford","Wed, 01 Jun 2016 19:54:25 +0000","Telford – Six Telford libraries are saved from the axe – Shropshire Star. &#34;After consultation with residents, the council said it would continue to run Newport and Madeley Library but review opening hours. Town councils covering Dawley, Donnington and Stirchley libraries along with the the Hadley Learning Community supported by Hadley and Leegomery Parish council agreed to take over the running of their libraries. Nobody came forward to run the borough’s mobile library. The changes mean that now all the borough’s libraries can be kept open, with changes to opening hours, more self-service machines and a charge for services like ancestry searches.&#34;","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["York","Wed, 01 Jun 2016 19:54:25 +0000","York – York libraries could be in line for a huge funding boost – York Press. &#34;Explore York Libraries and Archives was formally given charitable status by the tax office this year, a move the organisation’s boss says will open up a whole world of philanthropy and giving. The mutual organisation presented its annual report to councillors last week, and chief executive Fiona Williams spoke to members of a learning and culture committee about progress in the last year.&#34; … &#34;A new website has launched, and good news has also come from the Arts Council which has confirmed a £97,000 grant to York Explore over the next three years, to develop it as a &#34;cultural hub&#34; for the city.&#34;","2016/06/its-not-enough-to-just-be-aware-of-what-is-going-on-in-uk-libraries.html"],["Barnet","Sun, 05 Jun 2016 20:59:28 +0000","Barnet – Barnet Libraries Festival of Learning – Barnet London Borough. &#34;Barnet Libraries is inviting local residents to start a family tree, learn how to knit, tell stories with Lego or explore local history as part of the national 2016 Festival of Learning.&#34; see also Libraries will host 98 separate events during festival of learning – North London Newspapers.","2016/06/waiting-for-things-to-happen.html"],["North Yorkshire","Sun, 05 Jun 2016 20:59:28 +0000","North Yorkshire – Craven libraries celebrate Bookstart Week – Craven Herald. &#34;This year’s theme is Under the Sea and children will be able to make their own shark hats, take part in nautical rhyme-times and be creative with colouring sheets. Each youngster will also receive a free copy of the picture book A Hole In The Bottom Of The Sea, by Jessica Law, courtesy of the BookTrust.&#34;","2016/06/waiting-for-things-to-happen.html"],["Suffolk","Sun, 05 Jun 2016 20:59:28 +0000","Suffolk – Volunteers needed as Suffolk Libraries get set to launch Roald Dahl themes Summer Reading Challenge – EADT. &#34;More than 800,000 primary school children took part in the event last year, making 2015 the most successful year to date. Now, each library within Suffolk is on the hunt for volunteers to help run activities for children as part of the challenge, and to talk with them about the books they have read.&#34;","2016/06/waiting-for-things-to-happen.html"],["Barnet","Sun, 05 Jun 2016 20:59:28 +0000","Barnet – ‘Shame on you Barnet Council – librarians change children’s lives’ – council’s plea for library volunteers sparks outrage – This is Local London. &#34;People are outraged over Barnet council’s volunteer plea for volunteers to run the borough’s libraries. Community groups and individuals invited to be a part of the borough’s future library service say you &#34;cannot replace professionals with volunteers.&#34; Adele Winston of Barnet said: &#34;Shame on you Barnet Council. Librarians are not dustbin men, who though indispensable do not need a university education. &#34;They are highly-trained professionals who can change the lives of children who visit libraries. They certainly changed mine.&#34;","2016/06/waiting-for-things-to-happen.html"],["Lancashire","Sun, 05 Jun 2016 20:59:28 +0000","Lancashire – MP calls for county council to be placed in special measures – Longridge News. Conservative MP on Labour council. &#34;I have serious concerns about Lancashire County Council, and am of the opinion that many of the funding choices they have made in recent months have been politically motivated and have discriminated against rural areas of the county … &#34;This has been confirmed to me after the recent announcement that eight libraries are to be closed in the Ribble Valley. This has come hot on the heels of a fiasco over the funding of bus services, with the 1,500 residents of Sabden being left totally stranded and without any service.&#34;","2016/06/waiting-for-things-to-happen.html"],["Shropshire","Sun, 05 Jun 2016 20:59:28 +0000","Shropshire – Why libraries boost our quality of life – Shropshire Star / Phil Gillam. &#34;I have long held the belief that one way of measuring how civilised a nation is would be to examine the quantity and quality of its art galleries, museums and libraries.&#34; … &#34;These are the quiet places in towns and cities. These are the places largely disinterested in making money. These are the places that offer sanctuary from the hustle and bustle of busy streets. And they’re also the places that (it could be argued) serve no practical purpose whatsoever. Yet, just imagine what a terribly impoverished country we would inhabit if all the art galleries, museums and libraries were to close for good&#34;","2016/06/waiting-for-things-to-happen.html"],["Bury","Sun, 05 Jun 2016 20:59:28 +0000","Bury – Libraries face closure in bid to save money – Bury Times. &#34;Bury Council’s ruling Labour group says in a new report that it &#34;anticipates that there will be a need for changes, including the possibility of a reduction in the number of libraries.&#34; This, says the council report, is &#34;in response to the continued pressures on council budgets&#34; though the report does not say how much money any service cuts might save.&#34;","2016/06/waiting-for-things-to-happen.html"],["Hull","Sun, 05 Jun 2016 20:59:28 +0000","Hull – A flag for Hull pilot session at Hull Central Library – Creative Briefs. Pictures from children’s consultation / crafts session.","2016/06/waiting-for-things-to-happen.html"],["Shropshire","Sun, 05 Jun 2016 20:59:28 +0000","Shropshire – Shropshire Council not backing down on cutbacks – Shropshire Star. &#34;The authority said talks with town and parish councils about taking over such assets to prevent them from closing had been &#34;encouraging&#34; and would continue over the next few months. It comes after officials at Church Stretton Town Council and Ludlow Town Council requested more time to manage the transfer of services. The services will need to be funded or managed by town councils or third party organisations from April 2017 as Shropshire Council plans to cut its leisure and culture budget to zero as part of cost-saving measures. Venues under threat in the two towns include Ludlow Library and Museum Resource Centre, Church Stretton Library, South Shropshire Leisure Centre and Teme Church Stretton Leisure Centre.&#34; … &#34;Councillor Michael Walker, mayor of Church Stretton, wrote to Malcolm Pate, leader of Shropshire Council, saying time allowed was &#34;unrealistic&#34; and &#34;way beyond the capacity&#34; of either town council or Shropshi&#8230;","2016/06/waiting-for-things-to-happen.html"],["Stockton","Sun, 05 Jun 2016 20:59:28 +0000","Stockton – Closure plan for two Stockton borough libraries opposed by campaigners – Northern Echo.","2016/06/waiting-for-things-to-happen.html"],["Cheshire West and Chester","Sun, 05 Jun 2016 20:59:28 +0000","Cheshire West and Chester – Mobile Library consultation – Cheshire West and Chester Council. &#34;Following a Library Service review in 2014, and a reduction in the number of mobile library vehicles, it has been necessary to review the current service provided by the Mobile Library. The briefing document explains the current provision by the Mobile Library and also outlines the proposal of how the service would be delivered in the future. &#34;","2016/06/waiting-for-things-to-happen.html"],["Enfield","Sun, 05 Jun 2016 20:59:28 +0000","Enfield – ‘Morally shameless&#39;: MP accused of political point-scoring on future of Enfield libraries – This is Local London. Conservative MP on Labour council. &#34;He said he is worried that the move will not retain all services and &#34;only three shelves of books&#34; will be available at the new facility. However, Enfield’s cabinet member for children’s services and libraries Cllr Ayfer Orhan said they have made plans for all the services available at Southgate Circus to be available in the college, and accused Mr Burrowes of trying to score political points.&#34;","2016/06/waiting-for-things-to-happen.html"],["Glasgow","Sun, 05 Jun 2016 20:59:28 +0000","Glasgow – Glasgow library shut for urgent repair work – Evening Times. Masonry problems near entrance at Langside Library means closure for repairs.","2016/06/waiting-for-things-to-happen.html"],["Sheffield","Sun, 05 Jun 2016 20:59:28 +0000","Sheffield – Benefits of Libraries – Star. Council says &#34;&#34;Massive cuts from central government mean that it would be impossible for all our libraries to stay open without the wonderful work the volunteers put in … We support them by providing training and support with things like operating the library computer system for issuing books, but – because they’re independent organisations and not part of the council’s statutory service – we do not specify what data they should monitor&#34;","2016/06/waiting-for-things-to-happen.html"],["Shetland","Sun, 05 Jun 2016 20:59:28 +0000","Shetland – Praise for Unst library Bookbug event – Shetland Islands Council. &#34;The intergenerational session brought together young children, parents, grandparents and centre residents to share songs, stories and rhymes. Julie Thomson said: &#34;Bookbug sessions with bairns and parents is wonderful and this time we took Bookbug to Nordalea, so everyone could join in with the songs and actions. We hope to make the Nordalea event a regular activity now, as well as continuing to run weekly sessions at the nursery and also at UnstFest.&#34;&#34;","2016/06/waiting-for-things-to-happen.html"],["Stockton","Sun, 05 Jun 2016 20:59:28 +0000","Stockton – Pensioner forced to stand outside Fairfield Library to petition against its closure – Gazette. &#34;She has been forced to stand outside the premises to ask for signatures – as the petition cannot be put on public display in the library. But dozens of book lovers joined Enid at the library to make their voices heard to the council at a meeting last week. She said: &#34;People today are despondent. I think it has been decided but we feel that we have to do something. I’m still fighting.&#34; … &#34;The petition is under the counter and the librarians are not allowed to mention it.&#34;","2016/06/waiting-for-things-to-happen.html"],["Lancashire","Sun, 05 Jun 2016 20:59:28 +0000","Lancashire – Cash-strapped Lancashire local authorities lose more than £1m – Citizen. £500k lost by council due to collapse of training company. &#34;County Tory group chairman and Oswaldtwistle county councillor Peter Britcliffe is angry at the wasted cash when the authority is closing libraries and young people’s centres to save £200million by 2021. &#34;","2016/06/waiting-for-things-to-happen.html"],["Reading","Sun, 05 Jun 2016 20:59:28 +0000","Reading – National Bookstart Week: go under the sea in Reading’s libraries – Get Reading.","2016/06/waiting-for-things-to-happen.html"],["Barnet","Fri, 10 Jun 2016 10:43:28 +0000","Barnet – ‘Book start or book stop?’ – Tireless campaigners say council’s library events scream ‘hypocrisy’ – This is Local London. &#34;The National Bookstart Week, running from June 6-12, in libraries across Barnet, is a celebration of BookTrust’s flagship reading programme – and protesters have welcomed this initiative. However, people are arguing that the decreased number of library staff and opening hours, will mean less of these programmes for children in the near future.&#34;","2016/06/open-minds-open-libraries-but-whats-on-the-sclhorizons.html"],["Barnet","Fri, 10 Jun 2016 10:43:28 +0000","Barnet – Council calls on communities to run its libraries – North London Press. &#34;Residents and community groups in Barnet are being invited to help run four of the borough’s libraries in partnership with Barnet Council. The four libraries, to be known as partnership libraries, are at East Barnet, South Friern, Mill Hill and Childs Hill. A council spokeswoman said: &#34;We are now inviting community groups, not-for-profit and voluntary organisations and groups of residents to come forward to run the new partnership libraries.&#34;","2016/06/open-minds-open-libraries-but-whats-on-the-sclhorizons.html"],["Barnet","Fri, 10 Jun 2016 10:43:28 +0000","Barnet – Strike planned for libraries in Barnet – Socialist Worker. &#34;Barnet council library workers in north London were set to strike for three days from Monday of next week against the Tory council’s plans to outsource the library service. The Unison union members are fighting 47 percent cuts to library posts. Staffed hours at libraries are to be cut by 70 percent. This will mean for most of the time libraries are open under 15 year olds unac-companied by an adult will not be able to use libraries.&#34;","2016/06/open-minds-open-libraries-but-whats-on-the-sclhorizons.html"],["Barnet","Fri, 10 Jun 2016 10:43:28 +0000","Barnet – ‘We need to take action’ – Barnet library workers to strike over cuts to service – Times Series. &#34;Barnet library workers are inviting people to join them on the picket lines as they take industrial action from Monday June 13, to voice their frustration over the Council’s plan to outsource the library service. Barnet Unison represents around 3,000 members in Barnet Council, Barnet & Southgate College, as well as schools and contractors across the borough. Unison representative and libraries convenor, Hugh Jordan, said: &#34;We need to force the council into having meaningful negotiations, we are trying to do something, and we as a branch cannot stand back.&#34;","2016/06/open-minds-open-libraries-but-whats-on-the-sclhorizons.html"],["Bury","Fri, 10 Jun 2016 10:43:28 +0000","Bury – Ramsbottom library could also be under threat as Bury council looks to cut – Rossendale Free Press. &#34;Ramsbottom Library could be under threat after council bosses admitted they may decide to close some of their libraries as part of a cost-saving review.&#34;","2016/06/open-minds-open-libraries-but-whats-on-the-sclhorizons.html"],["Brighton and Hove","Fri, 10 Jun 2016 10:43:28 +0000","Brighton and Hove – Greens and Tories join forces to vote down Hove Library sell-off – Argus. If so, this will be the first big defeat for the Labour administration. &#34;Greens secured the future of Hove Library in its present home, while committing the Council to keep ALL of its libraries open for the foreseeable future. Following a joint amendment submitted by the Greens and the Conservative Group (Addendum Two Pack 09.06.16), the city’s libraries were preserved with a £100,000 investment from an unexpected underspend in Council finances this year.&#34; … &#34;The irony of working with the Conservatives is not lost on us.  This is a party whose national austerity agenda has created the local government finance crisis in the first place, and who are directly responsible for the threat to libraries and a host of other services.  Yet Hove Library was an issue where rising above our political differences was necessary to secure the best outcome for the city.&#34; see also Hove Library sell-off hits a wall of opposition – Brighton and &#8230;","2016/06/open-minds-open-libraries-but-whats-on-the-sclhorizons.html"],["Cambridgeshire","Fri, 10 Jun 2016 10:43:28 +0000","Cambridgeshire – Backlash as cash-strapped Cambridgeshire County Council bring in £1 charge on book reservations – Cambridge News. &#34;The county council says this is yet another consequence of the ongoing cuts in its funding from the Government, which has resulted in the council having to take tough choices to cuts in areas like social care and transport, as well as the library service. But resident Richard Stevenson said: &#34;They’re going to charge £1 for ordering books, this means people in the villages will no longer have access to a free library service. The books I want to read are never in at my local library, I have to order them from town and it’s an excellent free service.&#34; [My own authority has been happily charging £1 per adult book reservation for years with no problems – Ed.]","2016/06/open-minds-open-libraries-but-whats-on-the-sclhorizons.html"],["Central Bedfordshire","Sun, 12 Jun 2016 19:32:42 +0000","Central Bedfordshire – Have your say on library changes – Biggleswade Today. &#34;Its Library Servicehas set out plans for a total reduction of 30 hours split across its 12 libraries, which will help make £85,000 in savings while maintaining a professionally run service&#34; Consultation. &#34;Under these proposals, all libraries will be placed into three categories – Community Libraries, Area Libraries and Main Libraries – each with uniform opening hours, which will include being closed on one day during the week&#34;","2016/06/labouring-the-point-honours-and-autism.html"],["Dorset","Sun, 12 Jun 2016 19:32:42 +0000","Dorset – Future of Dorset’s mobile libraries to be decided next week – Daily Echo. &#34;Following a public consultation Dorset County Council’s People and Communities Overview and Scrutiny Committee will consider the withdrawal of three mobile library vans at a meeting on Thursday, June 16. A decline in the number of users and &#34;unprecedented&#34; budget pressures have been cited by Dorset County Council to justify the plan. The council has also said axing the mobile library service is part of its plan to save £1million over the next three years.&#34;","2016/06/labouring-the-point-honours-and-autism.html"],["Herefordshire","Sun, 12 Jun 2016 19:32:42 +0000","Herefordshire – Words Fail Me: Public Libraries 1964-201? – YouTube / Trish Marsh. &#34;am both saddened and infuriated by a decade of cuts (actual and planned) to council budgets and the lack of public awareness of their impact on the quality of our shared life together. Cuts to cultural spend (as well as many other areas) have been deep and are continuing. Surprised to find very few artist responses, I wanted to find a visual way to communicate and turned to the medium of satire and film, a new discipline for me. My thanks to the many students and others at Hereford College of Arts and beyond who have been essential elements in translating my initial concept into film.&#34;","2016/06/labouring-the-point-honours-and-autism.html"],["Haringey","Sun, 12 Jun 2016 19:32:42 +0000","Haringey – Muswell Hill Library Public Engagement – Haringey Council. &#34;We are consulting on proposals to relocate Muswell Hill Library to an alternative site at 54/56 Muswell Hill (the site of the old Green Man pub). We have committed to maintaining and investing in our library service and we know they are a valuable resource in our communities. To provide a modern and accessible service, Muswell Hill Library needs adaptations and repairs to the building. There is currently no lift in the building to access the children’s library on the first floor, and no accessible toilets for library users or staff. Level access to the ground floor entrance is provided by a limited elevated platform lift at the side of the building.&#34;","2016/06/labouring-the-point-honours-and-autism.html"],["Shetland","Sun, 12 Jun 2016 19:32:42 +0000","Shetland – Richard Coles fans the flames of library Twitter war – Shetland Times. &#34;Desperate to compete with Orkney the Shetland Library tried in vain to entice Take That star Gary Barlow to pay a visit. Now the Twitter war seems likely to rage given that the journalist, Reverend and former Communards star Richard Coles has popped in for tea, lemon cake and an impromptu recording session. Mr Coles explained that the visit came about &#34;through the magic of Twitter.&#34; After seeing the &#34;very strong and funny presence&#34; that the Shetland Library has on Twitter Mr Coles became involved in the tweet war between the two libraries and JK Rowling. When Shetland Library later realised that Richard would be paying a visit to the isles they were quick to entice him with lemon cake. The cake was baked by librarian Nicola Sinclair, not at all like the ready made supermarket cake which Orkney Library purchased for JK Rowling’s visit.&#34; JK Rowling then compares the feud to the Montagues and Capulets.","2016/06/labouring-the-point-honours-and-autism.html"],["Surrey","Sun, 12 Jun 2016 19:32:42 +0000","Surrey – Boom in children’s library book borrowing in Surrey – Surrey News. &#34;Children borrowed more than two million fiction books from Surrey libraries in the last year – the highest figure for more than a decade. It means fiction borrowing by under-13s has risen nearly a third since 2002 – and five per cent in the last year alone.&#34; Many events listed. &#34;The new figures emerged as Surrey County Council’s Cabinet approved plans to relocate Horley Library to a more accessible location and create a service which will better meet the needs of 21st century readers, with a business wi-fi area and leisure study area as well as the usual range of books and other services.&#34;","2016/06/labouring-the-point-honours-and-autism.html"],["Barnet","Tue, 14 Jun 2016 20:46:49 +0000","Barnet – Six libraries closed due to industrial action – North London Today. &#34;More than 70 staff members from libraries across the borough of Barnet are out on strike today over cuts to library services.&#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["Bedford","Tue, 14 Jun 2016 20:46:49 +0000","Bedford – Bedford Borough libraries under threat as council releases proposed strategy – Bedfordshire News. &#34;More than 3,000 people shared their views on which services should be prioritised, which are the most popular and how libraries could best be run with a reduced budget during the first stage.&#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["Blaenau Gwent","Tue, 14 Jun 2016 20:46:49 +0000","Blaenau Gwent – A revamped Ebbw Vale Library will open soon and here’s how it will look – Wales Online. &#34;The refurbishment is expected to transform service delivery at Ebbw Vale , enabling greater community involvement, improved IT facilities and providing an opportunity to increase partnership work with a wide range of organisations&#34; … &#34;The project has been funded by a Welsh Government Museums and Libraries grant and a contribution from the Welsh European Funding Office Convergence Programme. The fully refurbished library will provide a valuable, multipurpose community space which the council say is relevant to the community today and caters for everyone.&#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["Lancashire","Tue, 14 Jun 2016 20:46:49 +0000","Lancashire – More views sought on plans to close libraries and children’s centres – Champion. &#34;The authority has already received around 1,000 responses since the launch of a public consultation on May 18. The consultation, running for 12-and-a-half weeks, seeks residents views on plans to save millions of pounds by reducing the number of buildings the council owns and rents.&#34; … &#34;We’ve made hard copies of the consultation document available as well and unfortunately one of the consultation questions was omitted in error from the localised versions. This has been quickly rectified so few people will have completed one of these, but we’d like everyone who has done so to be aware of it and to feel free to complete the extra question if they have anything else to add to the comments they’ve already made.&#34;&#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["West Berkshire","Tue, 14 Jun 2016 20:46:49 +0000","West Berkshire – Legality of council’s library proposals remains unclear – Newbury Today. &#34;West Berkshire Council has refused to release details of what was discussed at an internal board meeting about its proposals to close eight of the district’s nine libraries. It is also remaining tight-lipped over what legal advice it was given regarding the controversial plans. However, following a Freedom of Information request from a campaigner, the council has released some of the correspondence between itself and the Department for Culture, Media and Sport (DCMS), though some emails have not been made available and key pieces of information are blacked out in several others. While the email exchanges do provide some transparency, it does little to answer questions as to whether the council’s original proposals were legal&#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["York","Tue, 14 Jun 2016 20:46:49 +0000","York – Concerns raised over charity model for York libraries – BookSeller. &#34;We are in our third year of independence now,&#34; Williams said. &#34;It’s been a hard slog, but we have received a lot of good news recently as a result of our hard work. Getting charitable status is crucial to financial plans for the organisation as it can now look into things like Gift Aid and payroll giving to encourage people to support the libraries financially&#34;. However, some library campaigners have expressed concerns about the charity model of library ownership. Elizabeth Ash, trustee of the Library Campaign, told The Bookseller: &#34;The accountability to the local taxpayers is likely affected[…], with the charity not under the same obligation to report to local communities as the council would have been when the libraries were in direct council control. Charitable status will allow York Explore to boost funds by accepting gift aid on donations, but should local people really be donating to keep a library service running that the local counc&#8230;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["Brighton","Tue, 14 Jun 2016 20:46:49 +0000","Brighton – Specialist book sale at Jubilee Library – Brighton and Hove Libraries Blog. &#34;A great opportunity has come up for lovers and collectors of specialist books to expand their collections!  Jubilee Library is holding an ex-stock sale from 23rd-26th June, focusing on Art and Design, Music, Vintage/Historical Periodicals, Architecture and much more.  Pre-sale viewings and offers welcome&#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["Lambeth","Tue, 14 Jun 2016 20:46:49 +0000","Lambeth – Concern for missing Upper Norwood library campaigner – Croydon Guardian.","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["Central Bedfordshire","Tue, 14 Jun 2016 20:46:49 +0000","Central Bedfordshire – Sandy and Potton libraries could be set for longer opening hours if Central Bedfordshire Council plan approved – Comet. &#34;The unitary authority is proposing to shorten the opening hours at nine of its 12 libraries in a bid to save money, but its changes would actually see Sandy and Potton’s libraries open for an increase of two and a half hours and two hours respectively each week&#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["North Somerset","Tue, 14 Jun 2016 20:46:49 +0000","North Somerset – Weston-super-Mare Library’s ‘amazing’ success – Mercury. &#34;The number of people using Weston Library has doubled since 2010, leading one councillor to hail the relocation of the facility as a ‘great success’ for the town.&#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["Torfaen","Tue, 14 Jun 2016 20:46:49 +0000","Torfaen – Torfaen kids come out in force for national literature week – South Wales Argus. &#34;More than 40 youngsters attended the sessions as part of National Bookstart Week, which celebrates the benefits of reading every day and sharing stories, books and rhymes with young children. &#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["Fife","Tue, 14 Jun 2016 20:46:49 +0000","Fife – Councillor’s concern over Fife mobile library review – Courier. &#34;Fife Cultural Trust is currently consulting on proposed new routes and is seeking feedback from the public before Friday’s closing date. But Glenrothes West and Kinglassie councillor Julie Ford has voiced her concern that Kinglassie is conspicuous by its absence on the planned new schedule.&#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["Gloucestershire","Tue, 14 Jun 2016 20:46:49 +0000","Gloucestershire – A Prize for Gloucestershire Libraries – Honourable Company of Gloucestershire. &#34;The prize will be for an initiative by a library that demonstrates the power of reading, leading to more borrowing, reading and discussion of books. It should also encourage community support and volunteers in the libraries. The panel of independent judges will consider submissions in order to select a short list of up to four libraries. The judges will be looking principally for initiatives that have resulted in more reading by people of all ages, from children to the elderly. They will also take into account the relative size of the libraries, the role of volunteers and community support, and the libraries will be visited before the winner is determined.&#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["Herefordshire","Tue, 14 Jun 2016 20:46:49 +0000","Herefordshire – Video takes a satirical look at Herefordshire library cuts – Herefordshire Live. &#34;Frustrated by the authority attitude to libraries – a public service famously described as &#34;not a luxury but one of the necessities of life&#34; – Leominster art student Trish Marsh has produced a video. It’s not big budget and it probably won’t go viral, but it’s an important (and sardonic) 9-minute long look at where library cuts might lead.&#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["Lancashire","Tue, 14 Jun 2016 20:46:49 +0000","Lancashire – Property strategy consultation 2016 – Lancashire County Council.  Lists all properties, shows what services will continue to be provided or, far more often, what will stop altogether. Invites views.","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["West Berkshire","Tue, 14 Jun 2016 20:46:49 +0000","West Berkshire – Council’s libraries assessment is underway – Newbury Today. &#34;independent assessment of West Berkshire Council’s library service started last month. The council was told by the Department for Culture, Media and Sport (DCMS) that it must carry out a Needs Assessment before closing any of its libraries. The aim of the assessment is to inform how the service should be developed in the future. The Needs Assessment will be based on a wide range of information including data on how it is currently used, the demographics of communities and the responses to the public consultation held earlier this year. The assessment will take around three months to complete with a report expected to be provided to the council by the end of August.&#34;","2016/06/how-i-learned-to-stop-worrying-and-love-wikipedia.html"],["Barnet","Wed, 15 Jun 2016 21:56:25 +0000","Barnet – Stop the cuts to Chipping Barnet Library – 38 Degrees /Petition. &#34;Stop outsourcing our libraries. Cancel implementation of the Barnet’s Future Library Service plan . Work with all stakeholders in the Library Service to produce a strategy that will minimise redundancies and maintain and improve the quality and accessibility of Barnet Libraries&#34;","2016/06/selling-on-to-amazon-thinking-about-linking.html"],["Darlington","Wed, 15 Jun 2016 21:56:25 +0000","Darlington – Darlington Borough Council’s £12.5m budget cuts – including closure of Crown Street library – recommended for approval – Northern Echo. &#34; swingeing budget £12.5m budget cuts proposed by Darlington Borough Council have overwhelmingly been recommended for approval – although a final decision by the full council is yet to be made. The authority has largely stuck by its massive package of cuts – despite widespread protests and opposition and suggestions of alternative money saving ideas to maintain services such as the libraries.&#34;","2016/06/selling-on-to-amazon-thinking-about-linking.html"],["Lancashire","Wed, 15 Jun 2016 21:56:25 +0000","Lancashire – Petition launched to stop Morecambe Library going self-service – Visitor. &#34;The new manager of the Arndale Centre has spoken out against plans to make the library a self-service ‘satellite library’ and has set up a petition for shoppers&#34; … &#34;The Rainbows, all aged between five and seven, have transformed the outdoor area in the centre of the library into a garden with lovely plants and are also growing fruit and vegetables as part of their gardening badge.&#34;","2016/06/selling-on-to-amazon-thinking-about-linking.html"],["North Yorkshire","Wed, 15 Jun 2016 21:56:25 +0000","North Yorkshire – Council cuts mean affluent rural communities ‘risk falling into deprivation’ – Yorkshire Post. Charity says &#34;&#34;It can also create communities that are more resilient, friendlier and with more enriched members,&#34; Mrs Swain added, pointing to how communities are already taking over the delivery of services or managing community assets, such as libraries.&#34;","2016/06/selling-on-to-amazon-thinking-about-linking.html"],["Northern Ireland","Wed, 15 Jun 2016 21:56:25 +0000","Northern Ireland – Oral Answers to Questions — Communities – in the Northern Ireland Assembly at 12:45 pm on 14th June 2016. – They Work For You. &#34;Mr Maskey asked the Minister for Communities what plans he has to protect libraries, including the Homecall and mobile library services, to ensure continued access for people with disabilities, older people and people who are socially isolated&#34;. Paul Givan responds by saying they will be unaffected by cuts. &#34;I regard the mobile library and Homecall services as important ways of ensuring that library services can reach people who are unable to access local branch libraries. They are particularly valuable to rural communities, older people, those with disabilities and parents or carers of children without access to private transport. They also make an important contribution to combating social isolation, which is one of the reasons why I am content that they are not affected by the budget reduction exercise.&#34; 5.7% reduction to Northern Ireland Libraries Budget.","2016/06/selling-on-to-amazon-thinking-about-linking.html"],["Swindon","Wed, 15 Jun 2016 21:56:25 +0000","Swindon – Protestors gather to mark opposition to cuts – Swindon Advertiser. &#34;Protestors took to the steps of the Civic Offices on Wednesday evening night ahead of an extraordinary meeting of the council. The meeting was called by the Labour group to allow newly elected councillors to bring forward motions on the transfer of Lydiard Park to external management and the imposition of parish councils across the borough. Representatives from the Swindon People’s Assembly were joined outside the council chamber by supporters of the Save Swindon’s Libraries campaign and other local campaigners.&#34;","2016/06/selling-on-to-amazon-thinking-about-linking.html"],["Darlington","Sun, 19 Jun 2016 21:14:59 +0000","Darlington – Crown Street Library set to re-locate to Darlington’s Dolphin Centre while Cockerton Library avoids closure – Northern Echo. &#34;Thousands of protesters, campaigners and volunteers, dedicated to protecting the landmark gifted by Edward Pease 131 years ago, had hoped it could have been protected from council cuts. But despite receiving support from internationally acclaimed authors and arts groups, Darlington Borough Council has decided to go ahead with relocating the library in an effort to save more than £100,000.&#34;","2016/06/humanity-first.html"],["West Berkshire","Sun, 19 Jun 2016 21:14:59 +0000","West Berkshire – West Berkshire libraries: have your say on their future – Get Reading. Consultation sessions, chaired by RedQuadrant consultants.","2016/06/humanity-first.html"],["Dorset","Sun, 19 Jun 2016 21:14:59 +0000","Dorset – Dorset to lose all but one of its mobile libraries – Bournemouth Echo. &#34;Members of Dorset County Council’s people and communities overview and scrutiny committee agreed to withdraw three of the county’s four mobile library vans. This decision follows a consultation with library users and local town and parish councils to look at alternative ways to access the library service. A decline in the number of users and &#34;unprecedented&#34; budget pressures have been cited by Dorset County Council to justify the plan.&#34;","2016/06/humanity-first.html"],["Greenwich","Sun, 19 Jun 2016 21:14:59 +0000","Greenwich – Council’s plans to scrap mobile library ‘retrograde step’, says union – LocalGov. &#34;Councillors will debate a proposal next week to scrap the mobile service in a bid to save an annual £126,000.&#34; … &#34;Onay Kasab, Unite’s regional officer, said: ‘The £126,000 figure is a drop in the ocean compared with the benefits to children’s literacy and reading ability, which are the keys to obtaining decent employment in the future.&#34; … &#34;The council believes the outreach service which will replace the mobile library will protect literacy levels&#34;","2016/06/humanity-first.html"],["Lancashire","Sun, 19 Jun 2016 21:14:59 +0000","Lancashire – Glimmer of hope for the future of Lancashire’s libraries – Lancashire Evening Post. &#34;During the debate Culture Minister Ed Vaizey called on Lancashire to engage with borough councils in the search for a solution, at the same time acknowledging a drop in the number of users.&#34; … &#34;&#34;If the county council were not engaging properly with borough councils, I would find that extremely surprising and it would cause me significant concern. It is very important that county councils get out of their silos and talk to the local borough councils. Indeed, one of my hobby-horses ​is that councils should talk to their neighbouring councils, so the county council should talk to other councils outside Lancashire as well.&#34;&#34;","2016/06/humanity-first.html"],["Northern Ireland","Sun, 19 Jun 2016 21:14:59 +0000","Northern Ireland – Many ageing library staff not IT-literate – Belfast Telegraph. Libraries described as overstaffed, with older people who live in dread of being asked about computers. Storytimes are good but do not require a full time staff. &#34;I suggest CEO Irene Knox leave her ivory tower and see for herself the number of staff not IT-literate and superfluous to her needs.&#34;","2016/06/humanity-first.html"],["Sheffield","Sun, 19 Jun 2016 21:14:59 +0000","Sheffield – Community library: Frecheville, Sheffield – Gov.uk / Libraries Taskforce. &#34;Frecheville Library and Learning Centre is an associate library and a registered not for profit charity. Community volunteers took over the running of the library on the 29 September 2014 and are supported by Sheffield City Council (SCC).&#34; Looks at deal with Sheffield council, role in the community and numbers and roles of volunteers.  35 volunteers. &#34;The library is open for 23 hours per week. This is an extra 2 hours per week than when it was run by the council as the library no longer closes for lunch.&#34;. Challenges include maintenance and updating technology.","2016/06/humanity-first.html"],["Warwickshire","Sun, 19 Jun 2016 21:14:59 +0000","Warwickshire – Community library: Harbury, Warwickshire – Gov.uk / Libraries Taskforce. A look at the staffing, role and funding of a volunteer library. &#34;The library was previously open for 2 days per week and is now open for 5 full weekdays and a half day on Saturday.&#34; … &#34;The library has worked hard to encourage usage by local children and in addition to holiday book schemes initiated by the county library service, they have organised &#34;Tunes and Tales&#34; which has brought in families with babies and toddlers. &#34; …&#34;A major factor in the success of Harbury Village Library has been the 3,100 books donated by villagers or purchased through the library’s Buy a Book Scheme. These books are administered by a separate computer system (Book Cat) which allows them to be kept within the library. &#34; £10,000 income per year due to café and other ventures.","2016/06/humanity-first.html"],["Birmingham","Tue, 21 Jun 2016 21:09:29 +0000","Birmingham – Flooded Heartlands Hospital declares ‘major incident’ – BBC. &#34;Meanwhile, the Library of Birmingham is considering whether to reopen tomorrow after a flooded stairwell forced a temporary closure.&#34;","2016/06/amazon-linking-revisited-and-ed-vaizey-says-its-all-ok.html"],["Glasgow","Tue, 21 Jun 2016 21:09:29 +0000","Glasgow – No one in Glasgow should face cancer alone – CILIP. MacMillan partnership with libraries: &#34; provides practical and emotional support for those living with and beyond cancer in the city’s 33 libraries, to ensure that everyone affected by cancer has access to quality information on their doors&#34; … &#34;To date, we have witnessed over 8,000 attendances at Macmillan @ Glasgow Libraries drop-in centres and feel we are making significant inroads in supporting individuals to access the support and information they need on their doorstep. &#34; … &#34;We know that Glasgow’s library service offers Glaswegians a welcoming hub at the heart of the community. Through the new Vision for Glasgow Libraries, developed in consultation with over 3,000 local residents, the city library service has committed to providing a one-stop-shop for residents’ key social, economic, cultural and educational needs. &#34;","2016/06/amazon-linking-revisited-and-ed-vaizey-says-its-all-ok.html"],["Cornwall","Thu, 23 Jun 2016 21:46:33 +0000","Cornwall – Launceston Town Council agree on proposal to take on library service – Cornish Guardian. &#34;The town council recently commissioned Perfect Moment to find out if the library could be an asset or a liability. The company found taking on the library could cost up to £80,000 which would include a backlog of repairs. The document sent to Cornwall Council said: &#34;The town council has approached this issue with an open mind, but our expression of interest has always been dependent on Cornwall Council giving substantial financial and in-kind support.&#34; … &#34;","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["Northern Ireland","Thu, 23 Jun 2016 21:46:33 +0000","Northern Ireland – Protest to save Derry’s central library this Saturday – Derry Journal. &#34;A protest against plans to cut the hours at Derry’s Central Library will take place on Friday at 2 p.m. Derry Central Library is one of 14 libraries across Northern Ireland threatened with a reduction in opening hours of five hours per week. A spokesperson for the group leading the protest said: &#34;Our libraries are being subjected to death by a thousand cuts.&#34; … &#34;On Saturday at 2pm activists, trade unionists and local campaigners will be gathering outside the Derry Central Library to protest against these cuts and demand that Libraries NI, Minister Paul Givan and the Assembly Executive make the necessary funds available to maintain our library services.&#34;","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["Worcestershire","Thu, 23 Jun 2016 21:46:33 +0000","Worcestershire – Group supporting Syrian refugees told to take down library exhibition – Malvern Gazette. &#34; Malvern group which has campaigned to bring Syrian refugees to the town was forced to take down an exhibition in the town’s library promoting its work because of the EU referendum. Malvern Welcomes Syrian Refugees had created the display in the library off Graham Road to coincide with Refugee Week. It went on show on Monday, and was expected top remain there until Saturday. But on Tuesday, the group was told by Worcestershire County Council‘s libraries department that it would have to come down until voting on the EU referendum had finished, due to so-called ‘purdah’ rules which come into effect in the run-up to a vote.&#34;. Group says &#34;&#34;Had we known this would be the approach of the library, we would have arranged for the display to happen elsewhere. By forcing us to take down the display, the council has in effect made a political decision that the refugee crisis is related to the EU referendum – which is a very c&#8230;","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["Devon","Tue, 21 Jun 2016 21:09:29 +0000","Devon – Libraries Unlimited give out books on the beach to encourage children to read – Torquay Herald Express. &#34;Ciara Eastell, Chief Executive of Libraries Unlimited, said: &#34;This type of event shows how libraries are changing and how keen we are to find ways to reach out to people who don’t currently use our libraries. What better way than to take books onto Devon’s beautiful beaches to have fun reading sessions with young children and their families?&#34; Five Devon County Councillors contributed £100 each to support the events&#34;","2016/06/amazon-linking-revisited-and-ed-vaizey-says-its-all-ok.html"],["Dorset","Tue, 21 Jun 2016 21:09:29 +0000","Dorset – Dorset mobile library cuts backed by county council committee – BBC. &#34;Proposals to scrap all but one of Dorset’s mobile libraries have been backed by a council committee. It recommended senior county councillors agree to remove three of four mobile library vans from service.&#34;","2016/06/amazon-linking-revisited-and-ed-vaizey-says-its-all-ok.html"],["North Yorkshire","Tue, 21 Jun 2016 21:09:29 +0000","North Yorkshire – Libraries Support Campaign To Encourage Young People To Read – NE Connected. &#34;North Yorkshire libraries are encouraging young people to read for pleasure and get more involved in their library in support of the BBC’s Awesome Authors campaign, which is promoting children’s books and encouraging children to read more or to try something new&#34;","2016/06/amazon-linking-revisited-and-ed-vaizey-says-its-all-ok.html"],["Shropshire","Thu, 23 Jun 2016 21:46:33 +0000","Shropshire – Warning for Whitchurch: No going back if libraries close – Shropshire Star. &#34;Discussions are currently taking place about the possibility of Whitchurch Town Council taking over the management of services, including play areas and youth activities. Councillor Gerald Dakin, Shropshire member for Whitchurch, said: &#34;If we lose these important services I cannot see them coming back again, so it is very important we all get together and start talking.&#34;","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["Worcestershire","Thu, 23 Jun 2016 21:46:33 +0000","Worcestershire – Local libraries offer great reading opportunities this summer – Droitwich Advertiser. &#34;people in Worcestershire are being invited to volunteer their time and help encourage school children to enjoy reading during their summer holidays&#34;","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["Sheffield","Tue, 21 Jun 2016 21:09:29 +0000","Sheffield – See what’s on offer in your local library – Star. Councillor proud no closures just many volunteer libraries instead. &#34;claim that the community-run libraries are based in the poorer parts of the city is entirely unfounded and there is a mix of council-run and volunteer-run facilities throughout all parts of our city.&#34;. Councillors says we should be celebrating what has been achieved despite major central government funding cuts.","2016/06/amazon-linking-revisited-and-ed-vaizey-says-its-all-ok.html"],["Sheffield","Tue, 21 Jun 2016 21:09:29 +0000","Sheffield – Volunteer councillors – Star / Letters. &#34;In order to set a good example for others in the city, it should be made compulsory for sitting councillors to undertake some unpaid work on a weekly basis in the libraries now run on a voluntary basis. I wondered if any current Sheffield councillors can confirm they are setting an example and undertaking such work, and what they think are the main challenges facing the library service&#34;","2016/06/amazon-linking-revisited-and-ed-vaizey-says-its-all-ok.html"],["Birmingham","Thu, 23 Jun 2016 21:46:33 +0000","Birmingham – Children’s libraries get a £250,000 makeover – Birmingham News Room / Council. &#34;The funding boost – which enabled libraries in Balsall Heath, Druids Heath, Kings Norton, Kingstanding and Small Heath to make improvements and finance educational projects – was awarded by the Wolfson Foundation, an independent charity that supports and promotes excellence in a wide range of fields, including education and the arts. These libraries are now equipped with the latest technology including plasma screens, digital cameras and the new Raspberry Pi system for ‘code clubs’, plus iPads enabling them to link up with community libraries across Birmingham.&#34; see also Funding boost for Kings Norton Community Library – B31 Voices.","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["Leicestershire","Thu, 23 Jun 2016 21:46:33 +0000","Leicestershire – New chapter as Burbage Library is handed to volunteers – Hinckley Times. &#34;Having gained CIO – charity incorporated organisation – status in February the group is nine-strong with a team of enthusiastic helpers determined to keep the centre open for the benefit of the village. Ray Watkins, chairman of the volunteers, said: &#34;Some helpers just want to do decorating or maintenance work while others are keen to work in the library itself. A number of people have gone through training with the county council because we wanted ‘super-users’ – people who could do everything – and we were lucky enough to find six. These six will cascade the training down to others.&#34;&#34;","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["Hull","Thu, 23 Jun 2016 21:46:33 +0000","Hull – Soul of the City: a vision for the future of public libraries in Hull – Libraries Task Force. &#34;Public libraries in Hull must be unique in having the support of a major philanthropic trust that allows it to continue to invest in new services, to experiment and to innovate.  The James Reckitt Library Trust manages an endowment established in 1892 by Sir James Reckitt, the pioneer industrialist and Quaker philanthropist, one of Hull’s greatest citizens.&#34; … &#34;In recent months, the Trust has begun work to develop a highly progressive, future-looking vision of the future of public libraries, both in Hull and nationally. As well as having an impact locally, we want to position Hull as a leading progressive voice in the national debate about the future of this country’s public library system.&#34; … &#34;We now want to move from vision to blueprint. We want to engage with as many people and organisations as possible – locally, nationally and internationally. We very much welcome the work of the Libraries Taskforce in trying &#8230;","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["Lancashire","Thu, 23 Jun 2016 21:46:33 +0000","Lancashire – Anger at ‘snub’ over libraries – Blackpool Gazette. &#34;The leader of a group campaigning to keep open a Fylde library has expressed her anger at being unable to arrange a meeting over the issue with the County Council’s cabinet member for culture. Louise McLaren, chairman of the Friends of Ansdell Library, requested a meeting with County Coun Marcus Johnstone to discuss ideas for the future of Fylde’s libraries, of which four of the current five could be axed in their present form under proposals to close more than half of the libraries across the county&#34;","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["Lambeth","Thu, 23 Jun 2016 21:46:33 +0000","Lambeth – Carnegie Library campaigners host community pop-up library in response to Lambeth’s book-ish gyms exhibition – in photos – Brixton Buzz.  &#34;While Lambeth and their business partners Greenwich Leisure Ltd hosted what was billed as a ‘Public Exhibition On The Future Of Carnegie,’ campaigners put on a ‘Pop Up Library’ event directly opposite the venue in Ruskin Park.&#34; … &#34;The council ‘exhibition’ turned out to be little more than a collection of leaflets blown up to poster size, with a gathering of officials wandering about.&#34; … &#34;We asked questions asked what kind of market research had been undertaken to establish the actual need for a gym, and if it could be posted online (&#34;You’ll have to ask Lambeth&#34;) and why GLL were directly handed the contract without any community consultation  (&#34;You’ll have to ask Lambeth&#34;) etc &#34;","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["Lancashire","Thu, 23 Jun 2016 21:46:33 +0000","Lancashire – Councillor aims to save Earby Library – Craven Herald. &#34;West Craven county councillor David Whipp has stepped up his campaign to save local libraries. And now he is asking Lancashire County Council (LCC) to consider alternative ways of providing facilities across the county. Cllr Whipp led a debate on the library service at LCC’s annual meeting. &#34;I plead with the county council’s administration to be more open to alternative models of service delivery,&#34; said Cllr Whipp&#34;","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["North Somerset","Thu, 23 Jun 2016 21:46:33 +0000","North Somerset – North Somerset Council reveals plan for libraries and children’s centres – North Somerset Times. &#34;North Somerset Council could close libraries as soon as next year in a bid to save about £500,000 per year, a new report has revealed&#34; … &#34;Congresbury Library could close under the raft of proposals agreed by the council’s executive, however it is not the authority’s preference. Worle’s library is similarly threatened&#34; … &#34;Cllr Felicity Baker, executive member for libraries, said: &#34;The council is committed to delivering community-based library and children’s centre services. The excellent new libraries in Weston and Portishead are proof of that. &#34;However, as a mindful authority faced with continuing financial pressures and changing customer needs and demographics, we should be undertaking regular service reviews to ensure value for money.&#34; … &#34;Since 2004-5, visitor numbers at Portishead Library have dropped 17 per cent and 14 per cent since the new venue opened in Harbour Road five years a&#8230;","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["Wiltshire","Thu, 23 Jun 2016 21:46:33 +0000","Wiltshire – Warminster library hosts Roald Dahl-themed creative dance session – Blackmore Vale. &#34;To celebrate the launch of this year’s Roald Dahl themed Summer Reading Challenge Warminster Library will be holding a creative dance session for children aged four – 11 on Saturday 9th July 2pm-3pm. Led by Caroline Newman (The Dance Lady), children will get the opportunity to explore Roald Dahl’s George’s Marvellous Medicine through expressive dance and movement. Book your free ticket by visiting Warminster Library or phone 01985 216022. Don’t forget to dress up as your favourite Roald Dahl character. All children must be accompanied by a parent/carer.&#34;","2016/06/a-quiet-couple-of-days-for-libraries-hull-enters-centre-stage.html"],["Birmingham","Mon, 27 Jun 2016 19:51:31 +0000","Birmingham – Discovery Terrace closed for essential maintenance – Library of Birmingham. &#34;The Discovery Terrace on Level 3 is currently closed for essential building maintenance. We will update all customers once these works are complete. Please accept our apologies for any inconvenience that this may cause and we hope that you enjoy many of the other fantastic features the Library of Birmingham has to offer&#34;","2016/06/11190.html"],["Blaenau Gwent","Mon, 27 Jun 2016 19:51:31 +0000","Blaenau Gwent – Education, Active Living and Learning Scrutiny Committee Minutes – Blaenau Gwent Council. &#34;In response to a question raised in respect of the future of Brynmawr Library. In response, Anthony Hughes advised that a Library Review would take place with appropriate timescales set out.&#34; … &#34;A Scrutiny Task & Finish Group to be established to undertake a fundamental review of the library service with a view to determine the future strategic direction for the service moving forward&#34;","2016/06/11190.html"],["Brent","Mon, 27 Jun 2016 19:51:31 +0000","Brent – Join me for dinner on 12th July – Save Kensal Rise Library. &#34;Ida restaurant is hosting a very special evening in support of Kensal Rise Library on Tuesday, July 12th. Enjoy three courses for £35 and Ida will donate £10 from every meal to the library.&#34;","2016/06/11190.html"],["East Lothian","Mon, 27 Jun 2016 19:51:31 +0000","East Lothian – Six-year-old’s plea as Prestonpans Library plans cause concern – East Lothian Courier. &#34;PLANS to move council services into Prestonpans Library have come under fire, amid claims a 20 per cent drop in the number of users is &#34;mince&#34; … &#34;Prestonpans Community Council met with East Lothian Council officials to discuss plans to close Aldhammer House in the town and spend £93,000 refurbishing the library to accommodate the services. And there was a personal plea made to save the library by six-year-old Manja Porteus, who attended the meeting with dad Tim, and expressed fears the changes would led to the eventual loss of the service altogether&#34;","2016/06/11190.html"],["Vale of Glamorgan","Mon, 27 Jun 2016 19:51:31 +0000","Vale of Glamorgan – Campaigners win permission for second judicial review over library plans – Local Government Lawyer. &#34;The hearing is due to be held in October, the Save Rhoose Library Campaign said. Vale of Glamorgan Council wants to save money by having Rhoose library run by volunteers rather than staffed full time. The campaign group argues that this will give an unsatisfactory service with the facility open for shorter periods. Save Rhoose Library said the council failed to provide sufficient information to justify its proposal, had issued misleading information about the role of volunteers when it surveyed opinion and had not properly assessed the impact of the proposal on school pupils and job seekers who relied on the library’s facilities.&#34;","2016/06/11190.html"],["Darlington","Mon, 27 Jun 2016 19:51:31 +0000","Darlington – Campaigners urge Darlington Borough Council to delay decision on Crown Street Library – Northern Echo.","2016/06/11190.html"],["Northern Ireland","Mon, 27 Jun 2016 19:51:31 +0000","Northern Ireland – Protests at library cuts across Northern Ireland – Irish News. &#34;A total of 14 branches are set to have their opening hours cut under plans announced by Libraries NI, despite figures from the former Department of Culture, Arts and Leisure (DCAL) showing a rise in the number of people using libraries.&#34; .. &#34;Sean Burns, spokesman for The Hands Off Our Libraries Campaign, said: &#34;From Enniskillen to Carrickfergus, we found universal opposition to these cuts. &#34;Our libraries don’t just provide books, they are community hubs. They provide vital resources for students, young families, people on benefits, the elderly and immigrant communities.&#34;","2016/06/11190.html"],["Devon","Mon, 27 Jun 2016 19:51:31 +0000","Devon – Libraries Unlimited aims to bring ‘commercial edge’ to Devon’s libraries – Express and Echo. &#34;Those involved insist the move is not privatisation or about generating profit for shareholders, but will &#34;bring a commercial edge to the library service to help it survive and thrive&#34;. Three months in, chief executive Ciara Eastell says she and her colleagues are relishing their new freedom from council control.&#34; … &#34;Under a five-year contract with Devon County Council, the amount Libraries Unlimited receives will reduce each year, from around £7 million this year to £5.5 million in three years’ time. The new public service mutual is applying for charitable status, which would bring savings on business rates and enable it to access sources of funding which the council could not.&#34; … &#34;Potential ways of generating income include opening up libraries for use by groups, organisations and services, such as business advice sessions, language lessons or training for job seekers.&#34; … &#34;&#34;We have 120,000 peo&#8230;","2016/06/11190.html"],["Lancashire","Mon, 27 Jun 2016 19:51:31 +0000","Lancashire – Anger at &#34;snub&#34; over libraries – Gazette. Councillor fails to meet library campaigner.","2016/06/11190.html"],["Sheffield","Mon, 27 Jun 2016 19:51:31 +0000","Sheffield – A major priority – Star / Letters. Asks councillor that praised volunteers if he’s willing to (a) praise the paid staff they replaced and (b) if it is possible to replace the volunteers with paid staff.","2016/06/11190.html"],["Northern Ireland","Mon, 27 Jun 2016 19:51:31 +0000","Northern Ireland – Libraries should return to the sound of silence – Belfast Telegraph. &#34;In the past, entering a library was to step from the harassment and noise of the outside world into an oasis of calmness and silence.Everywhere we go these days, there seems to be the constant, irritating rattle of fingers on keyboard. Now, even the tranquillity of the library is being polluted with this sound – a sound which (to paraphrase Louis MacNeice) deadens and endures.","2016/06/11190.html"],["Wandsworth","Mon, 27 Jun 2016 19:51:31 +0000","Wandsworth – Cllr Govindia explains how Wandsworth is saving money while protecting services – WandsworthSW18. &#34;As local authority funding has been reduced in recent years the council has had to work to make savings while protecting front line services like weekly bin collections, libraries and the borough’s award-winning parks.&#34; … &#34;We have also transferred the management of our libraries to social enterprise GLL which saves £665,000 every year. With reduced back office costs we have kept every library branch open while councils with an in-house service have simply closed them.&#34;","2016/06/11190.html"],["Warwickshire","Mon, 27 Jun 2016 19:51:31 +0000","Warwickshire – Warwickshire residents give local library services thumbs up – Leamington Observer.","2016/06/11190.html"],["Worcestershire","Mon, 27 Jun 2016 19:51:31 +0000","Worcestershire – Upton Villages Together sign lease taking control of Upton-upon-Severn library upkeep from Worcestershire County Council in a bid to reduce spending – Evesham Journal. &#34;A lease was announced on Saturday which transfers the responsibility to maintain, develop and manage the building, to Upton Villages Together. It is hoped the plans will lead to &#34;considerable savings&#34; for the council and enable the library to expand its services. Upton Villages Together signed a lease with Worcestershire County Council to look after &#34;bricks and mortar&#34; of the library. The council will still provide normal library services&#34;","2016/06/11190.html"]]