[["Kent","Sun, 01 Feb 2015 23:16:34 +0000","Kent – National Libraries Day in Kent – Will Our Councillors Support Libraries? – CliKent. Letter sent to councillors informing them of National Libraries Day and asking for their libraries to support it.","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Lambeth","Sun, 01 Feb 2015 23:16:34 +0000","Lambeth – Cultural services by 2020 – Lambeth Council. 5 out of 10 libraries may be closed/passed to volunteers: Carnegie, Minet, Waterloo Durning and Upper Norwood Joint withdrawal considered.","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Lincolnshire","Sun, 01 Feb 2015 23:16:34 +0000","Lincolnshire – Audit report brought Tories to book over plans to shut libraries - Lincolnshire Echo. &#34;The long-running farce that is The Great Tory Library Betrayal took a disturbing twist this week, which should concern anyone who values democracy and accountability by those elected to serve us.&#34; by opposition councillor.","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Wirral","Sun, 01 Feb 2015 23:16:34 +0000","Wirral – Council leader blasts ministers in row over Wirral library cuts – Wirral Globe. &#34;The bust-up centres around Wirral West MP Esther McVey inviting secretary of state for culture, media and sport Sajid Javid to visit Upton library on Thursday. Employment minister Ms McVey later lashed the cut in library hours as &#34;ill thought out&#34; adding it would &#34;disadvantage&#34; the community. She said she would put pressure on the authority for a change of heart. Councillor Davies told the Globe: &#34;Opening hours for the community libraries were reduced purely due to the scale of the cuts their Government has imposed on Wirral.&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Bromley","Sun, 01 Feb 2015 23:16:34 +0000","Bromley – Last chance to have say on libraries - Bromley. &#34;Library users can provide their views on proposals for Community Management at the six community libraries in the borough and market testing for the management of the core service. The consultation follows a review of the library service which includes these options to modernise the service and make improvements, while making savings and protecting the core service. For more information and to comment via the survey visit the website. &#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Cardiff","Sun, 01 Feb 2015 23:16:34 +0000","Cardiff – Seven Cardiff libraries under threat in council cuts – BBC. &#34;Cathays, Roath, Rhydypennau, Rumney, Radyr, Rhiwbina and Whitchurch are all under threat. Councillors rejected a motion which called for savings of £283,000 to be found elsewhere in the authority’s budget. A meeting on Thursday heard &#34;huge numbers&#34; were against the cuts.&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Ealing","Sun, 01 Feb 2015 23:16:34 +0000","Ealing – Story So Far - Acton Community Forum. &#34;We are pleased to announce that we have secured Arts Council funding for ‘The Story So Far’ which will create an ‘arts & story trail’ from one end of Ealing to the other. Ealing’s cabinet member for leisure, libraries and customer services, Councillor Dr Patricia Walker said: &#34;I’m delighted that the Arts Council has provided funding for this fantastic project which fuses art and stories throughout the borough; with the reborn Dominion Centre at one end of the trail and brand new Acton Library at the other.  Imaginative projects like this really add to Ealing’s arts and cultural strategy and play an important role in the regeneration of parts of the borough.&#34;&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Wolverhampton","Sun, 01 Feb 2015 23:16:34 +0000","Wolverhampton – Jobs to go and opening hours slashed in £100k cut to community centre budget – Express and Star. &#34;&#34;There was a great desire to have a quality community venue in Blakenhall and it has the area’s first ever library within it. &#34;The council is in a difficult situation but the gym and library are popular. We live in hope.&#34;&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Lambeth","Sun, 01 Feb 2015 23:16:34 +0000","Lambeth – Lambeth Council proposes to sell Minet and Waterloo Libraries, and end funding for three others in the borough – Brixton Buzz. &#34;Lambeth Council is planning to sell the Minet and Waterloo Libraries. Funding will also be stopped for the Durning, Carnegie and Upper Norwood Library. An expected £10m will be raised from the sale of the Minet and Waterloo. This would then be used to set up an endowment fund to help residents run community libraries. The Minet Library at Myatt’s Fields is home of the Lambeth Archives.&#34; … &#34;The announcement is far worse that we first thought&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Lincolnshire","Sun, 01 Feb 2015 23:16:34 +0000","Lincolnshire – Save Lincolnshire Libraries campaigners fight their cause at scrutiny committee – Grantham Journal. &#34;Among campaigners was Grantham county and district councillor Charmaine Morgan, who argued that the results of a public consultation &#34;clearly showed overwhelming support to retain and improve existing library services&#34;. She went on to say that the law clearly stated all residents are entitled to access library services and that the new proposals such as telephone orders and online orders did not deliver the same experience. Meanwhile, Coun Ray Wootten, also on behalf of the district and county, said that there had been a recent increase in the use of Grantham Library.&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Norfolk","Sun, 01 Feb 2015 23:16:34 +0000","Norfolk – Council papers - Norfolk Council. £80k cut 2015/16.  Results of public consultation including this showing 36% of respondents wanted more spent on libraries, the fourth most popular of 16 services, in front of Fire.","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Devon","Sun, 01 Feb 2015 23:16:34 +0000","Devon – Ambition to move Bideford Library into the Burton Art Gallery could be given the green light soon - North Devon Journal. &#34;A joint ambition to move Bideford Library into the Burton Art Gallery could be given the green light in the next few months. The possible move was first announced at a Bideford Town Council meeting back in October 2013, and this month Devon County Council has started a feasibility study to look as the possible joint venture.&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Leicestershire","Sun, 01 Feb 2015 23:16:34 +0000","Leicestershire – Groups express interest in running libraries – Loughborough Echo. &#34;groups have registered an interest in running 29 of Leicestershire County Council’s 36 libraries – which were at threat of closure if volunteers were not found. Leicestershire County Council says it will continue to look at how it can encourage the remaining seven. Last year, it was decided that village libraries will have to be run entirely by volunteers or face closure.&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Peterborough","Sun, 01 Feb 2015 23:16:34 +0000","Peterborough – Peterborough arts chiefs put service fears to city council bosses – Peterborough Today. &#34;He confirmed jobs losses at Peterborough’s libraries and indicated the city’s arts and heritage festivals could stop running. After a meeting with council officials early this week, he said: &#34;We have always appreciated the difficult position the council is in with tough decisions to be made. &#34;We strongly believe that libraries, heritage, the arts and sport are at the heart of what brings a city to life.&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Kirklees","Sun, 01 Feb 2015 23:16:34 +0000","Kirklees – In support of Malcolm Haigh – and our libraries – Dewsbury Reporter / Letter. &#34;the crucial ingredient that makes Batley Library such an important focal point for the local community is the skill and expertise of its staff. To lose this skill and expertise in job cuts or moves to volunteering would be a major blow to the future well-being of local residents, particularly those who, for a variety of reasons, are the more disadvantaged in our society. In dark moments I can’t help but wonder if Kirklees Council’s determination to close or to dumb down library services in Batley and elsewhere is nothing but a surrender to the present Government’s general attack on publicly provided welfare services.&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Buckinghamshire","Sun, 01 Feb 2015 23:16:34 +0000","Buckinghamshire – Buckinghamshire libraries aim to be ‘heart of communities’ – Get Bucks. Library chief says &#34;… while many feel the future is in ebooks, he felt it was better placed in putting libraries at the centre of the community. He said: &#34;People may not use them as much but they get upset if they hear it is being closed. There’s a real attachment to them.&#34; Mr Jones added because of this they could be ‘hubs,’ changing how they are used and viewed.&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Cardiff","Sun, 01 Feb 2015 23:16:34 +0000","Cardiff – Hopes of a reprieve for under-threat Cardiff libraries fails by two votes as city councillors vote against motion - Wales Online. &#34;Two separate motions have been tabled, one by Conservative councillor Craig Williams, and the second by the Independent group’s councillor Adrian Robson. One called on council to find an alternative saving to the planned £283,000 cut for the 2015/6 budget, both failed by a handful of votes&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Coventry","Sun, 01 Feb 2015 23:16:34 +0000","Coventry – ‘I have so much to thank the library for and the thought of losing it, staff losing their jobs, Bell Green becoming more and more deserted, is totally untenable’ - Coventry Telegraph / Letter.","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Cumbria","Sun, 01 Feb 2015 23:16:34 +0000","Cumbria – New Barrow library opens - North West Evening Mail. &#34;A bigger and better community library was officially opened to the public with the cutting of a ceremonial ribbon yesterday. It will be based in Ormsgill Nursery and Primary School, in Millbank, where all of the pupils have become library members. The move was the idea of County Councillor Bill McEwan who contributed £3,228 from his local revenue scheme funding towards the library’s refurbishment.&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Lincolnshire","Sun, 01 Feb 2015 23:16:34 +0000","Lincolnshire – Magna Carta and Lincolnshire Libraries – Labour Rose. &#34; The Magna Carta will arrive back soon to be housed in a new facility in Lincoln Castle which has cost £22 million. There will be many events held in the City to celebrate its anniversary. Yet while we honour this document of freedoms and human rights. Lincolnshire County Council has decided that it will not listen to the rights of the people of Lincolnshire in regard to their vital Library services. There is a connection between the Magna Carta and our Libraries. A Library represents freedoms, freedom to access free books, education and knowledge. Magna Carta and Libraries are intertwined in what they represent. Then why should Lincolnshire County Council on one hand celebrate the Magna Carta, and yes it should be celebrated, but on the other hand deny its people access to the freedoms that the Magna Carta represents?&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Cardiff","Sun, 01 Feb 2015 23:16:34 +0000","Cardiff – Seven Cardiff libraries under threat in council cuts – BBC. &#34;Cathays, Roath, Rhydypennau, Rumney, Radyr, Rhiwbina and Whitchurch are all under threat. Councillors rejected a motion which called for savings of £283,000 to be found elsewhere in the authority’s budget. A meeting on Thursday heard &#34;huge numbers&#34; were against the cuts.&#34;","2015/02/should-one-save-all-the-libraries-all-the-time.html"],["Brent","Tue, 03 Feb 2015 23:42:54 +0000","Brent – Closing Library Buildings - Jame Powney’s Blog. &#34;Public Libraries News has a post suggesting that sometimes closing a library building is the best choice available.  This is an argument I have been making for some years. &#34; … &#34;I think the piece is wrong, however, to suggest that a lack of protest necessarily means that the library is not needed, or that the presence of vociferous protests necessarily means a particular building is vital.  Unfortunately some kinds of community, that may have the greatest need, are least prone to protesting.  Other areas with less need can be full of articulate people who are good at mobilizing protests.  Simply being driven by the number of protests could lead to some very skewed decisions.&#34; … &#34;This opinion being based on gut instinct rather than the kind of assessment that the High Court judge described as &#34;rigorous&#34; and &#34;thorough&#34;.  Ignoring such an assessment in order to placate protest groups would have meant that the Council would not have achieved the su&#8230;","2015/02/changing-the-narrative.html"],["Lincolnshire","Tue, 03 Feb 2015 23:42:54 +0000","Lincolnshire – County Council’s executive approves plans for £2m library cuts – Market Rasen Mail. &#34;The decision will see the number of council-run libraries drop from 47 to just 15. But the council is likely to put these libraries out to tender after an expression of interest from not-for-profit group Greenwich Leisure Limited during the consultation process. The council will continue to run the existing libraries in these areas until 30 September 2015 giving volunteers plenty of time to lay firm foundations for the new community hubs to be developed.&#34;","2015/02/changing-the-narrative.html"],["Birmingham","Tue, 03 Feb 2015 23:42:54 +0000","Birmingham – Public rally to take place over Library of Birmingham cuts - Birmingham Mail. &#34;Hundreds of protesters are expected to attend a demonstration to save award-winning Library of Birmingham from severe cuts this weekend. Demonstrators will link arms around the £188 million library in a symbolic ‘hug’ as they try to persuade Birmingham City Council to think again about slashing running costs at the landmark building by £1.5 million. It would mean no new books on the shelves at Europe’s largest public library, 100 staff redundancies and opening hours cut by 40 per cent to just 40 hours a week.&#34;","2015/02/changing-the-narrative.html"],["Brixton","Tue, 03 Feb 2015 23:42:54 +0000","Brixton – ousing, cuts and flogging off public libraries – the Brixton Buzz round up for January – Brixton Buzz. &#34;We got a sniff of a story during the final week of January that something major was about to happen to Lambeth libraries. We reported how the Lambeth Archives would move to Brixton Library. Our story stood up, but it was sadly a lot worse than our first suggestion.&#34;","2015/02/changing-the-narrative.html"],["Buckinghamshire","Tue, 03 Feb 2015 23:42:54 +0000","Buckinghamshire – Is this the final chapter for our libraries? – Get Bucks. &#34;People just aren’t visiting libraries like they used too. You can cite all kinds of reasons – my favourite being it’s thanks to the increasing coffee culture, ie we prefer to sip our Starbucks with free wifi than pop in to borrow a book. Or what about paperback is out, ebooks are in? Whatever the reason that is flavour of the month, I would be among those saddened if we lost our libraries.&#34; [I’d say cutting the budget by 50% probably did not help – Ed.]","2015/02/changing-the-narrative.html"],["Cardiff","Tue, 03 Feb 2015 23:42:54 +0000","Cardiff – ‘Save our libraries&#39;: Campaign against library closures in Cardiff steps up for National Libraries Day - Wales Online. &#34;Local communities are stepping up their campaign to save under threat libraries this weekend as part of National Libraries Day. As well as a read in protest at Cardiff Central Library, different events are being planned for libraries around the city. At Whitchurch, local people are being invited to make their own video setting out why the library should be saved.&#34; … &#34;Everyone is also invited to bring a book to Cardiff Central Library on Saturday, from 12pm, for a protest organised by Cardiff Unison and the Cardiff People’s Assembly&#34;","2015/02/changing-the-narrative.html"],["Trafford","Tue, 03 Feb 2015 23:42:54 +0000","Trafford – What have Tories got against the children of Trafford, MP asks? - Messenger. &#34;Stretford and Urmston MP Kate Green saying: &#34;What have Trafford Tories got against our young people?&#34; By closing three libraries including Davyhulme, Bowfell and Lostock, Trafford Council estimates it will save more than £160,000 a year, and by slashing the current £294,000 book budget by more than one third, it will save a further £105,000. The reopened public consultation into the library closure plan will close on February 13. The Messenger spoke this week with parents and carers, who use the facilities at Davyhulme, who now fear the closure would not be backed up with reciprocal services elsewhere.&#34; … &#34;When asked whether slashing the book fund by one third would have a detrimental effect he said: &#34;This is proportionate to the number of libraries that will remain in Trafford. &#34;","2015/02/changing-the-narrative.html"],["Lincolnshire","Tue, 03 Feb 2015 23:42:54 +0000","Lincolnshire – Look North (East Yorkshire and Lincolnshire) - BBC Look North.  Very first item on the news, reports on the decision to force most libraries to volunteers, an alternative provider (e.g. GLL or similar) or close. Includes interview with Library Campaign Laura Swaffield who points out that there are alternative options to passing them on to volunteers and questions long term sustainability. see also Plans for volunteers to run Lincolnshire libraries approved - ITV News, Lincolnshire CC Executive agree to library cuts - Lincolnshire Echo, Lincs CC’s executive approves plans for £2m library cuts – Louth Leader, Approval given for cutdown library service – Sleaford Standard,  Controversial overhaul plan for Lincolnshire’s libraries get council approval – Grimsby Telegraph, Councillors approve plans for £2m library cuts – Grantham Journal, Lincolnshire Libraries consulation has cost £720k so far - Lincolnshire Echo, Lincolnshire Tory MP & Government Minister demands Lincolnshire CC ‘urgently rethinks’ - Save Lincolnshire Libr&#8230;","2015/02/changing-the-narrative.html"],["Trafford","Tue, 03 Feb 2015 23:42:54 +0000","Trafford – The Budget 2015-16: Proposed changes to Library services and some services in Children, Families and Wellbeing - Trafford Council.  [The council here has the sheer unmitigated gall to call it a &#34;reshaping journey&#34; – Ed.]","2015/02/changing-the-narrative.html"],["Barnet","Thu, 05 Feb 2015 22:08:04 +0000","Barnet – Public meeting about future of Barnet’s libraries – This is Local London. &#34;The authority is currently consulting on the future of its libraries, and options include: Keeping all libraries open but shrinking all but four and letting out the remaining space, Closing six libraries and staffing the remainder for 60 per cent of their current hours, but using technology to extend opening times, Closing two libraries, shrinking others and staffing them with volunteers, and staffing others for half of their current hours, again using technology to extend opening times, Barnet Council says people will be able to travel to all remaining branches by public transport within half an hour. Labour parliamentary candidate for Finchley & Golders Green Sarah Sackman, Liberal Democrat councillor Jack Cohen and Conservative councillor Shimon Ryde will all speak during the meeting.&#34;","2015/02/librarianfirst.html"],["Coventry","Thu, 05 Feb 2015 22:08:04 +0000","Coventry – Legal threat over library closures and council cuts - Coventry Observer. &#34;Unison, the largest union representing 2,600 employees of Coventry City Council, said it would consider a judical review of library closures and other cuts to protect vulnerable people from losing vital community services. The union has formally objected to Labour councillors’ &#34;City Centre First&#34; proposals. Beginning this year, it could axe every council service in most communities in response to government funding cuts to the council of a third so far since 2010. Services lost in the majority of 18 council wards would include libraries, children’s centres, youth clubs, adult education centres and community centres.&#34;","2015/02/librarianfirst.html"],["Wrexham","Thu, 05 Feb 2015 22:08:04 +0000","Wrexham – Wrexham Library Services To Be Transfered To South Wales Trust - Wrexham.com. &#34;Rather than reinventing the wheel we are identifying existing trusts we can link in with.&#34; With the likely concern over the South Wales element, he said: &#34;Although the trusts are based in South Wales, the day to day management and running will remain local. Wrexham Council say: &#34;Having considered all the options, the Council is seeking to negotiate with two existing trust that have been established recently within Wales: the Life Leisure Trust (Blaenau Gwent) and the Merthyr Tydfil Leisure Trust. &#34;Informal discussions indicate that it is possible that Wrexham’s Library Services could join one of these trusts providing negotiations on the terms of membership were successful.&#34;","2015/02/librarianfirst.html"],["East Riding of Yorkshire","Thu, 05 Feb 2015 22:08:04 +0000","East Riding of Yorkshire – Knight Urges Support for National Libraries Day – Beverley Guardian. &#34;The MP said: &#34;National Libraries Day sends a collective message across the country that we value our libraries and the staff who work in them and recognises libraries of all kinds: public ones and those at school, university, workplace, legal, commercial and government.&#34;","2015/02/librarianfirst.html"],["Kent","Thu, 05 Feb 2015 22:08:04 +0000","Kent – Protesters to gather in Whitstable Library Square to help save library services - Canterbury Times. Blames councillors. &#34;On the day, National Libraries Day, adults and children are asked to celebrate by &#34;chalking&#34; on the pavement outside why they think libraries are so special or drawing favourite literary characters. A Save Our Public Libraries petition will also be launched at the event, with the aim to get sufficient signatures to force a full debate on the future of Kent’s libraries. KCC rules state that 2,500 signatures guarantee a committee debate and 10,000 force a debate in full council. Richard Stainton, of the Whitstable Improvement Trust, said: &#34;Our aim is to protect Kent’s network of 99 libraries – which is something that people in Kent can be very proud of.&#34;","2015/02/librarianfirst.html"],["Lincolnshire","Thu, 05 Feb 2015 22:08:04 +0000","Lincolnshire – Christopher Bryant says the Government needs to do more to maintain libraries - Lincolnshire Echo. Shadow Minister for Arts visits Lincolnshire: &#34;&#34;The big solution is government cannot wash its hands. It has got to take some responsibility, it has to assess what is happening in the country. It is a bit depressing that 60 per cent of libraries in the country do not have Wi-Fi. &#34;I know Karl (McCartney) and I have never heard him say a word about the library in his constituents. Maybe he never uses the library?","2015/02/librarianfirst.html"],["Lambeth","Thu, 05 Feb 2015 22:08:04 +0000","Lambeth – Save Lambeth Libraries – Change.org. Petition. &#34;We are calling on the council to keep its promises to Lambeth citizens and invest in a secure future for Lambeth Libraries: Save Our Libraries. No cuts, no closures to Lambeth Libraries. Fund a professionally run public library service across Lambeth&#34;","2015/02/librarianfirst.html"],["Lincolnshire","Thu, 05 Feb 2015 22:08:04 +0000","Lincolnshire – Lincolnshire Libraries Decision – Reactions from Public & The Library Campaign #LibraryPlanNO – Save Lincolnshire Libraries. A look at local and national reaction to the news.","2015/02/librarianfirst.html"],["Lincolnshire","Thu, 05 Feb 2015 22:08:04 +0000","Lincolnshire – Lincs libraries – madness – Library Campaign. &#34;Nothing rational explains the decision by pig-headed Lincs County Council to destroy most of their library service – even though they don’t need to. They insist on dumping 30 libraries on to ‘volunteers’, keeping just 15. They have been shown that they can keep them all open, and avoid sacking 160-odd staff – and still make all the savings they want.","2015/02/librarianfirst.html"],["Northamptonshire","Thu, 05 Feb 2015 22:08:04 +0000","Northamptonshire – LIbrary Donation Scheme Not A Threat – About My Area. &#34;Library bosses at Northamptonshire County Council have moved quickly to reassure library users that a charity voluntary donation scheme to raise more funds is in no way is a threat to the service – pointing out the reverse is true and is another example of the constant work in the county to make sure libraries are hubs at the very heart of our communities.&#34; … &#34;&#34;Our charity scheme for libraries – far from being a threat to public libraries – is actually a vital tool in helping us to protect them from front line service reductions. We see our library services as absolutely critical in delivering not only traditional library services but also a whole host of other front line offerings such as some elements of children centre services and business start up advice.&#34; see also Library bosses say Northamptonshire service is not under threat despite fundraising announcement – Northants Telegraph.","2015/02/librarianfirst.html"],["Walsall","Thu, 05 Feb 2015 22:08:04 +0000","Walsall – Library services could remain in Walsall community despite closure threat - Walsall Advertiser. &#34;Streetly Library, in Blackwood Road, is one of eight Walsall Council owned libraries that will close its doors, among plans to save more than £500,000.&#34; but library chief &#34; revealed that both Streetly Academy and Streetly Community Association have shown interest in retaining a service in the area. But both organisations have said that there are no detailed plans, with library officials adding that both options are currently being &#34;explored and assessed.&#34;","2015/02/librarianfirst.html"],["West Sussex","Thu, 05 Feb 2015 22:08:04 +0000","West Sussex – Use those libraries, says Susie – Worthing Herald.  &#34;Writer Susie Wilde has organised two Chichester events aimed at putting libraries back at the centre of our community. A murder mystery evening at Chichester library will be followed the day after by the start of a writing group for children – all with the aim of safeguarding the future of our libraries in general.&#34;","2015/02/librarianfirst.html"],["Lincolnshire","Thu, 05 Feb 2015 22:08:04 +0000","Lincolnshire – Mass closure of Lincolnshire libraries – Keithpp’s blog. Lincolnshire – Residents hit by £728k bill – Lincolnshire Free Press. &#34;Council taxpayers in Lincolnshire are picking up a £728,000 bill from &#34;the great Tory library betrayal&#34; according to Deeping St James Labour councillor Phil Dilks. Last week Coun Dilks was told the bill would be about £250,000 but he now expects it will rocket to £1million. On Tuesday Coun Dilks, fellow campaigners and library users tied yellow ribbons to railings outside Market Deeping Library in the forlorn hope it might be spared.&#34;","2015/02/librarianfirst.html"],["Sheffield","Thu, 05 Feb 2015 22:08:04 +0000","Sheffield – Public meeting and day of fun at Sheffield libraries – Sheffield Telegraph. &#34;A public meeting is happening on Tuesday to discuss the proposed business model for Walkley Library. The library is set to share space with a cafe bar run by the Forum group. Representatives from the council and Forum are set to attend the meeting in the library at 7pm.&#34;","2015/02/librarianfirst.html"],["Sandwell","Thu, 05 Feb 2015 22:08:04 +0000","Sandwell – Five under-threat Sandwell libraries saved from axe – Express and Star. &#34;Sandwell Council has ruled out shutting the sites at Hill Top, West Bromwich; Oakham, Tividale; and Langley, Brandhall and Rounds Green, all Oldbury. But some could move to share buildings with other services while extra volunteers could also be recruited to help run them. While libraries could also start selling school text books in a bid to raise cash.&#34;","2015/02/librarianfirst.html"],["Shropshire","Thu, 05 Feb 2015 22:08:04 +0000","Shropshire – Second phase of Church Stretton Library consultation begins – Shropshire Live. &#34;Shropshire Council has previously held a community conversation on the future of Church Stretton library in which views from residents were sought on a proposal to work in partnership with South Shropshire Academy Trust to provide a library located at Church Stretton School.&#34;","2015/02/librarianfirst.html"],["Swindon","Thu, 05 Feb 2015 22:08:04 +0000","Swindon – £200,000 upgrade to library computers – Swindon Advertiser. &#34;As well as replacing the computers, WiFi is set to be installed in five of the community libraries as well as upgrading many of the self-service machines … Many of the computers operate on Windows XP, which will be unsupported from March, so the 180 public computers will be replaced by 150, recognising that many people have their own devices&#34;","2015/02/librarianfirst.html"],["Thurrock","Thu, 05 Feb 2015 22:08:04 +0000","Thurrock – The campaign to save Thurrock’s libraries continues this weekend – Thurrock Gazette. &#34;Campaigners from the Save Our Thurrock Libraries group will be in Corringham and Stanford-le-Hope on Saturday from 11am urging people to sign a petition to help keep the borough libraries open. &#34; … &#34;A month-long consultation by Thurrock Council – which ends next Sunday, February 15 – is looking into how the library service can save £500,000. One suggestion is the closure of some of the borough’s libraries to save cash, as well asking volunteers to step forward to run the libraries and to seek funding to support them. &#34;","2015/02/librarianfirst.html"],["Birmingham","Sun, 08 Feb 2015 22:09:02 +0000","Birmingham – Look: Library of Birmingham supporters give building big hug in rally against cuts - Birmingham Mail. &#34;Supporters of the Library of Birmingham gave the building a big hug as part of a rally against proposed cuts to opening hours and staff. … The protest on Saturday was designed to coincide with National Libraries Day and included speeches from historian Professor Carl Chinn, photographer Vanley Burke and crime writer Judith Cutler … Campaigners linked arms around the library to embrace the building in a &#34;hug&#34;, before presenting councillors with a petition of 2000 signatures calling for cuts to be reversed.&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Kirklees","Sun, 08 Feb 2015 22:09:02 +0000","Kirklees – Chocolat author Joanne Harris joins fight to save threatened Almondbury Library - Examiner. &#34;Chocolat author Joanne Harris has joined the fight to save Almondbury Library. She joined a group of other concerned local people, Huddersfield MP Barry Sheerman and library staff at a meeting today. There they began to form plans about how to not just save the service but preserve it in the Stocks Walk building where it currently resides.&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Lambeth","Sun, 08 Feb 2015 22:09:02 +0000","Lambeth – Future of Waterloo Library: Lambeth seeks ‘community partner’ – London SE1. &#34;At the end of last month Lambeth Council launched a public consultation on its plan to shut Waterloo Library and sell the valuable Lower Marsh site it occupies. Campaigners from the Friends of Waterloo Library collected petition signatures in Lower Marsh on Saturday during National Libraries Day celebrations and a public meeting has been called for this Wednesday evening to discuss the future of the library. A Lambeth-wide ‘save our libraries’ petition has now gained nearly 800 signatures. The three Labour councillors for Bishop’s ward, together with Kate Hoey MP and Waterloo Action Centre trustee Jenny Stiles, last week travelled to Lambeth Town Hall for talks with Cllr Jane Edbrooke, cabinet member for neighbourhoods.&#34; … &#34;The Bishop’s ward councillors have launched a new website www.keepalibraryinwaterloo.com and an online petition seeking a guarantee from their Labour colleagues that there would be no gap between the closure of the ex&#8230;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Wirral","Sun, 08 Feb 2015 22:09:02 +0000","Wirral – Wirral Council urged to rethink spending cuts after Government grant increase - Wirral Globe. &#34;When other elements are factored in, it means there is now a further £1.5m of cash available for the coming financial year&#34;. Lib Dem councillor suggests this would be a good time to save some libraries budget with the money. &#34;There is an opportunity for the Labour administation to reconsider some of its more controversial saving decisions from September. &#34; I am thinking particularly about the decimation of the library opening hours. This windfall means that if they want they can take this decision off the table and safeguard the future of the community libraries.&#34;&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Bromley","Sun, 08 Feb 2015 22:09:02 +0000","Bromley – Bromley Council put the freehold for Chislehurst Library up for sale – News Shopper. &#34;The future location of Chislehurst Library is uncertain after Bromley Council put the freehold up for sale. The council is inviting developers who are interested in acquiring the site – including car park – in Red Hill. The announcement comes amidst the council’s reduction of £300,000 in the 2014/15 budget for the library service. A replacement for Chislehurst library would need to be provided by developers to the council’s standards.&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Cardiff","Sun, 08 Feb 2015 22:09:02 +0000","Cardiff – Hundreds gather in protest at library cuts in Cardiff - Wales Online. &#34;Those who made addresses to the crowd included leading figures from the world of literature – among them the first National Poet of Wales Gwyneth Lewis, crime novelist Belinda Bauer, former head of Academi/Literaure Wales Peter Finch, children’s author Jackie Morris, playwright Greg Cullen, novelist Francesca Rhydderch and poet and musician Labi Siffre.&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Lambeth","Sun, 08 Feb 2015 22:09:02 +0000","Lambeth – Library Workers Accuse Council of Insult to National Libraries Day after Cuts and Closures Announcement – Lambeth Save Our Services. &#34;&#34;Library staff and our Library Friends Groups have been gearing up for a huge membership and publicity drive around National Libraries Day and now we find out the Council has announced plans which threaten half of the borough’s Libraries. Frankly, it’s a slap in the face to library staff, our Friends of Libraries Groups and the communities we serve. We now know exactly what the long-running and costly Cooperative Libraries project was, an attack on a comprehensive public library service across the borough. Labour was reelected boasting that it kept all our libraries open, where is that commitment to the service’s future now?&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Cardiff","Sun, 08 Feb 2015 22:09:02 +0000","Cardiff – Artists draw up support for stricken Cardiff libraries - Wales Online. &#34;Whitchurch artists Chris Griffin, Anthony Evans and Huw Aaron have joined forces to produce these pictures as a way of showing their protest against plans to remove funding from their local library&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["North Yorkshire","Sun, 08 Feb 2015 22:09:02 +0000","North Yorkshire – Support grows in Harrogate for Starbeck Library campaign - Harrogate Advertiser. &#34;The Harrogate Advertiser Series is backing a Starbeck campaign asking the county council to continue supporting the local library. At present there are two paid members of staff and about 30 volunteers working at Starbeck Library, and costs are met by NYCC. Proposals put before the public in November 2014 would pull this support to make Starbeck Library, along with 19 others, ‘community managed’, with no members of staff and reliant on volunteers and partners coming forward to run it.&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Cardiff","Sun, 08 Feb 2015 22:09:02 +0000","Cardiff – Hundreds at Cardiff library cuts and closure protest – BBC. &#34;About 400 people have gathered in Cardiff to oppose council plans to cut funding for libraries. Local writers joined the rally outside Central Library against the possible closure of seven libraries in the city. People held placards and banners calling for them to be saved, while dozens held books in the air and read stories out loud in unison. The council has said it needs to save £48.3m in 2015/16 and a final decision will be made on 26 February.&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Gloucestershire","Sun, 08 Feb 2015 22:09:02 +0000","Gloucestershire – Witches, wizards and muggles welcomed to Stroud Library for Harry Potter craft day – Gloucester Citizen. Some lovely events, including owl handling, for Harry Potter Night.","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Gwynedd","Sun, 08 Feb 2015 22:09:02 +0000","Gwynedd – Gwynedd library visits fall by more than 11% – Daily Post. &#34;A census carried out by councils to estimate the number of visits has revealed that Gwynedd’s libraries had 380,276 visits during 2014 – a fall of 11.4% from the 429,208 visitors in 2013. But the figures also show that Denbighshire, Anglesey and Conwy recorded an increase in 2014, although their figures were still well below the visitor numbers of two years ago.&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Kent","Sun, 08 Feb 2015 22:09:02 +0000","Kent – Concerns raised over future of Sandwich Library and possible cuts to services after Kent County Council announced changes – Kent Online. &#34;Concerns have been raised over the future of Sandwich Library and possible cuts to services. Speaking at the Sandwich Town Council meeting last week, Cllr Paul Carter explained he was against the proposal to put libraries under the responsibility of a charitable trust.&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Lincolnshire","Sun, 08 Feb 2015 22:09:02 +0000","Lincolnshire – Libraries do everything councils want – so why try to get rid of them? – Lincolnshire Echo. &#34;Libraries are a doorway to all public and voluntary services. The internet on library computers is a window to the world. It is not one we would want to close nor relinquish to an uncertain future.&#34;see also Campaigners’ dismay as library cuts voted in – Stamford Mercury.","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Northamptonshire","Sun, 08 Feb 2015 22:09:02 +0000","Northamptonshire – Library bosses in Northamptonshire reject criticism of public donation scheme - Northampton Chronicle. &#34;The move was criticised by the leader of the Labour, Councillor John McGhee, Labour councillor Danielle Stone and the author, Alan Moore, as an indication that the service was underfunded. The Chron ran a leader column praising the work of library staff but highlighting that the public was increasingly being asked to pay twice to maintain the same level of services. The council has hit back saying the scheme did not demonstrate a cut to the service that it was &#34;another example of the constant work in the county to make sure libraries are hubs at the very heart of our communities&#34;.&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Southampton","Sun, 08 Feb 2015 22:09:02 +0000","Southampton – Young people get say on libraries’ ‘future’ - Bitterne Park Info. &#34;The council says school and library staff have been asked to publicise the new questionnaires, and to give young people the assistance they may need to fill them out, although they can also be completed from internet-connected homes. &#34; … &#34;bitternepark.info understands from a freedom of information request that the cost for the council’s external suppliers to produce it, and then analyse and report on responses, is expected to be around £26,000″","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Sheffield","Sun, 08 Feb 2015 22:09:02 +0000","Sheffield – Sheffield library looks to the future after huge change – Star. &#34;Grandma Dot Russell, a former librarian at Stannington Library and now its manager, said: &#34;A year ago I didn’t think I would be running this library, not in a month of Sundays.&#34; … &#34;&#34;It is very much like it was in terms of atmosphere.. Obviously the staffing has changed, but I have to say the volunteers are very committed, they want to come in as much as they can&#34; … &#34;Trustees say at least two people join per week and local businesses are interested in holding events.&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Shropshire","Sun, 08 Feb 2015 22:09:02 +0000","Shropshire – Hundreds turn out to oppose Church Stretton library move – Shropshire Star. &#34;During the meeting, held at the Silvester Horne Institute, Mr Lewis said the move could save £43,000 – and that he has to cut £1.3 million from the library budget across the county. A consultation is running on proposals to move the library from the town centre to Church Stretton Academy, half a mile outside the town. Professor John Whitelegg, from the Church Stretton Library Support Group, said: &#34;This is not just a campaign to protect and preserve and enhance an incredible valuable public facility, it’s a campaign to protect and preserve and enhance Church Stretton.&#34;","2015/02/sanctuary-celebration-and-love-not-bad-people-not-bad.html"],["Birmingham","Tue, 10 Feb 2015 21:03:59 +0000","Birmingham – Library of Birmingham cuts ‘sadden’ Lord Whitby - Birmingham Post. &#34;The former council leader Lord Whitby said he was &#34;saddened&#34; by threatened cuts to the Library of Birmingham. Tory Lord Whitby, who as council leader spearheaded the development of the £188 million library between 2007 and 2012, is also calling on his Labour successors to reconsider its plans for £1.5 million cuts. In his first interview since the cuts were announced, Lord Whitby urged the current Labour leadership to be more imaginative and creative in seeking funding for the landmark facility.&#34;","2015/02/glory-days.html"],["Cardiff","Mon, 16 Feb 2015 10:22:58 +0000","Cardiff – Scrapping Trident would save millions – Wales Online / Letters. &#34;Libraries are a vital public service, and I was delighted that the voice of the people of Cardiff has been heard and the libraries saved – at least for a year. Our job now must be to ensure a long-term plan to sustain and develop our libraries so that we don’t face such threats of closure in future years&#34;","2015/02/a-week-of-public-library-news.html"],["Cardiff","Mon, 16 Feb 2015 10:22:58 +0000","Cardiff – Why we should consider a 5p a book charge to save Cardiff’s libraries - Wales Online. A look at the history of public libraries in Cardiff, ending with &#34;Is it blasphemy to suggest that maybe, just maybe, a small payment, perhaps 5p per book, might be made by those who could afford it? Or better still, scrap the Trident programme that cost us £1.4m a day during 2014 and contemplate the waste of £6.2bn on two aircraft carriers. That could pay for a lot of hospitals, houses – and libraries.&#34;","2015/02/a-week-of-public-library-news.html"],["Lancashire","Mon, 16 Feb 2015 10:22:58 +0000","Lancashire – Libraries could share with cafes as County Hall looks at ways of balancing the books – LEP. &#34;County Hall chiefs looking for economies have pledged not to shut a single branch down – even if it means books sharing with beverages to save cash.  … Austerity measures mean that the county’s library service will have to be slimmed down, even though the number of branches will remain the same. That could mean some libraries moving into smaller buildings, sharing with other council services or joining forces with local businesses such as cafes.&#34;","2015/02/a-week-of-public-library-news.html"],["Manchester","Mon, 16 Feb 2015 10:22:58 +0000","Manchester – Manchester Central Library: Fears that tens of thousands of books may have been pulped during £170m restoration of building - Independent. &#34;Carol Ann Duffy, Simon Armitage and Jeanette Winterson were among the writers who had called for an end to the pulping of non-fiction titles during the library’s £170m restoration in 2012. They described it as &#34;cultural vandalism on an industrial scale&#34;. Nothing more was heard until the Friends of Central Library group recently submitted a Freedom of Information request. Neil MacInnes, Manchester’s head librarian, wrote in an email that about 240,000 items, representing more than 40 per cent of the reference stock, were &#34;withdrawn and are no longer available&#34;.&#34; … &#34; There were no losses to the special collections, rare books, local history collections or the City Archives, but most non-fiction books were sold to a local company, Revival Books, which disposed of them.&#34;","2015/02/a-week-of-public-library-news.html"],["Cardiff","Tue, 10 Feb 2015 21:03:59 +0000","Cardiff – Author Ken Follett ‘horrified’ to learn that Cardiff is considering closing its libraries - Wales Online. &#34;The Cardiff-born writer, who has sold more than 130 million books worldwide said he owed his own career to the help of Cowbridge Road Library in Canton&#34; … &#34;He said closing public libraries was a &#34;Dickensian decision&#34; which would &#34;make worse any divisions in our society&#34;","2015/02/glory-days.html"],["Cardiff","Tue, 10 Feb 2015 21:03:59 +0000","Cardiff – Cardiff libraries are saved as people power wins the day – and the plan to axe funding for seven libraries is dropped  – Wales Online. &#34;The seven Cardiff libraries under threat of closure have been reprieved, we can reveal. The decision by the city’s ruling Labour group follows a massive public campaign to save library services. It will be ratified by the authority’s cabinet and is expected to go through the budget setting full council meeting without opposition.&#34; … &#34;Coun Graham Hinchey, the council’s cabinet member for corporate services and performance, said a new unit would be set up to explore partnerships and other ways of &#34;delivering library services&#34;.&#34;","2015/02/glory-days.html"],["Thurrock","Tue, 10 Feb 2015 21:03:59 +0000","Thurrock – Community and politicians join forces in &#34;Save our libraries&#34; campaign – Your Thurrock. &#34;Over in Corringham, community champion, Julia Sorrels-Wilde was out with hard working Ukip councillor, Roy Jones as well as community pastor at St Margaret’s church in Stanford, Maureen McPherson and numerous volunteers whilst Labour candidate for Stanford West, Ella Vine was also out in King Street and surrounding areas campaigning.&#34;","2015/02/glory-days.html"],["Staffordshire","Mon, 16 Feb 2015 10:22:58 +0000","Staffordshire – Victory for Penkridge Library campaigners as Staffordshire County Council rethinks plans – Staffordshire Newsletter.","2015/02/a-week-of-public-library-news.html"],["Staffordshire","Mon, 16 Feb 2015 10:22:58 +0000","Staffordshire – Volunteers set to take over three North Staffordshire libraries - Stoke Sentinel. &#34;The libraries in Silverdale, Loggerheads and Werrington are among six facilities which will become ‘early implemen ters’ of a new community managed/community delivered model&#34;","2015/02/a-week-of-public-library-news.html"],["Cardiff","Tue, 10 Feb 2015 21:03:59 +0000","Cardiff – Cardiff’s ‘strong message’ on National Libraries Day – BookSeller. &#34;Library campaigners in Cardiff believe they &#34;sent a strong message&#34; to the city council with a National Libraries Day protest against planned cuts to the service. More than 200 people gathered outside the city’s Central Library on Saturday (7th February) to hold a mass &#34;read-in&#34;, with people reading passages of their favourite books and speaking about the importance of libraries in the city.&#34;","2015/02/glory-days.html"],["Coventry","Tue, 10 Feb 2015 21:03:59 +0000","Coventry – Read In - Save Coventry Libraries. Monday 23r February at 4.45.","2015/02/glory-days.html"],["Essex","Tue, 10 Feb 2015 21:03:59 +0000","Essex – Essex County Council offering library internship to young jobseekers - Harlow Star. &#34;Young people on jobseekers benefits are being given a chance to begin a career as a librarian as part of an Essex County Council scheme. Applications are now open for the 30-hours a week paid internship within Essex libraries which is being run as part of a national scheme to help young people get jobs in the arts and creative industries.&#34; … &#34;The successful candidate will join professional teams to help improve services and learn how a modern library service works. They will also gain skills and experience in key areas of library service such as working on campaigns to improve customers’ digital skills and coordinating summer literature festivals&#34;","2015/02/glory-days.html"],["Hertfordshire","Tue, 10 Feb 2015 21:03:59 +0000","Hertfordshire – Hertfordshire County Council Library Service presented with busiest self-service kiosk in Europe award – Bibliotheca. &#34; Hertfordshire Library Service has 87 Bibliotheca self-service kiosks installed across its 46 library branches &#34;","2015/02/glory-days.html"],["Kirklees","Tue, 10 Feb 2015 21:03:59 +0000","Kirklees – We can save local libraries, say Kirklees Conservatives – and relocating Huddersfield’s Central Library is key - Examiner.  Conservative leader says &#34;The shortfall in what the council spends now and what the Labour administration has put forward is £5.8m against £3.9m. &#34;We believe we can keep the libraries and the mobile service open by identifying two things: firstly, the relocation of Huddersfield Central Library, which at present takes up 27% of the whole libraries budget. &#34;That singe library is absorbing much of the budget and we believe it can be relocated within the town centre and be far less expensive to run.&#34;  see also Conservatives pledge to keep all libraries open - Dewsbury Reporter.","2015/02/glory-days.html"],["West Dunbartonshire","Tue, 10 Feb 2015 21:03:59 +0000","West Dunbartonshire – West Dunbartonshire Council withdraws library closure proposals - CILIPS. &#34;After considering the outcome of a public consultation into cutting libraries and staff in West Dunbartonshire, the Council has withdrawn closure plans. Instead,  The Council set a one year budget which includes £500k to refurbish Clydebank Library and £20k to install a public WC in Balloch Library.  Free wi-fi is also due to be installed in all branches over the next couple of months.&#34;","2015/02/glory-days.html"],["Lincolnshire","Mon, 16 Feb 2015 10:22:58 +0000","Lincolnshire – Changing Lincolnshire’s library set-ups isn’t arbitrary – we must find a way to save £2 million – Lincolnshire Echo. Conservative councillor says &#34;Since 2010, the council has had to find annual savings of £150 million. And there’s more to come – around £120 million per year. To put that in context, by the end of this decade our budget will have been more-or-less halved. This is partly due to the disastrous mismanagement of the nation’s finances by the previous Labour government …&#34;","2015/02/a-week-of-public-library-news.html"],["North Yorkshire","Mon, 16 Feb 2015 10:22:58 +0000","North Yorkshire – Stokesley Library: Over 1,600 residents sign petition against volunteer proposals - Gazette Live. &#34;1,685 residents put their name to the petition opposing plans for Stokesley Library to run as a ‘community-managed’ model to save cash&#34; … &#34;The locals believe the library should run as a &#34;hybrid&#34; model instead – where volunteers work with paid members of staff.&#34;","2015/02/a-week-of-public-library-news.html"],["North Yorkshire","Mon, 16 Feb 2015 10:22:58 +0000","North Yorkshire – Starbeck Library campaigners’ 444-signature petition – Harrogate Advertiser. &#34;A petition, with 444 signatures, has been delivered to the council offices in Northallerton in a bid to get NYCC to change its plans for the future of Starbeck Library. It is hoped that this, along with several letters, sent to residents by the Starbeck Residents’ Association, will go some way to getting the community’s views across. Chair of Starbeck Residents’ Association Geoff Foxall said: &#34;Though I phoned beforehand I didn’t exactly have a welcoming committee waiting for the petition.&#34;","2015/02/a-week-of-public-library-news.html"],["Trafford","Mon, 16 Feb 2015 10:22:58 +0000","Trafford – Hale Library must stay says Altrincham MP Brady – Messenger. &#34;Mr Brady said: &#34;I support the campaign to ensure that it remains open and available for local people, either in its current building, or in a new facility following redevelopment.&#34; According to Mr Brady, Hale Library is used by thousands of people including mums and toddlers, community groups, people who need access to the internet, artists, charities and many more. He added: &#34;It is efficiently staffed by both paid staff and volunteers and is one of the few public libraries in the south of the borough.&#34;","2015/02/a-week-of-public-library-news.html"],["Cardiff","Tue, 10 Feb 2015 21:03:59 +0000","Cardiff – Fighting talk - Jackie Morris. &#34;The crowd grew. People with books. People of all ages, colours and heights. Most had books with them. Some had the most excellent banners and statements.&#34; … &#34;Librarie&#34;s taught me to read. And because I can read I have a structure to frame my thoughts and can express them through words, writing in particular. I have a voice. Free at the point of use, a library is a treasure house. A local library, yes, but each and every local library forms part of a national treasure and as such should be funded nationally. We don’t fund defence county by county. Why do we fund libraries county by county? Only because then the anger at their decline is focussed away from the national government.&#34;","2015/02/glory-days.html"],["Hertfordshire","Tue, 10 Feb 2015 21:03:59 +0000","Hertfordshire – Inspiring Libraries moves ahead - Council. &#34;Hertfordshire County Council’s innovative ‘Inspiring Libraries’ strategy will be discussed at the Customer Service, Performance and Libraries Panel on Tuesday 10 February. The strategy, which was published in September last year, sets out a vision of the library at the heart of the community, ambitious in its use of digital technology and delivered in partnership with local residents, organisations and communities. Most importantly, it proposed retaining all of Hertfordshire’s 46 libraries. To do this, it proposed reorganising them into three distinct tiers and replacing the current mobile library service with an expanded Home Library Service for people with disabilities and mobility problems and carers. &#34;","2015/02/glory-days.html"],["North Yorkshire","Tue, 10 Feb 2015 21:03:59 +0000","North Yorkshire – North Yorkshire’s second library consultation ends – BBC. &#34;The county’s library budget is being almost halved in 10 years, from £7.8m in 2010 to £4.2m by 2020. Currently nine of the county’s 42 libraries are run by community groups but under new proposals, many more libraries would be community-run. North Yorkshire County Council (NYCC) said more than 7,000 people had taken part in the consultation.&#34; see also Over 7,500 people have their say on a new chapter for libraries - Yorkshire Post.","2015/02/glory-days.html"],["Walsall","Tue, 10 Feb 2015 21:03:59 +0000","Walsall – Campaigners show support for under-threat Walsall library – Express and Star. &#34;Around 300 people came to the library in Blackwood Road to mark National Libraries Day. Walsall Council, which has to save £86m over the next four years, is still ploughing ahead with plans to close eight libraries, including Streetly, despite thousands of users signing petitions against the move. Linda McManus, who is part of the Save Streetly Library community campaign group, which has around 750 supporters, said the event on Saturday was held to celebrate the community facility and the good work the librarians do.&#34; … The planned closure date of five libraries – Pheasey, Beechdale, Walsall Wood, Walsall South and Streetly – has been deferred by three months. They will now close on July 1. Three others, in Rushall, New Invention and Blakenall, after that.&#34;","2015/02/glory-days.html"],["Hertfordshire","Mon, 16 Feb 2015 10:22:58 +0000","Hertfordshire – Overhaul of library system planned by Hertfordshire County Council - Hertfordshire Mercury. &#34;Remote video-link assistance, a mobile app and organised public transport are just some of the ways the libraries are being brought into the 21st century.&#34; £1m per year cut. &#34;The new mobile app also allows customers to read e-books, renew orders, and access account information, among other things.&#34; … &#34;For towns with a small library and retained fire station, the two may be combined via a £700,000 grant, although finer details of this are yet to be finalised.&#34; … &#34;Although no libraries are shutting entirely, full-time staff will be lost at all centres on the bottom rung of the council’s new tier system.&#34; see also Paid staff to stay at Sawbridgeworth Library and Stortford’s to pilot new technology under council plans - Herts and Essex Observer. &#34;The council has three main aims for its libraries – to take them into the digital age, to enhance them as gateways for reading, and to make them communi&#8230;","2015/02/a-week-of-public-library-news.html"],["Lincolnshire","Mon, 16 Feb 2015 10:22:58 +0000","Lincolnshire – Parish: ‘running library fiscally imprudent’ – Boston Standard. &#34; &#34;The parish councils both looked into it and said ‘we can’t go on and we’re not putting the precept up by £12,000 a year’. He said the library, which included a number of computer stations, housed the parish and county councils and allowed access to the Job Centre website, was an important location serving two villages which he says has a higher population combined than Horncastle – which is keeping its library. He said: &#34;It’s a hive of activity and we’re going to lose it.&#34;&#34;","2015/02/a-week-of-public-library-news.html"],["West Dunbartonshire","Tue, 10 Feb 2015 21:03:59 +0000","West Dunbartonshire – West Dunbartonshire Council withdraws library closure proposals - CILIPS. &#34;After considering the outcome of a public consultation into cutting libraries and staff in West Dunbartonshire, the Council has withdrawn closure plans. Instead,  The Council set a one year budget which includes £500k to refurbish Clydebank Library and £20k to install a public WC in Balloch Library.  Free wi-fi is also due to be installed in all branches over the next couple of months","2015/02/glory-days.html"],["Essex","Tue, 10 Feb 2015 21:03:59 +0000","Essex – The Open Book Project in Loughton needs public contributions for future projects – Guardian series. &#34;People are being urged to help keep their library open by suggesting new uses and ideas for the public space. The Open Book Project has been collecting community ideas in Loughton library on Tuesdays and Thursdays since January 22, and a fresh appeal is now being made for more members of the public to contribute.&#34;","2015/02/glory-days.html"],["Birmingham","Mon, 16 Feb 2015 10:22:58 +0000","Birmingham – Rally for the Library of Birmingham 7/2/15 #rally4LOB #NLD15 - Stop the privatisation of public libraries. Text of speech by Alan Wylie.","2015/02/a-week-of-public-library-news.html"],["Lincolnshire","Mon, 16 Feb 2015 10:22:58 +0000","Lincolnshire – Councillor attacks library cuts –  Horncastle News. The &#34;controversial decision to hand the running of libraries to volunteer groups will &#34;rip the heart&#34; out of rural communities. That is the stark warning from County Councillor Colin Mair who has admitted Coningsby/Tattershall Library looks almost certain to close. Coun Mair (UKIP), who represents the Tattershall Castle ward, said he was bitterly opposed to the County Council’s handling of the libraries saga which he said &#34;stank.&#34;&#34;","2015/02/a-week-of-public-library-news.html"],["Bristol","Tue, 17 Feb 2015 21:19:46 +0000","Bristol – Plans announced for school in Bristol Museum – Bristol 24/7. Parody of the move of a free school into Bristol Central Library. &#34;The mayor played down the link on Twitter, adding: &#34;I’m a strong supporter of the museum service, but not of a campaign that puts museum artefacts before Bristol kids’ education&#34;, like it was some kind of bleedin’ binary choice. &#34;","2015/02/necessity-is-the-mother-of-invention-libraries-in-2015.html"],["Camden","Tue, 17 Feb 2015 21:19:46 +0000","Camden – Volunteer-run Primrose Hill Community Library celebrates National Libraries Day – Camden New Journal. &#34;Newbie writers Roz Davies and Stephen Oram shared their experiences of tackling the world of self-publishing on Saturday as volunteers from Primrose Hill Community Library celebrated National Libraries Day 2015.&#34;","2015/02/necessity-is-the-mother-of-invention-libraries-in-2015.html"],["Cornwall","Tue, 17 Feb 2015 21:19:46 +0000","Cornwall – Cornwall Council agrees 1.97% council tax increase – West Briton. &#34;Fiona Ferguson, leader of the Conservative group, said she could not support a budget which was &#34;cutting services&#34; including funding for libraries, youth services and leisure services.&#34;","2015/02/necessity-is-the-mother-of-invention-libraries-in-2015.html"],["Hampshire","Tue, 10 Feb 2015 21:03:59 +0000","Hampshire – Kingsclere library saved by volunteers – Basingstoke Gazette. &#34;villagers are celebrating after a group of volunteers stepped forward to save their much-loved local library. As previously reported in The Gazette, residents were warned just weeks ago that the library would close in March unless new co-ordinators could be found to take responsibility for the facility … 25 volunteers have now been found to take over the running of the library, led by a committee of four volunteer co-ordinators. The parish council will support the library financially for the first year with a £3,000 grant, and charitable group The Headley Trust has pledged grants of between £2,250 and £2,750 for the following three years. Hampshire County Council estimated that it would save between £16,000 and £18,000 each year by transferring the library to a community group.&#34;","2015/02/glory-days.html"],["Windsor and Maidenhead","Tue, 10 Feb 2015 21:03:59 +0000","Windsor and Maidenhead – Sophie, Countess of Wessex to officially open library - Maidenhead Advertiser. &#34;As well as opening the Boyn Grove Library in Courthouse Road, Her Royal Highness, will also visit the sensory room, which is used by people with learning disabilities and elderly residents with dementia.&#34; &#34;I am delighted that the library has already proved so popular with the local community,&#34; said Cllr Eileen Quick, cabinet member for leisure and libraries. &#34;It’s now a vital part of their lives and a real asset to the Royal Borough. &#34;We are very honoured that HRH The Countess of Wessex will be coming to see it and officially open it.&#34; The library first opened it’s doors in April with over 31,000 residents living within one mile of the centre benefiting from it’s facilities.&#34;","2015/02/glory-days.html"],["Derbyshire / Staffordshire","Mon, 16 Feb 2015 10:22:58 +0000","Derbyshire / Staffordshire – Budget cuts takes toll on library services in Staffordshire and Derbyshire - Burton Mail. Burton under Needwood Library to become volunteer in Staffordshire. Derbyshire has cut its mobile libraries from 10 to 2.","2015/02/a-week-of-public-library-news.html"],["Lincolnshire","Mon, 16 Feb 2015 10:22:58 +0000","Lincolnshire – Lincolnshire Library Campaigners Interviewed by Tokyo Academic - Save Lincolnshire Libraries. &#34;This week, Save Lincolnshire Library campaigners Maurice Nauta and Angela Montague discussed the Lincolnshire campaign with Chie Suga, academic and scholar famed for her knowledge of the UK library scene. Ms Suga is a Lecturer at the School of Library and Information Science, Keio University, Tokyo.&#34;","2015/02/a-week-of-public-library-news.html"],["Shropshire","Mon, 16 Feb 2015 10:22:58 +0000","Shropshire – Shropshire library boss’s pledge over service changes – Shropshire Star. &#34;Changes to services at Shropshire’s libraries as a result of budget cuts will be made on a case-by-case basis. That is the pledge from Michael Lewis, head of the library service for Shropshire Council, who today said people will be asked what is important to them in their libraries.&#34;. see also We’ll try to keep Shropshire libraries open despite £1.3 million cuts, say council chiefs – Shropshire Star. &#34;council chiefs said today they could not rule out the possibility of some closures as part of a review into the county’s 22 libraries over the next three years&#34;","2015/02/a-week-of-public-library-news.html"],["Wirral","Mon, 16 Feb 2015 10:22:58 +0000","Wirral – Seacombe Library is occupied as protesters battle against cuts in opening hours across Wirral - Liverpool Echo. &#34;Protestors were tonight staging an occupation in Seacombe Library to express their opposition to plans to reduce several libraries’ opening hours. A group of 17, representing campaigning community group Wirral SOS and the TUC, entered the library shortly before it was due to close at 5pm.&#34;. Chief Exec says &#34;&#34;It’s a group of people, they are being very quiet and very well-behaved and they are reading and they are making their point, and that’s fine. The only problem is that I have got a member of staff who finished at five who wants to go home.&#34;","2015/02/a-week-of-public-library-news.html"],["Wrexham","Mon, 16 Feb 2015 10:22:58 +0000","Wrexham – Calls To Create Local Trust For Wrexham Libraries - Wrexham.com. A look at the pros and cons of passing libraries to a trust based in South Wales.","2015/02/a-week-of-public-library-news.html"],["Lincolnshire","Tue, 17 Feb 2015 21:19:46 +0000","Lincolnshire – Department for Culture will probe complaint over Lincolnshire libraries cuts - Lincolnshire Echo. &#34;The Government is considering if a comprehensive and efficient library service is being provided by Lincolnshire County Council. This investigation will help Culture Secretary Sajid Javid determine if a local inquiry is needed in response to a complaint from retired chief librarian Maurice Nauta.&#34; … &#34;Mr Nauta, a member of Save Lincolnshire Libraries, said: &#34;We are very pleased with the response from DCMS. &#34;It is not late for a re-think by the county council.&#34; A local inquiry could result in the Secretary of State stepping in. The council says it is confident its plan is legally sound.&#34; see also Department for Culture will probe complaint over Lincolnshire libraries cuts - Lincolnshire Echo.","2015/02/necessity-is-the-mother-of-invention-libraries-in-2015.html"],["Kent","Tue, 10 Feb 2015 21:03:59 +0000","Kent – Protestors launch petition to save our libraries – Kent News. &#34;Protestors launched a ‘save our public libraries’ petition at Whitstable Library on Saturday 7th February – National Libraries Day 2015. The protestors launched the petition in the wake of Kent County Council’s current consultation, ‘Shaping the future of library, registration and archive services in Kent’ which includes a proposal to hand over the running of Kent’s 99 libraries to a charitable trust.&#34; see also ‘Save our libraries!’ Protestors in Whitstable fight to protect services - Canterbury Times.","2015/02/glory-days.html"],["Lincolnshire","Tue, 10 Feb 2015 21:03:59 +0000","Lincolnshire – Lincolnshire library handover ‘exceptional’, says shadow minister - BBC. &#34;Labour’s Mr Bryant said he did not know of anywhere in the country that had done anything quite like it.&#34;","2015/02/glory-days.html"],["Southampton","Tue, 10 Feb 2015 21:03:59 +0000","Southampton – Campaign to save Southampton libraries – Southern Daily Echo. &#34;More than 1,000 people visited libraries across the city at the weekend, delighting the campaigners who say it shows strong public support for keeping them. Five are in jeopardy as the city council seeks to save money, including three smaller ones in Millbrook, Thornhill and Weston. At the threatened Cobbett Road library 540 people visited in just three hours, far more than usual, including scores of children who met best-selling children’s author Ali Sparkes.&#34;","2015/02/glory-days.html"],["Kirklees","Tue, 10 Feb 2015 21:03:59 +0000","Kirklees – Save Mirfield Library! #Mirfield - View from the Citadel. Reasons to save library include &#34;It’s about the only civic building left in the town. It acts as a hub for commemorations and festivities. It’s a great place to take children to discover and choose books. Yes, proper books. While we’re on the topic of books. Yes you can take out books – and lots more besides. It provides services and support for people who don’t always have internet access (for example) at home. It employs dedicated, helpful and passionate people. It has a great reading room upstairs to do research, reading and writing (I wrote a lot of the Hopfield Tales up there). Or just soak up the relaxing atmosphere in there. Libraries are a cornerstone of civilisation. Okay, I’m over-egging the pudding a bit here, but I mean it.&#34;","2015/02/glory-days.html"],["Hertfordshire","Mon, 16 Feb 2015 10:22:58 +0000","Hertfordshire – Inspiring Libraries moves ahead – Hertfordshire Council (press release). &#34; ‘Inspiring Libraries’ aims to make the Library Service more accessible and increase usage, while costing the taxpayer less. By doing things differently at a time of significant financial challenge, we aim to save £2.5million each year while building a more modern service and without the need to close any of our libraries. &#34;","2015/02/a-week-of-public-library-news.html"],["Kent","Mon, 16 Feb 2015 10:22:58 +0000","Kent – Bid to &#34;save&#34; public libraries in Courier. Campaigners against libraries being run by a trust. &#34;&#34;We demand that KCC councillors ensure that this integrated network of 99 libraries continues to be free and open to all with current levels of local accessibility and opening hours maintained or improved; run by professional librarians and appropriately remunerated staff – with volunteers providing additional support and democratically accountable to elected councillors and bound by Freedom of Information.&#34;","2015/02/a-week-of-public-library-news.html"],["Lincolnshire","Mon, 16 Feb 2015 10:22:58 +0000","Lincolnshire – Council have lost the plot over libraries – Louth leader / Letter. &#34;Its not right that Sutton on Sea and Alford could end up with nothing if the community volunteers do not take it over fully. The mobile library would not be suitable for so many people to use at 1 time as has already been proven through the residents association. &#34;","2015/02/a-week-of-public-library-news.html"],["Surrey","Mon, 16 Feb 2015 10:22:58 +0000","Surrey – Streetview of Epsom Library – Google. Full walkaround streetview of the interior of Epsom Library.","2015/02/a-week-of-public-library-news.html"],["Cardiff","Mon, 16 Feb 2015 10:22:58 +0000","Cardiff – Big names welcome Cardiff libraries reprieve after seven branches given year-long stay of execution - Wales Online. Various celebrities welcome the news.","2015/02/a-week-of-public-library-news.html"],["Lincolnshire","Mon, 16 Feb 2015 10:22:58 +0000","Lincolnshire – United Kingdom-Lincoln: Library services - Tenders Electronic Daily. &#34;Lincolnshire County Council is considering running a competitive process in the spring of 2015 for the delivery of a comprehensive library service including provision of relevant IT that meets the following requirements: — To meet the Council’s statutory duty to provide a comprehensive and efficient library service. Lincolnshire County Council is therefore seeking Expressions of Interest for the provision of the Library Service. Estimated cost excluding VAT: Range: between 25 000 000 and 50 000 000 GBP&#34;","2015/02/a-week-of-public-library-news.html"],["Thurrock","Mon, 16 Feb 2015 10:22:58 +0000","Thurrock – Campaign to save our libraries is gathering pace – Braintree and Witham Times. &#34;campaign to save Thurrock libraries is gathering pace with the petition to save Corringham Library reaching more than 2,000 signatures. Campaigners say they are struggling to keep up with the level of demand for forms&#34; … &#34;Peter Saunders, of the Chadwell St Mary Community Forum, said: &#34;It seems to us that the library service in Thurrock has been singled out for a particularly savage cut by the council, and if that is allowed to go through, it will have an irreversibly detrimental effect on leisure, education, training and jobseeking locally.&#34;","2015/02/a-week-of-public-library-news.html"],["Lincolnshire","Mon, 16 Feb 2015 10:22:58 +0000","Lincolnshire – Campaigner told &#34;Your representation is being treated as a formal complaint&#34; – Save Lincolnshire Libraries (press release). &#34;The Department of Culture Media and Sport’s ‘Library Team’ has, in a letter dated 13th February 2015, confirmed that a complaint lodged with them by Mr Maurice Nauta on behalf of the Save Lincolnshire Libraries campaign will be proceeded with, in accordance with Section 10 (1) (a) of the Public Libraries and Museums Act 1964. The Department’s letter (attached) clarifies that they will be writing to Lincolnshire County Council to inform them that a formal complaint from Mr Nauta (also attached) has been made to the Secretary of State concerning the proposed changes to Lincolnshire’s library service provision.  The DCMS ‘Library Team’ further confirms therein that the council will be advised that the matter is being treated as a formal complaint, and that it will request appropriate information and clarification on relevant issues relating to the county council’s duty under the Act to de&#8230;","2015/02/a-week-of-public-library-news.html"],["Stoke on Trent","Mon, 16 Feb 2015 10:22:58 +0000","Stoke on Trent – Library visitor numbers in Stoke-on-Trent one of lowest in UK - Staffs Live. &#34;Statistics from the Chartered Institute of Public Finance and Accountancy (Cipfa), show the city’s libraries ranked 183rd out of 187 local authorities last year … But Stoke-on-Trent City Council said the latest figures show its libraries dealt with more enquiries compared to the previous year. Computer logins were up 15,601, and people actively using the library service was up by 1,956. This is despite the number of people borrowing books going down, blamed on the growing use of the internet and e-books.&#34;","2015/02/a-week-of-public-library-news.html"],["Lincolnshire","Mon, 16 Feb 2015 10:22:58 +0000","Lincolnshire – DCMS tell Lincolnshire Libraries Campaigner: &#34;Your representation is being treated as a formal complaint&#34; – Save Lincolnshire Libraries. &#34;The Department’s letter (attached) clarifies that they will be writing to Lincolnshire County Council to inform them that a formal complaint from Mr Nauta (also attached) has been made to the Secretary of State concerning the proposed changes to Lincolnshire’s library service provision. The DCMS ‘Library Team’ further confirms therein that the council will be advised that the matter is being treated as a formal complaint, and that it will request appropriate information and clarification on relevant issues relating to the county council’s duty under the Act to deliver a &#34;comprehensive and efficient&#34; library service.&#34;","2015/02/a-week-of-public-library-news.html"],["Lincolnshire","Mon, 16 Feb 2015 10:22:58 +0000","Lincolnshire – Moves to cut library funds are endorsed – Lincolnshire Echo / Letter. &#34;The recent public budget consultation exercise has endorsed this approach. Even so, we are trying to protect front-line services and, in the case of libraries, we came up with a plan to keep more open, encourage volunteering and save money, which unfortunately fell foul of a legal technicality [the council lost a judicial review – Ed]. We are now legally obliged to put the whole library service out to tender under EU rules, even though we have had several expressions of interest.&#34; see also Libraries are a soft target for critics - Lincolnshire Echo/Letter. &#34;In fairness, there is hardly a major council in England that is not considering altering its library services in some way.&#34; and Library campaigners pledge to fight on - Skegness Standard.","2015/02/a-week-of-public-library-news.html"],["Coventry","Tue, 17 Feb 2015 21:19:46 +0000","Coventry – Coventry council to press ahead with unprecedented cuts to services - Coventry Observer. &#34;Labour councillors, who have a huge majority at the Council House, are to press on with their ‘City Centre First’ three-year plan to close most council services in most communities – including libraries, youth clubs, children’s centres, community centres, adult education centres and more … Willenhall is the latest of four Coventry communities to petition against the threat of library closures, while town hall trade unions and Socialists have led wider protests against the cuts.&#34;","2015/02/necessity-is-the-mother-of-invention-libraries-in-2015.html"],["Coventry","Tue, 17 Feb 2015 21:19:46 +0000","Coventry – Residents stage Save Walsgrave Road library protest on Valentine’s Day - Coventry Telegraph. &#34;Residents rallied round on Valentine’s Day to show how much they love their local library. Gosford Park Residents’ Association organised the protest on Saturday at Stoke Library in Walsgrave Road which is under threat of closure. People turned up to the 100-year-old library to show their support after it was announced that Stoke Library could be affected by the possible closure of most of the city’s 17 libraries as part of annual budget cuts.&#34;","2015/02/necessity-is-the-mother-of-invention-libraries-in-2015.html"],["Leicestershire","Tue, 17 Feb 2015 21:19:46 +0000","Leicestershire – Call to keep rural libraries council-run – Nuneaton News. &#34;Hinckley and Bosworth Borough Council representatives, councillor Mathew Hulbert of Barwell ward, and councillor Michael Mullaney of Trinity ward, went along to Hinckley Library to be part of National Libraries Day. The event celebrates the role libraries play in communities up and down the Country.&#34;.  Notes that many libraries in county will soon by run by volunteers.","2015/02/necessity-is-the-mother-of-invention-libraries-in-2015.html"],["Barnet","Sun, 22 Feb 2015 21:02:30 +0000","Barnet – Barnet’s Labour councillors put forward motion to halt library cuts – This is Local London. &#34;Barnet’s Labour councillors have put forward a motion to be debated at the next full council meeting to halt plans to cut £2.85m from the borough’s libraries, and to re-consult residents on different options. &#34;.  Opposition councillor say &#34;&#34;There are Conservative councillors who feel very strongly about their libraries, and we are giving them the opportunity to step back.&#34;","2015/02/being-open-about-weeding.html"],["Barnet","Sun, 22 Feb 2015 21:02:30 +0000","Barnet – Email Barnet’s Conservative councillors to stop the library cuts – Barnet Labour. &#34;Labour councillors are calling for an Extraordinary Council meeting to try and halt the £2.85 million of cuts to the Barnet Library Service on the 3rd March before the council makes the final decision on the next three year’s budget.&#34;.  Suggested email wording.","2015/02/being-open-about-weeding.html"],["Southampton","Sun, 22 Feb 2015 21:02:30 +0000","Southampton – ‘We have to fight fiercely for libraries’ says Chris Packham - Bitterne Park Info. &#34;TV presenter, naturalist and photographer Chris Packham, pictured above with a group of library users, gave a talk and showed his impressive wildlife photographs from around the world at Cobbett Road Library on Thursday (Feb 19). Speaking about the possible closure of Southampton libraries, Packham told a packed meeting room: &#34;Caring is not enough. You’ve got to do something. And to do something in this instance is to turn up to that meeting [on Monday at the Ascension Centre] and make your voices heard.&#34; Read more to hear a clip of Chris Packham talking about library closures – and what he thinks about the recurring idea of selling bits of the Southampton’s art collection.&#34;","2015/02/being-open-about-weeding.html"],["Walsall","Sun, 22 Feb 2015 21:02:30 +0000","Walsall – Libraries and children’s centres saved under alternative Walsall Council budget plans – Express and Star. &#34;There would be fewer senior management posts and new town councils with their own cash pots formed, under rival proposals from the Liberal Democrats. They will be put forward for consideration at Full Council against the ruling Labour authority plans, which include the closure of eight libraries and loss of 12 children centres&#34;","2015/02/being-open-about-weeding.html"],["Barnet","Thu, 26 Feb 2015 22:17:23 +0000","Barnet – Hendon MP Matthew Offord speaks out against proposed library closures by Barnet Borough Council - Times Series. &#34;Mr Offord said he was concerned about the proposed closures, and was calling on the Conservative-led council to keep the libraries open. The Conservative MP said: &#34;As someone to whom books mean a great deal, I share the concern of my constituents regarding possible reduction in libraries and library services. I have been liaising with the leader of Barnet Council for some time to see how the situation might be resolved.&#34;","2015/02/cuts-ideas-and-appeals.html"],["West Sussex","Thu, 26 Feb 2015 22:17:23 +0000","West Sussex – Literary anarchists strike in Littlehampton - Littlehampton Gazette. &#34;Anyone can be an anarchist of this literary leaning – simply head for one of five points around Littlehampton where a selection of books have been left in sealed, weather-tight plastic bags and make your choice. You might want to leave a book of your own behind, too, perhaps with a note wishing the new reader well and saying why you enjoyed the book. The initiative is another creative idea from the Littlehampton Organisation of Contemporary Art (LOCA), which left five books at each of the five places on Friday. Three were titles for grown-ups, one was for teenagers and one for children. By Monday, several had been taken and the stock will be topped up tomorrow.&#34;","2015/02/cuts-ideas-and-appeals.html"],["Bedford","Sun, 22 Feb 2015 21:02:30 +0000","Bedford – Important fight to keep up local services as spending reductions continue - Bedford Today. &#34;One of these was the annual library survey by the Chartered Institute of Public Finance and Accountancy, which revealed that 337 libraries have closed since 2009/10. By contrast, not only have all branches in Bedford Borough been kept open, but there has been no reduction in opening hours either. &#34;","2015/02/being-open-about-weeding.html"],["Lincolnshire","Sun, 22 Feb 2015 21:02:30 +0000","Lincolnshire – Is libraries move legal? - Guardian series. &#34;The Government is investigating whether the county council’s bid to shove 30 of its 45 libraries into the hands of volunteers is legal. The move comes as leading national figures, author Tim Coates and The Library Campaign chairman Laura Swaffield, attacked the &#34;disgraceful&#34; and &#34;pig-headed&#34; step to dump libraries and sack 160 staff – when the council was shown it could keep them all open and still make its planned £1.9million saving.&#34;","2015/02/being-open-about-weeding.html"],["Lincolnshire","Sun, 22 Feb 2015 21:02:30 +0000","Lincolnshire – There was one (special) councillor at open day – Guardian series. &#34;I would be grateful if, through your paper, I may correct a false impression given by the report on the open day at Deeping Library when I was quoted as saying that no county councillors were there. In fact, one certainly was; Phil Dilks, shadow executive member for libraries and councillor for Deeping St James was very much present, together with his family. &#34;","2015/02/being-open-about-weeding.html"],["Nottinghamshire","Sun, 22 Feb 2015 21:02:30 +0000","Nottinghamshire – Calls for book donors at Eastwood’s phonebox library – Eastwood Advertiser. &#34;Amid worries that libraries are closing up and down the country, an anonymous librarians appear to have taken the initiative to lend books for free.&#34;.  Library manager says &#34;&#34;This new approach complements the council’s long term modernisation strategy which includes recent investment at Stapleford Library. We have a very successful mobile library service which visits rural areas of the county, and we welcome any other initiative which can help promote reading. A spokesperson added: &#34;While we have not yet been directly approached about donating library books to these &#34;phonebox libraries&#34; the county council would be happy to discuss if the issue arises with whoever has organised them.&#34;&#34;","2015/02/being-open-about-weeding.html"],["Redbridge","Sun, 22 Feb 2015 21:02:30 +0000","Redbridge – No decision yet on library closures in Wanstead and Woodford – Guardian series. &#34;Library services are under threat as the deputy leader of Redbridge council said he could not guarantee saving them from cuts .. One of the proposals was closing three small libraries as well as the mobile library services although no specific branches or centres are mentioned. Buildings could also be sold off as part of the process.&#34;","2015/02/being-open-about-weeding.html"],["Worcestershire","Sun, 22 Feb 2015 21:02:30 +0000","Worcestershire – ‘Taking on volunteers whilst axing 1,500 staff is immoral’ claims councillor - Bromsgrove Standard. Opposition councillor says &#34;&#34;It’s a topic that’s coming up repeatedly. The programme for replacing people, particularly in libraries, is one they are developing so there is not a lot we can expect to achieve. But we can point out the immorality of it. &#34;They are going to staff facilities with volunteers. It is the only way the council reckons of keeping frontline facilities available and their alternative is to shut them down.&#34;","2015/02/being-open-about-weeding.html"],["Bexley","Sun, 22 Feb 2015 21:02:30 +0000","Bexley – Bexley Council seeks community management for libraries – Bexley Times. Council &#34;seeking assistance to manage the libraries at Blackfen, Bostall, North Heath and Upper Belvedere. This follows a cabinet decision in December, approving the adoption of a new library strategy and plans for remodelling the service. The borough already has two successful community managed libraries in Bexley Village and Slade Green.&#34;","2015/02/being-open-about-weeding.html"],["Buckinghamshire","Sun, 22 Feb 2015 21:02:30 +0000","Buckinghamshire – Police and tourist office share could overcrowd Marlow library, say residents - Bucks Free Press. &#34;Setting up a temporary police desk in Marlow’s library alongside a tourist office could make it overcrowded and detract from its original purpose, residents have complained&#34; … &#34;&#34;It’s going to be crowded. Does this mean less space for library services? Is it good to combine three public services in one building or not? Where will the police park?&#34; &#34; … Facebook comment: &#34;It’s not like we want to fill the library with books or anything! Bucks seems determined to ensure that Bucks libraries have fewer books (particularly fiction) than similar sized libraries in Oxon and Berkshire, so I suppose they might as well fill it up with council services instead.&#34;","2015/02/being-open-about-weeding.html"],["Manchester","Sun, 22 Feb 2015 21:02:30 +0000","Manchester – Manchester Central Library disposed of 240,000 items during refurbishment - Guardian. &#34;A freedom of information request submitted by Friends of Manchester Central Library found that more than a third of the municipal library’s reference books and material had been removed when the building underwent a £170m restoration.&#34; … &#34;The campaign group called the cull &#34;morally reprehensible&#34;and accused the council of failing in its public duty. The council, however, justified its decision, arguing that it had used a strict set of criteria about reference material that would remain in the library’s collection.&#34;","2015/02/being-open-about-weeding.html"],["Trafford","Sun, 22 Feb 2015 21:02:30 +0000","Trafford – Leaked document reveals scale of proposed library cuts – Messenger. &#34;Its aim is to deliver a new organisational model by 2017, which will see this year alone, the closure of Bowfell, Davyhulme and Lostock Libraries and the withdrawal of funding for a toy library advisor from Delamere, slash the book fund by more than one third, employ free volunteer front counter staff, from charity Blu Sci, which helps support people with mental health issues.  It will see the removal of current library staff including team managers(4 posts), training and systems officers (one post) performance analyst (2 posts), toy library advisor (2 posts), customer service specialists (2 posts) and customer service advisor (11 posts), which will help save £618,600. &#34;","2015/02/being-open-about-weeding.html"],["Lambeth","Thu, 26 Feb 2015 22:17:23 +0000","Lambeth – Lambeth Council Cultural Consultation: Libraries hardest hit as residents asked to patch up service – Brixton Buzz. &#34;We were expecting Lambeth Council to announce the possible closure of the Minet Library and the moving of the Lambeth Archives. We weren’t quite prepared for what was to follow.&#34; … &#34;Lambeth Council wants to close the Minet and Waterloo Libraries. It proposes to flog on the land to developers. £10m is expected to be raised. This will then be invested in an endowment fund. Profit from this will then ‘enable’ residents to run the Durning, Carnegie and Upper Norwood Libraries. Council funding for these three will stop.&#34;.  &#34;this online push appears to be coming from Lambeth Council itself. Like we said – how very odd that a local authority is about to close two libraries and stop funding for three others, yet then tries to invent an online campaign saying how much they love libraries.&#34;","2015/02/cuts-ideas-and-appeals.html"],["Brent","Sun, 22 Feb 2015 21:02:30 +0000","Brent – Lib Dem candidate for Brent North pledges do donate half of his MP salary to community libraries – Brent and Kilburn Times. &#34;Paul Lorber says he is pledging £25,000 a year for the full five-year Parliamentary term to help support a community library in Barham Park and at least a further £5,000 a year to help support a re-established community library in Preston. He said: &#34;Local communities across Brent lost out when Labour Councillors decided to close six local libraries against the wishes of local people. Many local volunteers are determined to reopen as many of the closed libraries as possible and I fully support their efforts.&#34; … &#34;For the past three years he has been an active local volunteer helping to run Friends of Barham Library two volunteer libraries and bookshops in Wembley High Road and Sudbury Town Underground station&#34;","2015/02/being-open-about-weeding.html"],["Cardiff","Sun, 22 Feb 2015 21:02:30 +0000","Cardiff – Library protest success as council cuts axed - Gair Rhydd.","2015/02/being-open-about-weeding.html"],["Hull","Sun, 22 Feb 2015 21:02:30 +0000","Hull – Volunteers launch Victoria Dock community library service in Hull Daily Mail. Volunteer library opened after loss of mobile library stop.","2015/02/being-open-about-weeding.html"],["Kirklees","Sun, 22 Feb 2015 21:02:30 +0000","Kirklees – Kirklees budget 2015: Conservative proposals – Batley and Birstall News. &#34;The Conservative Party’s budget proposals include a council tax freeze, saving Kirklees’ libraries and devolving more powers to district committees … The party said it could afford to save all Kirklees’ libraries by moving Huddersfield Library to a more cost-effective location in the town’s centre, cutting the budget for union officials paid for by the council and cutting mileage expenses available to council officers.&#34;","2015/02/being-open-about-weeding.html"],["Coventry","Sun, 22 Feb 2015 21:02:30 +0000","Coventry – Every Coventry library to remain open for another year - Coventry Telegraph. &#34;City council assures short-term future of all 17 sites, but says some are a &#34;disgrace&#34; and &#34;not fit for purpose&#34;&#34; … &#34;there is no guarantee that some of the 17 libraries won’t close over the next two to three years as the council shaves £65million from its budget following reduced Government funding … Ideas include retaining some libraries at their current sites but moving others into schools, religious buildings and even GP surgeries.&#34;","2015/02/being-open-about-weeding.html"],["Lincolnshire","Sun, 22 Feb 2015 21:02:30 +0000","Lincolnshire – Plan to save Wainfleet library and historic building from closing - East Lindsey Target. &#34;Lincolnshire Country Councillor Chris Pain has organised the meeting to help save Wainfleet library and museum, located within the Magdalen College School.&#34;.  Council &#34;negotiating a plan with Oxford Magdalen College and Savills to secure the premises for the benefit of the local community, whilst getting financial support from Lincolnshire County Council. He said: &#34;It will still need volunteers …&#34;","2015/02/being-open-about-weeding.html"],["Northern Ireland","Sun, 22 Feb 2015 21:02:30 +0000","Northern Ireland – Library opening hours to be cut – Derry Journal. &#34;The Board of Libraries NI says it has agreed &#34;reluctantly&#34; to review library opening hours in response to plans to cut £2.4 million from its budget. Irene Knox, chief executive of Libraries NI, said the draft budget called for savings of 7.5%.&#34;","2015/02/being-open-about-weeding.html"],["Oxfordshire","Sun, 22 Feb 2015 21:02:30 +0000","Oxfordshire – Phone box library closure threat angers residents - Guardian. &#34;The phone box library in Banbury, Oxfordshire, was fitted with extra shelves and a regular supply of books for residents to share and enjoy, its supporters say. But on Tuesday BT posted a letter on the working phone box threatening to remove the shelves on 3 March due to concerns that they could fall and cause injury.&#34;","2015/02/being-open-about-weeding.html"],["Coventry","Sun, 22 Feb 2015 21:02:30 +0000","Coventry – Labour council to deal ‘savage blow’ to Coventry – Socialist. &#34;Just like everywhere else in austerity Britain, our Labour council’s plans will close libraries, community centres, children’s services, public toilets and more. These services are critical for people across the city and need to be firmly defended. Labour’s plans will also cause hundreds of job losses.&#34;","2015/02/being-open-about-weeding.html"],["Lincolnshire","Sun, 22 Feb 2015 21:02:30 +0000","Lincolnshire – We made the right decision – Market Rasen Mail. &#34;although it is regrettable that some staff at Market Rasen have had a cut in hours, overall the library itself will remain open, with a loss of only two hours per week&#34; … &#34;The £2 million saved from a rationalisation of the library service will help insure that the youngest and the most elderly in a county of 720,000 people are looked after.&#34;","2015/02/being-open-about-weeding.html"],["North Yorkshire","Sun, 22 Feb 2015 21:02:30 +0000","North Yorkshire – South Craven people thanked for response to library consultation – Keighley News. &#34;More than 7,500 responses were received from across the county.&#34; …  Council says &#34;We know that our current group of community libraries has proved to be a resounding success. &#34;Libraries are community assets and with the enormous financial pressures the county council is under, we hope we can work in partnership with our communities to maintain an effective and vibrant library service into the future.&#34;","2015/02/being-open-about-weeding.html"],["Staffordshire","Sun, 22 Feb 2015 21:02:30 +0000","Staffordshire – Staffordshire council leaders approve libraries plan - Sentinel. &#34;Under the revised model, volunteers will now take a greater role in running 23 libraries, but will be supported by paid staff. Council leaders hope six facilities will soon be managed by volunteers as well, with the authority expected to start inviting formal expressions of interest from community groups in June.&#34;","2015/02/being-open-about-weeding.html"],["Thurrock","Sun, 22 Feb 2015 21:02:30 +0000","Thurrock – Russell Brand: Libraries are the lifeblood of Thurrock – Thurrock Gazette. &#34;Because it’s a library, it’s sending out an important message, not just for learning, but for the community, to remind  them that many of the things important in life are not bought. It’s clearly a lesson we need reminding of.&#34;","2015/02/being-open-about-weeding.html"],["Hertfordshire","Sun, 22 Feb 2015 21:02:30 +0000","Hertfordshire – International bestselling author Ken Follett speaks of need to protect libraries as council downsize Stevenage Old Town library - Hertfordshire Mercury. &#34;&#34;Nobody becomes a writer unless they are first a reader. &#34;Access to a public library was important for me as a child, it was an essential part of my education.&#34;&#34;","2015/02/being-open-about-weeding.html"],["Staffordshire","Sun, 22 Feb 2015 21:02:30 +0000","Staffordshire – Penkridge Library campaigners win their battle to keep council-run service - Staffordshire Newsletter. &#34;Penkridge Library is set to continue to be managed and run by Staffordshire County Council after the council’s cabinet approved proposals today.&#34; see also Stone library will still be managed by county council – A little bit of Stone.","2015/02/being-open-about-weeding.html"],["Southampton","Thu, 26 Feb 2015 22:17:23 +0000","Southampton – Views on Cobbett Road Library’s future – Bitterne Park Info. &#34;Monday saw a packed meeting at the Church of Ascension as residents and politicians from various parties explored options to keep Cobbett open&#34;","2015/02/cuts-ideas-and-appeals.html"],["Staffordshire","Thu, 26 Feb 2015 22:17:23 +0000","Staffordshire – Library shake-up for Lichfield and Burntwood is ratified – Lichfield Mercury. &#34;Plans to shake-up library services across Staffordshire have been ratified by senior county councillors. Lichfield Library has been earmarked to become a ‘library extra’ – a centre of excellence, with the widest range of services, and the most comprehensive of the three new models for the facilities in the future.&#34; but other libraries not so lucky and job situation unclear.","2015/02/cuts-ideas-and-appeals.html"],["Lincolnshire","Sun, 22 Feb 2015 21:02:30 +0000","Lincolnshire – ‘Good’ hearts not enough for libraries – Lincolnshire Echo / Letters. Raises worries over CRB checking and long-term future if branches turn volunteer. &#34;A last point, and one which I brought up in the original consultations on this issue: in the reconstruction of Afghanistan over the past decade, 160 libraries were opened to educate and enlighten a developing nation.&#34;","2015/02/being-open-about-weeding.html"],["Manchester","Sun, 22 Feb 2015 21:02:30 +0000","Manchester – Details on Manchester’s library stock cull - BookSeller. &#34;The council’s criteria for stock editing says material considered for withdrawal had to meet certain conditions, such as that there was a later edition available, that it was &#34;too badly damaged or has deteriorated too far to be of any further use to library staff and customers&#34;, that its content is out of date, or that the &#34;content of the material is no longer relevant to, or supportive of, the library’s collections or its stock policy&#34;. The type of general reference material which was withdrawn included paperback editions where the library held a hardback copy, &#34;coffee table&#34; books, material now available as an electronic resource, and foreign language information material, the council told The Bookseller.&#34;","2015/02/being-open-about-weeding.html"],["Staffordshire","Sun, 22 Feb 2015 21:02:30 +0000","Staffordshire – Over half Staffs libraries to be volunteer-run – BookSeller. &#34;The county council’s cabinet approved plans today (18th February) that will see only 20 of the county’s 43 libraries remain managed and staffed by the council, while the rest will be &#34;supported and delivered by the community, with access to formal county council support.&#34;&#34;","2015/02/being-open-about-weeding.html"],["Wirral","Sun, 22 Feb 2015 21:02:30 +0000","Wirral – Wirral library cuts campaign group set for further action after occupation of Seacombe library - Liverpool Echo. &#34;Following the occupation, two members of Wirral SOS were invited to meet with council leader Cllr Phil Davies and Seacombe Cllr Adrian Jones to discuss the issue. But the group says that following a &#34;disappointing&#34; meeting on Wednesday, where three options they put forward to Cllr Davies to stave off the cut-backs were rejected, the council should now prepare for further occupations at other libraries. Dawn Grant, of Wirral SOS, said they had suggested deferring the reduced hours until after the general election, taking money from reserves or reducing councillors by a third as ways to offset the costs of retaining the current library hours.&#34;","2015/02/being-open-about-weeding.html"],["Northamptonshire","Sun, 22 Feb 2015 21:02:30 +0000","Northamptonshire – Northamptonshire County Council outsources services and redeploys staff – BBC News / Northampton. &#34;Councillors agreed to &#34;efficiency savings&#34; including spending £1m less on promoting the county’s economy, £7m less on waste management, £750,000 less on the fire service budget and saving £4m reviewing all looked after children in places outside the county. But cabinet member for finance, Bill Parker, said the budget protects &#34;frontline and critical services&#34; such as libraries and country parks. The Conservative-controlled council claimed work to implement the &#34;Next Generation Model&#34; would see it explore how services can become &#34;separate stand-alone organisations free from statutory restraints&#34;.&#34; [The Council’s chief executive is Paul Blantern who is heading the national library taskforce – Ed.]","2015/02/being-open-about-weeding.html"],["Staffordshire","Sun, 22 Feb 2015 21:02:30 +0000","Staffordshire – No volunteers come forward to run Barton under Needwood Library as decision is reached on six others - Burton Mail. &#34;Volunteers will manage the running of just six of 23 libraries under the control of Staffordshire County Council, after a decision on Wednesday.&#34; … No one has volunteered for Barton under Needwood: &#34;remains unclear what will happen if no volunteer groups come forward to staff it&#34;","2015/02/being-open-about-weeding.html"],["Swansea","Sun, 22 Feb 2015 21:02:30 +0000","Swansea – Vital to consider future of our library – South Wales Evening Post. &#34;It is a cliche of planning that libraries should be sited on main pedestrian routes with adequate vehicle access. If you would not put a shop or a large store on a site then it is not suitable for a library. If people cannot drop in without going out of their way, a site is unfit. Car parking nearby is essential and so is easy access for delivery vehicles and mobile libraries. It was therefore very surprising, indeed a matter for concern, when Central Library was moved to the Civic Centre where it had no more space than in the old building and was even less well-positioned in the city. It looked very much as if the move was made only because there happened to be some surplus floor area available.&#34;","2015/02/being-open-about-weeding.html"],["Trafford","Sun, 22 Feb 2015 21:02:30 +0000","Trafford – Librarian role eroded by years of under-funding claims former worker - Messenger. &#34;during my time in the libraries, I witnessed the outrageous pressure put on the dedicated frontline library staff , some with more than 20 years services, who were forced to reapply for their own jobs.&#34; Mr Evans, who previously worked as a professional for a multinational chemical company before taking early retirement, added that the move led to reductions in staffing and remaining staff were forced to take on the role of administering council services, including dealing with missed bin collection queries and housing benefit claims and giving advice to members of the public. He continued: &#34;They got rid of the last degree level librarian in about 2004, and since then the remaining staff have just become glorified customer services representatives,&#34;","2015/02/being-open-about-weeding.html"],["Manchester","Thu, 26 Feb 2015 22:17:23 +0000","Manchester – Book in to hold your wedding at Central Library – Manchester Council. &#34;The Grade II* listed Central Library, which fronts the city’s most desirable new destination St Peter’s Square, is now licensed to host civil ceremonies and is primed to become the most prestigious new wedding venue in the city. The much anticipated wedding package offers couples the opportunity to be married in the privacy of one of Manchester’s best loved spaces, with exclusive access to the building being made available on Sundays&#34;","2015/02/cuts-ideas-and-appeals.html"],["Barnet","Thu, 26 Feb 2015 22:17:23 +0000","Barnet – Library campaigners write open letter to Barnet’s Conservative councillors urging them to support Labour motion and halt cuts – This is Local London. &#34;In an open letter to the Conservative councillors, library campaigners from across the borough emphasised the &#34;traditional Conservative values&#34; of the service, and warned cuts would damage the chances of &#34;budding entrepreneurs&#34;. The letter states that libraries &#34;offer a place of warmth and compassion for all ages in the community and allow the self-determination of today’s students in reaching their goals.&#34;&#34;","2015/02/cuts-ideas-and-appeals.html"],["Coventry","Thu, 26 Feb 2015 22:17:23 +0000","Coventry – Coventry council budget finds cash for communities to run services – Coventry Observer. The &#34;council has found £500,000 to help community volunteers and organisations who want to step in to run public services including libraries and youth clubs – as it passed a £15million cuts budget with a 1.9 per cent Council Tax hike.&#34;","2015/02/cuts-ideas-and-appeals.html"],["Hertfordshire","Thu, 26 Feb 2015 22:17:23 +0000","Hertfordshire – Strategy to boost Herts libraries over next 10 years agreed by county council - Herts and Essex Observer. &#34;However, following a petition signed by 1,209 supporters, members of the council’s customer service, performance and libraries panel decided that staff should be kept.&#34;","2015/02/cuts-ideas-and-appeals.html"],["Birmingham","Thu, 26 Feb 2015 22:17:23 +0000","Birmingham – Tories: ‘We would keep Library of Birmingham open seven days a week’ - Birmingham Mail. &#34;Birmingham Conservatives say they would keep the Library of Birmingham open seven days a week and scrap the £35-a-year ‘garden tax’ in their alternative council budget. The main opposition party has highlighted libraries and bins as priorities for funding ahead of Birmingham City Council’s annual budget meeting on Tuesday, March 3″ … &#34;The Tories also said they would keep all 39 community libraries open at a time when the council is believed to be considering cutting at least four.&#34;","2015/02/cuts-ideas-and-appeals.html"],["Thurrock","Thu, 26 Feb 2015 22:17:23 +0000","Thurrock – Thurrock libraries saved from closure – Thurrock Gazette. &#34;An added and unexpected announcement also heard that a new library will open in Purlfeet – taking the number of libraries in the borough to 10. A Thurrock Council consultation looking at ways to save £500,000 suggested one way was to close some of the libraries in the borough when it launched last month.&#34;","2015/02/cuts-ideas-and-appeals.html"],["Brighton and Hove","Thu, 26 Feb 2015 22:17:23 +0000","Brighton and Hove – Baby groups in libraries in pipeline to be saved from cuts as more proposals retracted – Argus. &#34;The groups, run by the Early Years Project, were at risk of closure if funding reductions to children’s centres and related services was introduced when &#34;the council set the 2015/16 budget. The council told The Argus there were plans to stop financial support for groups in September – but interim funding would be provided until then so other options could be explored.&#34;","2015/02/cuts-ideas-and-appeals.html"],["Hartlepool","Thu, 26 Feb 2015 22:17:23 +0000","Hartlepool – Hartlepool library services under threat amid fresh cuts – Hartlepool Mail. &#34; since 2013 the Library Service budget has had to be reduced by almost 16 per cent. Despite this savings have been achieved without any direct impact on library opening hours or the branch library network.&#34; but now deeper cuts: &#34;Among the aspects being looked at in the review are opening hours, whether the branch libraries are still in the best locations to serve the needs of communities, potential for volunteers and external organisations to play an increased role, possible further development of the libraries’ online services and the potential for the libraries to generate additional income.&#34;","2015/02/cuts-ideas-and-appeals.html"],["Thurrock","Thu, 26 Feb 2015 22:17:23 +0000","Thurrock – No Thurrock libraries to close (but you may want to read the small print) – Your Thurrock. &#34;Council leader, John Kent was responding to a number of petitions across the borough as well as a consultation with the public by Thurrock Council. Councillor John Kent did stress however, that &#34;libraries have to change&#34;.&#34; see also  Council leader ‘never considered’ closing any libraries… but the mobile service will stop – Clacton Gazette.","2015/02/cuts-ideas-and-appeals.html"],["Hertfordshire","Thu, 26 Feb 2015 22:17:23 +0000","Hertfordshire – Litfest 15: Programme of library events for March and April - Hertfordshire Council. &#34;Our annual programme of events presented by Hertfordshire Libraries takes place in March and April. We recommend you book early to avoid disappointment&#34;","2015/02/cuts-ideas-and-appeals.html"],["Kent","Thu, 26 Feb 2015 22:17:23 +0000","Kent – Concerns over future of Sandwich Library as Kent County Council launches consultation - Kent Online. &#34;Residents in Sandwich say they are being asked to vote blindly on a consultation to offload library services to a charitable trust. At a meeting of Sandwich Library Guild at the Guildhall last Wednesday, chairman Margaret Simpson said the consultation seemed to be taking a &#34;cart before the horse&#34; approach. No clear business model means residents feel they are left in the dark over exactly what would happen if services were handed over.&#34;","2015/02/cuts-ideas-and-appeals.html"],["Lambeth","Thu, 26 Feb 2015 22:17:23 +0000","Lambeth – Lambeth Libraries in peril - History & Social Action News and Events. &#34;The financial plan to support so-called ‘community libraries’ simply doesn’t add up. They are being set up to fail. Lambeth’s plans are totally flawed – and show that it has no idea what public libraries do for the council and its residents.&#34; see also Lambeth in line for library closures - BookSeller. &#34;Laura Swaffield, chair of the Library Campaign and a member of Friends of Lambeth Libraries, said: &#34;The service itself has been under-funded for decades. Yet it is improving on all measures, and expanding its activities dramatically. Thanks to enormous efforts by staff, it is winning awards and government praise. The libraries’ beautiful buildings have been neglected for years, almost to the point of destruction. Lambeth has recently invested in repairing this damage – and it is paying off, with attractive spaces that people want to use. Much of this is now to be wasted.&#34;&#34;","2015/02/cuts-ideas-and-appeals.html"],["Kirklees","Thu, 26 Feb 2015 22:17:23 +0000","Kirklees – Credit card device called Raspberry Pi creating new programmer revolution in Huddersfield to help everyday people control anything from cars to robots - Huddersfield Daily Examiner. &#34;In an unassuming room in Huddersfield Library, a mini technological revolution is under way. And those involved hope to create a new generation of computer whizzes-come-inventors. Robots, computer games, apps and CCTV systems are all springing to life, which are being created by people as young as four and as old as almost 80. And it is not a large, hi-tech lab that is making all this possible, but a mini device no bigger than the size of a credit card, called Raspberry Pi.&#34;","2015/02/cuts-ideas-and-appeals.html"],["Southampton","Thu, 26 Feb 2015 22:17:23 +0000","Southampton – In denial over closures – Daily Echo. &#34;Despite being the people closing the library, there was an abundance of Labour councillors in utter denial that they were responsible for closing the library&#34; … &#34;In a couple of years, when the libraries have been shut for a while, I predict that Labour will be explaining in their leaflets how they did their utmost to keep the libraries open.&#34;","2015/02/cuts-ideas-and-appeals.html"]]