[["Barnet","Tue, 01 Mar 2016 21:57:09 +0000","Barnet – ‘Libraries could be saved if council votes for our alternative budget’ – Barnet and Whetstone Press. &#34;Axing certain senior management jobs at Barnet Council could raise more than a million pounds which could help save library services in the borough.vAccording to Barnet’s Labour Group, a further £500,000 could be raised by slashing the council’s spending on consultants and agency staff, and around £338,000 could be made by reducing spending on council communications.&#34; … &#34;It’s estimated that around £2.2 million is needed to save library services.&#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Brent","Tue, 01 Mar 2016 21:57:09 +0000","Brent – Wordblend – Brent Council. &#34;Come and write on paper covering the gallery walls, an excerpt of your favourite book in your native language. We provide all the materials. In Brent there are 130 languages spoken.  Help us to gather on our exhibition walls as many as possible&#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Darlington","Tue, 01 Mar 2016 21:57:09 +0000","Darlington – Bestselling authors join fight to save Darlington’s Crown Street library from closure – Northern Echo. &#34;Madame Doubtfire author Anne Fine and Philippa Gregory, author of The Other Boleyn Girl, have accused Darlington councillors of using the library as a &#34;soft target&#34; for cuts. &#34; … &#34;In a strongly worded missive, Ms Fine – who lives in County Durham – said any councillor considering using the library as such &#34;should know themselves for the defeatist, bureaucratic vandals they are&#34;.&#34; … Philippa Gregory: &#34;The closure of this library would be of particular disgrace to the North-East, which has a strong tradition of self-education and an industrial investment in the education of the public.&#34; Peter James: &#34;&#34;Without libraries, who will give the new generations their passion for reading good books?&#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Bradford","Tue, 01 Mar 2016 21:57:09 +0000","Bradford – Children across Bradford prepare for literacy larks on World Book Day – Telegraph and Argus. &#34;Children across Bradford will be dressing as their favourite literary characters on Thursday as libraries and schools across the district celebrate World Book Day. As well as events in schools, Bradford’s libraries will host events for children, and some big name children’s authors will pop in to talk about their creations.&#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Darlington","Tue, 01 Mar 2016 21:57:09 +0000","Darlington – Sacrificing our libraries – Northern Echo. &#34;The Dolphin Centre is a fine swimming pool and municipal sports complex. It is not, and never will be, a purpose-built lending library. The Dolphin Centre is a sports hub. It is bright and noisy. Visitors are greeted by pop music played over the public address system and sounds of swimmers having fun. It is the antithesis of Crown Street library where generations of children and adults have studied in quiet contemplation. Levering a library into the Dolphin Centre will cost Darlington Borough Council a considerable amount of money – cash that could be used to sustain the Crown Street library.&#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Swindon","Tue, 01 Mar 2016 21:57:09 +0000","Swindon – Campaigners opposed to Swindon library proposals – Swindon Advertiser. As a result, the 14 libraries will need to be run by volunteers or they could be closed with only central library staying in council control. However, many are opposed to the move, saying even if volunteers take over the service will suffer. On Tuesday, campaigners gathered outside the Old Town library to collect signatures from those using the facility.&#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Argyll and Bute","Sun, 06 Mar 2016 20:42:50 +0000","Argyll and Bute – Pupils from Scottish islands of Mull and Iona launch video to save their school librarian – Herald Scotland. &#34;The youngsters from the islands of Mull and nearby Iona, off the west coast of Scotland, launched the campaign after council chiefs voted to axe the school librarian at Tobermory High School – a post currently held by Sue Penny. The move is part of a wider fight to save school librarians and the mobile library service across Argyll and Bute after the council cut them as part of a savings package of £10 million.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Bridgend","Sun, 06 Mar 2016 20:42:50 +0000","Bridgend – Online resources award for libraries – Barry Today. &#34;Bridgend Library and Information Service, which is managed by Awen Cultural Trust, a new not-for-profit organisation, was selected from over 40 entries from libraries, museums and archive services across Wales for their successful ‘e-Promo’ campaign.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Cambridgeshire","Sun, 06 Mar 2016 20:42:50 +0000","Cambridgeshire – Sponsorship and overhaul of Cambridge Central Library under plans to make libraries more commercial – Cambridge News. &#34;These will include approaching businesses to sponsor libraries around the county; overhauling the cafe at Cambridge Central Library to make it more commercial, as well as maximising the commercial potential of the central library’s third floor&#34; … &#34;The council’s plan for an ‘enterprise centre’ in partnership with private company Kora for the library’s third floor spectacularly fell apart last year after it emerged Kora’s director was disqualified from being a company director in the UK. This has left a hole of some £200,000 in the library service’s budget for the next financial year, although many councillors and campaigners were dubious as to whether this income could be achieved. And much of the proposed restructuring of the layout of library’s third floor under Kora’s plan is now largely set go ahead.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Lancashire","Sun, 06 Mar 2016 20:42:50 +0000","Lancashire – £1.3m to support local communities – Lancashire County Council. &#34;IT crowd actor Richard Ayoade has backed a petition calling on Lambeth Council to stop their plans to install gyms in libraries across the borough.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Lancashire","Sun, 06 Mar 2016 20:42:50 +0000","Lancashire – Hundreds protest against library closures – Lytham St Annes Express. &#34;A ’read-in’ turned into a ‘read-out’ as hundreds of people rallied in Ansdell to show the strength of feeling against County Hall proposals to close more than half of Lancashire’s libraries. So many people turned out to the event organised by the Friends of Ansdell Library that it was held on the forecourt outside because it wasn’t possible to safely accommodate everyone inside the building.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Lancashire","Sun, 06 Mar 2016 20:42:50 +0000","Lancashire – Reduced opening hours at some libraries in West Lancashire – Lancashire County Council. &#34;There will be temporary reductions to opening hours of Skelmersdale, Ormskirk and Parbold libraries for a short time starting in March.&#34; … &#34;The reduced opening hours are due to staff shortages. &#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Lancashire","Sun, 06 Mar 2016 20:42:50 +0000","Lancashire – Temporary reduced opening hours at Leyland Library – Lancashire County Council. &#34;The temporary change of opening hours is due to a staff shortage. &#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Swindon","Sun, 06 Mar 2016 20:42:50 +0000","Swindon – I am 100 per cent supportive of our local libraries, says MP – Swindon Advertiser. Justin Tomlinson MP uses the library: notes importance of books, Summer Reading Challenge and internet usage. Hopes &#34;innovative ideas&#34; will save them in face of cuts.","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Bradford","Tue, 01 Mar 2016 21:57:09 +0000","Bradford – Library’s £240,000 refurbishment failed to ‘take into consideration’ disabled people, critics claim – Telegraph and Argus. &#34;Concerns emerged after an angry resident, who was visiting Eccleshill Library, was forced to struggle up a flight of stairs to access a toilet. Clare Pollard, 65, who suffers from Parkinson’s and uses a rollator walking frame, had to be helped up a flight of 17 steps to a first floor toilet at the Bolton Road library and information centre by family members.&#34; … &#34;she says there are no toilet facilities specifically for disabled people at the library, only men’s and ladies’ toilets. Bradford Council said it had managed to fund &#34;essential repairs&#34; to the decades-old library, but did not have money available for &#34;additional works&#34; before reopening the building last year.&#34; … &#34;The library was closed for four months for maintenance and refurbishment work and re-opened on March 30 last year. &#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Cheshire West and Chester","Tue, 01 Mar 2016 21:57:09 +0000","Cheshire West and Chester – Cheshire backs World Book Day – Cheshire Today. &#34; by inviting schools and children into their local library to discover the fabulous range of books and resources on offer.&#34; … &#34;As part of World Book Day celebrations the Council’s libraries will also be hosting special productions of ‘Bardolph’s Box’ – a fantastic fun-paced introduction to Shakespeare’s stories for all the family","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Buckinghamshire","Tue, 01 Mar 2016 21:57:09 +0000","Buckinghamshire – Bucks libraries could be run as charities due to budget cuts – Get Bucks. &#34;The council’s transport, environment and communities select committee was presented with three options for the future of the service on Tuesday, March 1 for the future of the library service in Bucks following research. The options are; to leave the service as it is, with council management funded by the taxpayer through the county’s budget; to out source the service to a competitive tender and have an external organisation run it on a council contract; or to set up and run libraries as a new not for profit organisation through a commissioning contract with the county council.&#34; see also Changes to Bucks Libraries Being ‘Looked Into’ – Mix 96.","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Cambridgeshire","Tue, 01 Mar 2016 21:57:09 +0000","Cambridgeshire – Creative writing is alive and kicking with workshops at March and Chatteris library – Wisbech Standard. &#34;Thanks to popular demand the Fen Speak Poetry Collective have organised a series of workshops where beginners and more experienced writers of all ages are welcome to hone their art.&#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Lewisham","Tue, 01 Mar 2016 21:57:09 +0000","Lewisham – The Future of Forest Hill Library – Forest Hill Society. &#34;The major concern from the Forest Hill Society is that levels of book borrowing continue to be maintained and we do not see the 70% drops that other community libraries have experienced in the last 4 years (compared to a drop of just 4% in Forest Hill over the same period). To achieve this the council needs to ensure that their IT systems are able to work properly with the community libraries, levels of stock must be retained, primary school  visits must be facilitated, and volunteer levels must be sufficient to keep the library open seven days a week, from morning to late evening.&#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Merthyr Tydfil","Tue, 01 Mar 2016 21:57:09 +0000","Merthyr Tydfil – A library is letting people pay their fines with food to help people in need – Wales Online. &#34;‘Food for Fines’ will run throughout March, and work in conjunction with Merthyr charity Donation Station, a volunteer group which collects food and clothes donations, to share between various charities in the town.&#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Croydon","Tue, 01 Mar 2016 21:57:09 +0000","Croydon – Council accused of ‘shoddy’ deal on Crystal Palace library – Inside Croydon. &#34;A row has broken out between trustees and library campaigners over Croydon Council’s £85,000 per year, two-year funding grant for Upper Norwood Joint Library, with activists dismissing the Labour-run council’s plans as &#34;shoddy&#34; and accusing them of trying to steer the public amenity towards a volunteer model of operation which has repeatedly been rejected by residents.&#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Surrey","Tue, 01 Mar 2016 21:57:09 +0000","Surrey – East Surrey book lovers owe more than £70k in library fines – Surrey Mirror. &#34;According to figures released to the Mirror, borrowers across the county owe Surrey County Council’s library service £383,326″ … &#34;&#34;We are trying to raise income and it [unpaid fees] can have an impact. The more charges are paid the easier it is for us to raise the income that then feeds back into the council services. &#34;Those borrowers who bring their books back on time, it has an impact on them because there’s less services for them to borrow.&#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Lancashire","Sun, 06 Mar 2016 20:42:50 +0000","Lancashire – Temporary changes to the opening hours at Upholland Library – Lancashire City Council. &#34;The reduced opening hours are due to staff shortages.  &#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Swindon","Sun, 06 Mar 2016 20:42:50 +0000","Swindon – FoI Response – Swindon Borough Council | Walcot Library’s lending figures and paid staff input – What Do They Know. Walcot Library is now a volunteer library.  Issues declined from 4057 in 2009/10 to 1650 2014/15. Council pays for 10 hours per week library staff time.","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["West Berkshire","Sun, 06 Mar 2016 20:42:50 +0000","West Berkshire – West Berkshire cuts: mums rally to save children’s centres – Get Reading. &#34;Proposals to close Tilehurst and Burghfield children’s centres and Mortimer and Burghfield Common libraries have prompted petitions and protests from local mums.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Lambeth","Tue, 01 Mar 2016 21:57:09 +0000","Lambeth – Escalating library strikes can bring Lambeth Council bosses to book – Socialist Worker. &#34;The Unison union has announced that it will consult its members working for Lambeth Council over a council-wide strike against library cuts. The south London borough’s Labour-run council wants to close or run down ten libraries. Library workers have already struck twice. The union is urging members to vote yes.&#34;","2016/03/taken-out-of-context-house-of-commons-library-and-the-dcms.html"],["Argyll and Bute","Sun, 06 Mar 2016 20:42:50 +0000","Argyll and Bute – Russell cites ‘failures in decision making process’ in asking Council to reconsider cutting Library services – For Argyll. &#34;Argyll and Bute’s SNP MSP, Michael Russell,  has asked Argyll & Bute Council to reconsider the recent decision of the ruling administration ‘to fire all school librarians and remove the four library vans presently in use’ because of failures in the decision making process. The MSP is expressing concern that the Council now risks breaking the law.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Barnet","Sun, 06 Mar 2016 20:42:50 +0000","Barnet – Young readers protest proposed Barnet library cuts on World Book Day – Barnet and Whetstone Press. &#34;The children dressed up as characters from the popular children’s Dr Seuss books for their protest outside East Finchley Library today on World Book Day. They will be gathering outside the library in East Finchley High Road to draw attention to their concerns. Campaigner Emily Burnham, whose three children use the library said: &#34;We are staging the protest ahead of the council’s decision on the future of libraries on March 23. She said parents were concerned that if proposals for &#34;technology enabled opening&#34; with reduced staffing got the go-ahead children would be excluded from using the libraries&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Bradford","Sun, 06 Mar 2016 20:42:50 +0000","Bradford – Bradford South MP joins fight against major cutbacks to district’s libraries – Telegraph and Argus. &#34;Bradford South Labour MP Judith Cummins is urging Labour-led Bradford Council to rethink its proposals to close all but seven libraries, if volunteers are not found to run them. Across the district, library opening hours and the money spent on books would also be cut, in moves to save more than £300,000 over the next two years. There has been particular anger to the proposals in Mrs Cummins’ constituency, which would see all its libraries either become voluntary organisations or close.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Glasgow","Sun, 06 Mar 2016 20:42:50 +0000","Glasgow – In Glasgow you’re never more than a mile from a Macmillan support service – Evening Times. Information centres have been set up in several Glasgow libraries.","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Swindon","Sun, 06 Mar 2016 20:42:50 +0000","Swindon – Library review raises concerns in Wroughton – Swindon Advertiser. Worries that &#34; the loss of the Wroughton Library building would lead to a number of community groups having to come to an end. Sally Speller is a member of one such group, which for a number of years has taught youngsters from Wroughton Infant School how to make ribbons.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["West Berkshire","Sun, 06 Mar 2016 20:42:50 +0000","West Berkshire – Charity condemns West Berkshire Council plans to cut ‘irreplaceable’ library services – Get Reading. &#34;members of Reading-based charity ABC to Read have described the plans as &#34;incredibly disappointing&#34; and are warning councillors about the detrimental impact high levels of illiteracy can have on communites.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Barnet","Sun, 06 Mar 2016 20:42:50 +0000","Barnet – Eight-year-old boy writes poem on why East Finchley library should be saved – This is Local London. &#34;East Finchley is just one of the many libraries across London and the UK facing staffing and financial cuts. Here is what Fergus wrote: Because there were no books, There was no learning …&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Brighton and Hove","Sun, 06 Mar 2016 20:42:50 +0000","Brighton and Hove – Hollingbury residents to get two libraries in rejig of cut proposals – Argus. &#34;Plans to close the Hove Library in Church Road and move services into Hove Museum put back to start of 2018.&#34; … &#34;Hollingbury Library in Brighton will have its book collection divided between Hollingbury and Patcham Children’s Centre and the Old Boat Community Centre as part of amended plans following a public consultation. &#34; … &#34;&#34;This is not so much a reversal but rather a positive outcome of the consultations on the Libraries Plan.&#34; &#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Buckinghamshire","Sun, 06 Mar 2016 20:42:50 +0000","Buckinghamshire – Council may wash its hands of running libraries in Bucks – Bucks Free Press. &#34;Buckinghamshire County Council says &#34;severe pressure&#34; on budgets in the coming three years means the county library service must save at least £1 million. Opening hours at council-run libraries have already been cut in previous cost-saving measures. Library Service Manager David Jones says the department, which has already found £2m savings in the past six years, need to look more radically at the way things are done to save more money.&#34; see also Big shake-up ahead for Bucks libraries in an effort to balance the books – Buckingham Today. &#34;Library service manager David Jones said that while continuing libraries as they were was the lowest risk option, they wouldn’t be able to make as many savings or generate as much income as commissioning externally.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Cornwall","Sun, 06 Mar 2016 20:42:50 +0000","Cornwall – Penryn Town Council faces £40,000 maintenance bombshell if it takes over the library – West Briton. &#34;A full condition survey of the library, which was undertaken following a town council request in December, found multiple problems with the building.&#34; … &#34;Penryn Town Council clerk Michelle Davey told councillors that Cornwall Council had confirmed the issues with the boiler would be resolved prior to the transfer. She said: &#34;In addition, there are a number of funding sources for devolution projects that could contribute towards the cost of the required works.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Croydon","Sun, 06 Mar 2016 20:42:50 +0000","Croydon – Job losses and volunteer libraries leaves us feeling let down – Inside Croydon. &#34;Public library provision is a statutory requirement for local authorities such as Croydon. But they also represent a soft target when councils want to make cuts. Robert Gibson says that the funding announcement for Crystal Palace’s library is less than a &#34;delight&#34;&#34; … &#34;As a former Trustee I know the Upper Norwood Library Trust was never set up to be a fig leaf for cuts and a shift from a statutory provision of library service towards a volunteer-staffed community centre. As a community, we should mourn that this week’s announcement represents a reduction in service, staffing and funding and an admission from Croydon that it is moving away from statutory provision of library services for Upper Norwood, and across its borough.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Isle of Wight","Sun, 06 Mar 2016 20:42:50 +0000","Isle of Wight – It’s time to Fight for the Wight – Isle of Wight County Press. &#34;With public services taking a terrible battering on the Isle of Wight, now is just such a time. Libraries, public toilets, council tax benefit and hundreds of jobs have been cut as the Isle of Wight Council teeters on the edge of bankruptcy. The County Press is teaming up with the Isle of Wight Council to launch a petition to government, calling on it to look again at the way the Isle of Wight is funded.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Merthyr Tydfil","Sun, 06 Mar 2016 20:42:50 +0000","Merthyr Tydfil – Bring late books back with food gifts and be spared fines, say libraries – Guardian. &#34;Taking heed of CS Lewis’s maxim that &#34;eating and reading are two pleasures that combine admirably&#34;, libraries in Merthyr Tydfil are waiving fines on late books for borrowers who donate food instead. The &#34;food for fines&#34; initiative, which gives borrowers the opportunity to see their penalties disappear if they donate food, will run through March, in conjunction with local charity Donation Station. &#34;Why not declutter your house, pay off your library fines and contribute to a good cause all at once!&#34; urged the Welsh town’s service, which will pass the food on for distribution to charities and local people in need.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["South Ayrshire","Sun, 06 Mar 2016 20:42:50 +0000","South Ayrshire – Council to shut and curb opening of hours of over a dozen libraries as cuts bite – Herald Scotland. &#34;Three rural libraries, in Coylton, Dailly and Dundonald, will close completely. Ten others, at Alloway, Ballantrae, Carnegie, Forehill, Girvan, Maybole, Mossblown, Symington, Tarbolton and Troon, will have their hours reduced. In total, the moves will save the council less than £150,000. It said the near £10m it had to find was &#34;the highest amount of savings the council has had to deliver in any one financial year&#34;.","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Buckinghamshire","Sun, 06 Mar 2016 20:42:50 +0000","Buckinghamshire – Turning libraries into charities could save them, says expert – Bucks Free Press. &#34;Brian Furner, chairman of The Friends of High Wycombe Library, said: &#34;Making the libraries into charity trusts is probably the most favourable option of the three. &#34;I think privatising the libraries would not wash with the public but it can’t carry on as it is – we are going downhill and libraries are facing further cuts. &#34;When High Wycombe library opened they had 70 staff – now they have 40 and only ten of those are permanent. &#34;At the moment I don’t think many staff are getting job satisfaction. I think putting more responsibility in their hands would improve moral. &#34;It would also give more flexibility for the libraries to respond to the public’s changing needs if they were more independent.&#34;&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Lambeth","Sun, 06 Mar 2016 20:42:50 +0000","Lambeth – Council to push on with library plans – Brixton Blog. &#34;Lambeth council has revealed minor changes to plans for its 10 libraries, which had included turning three of them into gyms, the day before opponents will demonstrate against the plans.&#34; … &#34;Tate South Lambeth and Durning Library will both remain open until we can identify a permanent site for a town centre library for the north of the borough&#34; … &#34;Proposals for a &#34;staff mutual&#34; organisation to run the 10 libraries – an idea which has proved a success in York libraries – has been turned down.&#34;. Laura Swaffield says","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Lambeth","Sun, 06 Mar 2016 20:42:50 +0000","Lambeth – IT Crowd actor Richard Ayoade backs campaign against putting gyms in libraries in Lambeth – Evening Standard.","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Suffolk","Sun, 06 Mar 2016 20:42:50 +0000","Suffolk – Stradbroke Library Post Office wins libraries award – Suffolk Libraries. &#34;Stradbroke Library’s post office has won a national libraries award. The library’s post office was announced as the winner of the ‘Social’ category in the EDGE library conference awards in Edinburgh on the evening of Thursday 3 March.&#34; … &#34;Monthly visits to the library have increased from just under 1,000 in 2013/14 to an average of about 2,700 per month for the current financial year so far.","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Warwickshire","Sun, 06 Mar 2016 20:42:50 +0000","Warwickshire – New library at the heart of Southam – Courier. &#34;Nao, the humanoid robot, encouraged onlookers to join their new library before performing its dance routine at the event last Friday.&#34; … &#34;Cllr Izzi Seccombe, leader of Warwickshire County Council, said at the launch: &#34;Southam has an incredibly strong community spirit, without which none of this would be possible, and that is why I am particularly proud to see Southam library return to the heart of the community – exactly where it belongs.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Warwickshire","Sun, 06 Mar 2016 20:42:50 +0000","Warwickshire – Our Warwickshire ‘Pop Ups’ – Come and take part in Nuneaton and Bedworth – Warwickshire Council. &#34;Tell stories, create new artwork and help us build a brand new ‘Pop-Up’ Museum that celebrates Nuneaton, Bedworth and Warwickshire as a whole.  You will  also have a chance to add your stories or photos to the ‘Our Warwickshire’ &#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Fife","Sun, 06 Mar 2016 20:42:50 +0000","Fife – Councillor claims his vote buys time for Glenwood Library – Courier. &#34;Bill Brown, chairman of the Glenrothes area committee, had been criticised for voting with the Labour administration on plans that could lead to 16 libraries in the region closing within the next 12 months. Mr Brown, an independent, has campaigned to save the library service in Glenwood. However, this too will close in March 2017 should a feasibility study to introduce a community run service, move to Glenwood High School or cut costs at the current site – Mr Brown’s preferred option – fall through.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Lambeth","Sun, 06 Mar 2016 20:42:50 +0000","Lambeth – Hundreds protest over libraries plan – Brixton Blog. &#34;Hundreds of people gathered in Windrush Square on Saturday for a march to protest at Lambeth council’s plans for its libraries.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Lambeth","Sun, 06 Mar 2016 20:42:50 +0000","Lambeth – Protesters in Brixton slam ‘ludicrous’ plan to turn libraries into gyms – Evening Standard. Long video clip interviewing users. &#34;The controversial proposals have sparked anger among residents in Lambeth, with an online petition opposing the move backed by more than 5,000 signatures. IT Crowd actor Richard Ayoade has also joined calls to drop the plans.&#34;.  Looks at co-location of gym and library at Redbridge.","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Lambeth","Sun, 06 Mar 2016 20:42:50 +0000","Lambeth – Will Self: &#34;local libraries are more important than ever&#34; – photos and video from Save Lambeth Libraries march – Brixton Buzz. &#34;Will Self told the marchers that local libraries are more important than ever as a way to give internet access to all, whatever their income. They are not, he said, a gift to &#34;well-toned banker w***ers&#34; – linking the idea to the rapid gentrification taking place all over Lambeth.&#34; see also Lambeth – Celebs join library demo as judicial review looms – Brixton Blog.","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Leicestershire","Sun, 06 Mar 2016 20:42:50 +0000","Leicestershire – Barwell Library faces final chapter as closure confirmed – Hinckley Times. &#34;Barwell library is to close on June 1 and be replaced by a weekly mobile service. Leicestershire County Council bosses approved the controversial cost-saving move at a cabinet meeting on Tuesday. The area will be served by a weekly six hour mobile library service and it is hoped some of the IT facilities at the George Ward Centre can be retained if the building’s owners approve. Liberal Democrat county councillor Michael Mullaney, who fought to save the centre, said he was &#34;very unhappy&#34; at the decision and it was a &#34;real loss&#34; to the village.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Shropshire","Sun, 06 Mar 2016 20:42:50 +0000","Shropshire – Shropshire Rural Library Community Engagement – West Mercia Police. &#34;For the first time, Police Community Support Officers will join the Shropshire Mobile Library Service to visit villages and hamlets. The Mobile Library Service visits up to fifteen locations each day, include public houses, village halls and other community bases, in locations that would not routinely be visited by Police. On arriving at each location, PCSO’s will be available to meet with local residents to discuss any concerns, or carry out foot patrol&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Lambeth","Sun, 06 Mar 2016 20:42:50 +0000","Lambeth – Lambeth Library campaigners leaflet Brixton ahead of of mass rally on 5th March – Brixton Buzz. &#34;The rally is planned for 10.30am in Windrush Square on Saturday 5th March, and is supported by the public service union, Unison. Supporters are urged to bring along, &#34;banners, placards, drums and especially friends.&#34;&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Lancashire","Sun, 06 Mar 2016 20:42:50 +0000","Lancashire – Deputy leader protests over Lancashire County Council cut with letter to PM – Clitheroe Advertiser. 220 council buildings to be decided on: many may be jettisoned by council, including libraries. &#34;The report to cabinet says there may be opportunities for working differently with partners and communities in local areas and has pledged to take into account &#34;local intelligence from communities, councillors and partners&#34; to understand the current role council buildings play and how the right ones can be retained.&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["West Sussex","Sun, 06 Mar 2016 20:42:50 +0000","West Sussex – ‘Evolution’ in our libraries – West Sussex County Times / Letters. Complains about Amazon lockers at libraries. &#34;for some years now, our county council has accommodated a multinational firm – with, to say the least, a dubious UK tax record – to do business in its own premises. Presumably, this is the sort of ‘evolution’ that the Horsham MP approves of…. Would the county council be prepared to divulge how much rent Amazon pays to the Library Service for this facility and how much longer the contract has to run?&#34;","2016/03/lancashire-lambeth-cipfa-orkney-and-jk-rowling.html"],["Bute and Argyll","Tue, 08 Mar 2016 22:05:57 +0000","Bute and Argyll – Mull & Iona Libraries Action Group – Vimeo. See also Scottish islanders’ video protest after council scraps school librarians – TES. &#34;Without the library I feel I would really struggle,&#34; says one boy at the school, which takes children from nursery levels upwards. A girl says the library would be &#34;chaotic&#34; without the orderly presence of a librarian, while another boy fears there would be a &#34;much different atmosphere in the school…you just wouldn’t be able to pick the right book without her help&#34;.&#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Greenwich","Tue, 08 Mar 2016 22:05:57 +0000","Greenwich – Greenwich school wins £20,000 WBD award – BookSeller. &#34;Patterson helped pick Eltham Hill School as the winner along with Jane Jackson from library furniture company BookSpace, World Book Day director Kirsten Grant, The Sun books columnist Natasha Harding and children’s laureate Chris Riddell. Eltham Hill School won £10,000 of books and £10,000 worth of library furniture for its response to the question ‘where does your reading take you?’. Pupils at the school wrote hundreds of postcards to their friends, family, favourite writers and fictional characters, which were then published in a book.&#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Kirklees","Tue, 08 Mar 2016 22:05:57 +0000","Kirklees – Mobile libraries have now become a thing of the past as Kirklees Council axes its service – Telegraph and Argus. &#34;Under Kirklees Council’s plan, the mobile library service, operating in six areas including Birkenshaw, has now been withdrawn. Coun Graham Turner, Kirklees Council’s cabinet member for resources, previously said the plan was the best balance between achieving the service ambitions of everybody having access to a library, and the budget demands of saving £1.8m. &#34;When we started looking at what we could deliver within our reduced budget, I wanted to make sure that we preserved as much of the service as possible and to ensure that we could provide as many access points to a library service as possible, and not embark on a wholesale closure programme. I believe with the help of volunteers and hardworking committed staff we have achieved this.&#34;&#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Lancashire","Tue, 08 Mar 2016 22:05:57 +0000","Lancashire – Wheatley Lane Library to close – Lancashire County Council. &#34;The library, on Wheatley Lane in Fence, has been run by Lancashire County Council with financial support from Pendle Borough Council since 2006. Without this provision, the library would have closed at this time, as part of plans to close seven other libraries.  Under these current shared arrangements with the county council to keep the library open, Pendle Borough Council has covered the salary of the member of staff who works there and the running costs of the building. Lancashire County Council has met other costs during this time to keep the library running, including buying books and making the peoples’ network computer available.\nPendle Borough Council’s latest budget included the proposal to withdraw funding from Wheatley Lane Library from 1 April, meaning that the library will have to close on Thursday 31 March. &#34; … &#34;Discussions are currently ongoing between Lancashire County Council, Pendle Borough Council and the Village Hall Management Com&#8230;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Suffolk","Tue, 08 Mar 2016 22:05:57 +0000","Suffolk – Stradbroke Library praised and scoops national award – Diss Express. &#34;The judges said: &#34;Stradbroke Library Post Office exemplifies how libraries can be the heart of the community, and the vital role both libraries and post offices play in enhancing community life and wellbeing. The increasing number of visits and issues, not to mention the increase in non-users visiting the library, is testimony to the success of the initiative. Through co-location and working in partnership with the local community and by looking to increase its income, Stradbroke embodies a forward-looking and engaged way of working that is as exciting as it is commendable.&#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Dorset","Tue, 08 Mar 2016 22:05:57 +0000","Dorset – Dorset County Council to consult on scrapping school library service – Dorset Echo. &#34;The service that provides library resources to schools across the county could be on its way out due to a lack of up take. A decision was set to be made by Dorset County Council’s Cabinet but it was deferred so further consultation can take place. A report said that only 26 percent of schools used the service either on a subscription or a pay-as-you use basis and that during the past five years the service had not achieved the corporate income target and had returned a budget deficit. &#34; … &#34;A note on the school library service section of the Dorset County Council website says that the future of the service is currently under review and that it will be offered until the end of the summer term, July 2016 only, pending a decision. &#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["East Renfrewshire","Tue, 08 Mar 2016 22:05:57 +0000","East Renfrewshire – Barrhead Foundry Success – SLIC. &#34;The Barrhead Foundry in East Renfrewshire has won the physical category award at this year’s EDGE Conference, for their integrated Library & Sports Centre Project. The Foundry, which opened last January, gives local residents access to a first-class library, enhanced sports facilities, café, business centre, digital hub and free WiFi. There are also flexible meeting spaces for local organisations and community groups and a soft play area for children.&#34;.  Library is open 7.30am to 10pm weekdays, 9am to 6pm weekends.","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Northamptonshire","Tue, 08 Mar 2016 22:05:57 +0000","Northamptonshire – Northampton Borough Council could draw up plans to become a unitary authority – Northampton News. &#34;Northampton Borough Council was to have unitary status, it would maintain responsibility for services such as rubbish collection, housing and planning applications, while taking on the county council’s roles on education, transport, fire and rescue service and libraries. This single-tier authority is similar to proposals recently outlined by councils in Oxfordshire, where there are plans for eight districts and a county council to become four local unitary districts – one of which would join up Cherwell District Council, in North Oxfordshire, with South Northants Council&#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Swindon","Tue, 08 Mar 2016 22:05:57 +0000","Swindon – Fears libraries could be lost if people do not come forward – Swindon Advertiser. &#34;However, some of those sessions have been attended by very few people and Councillor Derique Montaut (Lab, Liden, Eldene and Park South) fears this will lead to services closing without people realising. &#34;At one session I heard there were only six people and when asked if they would get involved no-one came forward,&#34; he said. &#34;This plans have been pushed through so are going to happen. I don’t know if people think there will be some last minute change but that isn’t going to happen.&#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Enfield","Tue, 08 Mar 2016 22:05:57 +0000","Enfield – Council plans to lease library space to &#34;external operators&#34; – This is Local London.  Fears over library usage of five libraries if leased out to others. &#34;So far only the lease details of Enfield Island Village have been released, and while it is said that the use would be as a public library it also states that &#34;subject to landlord’s consent, other uses will be considered&#34;.  … &#34;Warren Sherman, 46, who has used Enfield’s libraries all his life, said he was concerned that the plans were the beginning of the end for the services in their current state. &#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Leeds","Tue, 08 Mar 2016 22:05:57 +0000","Leeds – Leeds libraries win two national awards – Yorkshire Evening Post. &#34;Leeds’ library service won two Highly Commended honours at the 2016 National Coding Awards last week. The city’s Leeds Central Library and Headingley Library were recognised for their Hour of Code activity sessions last year.&#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Lambeth","Tue, 08 Mar 2016 22:05:57 +0000","Lambeth – Will Self joins march against Lambeth library closures – BookSeller. &#34;Celebrities Joanna Lumley, Richard Ayoade and Mark Rylance have lent their support to the campaign against the &#34;irrational&#34; decision to alter the Lambeth library service, according to a campaign group, while over 500 campaigners marched on Saturday (5th March) to protest against the libraries’ closure.&#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Lancashire","Tue, 08 Mar 2016 22:05:57 +0000","Lancashire – Strong support as battles continue to save libraries – Chorley Guardian. &#34;Hundreds of people visited a village library in the latest event calling for the doors to stay open. Around 400 people went to Euxton Library on Saturday morning, including Chorley MP Lindsay Hoyle, Euxton Parish Council chairman Katrina Reed and councillors Peter Wilson, Mark Perks, Danny Gee and Mark Jarnell. They were joined by local residents, as well as campaigners from Adlington and Coppull libraries and supporters from around the North West.&#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["West Berkshire","Tue, 08 Mar 2016 22:05:57 +0000","West Berkshire – Campaigners give council 30 ‘alternatives’ to cuts – Newbury Today. &#34;The council is proposing to close four children’s centres, eight libraries and one care home, as well as slashing funding for theatres, roads maintenance, CCTV cameras and public toilets. A campaign group called ‘West Berkshire Save Our Services’ has been set up to fight the proposals. The group held two public meetings last week to discuss the cuts and, based on the feedback received, has put together a list of suggestions which it says it believes is an effective response to anyone who claims there is no alternative to the current &#34;destructive spiral of cuts&#34;.&#34;  Includes &#34;Start a scheme where people become a &#34;supporter of libraries&#34; and pay just £1 a year for their library ticket. Potential income to the council – £400,000 a year. [Charging for library membership is illegal under the 1964 Public Libraries and Museums Act – Ed.]; Instead of closing libraries, recognise the libraries as assets that can be used for the comm&#8230;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Leicestershire","Tue, 08 Mar 2016 22:05:57 +0000","Leicestershire – New chapter ruled out for Barwell Library’s future – Nuneaton News. &#34;The move to close Barwell Library, been taken by Leicestershire County Council, has been condemned by campaigners. Lib Dem councillor Michael Mullaney, who has worked with a number of residents in a bid to save it from the axe, has slammed the Conservative-run cabinet for their actions. It’s the first library to be closed following a decision that the county’s community libraries needed to be taken over by volunteer groups in order to stay open.&#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["South Gloucestershire","Tue, 08 Mar 2016 22:05:57 +0000","South Gloucestershire – South Gloucestershire Council announces drop-in events on cuts to libraries, One Stop Shops and offices – Gazette Series. &#34;Cllr Riddle’s ruling Conservative party has, however, come under fire from opposition councillors for failing to protect frontline services and instead unanimously voting to uphold a manifesto pledge to axe the £36 opt-in green bin charge imposed in 2014. The budget would not stretch to scrapping the cost entirely but instead the party agreed to cut £6 from the annual bill of those people who pay to have their green bin emptied once a fortnight.&#34;","2016/03/desmond-clarke-revisions-and-some-delicious-rivalry.html"],["Bradford","Thu, 10 Mar 2016 20:48:56 +0000","Bradford – Campaign launched for volunteers to run Silsden library – Craven Herald and Pioneer. &#34;… recruitment  campaign for volunteers to take over threatened Silsden Library will begin this month. Ward councillor Adrian Naylor is hosting a meeting to attract townspeople interested in managing or staffing the facility&#34; … &#34;&#34;If there are people who have worked in libraries before, then their expertise will be invaluable, but people do not have to have experience.&#34; … &#34;Cllr Naylor, part of a community team that runs Addingham Library, was pleased Bradford Council had made a &#34;realistic offer&#34; to would-be volunteers. He said the council would maintain the building, pay the utilities, such as electricity, and provide books, leaving some items, such as public liability insurance, to the new volunteer team&#34;","2016/03/embedded-job-advisors-and-thema.html"],["Lambeth","Thu, 10 Mar 2016 20:48:56 +0000","Lambeth – March for Lambeth libraries as new strikes loom – Socialist Worker. &#34;A 500-strong demonstration last Saturday kept up the defence of the borough’s ten libraries—and new strikes are coming. The libraries would either close or turn into gyms under the Labour council’s plans. Unison union library rep (pc) Tim told Socialist Worker, &#34;We’re planning to strike again on 17 March, and want to escalate to two days the following week.&#34;","2016/03/embedded-job-advisors-and-thema.html"],["Staffordshire","Thu, 10 Mar 2016 20:48:56 +0000","Staffordshire – Love your library? Then why not give it a helping hand by becoming a volunteer: video – Staffordshire Newsletter. &#34;At Stafford Library Natasha Allsopp, 27, and Phil Wylie, 26, run weekly after school Code Club sessions on Thursdays for 9-11 year olds who want to learn coding for the web. Both former Staffordshire University graduates, Natasha now works for Stafford firm iWeb and Phil works for Burton-on-Trent-based software house Haywyre.&#34;","2016/03/embedded-job-advisors-and-thema.html"],["Essex","Sun, 13 Mar 2016 21:56:02 +0000","Essex – Merging services is part of Essex County Council’s money saving plan – Echo. [Article from January but contains news new to this website – Ed.] Libraries budget is £9 million 2016/17. £593k cut 2015/16, £594k 2016/17. Registrar births, deaths and marriages will move into libraries. Council &#34;moving towards a community hub model&#34; for libraries.","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["Lewisham","Sun, 13 Mar 2016 21:56:02 +0000","Lewisham – Extension of the community library model – Lewisham Council. &#34;This page presents documents related to the extension of the community library model to the Forest Hill, Manor House, and Torridon Road library buildings&#34;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["Suffolk","Sun, 13 Mar 2016 21:56:02 +0000","Suffolk – Competition for the best love story to win a free wedding at Ipswich Library – Ipswich Star. &#34;Normally used as the library’s study and reference area, the Northgate Room has been licensed to hold weddings, civil ceremonies and other celebrations. To launch the new venue Suffolk Libraries is running a competition to offer a free hire for the best love story&#34; … &#34;Ipswich County Library is a listed building which is 92 years old this year. Its Northgate Room is 100ft long with a vaulted ceiling and old oak bookshelves and tables. It’s a room which celebrates Suffolk’s cultural heritage and historic significance … The room can hold up to 40 people and has a full licence from Suffolk Registrars, which also covers the library’s lecture hall and enterprise and innovation hub which are also available for hire. &#34;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["Buckinghamshire","Thu, 10 Mar 2016 20:48:56 +0000","Buckinghamshire – Running libraries as charities is the ‘best of three options’, says library chairman – Get Bucks. &#34;Tony Hoare, of Chalfont St Giles Community Library, was speaking about the county council’s decision that they were looking at running libraries as charitable trusts due to ‘severe’ budget cuts &#34; … &#34;&#34;Our partnership with the County Library Service enables us to offer our residents a good library service that is fully integrated with that of the the county. We see no reason why this successful partnership can’t continue with the type of organisation envisaged in the County’s proposal.&#34;&#34;","2016/03/embedded-job-advisors-and-thema.html"],["Denbighshire","Thu, 10 Mar 2016 20:48:56 +0000","Denbighshire – Denbighshire libraries scoop marketing award – Point FM. &#34;The Award was won for Denbighshire’s Reading Hack young volunteers project which created volunteering opportunities in libraries for young people to support children participating and completing the Summer Reading Challenge.&#34;","2016/03/embedded-job-advisors-and-thema.html"],["Hertfordshire","Thu, 10 Mar 2016 20:48:56 +0000","Hertfordshire – Libraries could co-locate with Redbourn and Wheathampstead fire stations – St Albans Review. &#34;Libraries could co-locate with four retained fire stations in Hertfordshire to reduce overall property running costs for the two services. Hertfordshire County Council’s public health, localism and libraries cabinet panel met to discuss the possibility of libraries being located at Redbourn, Wheathampstead, Buntingford and Sawbridgeworth fire stations.&#34;","2016/03/embedded-job-advisors-and-thema.html"],["Lancashire","Thu, 10 Mar 2016 20:48:56 +0000","Lancashire – Fight for libraries steps up a gear – Lytham St Anne’s Express. &#34;Hundreds of people are set to march from St Annes to Lytham via Ansdell this weekend amid fears that several of the area’s five libraries could face the axe under Lancashire County Council proposals to close more than half of the current total of 74 across the county.&#34;","2016/03/embedded-job-advisors-and-thema.html"],["Leeds","Thu, 10 Mar 2016 20:48:56 +0000","Leeds – #whatsyourstory – Leeds libraries’ innovative marketing campaign – Libraries Task Force. &#34;Marketing of public library services is notoriously difficult. We offer so much to so many people, when designing a marketing campaign it’s hard to know where to start! So when we decided we wanted a new marketing campaign to change people’s perceptions of modern public libraries, we knew it had to be fresh, exciting and high profile. We also wanted to align our online and offline marketing so our offer was more ‘joined-up’ across promotional channels.&#34;","2016/03/embedded-job-advisors-and-thema.html"],["Cornwall","Thu, 10 Mar 2016 20:48:56 +0000","Cornwall – Penryn councillors press on with library devolution following £40,000 maintenance bill report – This is the West Country. &#34;Penryn Town Council faces a £40,000 repair bill after agreeing on Monday to continue with its plans to take over the running of the town’s library. Councillors have received a building survey, carried out as the town council looks to take control of the library as part of Cornwall Council‘s programme of devolution, which showed eight items of maintenance that need to be carried out.&#34;","2016/03/embedded-job-advisors-and-thema.html"],["Lancashire","Sun, 13 Mar 2016 21:56:02 +0000","Lancashire – Trawden library is temporarily closed today – Pendle Today. &#34;Trawden Library will be temporarily closed today due to a staff shortage.&#34;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["Swindon","Sun, 13 Mar 2016 21:56:02 +0000","Swindon – Library campaigners show support at Old Town fundraiser – Swindon Advertiser. &#34;..campaigners from across Swindon joined forces for a fundraiser in Old Town on Saturday. The event, run by the Save Swindon Libraries campaign group saw Los Gatos restaurant filled with local residents clamouring to show their support and sign their petition.&#34; … &#34;&#34;There must have been some hundreds of people in here during the whole course of the morning,&#34; she said. &#34;Everyone wants to tell us how appalled they are at the prospect of losing the professional service we all enjoy and value.&#34;&#34;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["Croydon","Thu, 10 Mar 2016 20:48:56 +0000","Croydon – Funding for new Upper Norwood Library ‘learning hub’ but campaigner sceptical for service’s future – Croydon Advertiser. &#34;Lambeth Council, which currently joint-runs the Westow Hill library with Croydon, confirmed they it would also match the funding. While the trust is &#34;confident&#34; it can run a &#34;thriving service&#34; from April 1, prominent campaigner for the Friends of Upper Norwood library, Robert Gibson, is sceptical the money will lead to a &#34;sustainable library service&#34;. He said: &#34;I support the trust and spent many long hours working with the trustees and have contributed and will continue to help their fund-raising efforts&#34;","2016/03/embedded-job-advisors-and-thema.html"],["Darlington","Sun, 13 Mar 2016 21:56:02 +0000","Darlington – Protestors want genuine consultation over Darlington library closure proposals – as hundreds turn out to demonstrate – Northern Echo. &#34;Darlington’s Crown Street came to a standstill on Saturday afternoon as arts campaigners and library users of all ages joined together with homemade placards and posters during the ‘Save Our Library’ protest. &#34; … &#34;Around 35 members of staff face redundancy if the plans to sell the Crown Street site for £300,000 go ahead. &#34;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["Fife","Thu, 10 Mar 2016 20:48:56 +0000","Fife – Not the end of library story, Fife campaigners say – Fife Today. &#34;Residents in the district are looking at forming ‘alternative delivery models’ after the most recent chapter in the tale was written at Fife Council’s latest full meeting. Councillors voted to shut 16 libraries across the Kingdom – but some could remain open for up to a year while the suggestions from the community are considered&#34;","2016/03/embedded-job-advisors-and-thema.html"],["Wokingham","Thu, 10 Mar 2016 20:48:56 +0000","Wokingham – Wokingham puts forward plans for unstaffed self service libraries – Get Reading. &#34;If the council’s proposals are given the green light Wokingham, Woodley and Lower Earley libraries would operate using a combination of staffed and unstaffed hours&#34; … &#34;These proposed changes are part of the council’s hub and spoke model, which will see Wokingham, Woodley and Lower Earley libraries act as the hubs while the other seven in the borough act as spokes. This means that the hubs would be open for longer while spoke libraries operate during set opening hours, at times when there is a high demand in the local area.&#34;","2016/03/embedded-job-advisors-and-thema.html"],["South Gloucestershire","Sun, 13 Mar 2016 21:56:02 +0000","South Gloucestershire – Futuristic thriller wins Concorde Book Award – South Gloucestershire Council. &#34;Futuristic thriller ‘The Fearless’ has been chosen as the 2016 winner of South Gloucestershire’s young people’s literature prize the Concorde Book Award.&#34; … &#34;Once again this year’s winner was chosen after an exciting district-wide reading challenge in which hundreds of young people from public and school library reading groups throughout South Gloucestershire worked their way through a shortlist of titles.&#34; … &#34;The Concorde Book Award, supported by The Bristol Post, is a long-running ‘young people’s Booker’ run by South Gloucestershire schools and public libraries in which groups of young people read a shortlist of novels before voting on their favourite title.&#34;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["South Gloucestershire","Sun, 13 Mar 2016 21:56:02 +0000","South Gloucestershire – Council consults on proposed library cuts – Bradley Stoke Journal. &#34;South Gloucestershire Council has opened a public consultation on proposed changes to its library service which could see opening hours at main libraries (such as Bradley Stoke and Patchway) cut by an average of eight hours per week and smaller branches (such as Filton) reduced to opening on just two days a week or being closed altogether. As part of its agreed Savings Programme running until 2019/20, the council needs to save £640,000 from the budget for the service and has proposed options that involve reducing library opening hours, closing Chipping Sodbury Library and ending the mobile library service.&#34;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["Swindon","Thu, 10 Mar 2016 20:48:56 +0000","Swindon – Fight for libraries – Swindon Advertiser / Letters. &#34;How heartwarming it was to read Justin Tomlinson‘s love letter to libraries (March 4). It’s wonderful that he is &#34;100 per cent supportive of our local libraries &#34; and gives examples of their vital social role.\nIt’s a shame therefore that he then descends into waffle and doublespeak, such as the need to &#34;deploy innovative ideas to ensure their future sustainability&#34;. &#34;","2016/03/embedded-job-advisors-and-thema.html"],["West Berkshire","Thu, 10 Mar 2016 20:48:56 +0000","West Berkshire – Kintbury author’s unswerving support for local libraries – Newbury Today. &#34;The best-selling author, who last month called the proposed closure of eight libraries in West Berkshire  &#34;an act of significant cultural vandalism&#34;, spoke to a large audience at the library in The Wharf, about his latest novel, Dictator. In a 40-minute talk, Mr Harris outlined the politics of ancient Rome, Cicero’s philosophy and his influence on great political leaders across the world and throughout history.&#34;","2016/03/embedded-job-advisors-and-thema.html"],["West Berkshire","Thu, 10 Mar 2016 20:48:56 +0000","West Berkshire – Thatcham’s Priory could help counter library cuts – Newbury Today. &#34;The Liberal Democrats planned to use the Priory as a focal point for community groups and bring the town council closer to the community. The plan was to use any rent from leasing the Priory to pay off the 25-year loan on the building. However, the Conservatives argued that the project was a colossal waste of taxpayers’ money and voted recently to sell the building&#34; … &#34;West Berkshire Council, which has been criticised by campaigners for not providing a breakdown of costs for running Thatcham Library, has also failed to release information regarding the number of people using the library service. It has only said that it would save £730,000 by closing eight of the district’s nine libraries.&#34;","2016/03/embedded-job-advisors-and-thema.html"],["Northern Ireland","Sun, 13 Mar 2016 21:56:02 +0000","Northern Ireland – Libraries to host writing workshops – Ulster Star. &#34;NI Libraries’ 2016 Writer in Residence, Anthony Quinn, will be hosting writing workshops …&#34;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["Lancashire","Sun, 13 Mar 2016 21:56:02 +0000","Lancashire – Village library is to close – Pendle Today. &#34;Wheatley Lane Library, in Fence, has been run by Pendle Council since 2006 when it was earmarked for closure by Lancashire County Council. But, due to cutbacks, bosses at the Town Hall said they are unable to continue funding the facility.&#34;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["Vale of Glamorgan","Sun, 13 Mar 2016 21:56:02 +0000","Vale of Glamorgan – Dinas Powys call for library volunteers – Barry Gem. &#34;Library volunteer open day got off to a flying start at the Dinas Powys Library after the steering committee of the community library arranged to formally sign up volunteers who will be trained and have the assistance of a peripatetic librarian.&#34; … &#34;Dinas Powys is one of five community libraries to be created, including Sully, Rhoose, St Athan and Wenvoe. &#34;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["Redbridge","Sun, 13 Mar 2016 21:56:02 +0000","Redbridge – Redbridge libraries to hold Women’s History Month events – Ilford Recorder. &#34;Redbridge Libraries launched Women’s History Month, on Saturday and features an expert multi-tasker who not only survived a terrifying encounter with a murderer on a train, but has penned four novels&#34;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["Trafford","Sun, 13 Mar 2016 21:56:02 +0000","Trafford – Mum-of-four invites Sale and Hale to explore Muslim faith and culture – Messenger. &#34;Shabnam Yusuf is holding a ‘Discover Islam’ exhibition in Hale Library, Leigh Road, until Saturday March 19. Through the exhibition, Shabnam is aiming to raise awareness about the culture, diversity and the unique way of life of a Muslim. &#34; .. &#34;&#34;I have been working with libraries in the East Cheshire area for several years now and hold Discover Islam exhibition on an annual rota&#34;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["West Berkshire","Sun, 13 Mar 2016 21:56:02 +0000","West Berkshire – Library closure consultation ‘a sham’ says campaigner – Newbury Today. &#34;&#34;According to report backs from the meeting, parish councillors were advised to form resident charitable trusts to take control of the running of their libraries. &#34;This is despite the fact that the formal West Berkshire Council public consultation about proposed library closures still had one week to run. This exposes the consultation as a sham.&#34; The council vehemently denied those claims and said the option of charitable trusts was &#34;simply an example of how a parish council or other community group might consider running their own library if the option to do so came about&#34;.&#34; … &#34;Ms Culver’s letter adds: &#34;Representatives of the residents’ campaigns to prevent library closures were not invited, and neither were parish councillors or residents from areas that use the mobile libraries. &#34;Councillor Hilary Cole’s [who set up the meeting] excuse was that this would be ‘unwieldy and unproductive’.&#34;The council sa&#8230;","2016/03/not-one-of-the-worlds-most-literate-nations.html"],["Angus","Thu, 17 Mar 2016 21:39:40 +0000","Angus – Hearing aid batteries available on mobile libraries – Brechin Advertiser. &#34;NHS hearing aid users will now be able to get their free replacement batteries from Angus’ mobile libraries. The service is part of the Scottish Government’s See Hear strategy for meeting the needs of people with a sensory impairment&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Bedford","Thu, 17 Mar 2016 21:39:40 +0000","Bedford – Free story sticker books to encourage budding bookworms to visit Bedfordshire libraries – Bedfordshire News. &#34;Parents can pick up a free sticker storybook when their baby or pre-school child joins the library and gets their very own library card. Collect a sticker each time they visit the library to borrow books or take part in a Rhymetime or Storytime.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Lancashire","Thu, 17 Mar 2016 21:39:40 +0000","Lancashire – Fighting to keep libraries open – Chorley Guardian. &#34;People of all ages walked from libraries in Coppull, Eccleston and Adlington on Saturday morning.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Lancashire","Thu, 17 Mar 2016 21:39:40 +0000","Lancashire – Protest against cuts to libraries gathers pace – Lytham St Anne’s Express. &#34;Just days after hundreds of library users staged a walk from St Annes to Ansdell and Lytham to make their point as 40 of Lancashire’s 74 libraries face being closed, some 80 Ansdell residents people attended a public meeting over the threat to the village’s library.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Leeds","Thu, 17 Mar 2016 21:39:40 +0000","Leeds – Leeds libraries open new chapter in city campaign – Morley Observer. &#34;A total of 36 libraries across Leeds launched the #Whatsyourstory campaign last year in the hope of encouraging more people to use their free services and workshops&#34; … &#34;Jean and Bill’s own personal stories really do highlight how varied our programme is at your local library, and why it is not always what people might expect. &#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Barnet","Thu, 17 Mar 2016 21:39:40 +0000","Barnet – Library glitch is a ‘sign of things to come’, say campaigners – This is Local London. &#34;Barnet Council’s library service, Vubis, crashed nearly two weeks ago during an update which has taken the online catalogue and the e-library system offline. Children cannot access the computers and the authority is also losing up to £200 a day in fines. But as councillors prepare to make cutbacks to libraries in the borough, including leaving some unstaffed, people have reacted furiously to this news.&#34; see also Libraries glitch still not fixed after two weeks – Barnet and Whetstone Press. &#34;The server problem means borrowers are unable to renew books in person at 14 libraries, or online&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Bury","Thu, 17 Mar 2016 21:39:40 +0000","Bury – Appeal for donations to help fill school libraries in Tanzania and Bangladesh – Bury Times. &#34;They are relying on donations of books for children aged three to five and they can be dropped off at locations across Greater Manchester. There are currently two donation points in Prestwich, in Prestwich Library and at the Sedgley Park Children’s Centre.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Lancashire","Thu, 17 Mar 2016 21:39:40 +0000","Lancashire – A best foot forward to save our libraries – Gazette. &#34;Library users marched from St Annes Library to Lytham, via Ansdell, to raise awareness that three of the area’s five libraries face the axe.&#34; … &#34;The Big Book Walk through south Fylde was led by the Friends of St Annes Library, two weeks after the Friends of Ansdell Library staged a ‘read-in’ to protest at the proposals. The Ansdell Friends, who also took part in the walk, are following up with a public meeting tomorrow.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Croydon","Thu, 17 Mar 2016 21:39:40 +0000","Croydon – Council to launch public consultation on future of Croydon’s libraries – Croydon Advertiser. &#34;A report, Ambitious for the Library Service in Croydon, says residents will be asked about how libraries should be run in light of recent funding cuts. Funding for Croydon 13 libraries will fall by £217,000 (4.9 per cent) from April as part of a £29 million reduction in council spending over the next three years. The library service, which was outsourced to Carillion Integrated Services at a saving of £800,000 in October 2013, &#34;needs to continue to offer value for money but at a lower cost&#34;, says the report.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Darlington","Thu, 17 Mar 2016 21:39:40 +0000","Darlington – Authors against library cuts: Best-seller Gervase Phinn demands protection for libraries – and their librarians – Northern Echo. &#34;Dales author Gervase Phinn joins international best-sellers Anne Fine, Philippa Gregory and Peter James as the latest writer to speak out over cuts to library services in Darlington&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Herefordshire","Thu, 17 Mar 2016 21:39:40 +0000","Herefordshire – Masters House and Ledbury Library go from strength to strength – Hereford Times. &#34;Did you know that there have been over 99,500 visitors to the Masters House and Ledbury Library since it opened a year ago? This was just one of the impressive statistics available for the community to learn about during the open day held to celebrate the first anniversary. In addition there have been 685 new members and a huge 53,100 items borrowed and reserved for members.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Lincolnshire","Thu, 17 Mar 2016 21:39:40 +0000","Lincolnshire – Lincolnshire libraries open 130 extra hours a week after volunteer take-over – Lincolnite. &#34;As part of these plans, the authority has been working with local groups to develop a network of more than 30 community hubs. Nearly all of the hubs are now open, with the final few set to come on line over the coming months. As a result, these sites are now open for an additional 131.5 hours each week (up from 479 to 610.5) – an increase of more than 27%.. Among the success stories is Spilsby Library, which has seen its opening hours more than treble following its move to Lincolnshire Co-op’s nearby food store.","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["West Berkshire","Thu, 17 Mar 2016 21:39:40 +0000","West Berkshire – Temporary reprieve for six libraries facing closure – Newbury Today. &#34;West Berkshire Council says £475,000 will ‘help’ keep some libraries open – for now – but two still set to close&#34; … &#34;Six of the district’s libraries are set to be given a temporary reprieve after West Berkshire Council proposed to make £475,000 of ‘transitional funding’ available to them- but two are still set to close. The council says the £475,000 – given to them by central government to help ‘soften’ the blow of the cuts – is only temporary and designed to allow those services affected more time to adjust. The council was proposing to close all but one of the district’s nine libraries and the mobile library service as part of its plan to save £17.5m in the next financial year – leaving just Newbury open.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Devon","Thu, 17 Mar 2016 21:39:40 +0000","Devon – Libraries Unlimited to go live with Advanced Exchequer – BDaily. &#34;Libraries Unlimited South West (Libraries Unlimited), a new not-for-profit organisation created to run Devon’s library service, will go live with cloud-hosted finance software and mobile app from Advanced Exchequer (Advanced) in April 2016. The system will provide real-time financial reporting and give staff access to accounts data while out of the office. Libraries Unlimited is due to take over the management of the library service from Devon County Council on April 1. The organisation, which has its headquarters in Exeter, will employ more than 300 staff across more than 50 sites. The mobile app will enable managers visiting these sites to access up-to-date financial information, and is a key reason why Advanced was selected from four software providers.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Lambeth","Thu, 17 Mar 2016 21:39:40 +0000","Lambeth – Durning Library and Tate South Lambeth Library: Consultation Report – Lambeth Council. &#34;Within the context of a 40% budget reduction for culture services, the consultation sought to understand local people’s and other library users’ views on the proposals that Durning Library should become the temporary town centre library for north Lambeth, and that Tate South Lambeth Library should offer a reduced library service within a Healthy Living Centre. In addition the consultation sought to understand people’s views on revenue generating activities within the Tate>South Lambeth building. These proposals were being consulted on because, following feedback from the previous Culture 2020 consultation, they represent a change from proposals consulted on at that time.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Hillingdon","Thu, 17 Mar 2016 21:39:40 +0000","Hillingdon – Boris Johnson crowns Hillingdon employee ‘Librarian of the Year’ – Get West London. &#34;Boris Johnson says Hillingdon libraries are the best in the country, after presenting an employee with a ‘Librarian of the Year’ award. Sam Everett, group manager for Manor Farm , Ickenham , and Oak Farm Libraries was voted Librarian of the Year by the Publishers’ Publicity Circle. She was one of five librarians shortlisted by the Circle’s committee and scooped the award jointly with Stewart Bain of the Orkney Library, receiving her prize from the Mayor of London, on Friday (March 11).&#34; … &#34;Sam has worked for Hillingdon Council ’s Library Services for eleven years and was nominated for her partnership work with publicists and event organising. She recently played a lead role in setting up the council’s first Culture Bite Festival which was held in October.&#34; … &#34;The Circle is a network of book publicists, who every year vote for their journalist, event organiser and librarian of the year.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Kent","Thu, 17 Mar 2016 21:39:40 +0000","Kent – Kent’s 99 libraries to offer free Wi-Fi for visitors – Kent News. &#34;The expansion from the 33 libraries which currently offer it, to the full 99, was possible due to funding from Arts Council England. The grant, is part of a nation-wide campaign to provide access for visitors using their laptop, smartphone or table PC.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Lambeth","Thu, 17 Mar 2016 21:39:40 +0000","Lambeth – Strike plan to save libraries as Lambeth campaign looks to target Labour – Socialist Worker. &#34;Library workers in Lambeth, south London, were set to strike on Tuesday and Wednesday next week. The Labour-run council is facing fierce opposition to plans to close libraries and turn some into gyms. Campaigners met last week, bringing together groups around the borough’s ten libraries, to debate how to stop the closures. Sit-ins are possible before locks are put on the doors of libraries on 1 April&#34; see also New strike over library plans – Brixton Blog.","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Kirklees","Thu, 17 Mar 2016 21:39:40 +0000","Kirklees – Book lovers say cheers as Huddersfield gets a community library – in a pub – Huddersfield Daily Examiner. &#34;Huddersfield author Nick Stead will open the new venture in The Sun, Lepton, on Friday following the decision to close the village’s main library.&#34; … &#34;The community library has been set up with the support of Huddersfield District Committee and by the rural pubs organisation, Pub is The Hub, a not-for-profit organisation started by the Prince of Wales in 2001.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Lincolnshire","Thu, 17 Mar 2016 21:39:40 +0000","Lincolnshire – Lies, Damn Lies and Statistics – Secret Librarian. &#34;it would seem that before the Council Executive hand the library service over to the outside organisation they are attempting to have one last almighty propaganda campaign to justify their ill thought out actions. To that end they have falsified the increased opening hours of the service by claiming that after transforming the majority into volunteer-led community hubs, an extra 130 hours to services has been added. However the opening hours of smaller libraries had already been reduced substantially so of course there has been an increase but not nearly by as much as the Council Executive are maintaining. It is like the classic supermarket wheeze in that they double the prices, halve them back to where they were before and then claim they have been reduced by fifty per cent.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Orkney","Thu, 17 Mar 2016 21:39:40 +0000","Orkney – Stop the Cuts – Mobile Libraries are Vital – Lin Anderson. &#34;Like the Highlands of Scotland, Orkney has a scattered population, many of whom rely on the mobile library service, which is currently under threat of cuts. The main library in Kirkwall does a great job in reaching out to their community, and indeed to the wider world. &#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Suffolk","Thu, 17 Mar 2016 21:39:40 +0000","Suffolk – Building Wellness through Reading – Suffolk Libraries. &#34;The event will provide schools with a solid framework for building a reading culture to help secure wellness and good mental health amongst students. Through its increasing work with schools and commitment to boosting literacy levels and encouraging reading for pleasure, Suffolk Libraries is ideally placed to draw on its contacts and expertise to host this one-day event.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Lambeth","Thu, 17 Mar 2016 21:39:40 +0000","Lambeth – Carnegie Library – the issues – Brixton Blog / Letters. &#34;I’ve continued to mull on the impossibility of Lambeth’s plans to turn our local library (Carnegie) into a gym … the points are so numerous that I apologise if this letter becomes too long …&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["West Berkshire","Thu, 17 Mar 2016 21:39:40 +0000","West Berkshire – Libraries being kept open because council told it has to – Newbury Today. &#34;Government tells council it would be acting illegally if it had pressed ahead with plans to close eight libraries&#34; … &#34;Today, council papers seem to reveal why – the Department for Culture, Media and Sport (DCMS) have told the council it would be breaching its statutory duty if it was to do so. Under the Public Libraries and Museums Act, the council has a statutory duty to provide a &#34;comprehensive and efficient library service&#34;. There had been questions from campaigners and members of the public as to whether keeping just one library open could be considered as a comprehensive and efficient service. It appears they were right with council papers published at 2pm yesterday afternoon revealing that the council  would be &#34;failing&#34; in its duty if it closed eight libraries.&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["West Berkshire","Thu, 17 Mar 2016 21:39:40 +0000","West Berkshire – New £1.4m fund halt some West Berkshire library closures – BBC. &#34;Libraries will receive £475,000 funding over two years, but will transition to a self-service system to save money. &#34; … &#34;We need to be clear however that this money is a lifeline which will enable these services to move to a more sustainable funding model. In particular, it will allow us to work with partners, community groups and parishes to secure these services in the long term.&#34;&#34;","2016/03/dcms-sort-of-intervene-in-west-berkshire-and-the-nightmare-of-barnets-it-problems.html"],["Bradford","Sun, 20 Mar 2016 21:51:55 +0000","Bradford – Cumbrian poet Kim Moore leads poetry workshop at Keighley Library – Keighley News. &#34;Award-winning Kim Moore, who lives in Barrow, will appear as part of Bradford Libraries’ Read Regional 2016 campaign&#34;","2016/03/the-house-of-stories.html"],["East Sussex","Sun, 20 Mar 2016 21:51:55 +0000","East Sussex – Pubs urged to open up post offices, shops, libraries, cash points, even allotments in project – Argus. &#34;Pub is The Hub is launching in East Sussex to encourage landlords to offer a shop, library, internet café or a cash point alongside food, drink and accommodation. Other possibilities include providing school dinners, lunch clubs for elderly people, IT training and meeting rooms. &#34;","2016/03/the-house-of-stories.html"],["Warwickshire","Sun, 20 Mar 2016 21:51:55 +0000","Warwickshire – Demand to ‘shelve’ plans to close Nuneaton library on Sundays – Nuneaton News. &#34;they voted a motion which rejects the Shire Hall proposals, and calls on the county council to find the funds to keep the town’s main library, as well as the one in Leamington and Rugby, open on Sundays. Cllr Jim Foster appealed to the cabinet to show some respect to the Shire Hall officers who work in the libraries section, as he says they are being pushed to save another £100,000.&#34;","2016/03/the-house-of-stories.html"],["West Berkshire","Sun, 20 Mar 2016 21:51:55 +0000","West Berkshire – ‘Funeral’ protest over West Berkshire library closures – BBC. &#34;Campaigners holding gravestone-shaped placards marched through Newbury on Saturday&#34; … &#34;The march travelled to Conservative MP for Newbury Richard Benyon’s office. Campaigners said the changes could mean some people would be left with a 20 mile journey to visit a library.&#34;","2016/03/the-house-of-stories.html"],["Brighton and Hove","Sun, 20 Mar 2016 21:51:55 +0000","Brighton and Hove – Warren Morgan: Hove Library is no longer fit for purpose – Brighton and Hove Independent. The last time Labour ran the city council, we built the award-winning Jubilee Library, one of the UK’s leading libraries and one which has only grown in popularity over the past decade. Under the Greens, library hours were significantly reduced and one – the much-loved mobile library – was closed. Money from the Labour government funded new library buildings in Coldean, Whitehawk and Woodingdean, but Conservative cuts seemed to destine those new facilities to be short-lived.&#34; … &#34;Hove will get a new library in an extended Hove museum, just a few hundred metres from the current site, closer to users, and with outdoor space and a cafe. In a council survey of over a thousand people, a majority of Hove library users backed the proposal to create the new cultural and community hub.&#34; … &#34;However, in a vote at the council committee which oversees libraries, Green councillors voted against these library proposals in thei&#8230;","2016/03/the-house-of-stories.html"],["Darlington","Sun, 20 Mar 2016 21:51:55 +0000","Darlington – &#34;If you do not fight this cut, you will lose this library.&#34; International bestseller Anne Fine signs petition to save Crown Street Library – Northern Echo. &#34;author Anne Fine visited Darlington to make a passionate exhortation to its people to fight for their libraries. The Madame Doubtfire writer was in town on Thursday (March 17) to sign The Northern Echo’s petition to Save Crown Street Library&#34;","2016/03/the-house-of-stories.html"],["Lincolnshire","Sun, 20 Mar 2016 21:51:55 +0000","Lincolnshire – Welton library reopening confirmed – Market Rasen Mail. &#34;Lincolnshire County Council closed the library on August 27 last year – and since then Welton Parish Council has been waiting to take over its operation, with delays caused by lease arrangements. &#34;","2016/03/the-house-of-stories.html"],["West Berkshire","Sun, 20 Mar 2016 21:51:55 +0000","West Berkshire – Government steps in to delay library closures in West Berkshire – Guardian. Council told BBC that delay in closures was due to extra government funding but it has since found out that it was because DCMS had advised council the cuts were illegal in current form. &#34;Nick Poole, chief executive of the libraries body Cilip, said he welcomed the intervention. &#34;We are pleased to see decisive action by DCMS to maintain public libraries in West Berkshire and signs that government is prepared to intervene where councils may be considering cutting statutory services,&#34; he said.&#34;","2016/03/the-house-of-stories.html"],["Cheshire West and Chester","Sun, 20 Mar 2016 21:51:55 +0000","Cheshire West and Chester – £37m Chester arts centre to be named Storyhouse – Liverpool Echo. &#34;The venue, being named Storyhouse, is the country’s largest regional arts project currently under construction and will house a theatre which can switch between an 800-seat proscenium space and 500-seat thrust &#34;festival&#34; stage, along with a 150-seat studio and cinema. It will also be the home of Chester Library.&#34; … &#34;Arts Council chief executive Darren Henley added: &#34;Storyhouse is a hugely ambitious project and we’re delighted to be working alongside Cheshire West and Chester, Chester Performs and Chester University as key partners in its development. &#34;The announcement of its name represents a major milestone along the road to opening what will be a stunning, ground breaking venue for Cheshire.&#34;&#34; see also Chester’s new £37m cultural centre to be called Storyhouse – Chester Chronicle. &#34;The announcement comes at the end of an extensive process, led by Manchester agency True North, which included a public &#8230;","2016/03/the-house-of-stories.html"],["Croydon","Sun, 20 Mar 2016 21:51:55 +0000","Croydon – Croydon’s ambition for libraries is on the line – Save Croydon Libraries Campaign. &#34;It’s not really clear how ambition features in what many view as a ‘fingers firmly plugged in the ears, hands firmly clasped across the eyes’ approach to tackling the issue at hand.&#34; … &#34;Rather than rip up the contract with Carillion, or hold Carillion to account for the service they are contracted to offer, Croydon Council has come up with… Ambitious for Libraries&#34; … &#34;Croydon residents valued their libraries and the experienced staff that delivered the service so well; a service now ripped to shreds by privatisation. They did not want to run their libraries, nor feel equipped to do so.  Whether or not the current administration is really ambitious to address the steep decline in Croydon library services, only time will tell.&#34;","2016/03/the-house-of-stories.html"],["Hartlepool","Sun, 20 Mar 2016 21:51:55 +0000","Hartlepool – Hop along to Hartlepool libraries’ Easter events – Hartlepool Mail. &#34;Making a 3D goldfish bowl, decorating paste eggs, treasure hunts, creating Easter baskets, the ever-popular baby babble, read and rhyme and sing and sign sessions are just some of the events. There’s also an opportunity to meet some real birds of prey and their handlers in a birds of prey show in Central Library&#34;","2016/03/the-house-of-stories.html"],["Lincolnshire","Sun, 20 Mar 2016 21:51:55 +0000","Lincolnshire – CP8975 Former Library Premises For Sale In Lincoln – Property Link. &#34;The property is situated within the popular village of Washingborough which is located approximately 3 miles east of Lincoln City Centre. Washingborough has a good range of local facilities including several public houses, supermarket, Post Office with chemist, Chinese and an Indian takeaway and fish and chip shop. &#34;","2016/03/the-house-of-stories.html"],["Lincolnshire","Sun, 20 Mar 2016 21:51:55 +0000","Lincolnshire – Donington Library reopens reopens on Wednesday as community hub – Boston Standard. &#34;The hub project had support from Donington Parish Council and its clerk Diane Fairweather and district councillor Jane King, who is &#34;thrilled&#34; it is reopening.&#34;","2016/03/the-house-of-stories.html"],["Southampton","Sun, 20 Mar 2016 21:51:55 +0000","Southampton – Future of five Southampton libraries threatened with closure secured – Southern Daily Echo. &#34;Burgess Road Library will be headed by the Burgess Road Library Action Group – runin partnership with local-based charity Christ Church Southampton. Thornhill Library will be operated by newly formed local charity group Thornhill Community Library. The YMCA, a local community charity that has been serving the city since 1878, will provide a community library in the new unit when it is completed in Weston, while in the meantime services will continue from the portacabin. Cobbett Road Library will be run by two not for profit organisations Social Care in Action (SCA) and Unexpected Places in partnership with the Friends of Cobbett Road Library. In Millbrook, the library resources will be moved into the Solent NHS Trust Pickles Coppice Children’s Centre where the Sure Start Service is based.&#34; see also Southampton libraries: Community groups to run threatened libraries – BBC.","2016/03/the-house-of-stories.html"],["Perth and Kinross","Sun, 20 Mar 2016 21:51:55 +0000","Perth and Kinross – Top crime writer Alex Gray to judge this year’s William Soutar writing prize – Daily Record. &#34;All winning and shortlisted entries will be published in eBook format and available to borrow from the libraries and information service’s eBook catalogue. Entry forms and competition rules are available from local libraries or can be downloaded from www.pkc.gov.uk/library&#34;","2016/03/the-house-of-stories.html"],["Camden","Tue, 22 Mar 2016 21:09:41 +0000","Camden – New library for Holborn – Designing Libraries. &#34;the one-acre site is currently occupied by a public library and Cockpit Arts – an award winning social enterprise, which is the UK’s only creative business incubator for designer-makers. U+I’s plans have been designed by the award-winning architectural practice, Coffey Architects, and will see the site completely redeveloped to provide brand new employment studio spaces, a fully remodelled library and local studies archive facility, and new public spaces so that this becomes a busy, creative hub for the community. The redevelopment will also deliver 105 new homes including new affordable units.&#34;","2016/03/countries-of-culture.html"],["Kirklees","Tue, 22 Mar 2016 21:09:41 +0000","Kirklees – Twenty library staff leaving as shake-up begins but no compulsory redundancies – Huddersfield Daily Examiner. &#34;The council said 20 staff were leaving voluntarily at the end of March and 14 were moving to different roles. Clr Graham Turner, cabinet member for resources, said he was delighted that no-one had been forced out.&#34;","2016/03/countries-of-culture.html"],["Sheffield","Tue, 22 Mar 2016 21:09:41 +0000","Sheffield – Stand up for the citizens of Sheffield – Sheffield Star. &#34;Around two years ago, the council took the decision to hand over many libraries in Sheffield to voluntary groups. In the process, they made librarians with links to the communities they served going back decades redundant&#34; … &#34;In light of the high regard that Sheffield’s librarians are held in and the fact that visitor numbers to the volunteer run libraries appear to be falling, I would appeal to all councillors to ensure that ring-fenced funding from central government to reinstate librarians be made a part of any devolution deal agreed.&#34;.","2016/03/countries-of-culture.html"],["Cornwall","Tue, 22 Mar 2016 21:09:41 +0000","Cornwall – Video: Locals Rally Round To Save St Ives Library – Pirate FM. &#34;Janet Axten is on the Friends group and runs the St Ives Archive: &#34;Because we take our libraries so seriously and it’s been here since 1896 and is probably the best loved building in the town we thought we’d look not only to see how much support we could get for it but look at ways we might be able to use it in the future to keep it going as a library.&#34;","2016/03/countries-of-culture.html"],["Sandwell","Tue, 22 Mar 2016 21:09:41 +0000","Sandwell – Easter fun at Sandwell libraries – Sandwell Council. &#34;All kinds of events, from storytelling to making Minecraft blocks, are planned at the borough’s 19 libraries&#34;","2016/03/countries-of-culture.html"],["Croydon","Tue, 22 Mar 2016 21:09:41 +0000","Croydon – Councillors promise no library closures in Croydon as consultation over future of service begins – Croydon Advertiser. &#34;Croydon Council has launched a consultation about the future of the borough’s 13 libraries including the possibility some will be run by community groups. Timothy Godfrey, cabinet member for culture, leisure and sport, said the survey was a &#34;genuine chance to decide what a modern day library should be and how we should go about funding it&#34;.&#34;.  Opposition councillor notes &#34;&#34;You are now expecting Upper Norwood Library to operate on what is roughly a third of what you said was the bare minimum of what it could possibly survive on.&#34;","2016/03/countries-of-culture.html"],["West Berkshire","Tue, 22 Mar 2016 21:09:41 +0000","West Berkshire – Theale Library faces closure despite £1m extra for West Berkshire – Get Reading. &#34;Only Theale and Wash Common libraries still face closure in West Berkshire unless villagers can find money to save them&#34; … &#34;This follows the announcement the Government would hand over £1 million in transitional funding to tide the council over an unexpectedly savage cut in the local settlement grant in December. West Berkshire Council held a public consultation when it received news of the extra cash and decided to divide it up as follows&#34; [Graph shows libraries get £475k of £1m – Ed.]","2016/03/countries-of-culture.html"],["Darlington","Tue, 22 Mar 2016 21:09:41 +0000","Darlington – Union members work on rescue plan for Darlington libraries – Northern Echo. &#34;&#34;Unison’s Darlington Branch is working with its members to put forward proposals for income generation and savings to assist the provision of these much needed services in Darlington. &#34;Our libraries serve a social and educational need. They also provide necessary digital and internet facilities for our community.&#34; … &#34;More than 9,200 people have now signed a petition launched as part of a separate Echo campaign to push for a Parliamentary debate on the crippling cuts in grant facing Darlington Borough Council. &#34;","2016/03/countries-of-culture.html"],["Manchester","Tue, 22 Mar 2016 21:09:41 +0000","Manchester – ‘Millionaires’ join Council to launch brand new campaign Read Manchester – Manchester Council. &#34;The campaign has already also won the backing of Coronation Street star Jennie McAlpine, TV presenter Katie Thistleton, from CBeebies, and from Manchester United and Manchester City football clubs – as well as schools, libraries, local businesses, health professionals and academics from the city’s universities.&#34;","2016/03/countries-of-culture.html"],["Orkney","Tue, 22 Mar 2016 21:09:41 +0000","Orkney – McDermid and Cleeves join Orkney library fight – BookSeller. &#34;Orkney Island Council recently announced that the mobile library service is to be cut by £25,000, as the council has to find £1.4m in savings following a drop in funding. The mobile library service currently travels to the islands of Stronsay and Shapinsay, Longhope and Westray as well as other locations across Orkney’s mainland and isles. According to the Guardian, the council said this cut could mean &#34;reducing visits to each destination served by the mobile library service to once every two months, rather than once a month as at present.&#34;&#34;","2016/03/countries-of-culture.html"],["Scottish Borders","Tue, 22 Mar 2016 21:09:41 +0000","Scottish Borders – Borders libraries get digital upgrade – Southern Reporter. A major £195,000 upgrade of public computers in libraries and library contact centres across the Scottish Borders has been completed. The new equipment includes all-in-one PCs with 23 inch touch screens operated by Windows 8.1 and Microsoft Office 2013 software&#34; … &#34;The upgrade is the result of a £195k investment from SBC’s Capital programme to encourage and support Borders residents to connect with the council online as much as possible&#34;","2016/03/countries-of-culture.html"],["Isle of Wight","Tue, 22 Mar 2016 21:09:41 +0000","Isle of Wight – Isle of Wight among the worst hit by cuts to ‘cultural’ services – Isle of Wight County Press. &#34;The Mirror survey of local authority spending showed a massive decline in spending on ‘cultural’ services such as open spaces, libraries and tourism. It listed the Isle of Wight as the third worst affected, with 60 per cent cut from those areas, behind Camden and Middlesbrough.&#34;","2016/03/countries-of-culture.html"],["Lambeth","Tue, 22 Mar 2016 21:09:41 +0000","Lambeth – Cllr Scott Ainslie launches blistering attack on Lambeth’s plans to demolish Cressingham and decimate library services – Brixton Buzz. &#34;In an open letter to the council, he accuses Lambeth of seeming determined to ‘ride roughshod’ over the will of the people, pumping out misleading propaganda to justify their own ends and dismissing practical alternatives out of hand.&#34;","2016/03/countries-of-culture.html"],["Lambeth","Tue, 22 Mar 2016 21:09:41 +0000","Lambeth – Libraries, Cressingham campaigners join forces – Brixton Blog. &#34;The demolition of the Cressingham Gardens housing estate for regeneration and the decision to turn two of the council’s ten libraries in to gyms are the target of their anger.&#34;","2016/03/countries-of-culture.html"],["Sunderland","Tue, 22 Mar 2016 21:09:41 +0000","Sunderland – Sunderland libraries to host family-friendly Easter craft activities during school holidays – Chronicle. Long list of crafts.","2016/03/countries-of-culture.html"],["Lambeth","Tue, 22 Mar 2016 21:09:41 +0000","Lambeth – Campaigners confront MP over library cuts – South London Press. &#34;London mayoral hopeful Sadiq Khan MP was left in no doubt about the strength of feeling of cuts to library services when he visited one of the affected libraries. Mr Khan went to Camberwell library on Saturday and was greeted by protesters who want Lambeth council to put a stop to its planned cuts to the service and instead consider a proposal for a staff and community mutual to take over the running of the libraries.&#34;","2016/03/countries-of-culture.html"],["Lambeth","Tue, 22 Mar 2016 21:09:41 +0000","Lambeth – Lambeth library staff strike to stop Labour council’s cuts – Socialist Worker. &#34;Library workers in Lambeth, south London, began a solid two-day walkout on Tuesday in their battle against the Labour council’s deep and unpopular library cuts. Three libraries are set to close on 1 April, with the borough’s other seven affected by budget cuts. Two of the libraries, Minet and Carnegie, are to be handed over to a private firm to run as gyms. Thousands of people oppose the plan and back the strike. &#34;We’re getting donations in from individuals and union branches,&#34; Brixton library Unison union rep Tim O’Dell said. &#34;At one campaign meeting last week £257 was collected for the strike fund.&#34;&#34;","2016/03/countries-of-culture.html"],["Northumberland","Tue, 22 Mar 2016 21:09:41 +0000","Northumberland – Organisation sets out big changes – News Post Leader. &#34;As it aims to make significant savings, it has also confirmed its proposals for various services such as moving Guide Post Library into the Cleaswell Hill Centre alongside the Schools Library Service.&#34;","2016/03/countries-of-culture.html"],["Southampton","Tue, 22 Mar 2016 21:09:41 +0000","Southampton – Southampton libraries: Community groups to run threatened libraries – BBC. &#34;Volunteers will staff the buildings, while the books and equipment remain owned by the council.&#34;","2016/03/countries-of-culture.html"],["Swindon","Tue, 22 Mar 2016 21:09:41 +0000","Swindon – Library meeting sham – Swindon Advertiser. &#34;After attending the libraries’ engagement meeting at Park Library on March 14, I came away convinced the decision had already been made and once again the council was engaged in a sham consultation.  The council officer gave us the official explanation for the proposed funding reduction, and was so lacking in interest that, until challenged by an attendee, he did not even bother to take any notes of comments made.&#34; … &#34;The leaflets we were given were shoddily compiled in that they gave the profile of North Swindon Library rather than Parks and advertised a drop-in meeting for Walcot residents the previous week.  The bar charts were unintelligible, giving no explanation of what they were supposed to convey.  We were obviously supposed to be there to suggest ways the cuts could be implemented rather than register our total opposition to the ridiculous proposal that all facilities apart from the central library should be run by volunteers.&#34;","2016/03/countries-of-culture.html"],["West Berkshire","Tue, 22 Mar 2016 21:09:41 +0000","West Berkshire – DCMS intervenes on West Berkshire libraries – BookSeller. &#34;Chair of the Library Campaign Laura Swaffield told The Bookseller: &#34;In very rare cases, DCMS does a little arm-twisting behind the scenes when really grotesque cuts are planned. Not nearly often enough. But this public stance is unusual. Maybe it means the minister is responding at last to mounting complaints about his uselessness.&#34; But she added: &#34;I suspect it’ll just be temporary. The plan can probably stay almost unchanged once the council goes through the motions of doing a needs assessment, just as councils can ignore 100% opposition as long as they ‘consult’.&#34;","2016/03/countries-of-culture.html"],["South Gloucestershire","Tue, 22 Mar 2016 21:09:41 +0000","South Gloucestershire – Library users urged to attend drop-in event at under threat Chipping Sodbury Library today – Gazette series.  &#34;More than 250 people have signed a petition to save the facility, on High Street, which is earmarked for closure under a savings programme at South Gloucestershire Council&#34;","2016/03/countries-of-culture.html"],["Barnet","Mon, 28 Mar 2016 21:42:27 +0000","Barnet – Anyone but a fool, or: is that really what you want? Barnet Tory cuts, as the Open Library shuts … – Broken Barnet. &#34;As is usual these days, the public gallery was already graced with the presence of a number of senior officers from Capita, staking out the territory, but … gone was the habitual, self evident sense of complacency and indifference that exudes from these people. No jokes, no eye contact, with Mrs Angry: they sat sulking in their places, silently, and, oh dear: thin lipped, and uncommunicative. &#34;  … &#34;Physical access will be difficult for anyone with such needs, and once in the library, without staff present, many learning disabled residents, perhaps with autism, or similar difficulties, will struggle to use the facilities provided – such as they will be, in the new Tory library era.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Barnet","Mon, 28 Mar 2016 21:42:27 +0000","Barnet – Boy, 11, joins fight to stop ‘suicidal’ library cuts – Times Series. &#34;An 11-year-old has begged councillors to think again and save libraries over fears he will lose his independence if cuts take place. Heval Kartal was one of many speakers to address Barnet Council’s library committee last night. The Fortismere School pupil said if cuts were to go ahead, he and his little sister will not be able to visit the library without an adult.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Warwickshire","Mon, 28 Mar 2016 21:42:27 +0000","Warwickshire – Community libraries in Warwickshire – Libraries Taskforce. &#34;Sixteen libraries were designated as ‘no longer sustainable in their present form’ and as a result, local communities were encouraged to work with the council to find ways of keeping them open. Fourteen community-managed libraries were established between January and June 2012, mainly in rural areas. The busier, predominantly urban, libraries were retained. &#34; … &#34;The 12 community-led libraries are still operating and they continue to receive stock and professional support. Collectively, community libraries account for 3% of library loans county wide and the council is committed to funding for ongoing support.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Birmingham","Mon, 28 Mar 2016 21:42:27 +0000","Birmingham – Brussels attacks: Library of Birmingham lit with Belgian flag colours in tribute to terror victims – Birmingham Mail. &#34;The Library of Birmingham’s night-time tribute began at 7pm on Tuesday and will continue through the night as a mark of respect following the deadly attacks on Brussels airport and the city’s metro system.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Lincolnshire","Mon, 28 Mar 2016 21:42:27 +0000","Lincolnshire – ‘It was wrong to close the libraries’ – anger lingers as new library opens its doors – Lincolnshire Echo. &#34;&#34;Now there is over 40 people who volunteer and we have three teams that operate the library each day it opens.&#34; Mr Cunningham added that the group would like to put solar panels on the roof to help with energy costs and are also looking to secure a lease on the building.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["South Ayrshire","Mon, 28 Mar 2016 21:42:27 +0000","South Ayrshire – Three South Ayrshire libraries to close their doors for good next week – Daily Record. &#34;The shutters will be pulled down at Coylton, Dailly and Dundonald next Thursday. Savings of almost £50,000 are expected to be made over the next two years as part of the cull. And more than £100,000 will be banked by reducing the opening hours of other libraries later in the year. A fortnightly mobile service will be sent in to replace the lost facilities. The council’s Jill Cronin, who said libraries offered a &#34;great service&#34; to communities, insists all is not lost.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Brighton and Hove","Mon, 28 Mar 2016 21:42:27 +0000","Brighton and Hove – Historic library to close – Argus. &#34;The plan was heavily criticised and was opposed with a petition signed by more than 4,000 people from the Save Hove Library campaign appealing for the site to be spared the axe. Library services will be transferred to the nearby Hove Museum&#34; see also Hove Library move wins backing – Brighton and Hove News.","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Gateshead","Mon, 28 Mar 2016 21:42:27 +0000","Gateshead – Community libraries in Gateshead – Libraries Taskforce. &#34;The library service review in 2012-13 identified that the 5 libraries were outside of the council’s statutory provision. The development of volunteer managed libraries in Gateshead has always been a most sensitive area of work. The service, through the implementation, avoided the need for compulsory redundancies, and for this reason the development of volunteer libraries was tolerated by unions and employees.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["West Berkshire","Mon, 28 Mar 2016 21:42:27 +0000","West Berkshire – &#34;Save our library&#34; say Theale Children – Newbury Today. &#34;education will suffer if West Berkshire Council closes Theale library&#34;. Includes  video.","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Buckinghamshire","Mon, 28 Mar 2016 21:42:27 +0000","Buckinghamshire – Community library: Farnham Common, Buckinghamshire – Libraries Taskforce. &#34;Farnham Common community library was established in October 2011 and is one of 19 community partnership libraries in Buckinghamshire that are supported by 10 larger county libraries in areas of high population. The library is run as a charitable trust and forms part of the statutory provision. &#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Dorset","Mon, 28 Mar 2016 21:42:27 +0000","Dorset – Community library: Colehill, Dorset – Libraries Taskforce. &#34;Colehill community library in Dorset was transferred to the community in January 2013 and receives substantial financial support from Colehill Parish Council through a Parish Precept. The library is set up as a limited company and a registered charity&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Guernsey","Mon, 28 Mar 2016 21:42:27 +0000","Guernsey – Play in a Day – Schools Library Service Guernsey. &#34;the impact that the Patron of Reading initiative has been having on children’s engagement with stories. An author usually links up with a school close to where they live and builds a relationship with those teachers and students but being on an Island has obviously made this a challenge. Ann Bryant was invited to join in our 2014 book week and we immediately hit it off.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Buckinghamshire","Mon, 28 Mar 2016 21:42:27 +0000","Buckinghamshire – Community library: Wendover, Buckinghamshire – Libraries Taskforce. &#34;Wendover community library was established on 1 December 2012 and is one of 19 community partnership libraries in Buckinghamshire that are supported by 10 larger county libraries. &#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Buckinghamshire","Mon, 28 Mar 2016 21:42:27 +0000","Buckinghamshire – Free Wi-Fi In All Of Bucks Libraries – Mix 96. &#34;Thanks to an Arts Council England grant of nearly £50,000 which has funded the project&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Dorset","Mon, 28 Mar 2016 21:42:27 +0000","Dorset – Community library: Stalbridge, Dorset – Libraries Taskforce. &#34;Stalbridge community library has been managed by volunteers since February 2013. The library used to be stand alone but is now located within a community hub called The Hub@Stalbridge which also includes: the town clerk’s office, a flexible meeting space which is used for town council meetings and IT classes, a private meeting room and a community information point. This mixed space facility has been developed in the last 3 years and offers locals a one stop shop. Through the community information service people can access information on tourism, travel, find out about planning, recycling, highway and police matters. &#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Lancashire","Mon, 28 Mar 2016 21:42:27 +0000","Lancashire – Save my city: the axeing of once great Lancaster – Guardian. &#34;Last November, just as it started raining, Lancashire County Council was told it had to find £65m of cuts over the next two financial years – and £200m by 2020. Alongside cuts to rural bus services and the closure of 40 libraries, the council announced that, by the end of this month, they were going to close five museums, including the Judges’ Lodgings, the city’s oldest townhouse. The council said it would also have to withdraw funding from other museums, including Lancaster Castle, the City Museum, the Cottage Museum and the Maritime Museum. If these don’t start to pay their way they face closure, possibly by the end of 2016. &#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Swindon","Mon, 28 Mar 2016 21:42:27 +0000","Swindon – Campaigners urge council to listen to public on libraries – Swindon Advertiser. &#34;&#34;All ages are represented here, which demonstrates how vital this service is to all sectors of the community,&#34; said Sarah Church, of the group. &#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Dorset","Mon, 28 Mar 2016 21:42:27 +0000","Dorset – Community libraries in Dorset – Libraries Taskforce. &#34;An overview of community libraries, from the perspective of the library service &#34; … &#34;This partnership approach has resulted in a better local service offer, given the previous limited resources of the county council-provided library service. &#34; … &#34;The decision was taken that the only performance indicator to be included in the agreement would be a minimum number of opening hours per week. &#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Dorset","Mon, 28 Mar 2016 21:42:27 +0000","Dorset – Community library: Wool, Dorset – Libraries Taskforce. &#34;The Friends of Wool Library took over the management of a revamped Wool community library from Dorset County Council (DCC) on Tuesday 15 January 2013 working in co-operation with Wool Parish Council. The Friends of Wool Library is a small charity with annually-elected trustees. It is in the process of seeking Charitable Incorporated Organisation status.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["East Sussex","Mon, 28 Mar 2016 21:42:27 +0000","East Sussex – Opening hours for East Sussex libraries set to be cut back – Kent and Sussex Courier. &#34;The worst hit would be Mayfield library, which could be closed on Mondays, Wednesdays and Fridays according to the proposals put forward by East Sussex County Council (ESCC), as part of a bid to save a total of £90 million by 2018/19.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Falkirk","Mon, 28 Mar 2016 21:42:27 +0000","Falkirk – Bo’ness Library set to take on silver screen – Linlithgow Gazette. &#34;The Scottish Library and Information Council (SLIC) and Creative Scotland have joined forces with the aim to offer communities access to information, activities and resources on film creativity and culture. The pilot programme was launched last week by the Cabinet Secretary for  Culture, Europe and External Affairs Fiona Hyslop at Bo’ness Library, where she was given a guided tour of the Stars of Silent Film in Scotland photography exhibition, which finished last Sunday.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Shropshire","Mon, 28 Mar 2016 21:42:27 +0000","Shropshire – ‘Friends’ call for u-turn on Ludlow Library – Evesham Journal. &#34;services not related to the library and museum could be relocated leaving space for a range of other activities in the library and museum resource centre building. They say that the library and its services are feeling the impact of cost cutting and that it has to stop. In particular the group is upset at the way in which vital services are being provided. &#34;Shropshire Council’s move of the public contact point into the atrium has been a fudge,&#34; said Lottie James, chair of the Friends of Ludlow Museum in a letter to Ludlow Town Council. &#34;It is unattractive, lacks privacy and above all intrudes on a purpose built building to provide a library for Ludlow and a Museum Resource Centre for the County.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Staffordshire","Mon, 28 Mar 2016 21:42:27 +0000","Staffordshire – Staffordshire libraries – public consultation – Libraries Taskforce. &#34;In response to budget pressures, many authorities were closing libraries. Staffordshire wanted to do everything they could to sustain their library service. Taking an ambitious approach to transforming their service Staffordshire designed, developed and implemented a new model following extensive public consultation.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["West Berkshire","Mon, 28 Mar 2016 21:42:27 +0000","West Berkshire – Hundreds gather to protest Theale Library closure plans – Get Reading. &#34;Protesters gathered in their hundreds outside of Theale Library to protest against its closure. Facebook group Friends of Theale Library had managed to organise the protest in just a matter of days after a shock announcement from West Berkshire Council revealed plans to close it. Protesters gathered outside the library from 4.30pm, Wednesday, March 23 and organisers had asked everyone to take out the maximum allowance of 15 books.&#34;.  Includes video interviews.","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["West Berkshire","Mon, 28 Mar 2016 21:42:27 +0000","West Berkshire – Self-serve library idea challenged – Newbury Today. &#34;West Berkshire Council has finally released estimated annual running costs, excluding staff salaries – £36,920 in the case of Hungerford and £14,480 in the case of Lambourn. But a spokeswoman for the Friends of Hungerford Library, Helen Simpson, said their own estimation, including salaries, was £65,000. She added: &#34;West Berkshire Council said that they would like the libraries to run in a self-serve manner, but they are yet to elaborate what this decision will mean for the employed professional staff already in place.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Warwickshire","Mon, 28 Mar 2016 21:42:27 +0000","Warwickshire – Rumours of service cuts from Kenilworth Library quashed – Kenilworth Weekly. &#34;Rumours of services being cut from Kenilworth Library have been quashed after signs displaying ‘Warwickshire Direct’ were removed from the building’s front last week. Instead, the signs’ removal was part of a rebranding exercise of all libraries in Warwickshire to make sure they are all consistent with one another. A simple sign displaying ‘Library’ in capital letters has now appeared on the left-hand pillar of the building.&#34;","2016/03/ambition-volunteer-toolkits-and-a-media-blitz.html"],["Bradford","Wed, 30 Mar 2016 21:30:06 +0000","Bradford – Memories of the mobile library service in Bradford – Telegraph and Argus. &#34;Book lending is something many no longer need to do with the ease and availability of e-readers but there is something special about swapping books from a library. Firstly, there is the thrill of finding the book you want to read by actually thumbing through copies on a shelf instead of scrolling down a list of front covers on a screen&#34;","2016/03/the-most-publicity-that-uk-public-libraries-have-had-this-century.html"],["Lambeth","Wed, 30 Mar 2016 21:30:06 +0000","Lambeth – Candlelit vigils set to be held for doomed Lambeth libraries – London Evening Standard. &#34;Protesters are holding candlelit vigils and &#34;farewell parties&#34; at south London libraries closing this week. Lambeth residents will gather at Carnegie Library in Herne Hill tomorrow for a children’s storytime and Easter egg hunt from 11am. Supporters are also holding a farewell party from 4pm to 6pm and will stage a vigil from 6pm until late at the Carnegie and the Minet library in Camberwell.&#34;","2016/03/the-most-publicity-that-uk-public-libraries-have-had-this-century.html"],["Cheshire East","Wed, 30 Mar 2016 21:30:06 +0000","Cheshire East – Crewe Library building to close today – Crewe Chronicle. &#34;The new library will open in the lifestyle centre on April 11 when all books and services will have been moved across &#34; … &#34;The first day of the new library will be marked by cutting a cake and serving refreshments from 10.30am and there will be balloons for the younger visitors plus an opportunity to have photographs taken with special guest, the Big Blue Bookstart Bear&#34;","2016/03/the-most-publicity-that-uk-public-libraries-have-had-this-century.html"],["Worcestershire","Wed, 30 Mar 2016 21:30:06 +0000","Worcestershire – Paid library jobs plunge 49 per cent across Worcestershire as hordes of volunteers take their place – Worcester News. &#34;New data has revealed how Worcestershire County Council has just 137 paid staff across its libraries compared to 272 six years ago. The savage reduction in professional work has led to a huge rise in volunteers, which stands at a whopping 449 compared to 175 in 2010. The rapid change, which has coincided with severe funding squeezes from central Government, has been described as &#34;scandalous&#34; from the opposition Labour Party.&#34;","2016/03/the-most-publicity-that-uk-public-libraries-have-had-this-century.html"],["Gloucestershire","Wed, 30 Mar 2016 21:30:06 +0000","Gloucestershire – Libraries in Gloucestershire lose staff but gain volunteers since 2010, figures reveal – Gloucester Citizen. &#34;Libraries in Gloucestershire have also taken a hit. In 2010 there were 270 paid employees in the county’s libraries, but now there’s just 184. But staff working at Gloucestershire’s community libraries have said its not all doom and gloom having seen a surge in their numbers of volunteers&#34; … library volunteer says &#34;In Gloucestershire at the moment the library service works quite efficiently. But we’re waiting to see what funding the council offer us from March 2017.&#34;","2016/03/the-most-publicity-that-uk-public-libraries-have-had-this-century.html"],["Isle of Wight","Wed, 30 Mar 2016 21:30:06 +0000","Isle of Wight – Isle of Wight library staff: Cut by more than half in last six years – On the Wight. &#34;If you follow the national news you might have seen the BBC’s report on Tuesday about the cuts to library staff over the last six years. They revealed that &#34;almost 8,000 jobs in UK libraries have disappeared in six years, about a quarter of the overall total&#34;. Here on the Isle of Wight the figures are rather more stark with more than half of library staff losing their jobs. The picture in 2010:  On 1st April 2010, the Isle of Wight library service had 20 full-time staff and ten relief staff.There were 51 part time staff (this included six Saturday assistants and eleven Sunday assistants on weekly hours of seven or less). That’s a total of 81 staff. Where we are today:  Fast forward to 1 April 2016 the number of full-time has dropped to 14, whilst relief staff are reduced to nine. The part-time roles have been hit the hardest with just 13 remaining (plus one funded by Ventnor Town Council). That’s a total of 36 staff.&#34;","2016/03/the-most-publicity-that-uk-public-libraries-have-had-this-century.html"],["Sunderland","Wed, 30 Mar 2016 21:30:06 +0000","Sunderland – Sunderland among the worst for axing libraries with more than half of branches closed, figures show – Sunderland Echo. &#34;Sunderland is one of four areas where more than half the libraries have closed since 2010, either buildings, mobile or both. It has lost nine static libraries and two mobile libraries since that time, however, there are no plans to close any more this year&#34;","2016/03/the-most-publicity-that-uk-public-libraries-have-had-this-century.html"],["Lincolnshire","Wed, 30 Mar 2016 21:30:06 +0000","Lincolnshire – Libraries run by volunteers in Lincolnshire could be ‘unsustainable’ – Lincolnshire Echo. Council says that with 700 volunteers, it’s sustainable.","2016/03/the-most-publicity-that-uk-public-libraries-have-had-this-century.html"],["Suffolk","Wed, 30 Mar 2016 21:30:06 +0000","Suffolk – Suffolk Libraries launch project to help youngsters’ mental health through reading – Ipswich Star. &#34;Suffolk Libraries has organised the launch of the project with a special event called ‘Building wellness through reading’ in which a host of organisations will come together to help schools and colleges recognise how reading can be used to tackle mental health crisis. Krystal Vittles, innovation and development manager for Suffolk Libraries, said: &#34;This event will provide schools with a solid understanding of how to develop a reading culture to promote wellness and good mental health amongst their students.&#34;","2016/03/the-most-publicity-that-uk-public-libraries-have-had-this-century.html"],["Northern Ireland","Wed, 30 Mar 2016 21:30:06 +0000","Northern Ireland – Libraries: More people in NI using facilities says DCAL – BBC. &#34;DCAL said a strategic review in 2009 had led to the closure of 13 libraries, but there were no plans to close any more. It said Culture Minister Carál Ní Chuilín had secured Northern Ireland Executive agreement for a proposal that reductions to the Libraries NI budget be capped at 7.5%, instead of the 11.2% cap enforced elsewhere across the department. &#34;These actions helped to ensure that there were no further library closures,&#34; the department said. It also said £17m had been invested in library capital projects since 2010, including new facilities in Lisnaskea, County Fermanagh, and Kilkeel and Moira in County Down.&#34;","2016/03/the-most-publicity-that-uk-public-libraries-have-had-this-century.html"],["Staffordshire","Wed, 30 Mar 2016 21:30:06 +0000","Staffordshire – Three ways to celebrate Tolkien in Staffordshire during the Easter break – Staffordshire Council. &#34; Staffordshire’s libraries are giving residents three different ways to celebrate the county’s links with the world famous author of The Hobbit and The Lord of the Rings. As well as hosting a brand new exhibition exploring in depth Tolkien’s time in Staffordshire during the Great War, libraries are also inviting residents to celebrate both Tolkien Reading Day on Friday 25 March, and experience a series of walks across picturesque Cannock Chase, exploring the landscape and geography which influenced the author’s early writings.&#34;","2016/03/the-most-publicity-that-uk-public-libraries-have-had-this-century.html"],["South Gloucestershire","Wed, 30 Mar 2016 21:30:06 +0000","South Gloucestershire – Support to save Hanham Library grows with song written to protest South Gloucestershire cutbacks – Bristol Post. &#34;Not only have nearly 1,500 people signed a petition to protect Hanham Library from having its opening hours slashed, a song has also been written protesting against changes to funding.&#34; … &#34;&#34;We’re so passionate about the library,&#34; said mum-of-two Abi Unwin, who is spearheading the campaign group to protect it. &#34;I have never been involved in anything like this before and I feel so strongly about it.&#34;","2016/03/the-most-publicity-that-uk-public-libraries-have-had-this-century.html"]]