[["Cambridgeshire","Thu, 01 Sep 2016 20:35:30 +0000","Cambridgeshire – Calling all bookworms! Littleport to host its first ever literary festival – Ely News. &#34;The festival is being funded by the Arts Council as part of Cambridgeshire County Council’s Arts Alive in Libraries programme&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Cumbria","Thu, 01 Sep 2016 20:35:30 +0000","Cumbria – Keeping libraries relevant and enhancing community wellbeing – Public Sector Executive. &#34;Cllr Ian Stewart, cabinet member for Public Health and Community Services at Cumbria County Council, in his Libraries Taskforce blog, explains why we all must step up and meet the challenge of ensuring libraries are relevant to this day and age&#34; … &#34;we have library services that are open and outward facing, not inward or &#34;reverential&#34;.  The skills of engagement with people which are core to many library functions are needed by the whole council in these times of change. The listening skills of library staff, allied to a deep knowledge of their community can also be harnessed and utilised to make that community a better place for all.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – Anger as it’s confirmed LCC to close three Hyndburn libraries – Accrington Observer. Teacher says &#34;We are absolutely devastated at the announcements to date as we feel a strong viable solution has been proposed by ourselves which would benefit all residents of Rishton. We would very much welcome the opportunity to discuss our proposal further with LCC. If we lose this our village will be decimated.&#34;&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – Final chapter as library faces the axe – Clitheroe Advertiser. &#34;Disappointed campaigners, who submitted petitions and battled for months to keep the crucial services open, are refusing to back down and have vowed to continue fighting. Mr Neil Martin, a spokesman for the Save Whalley Library campaign, said: &#34;This is very disappointing news, and a great blow to the community, along with the other cuts the residents of the Ribble Valley have experienced such as bus services. &#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – Lancashire council to close more than 20 libraries – Guardian. &#34;Lancashire author Andrew Michael Hurley, the Costa award-winning novelist, has warned that &#34;once libraries are closed down that’s it, they don’t come back&#34;, after Lancashire county council confirmed it was set to go ahead with plans to close more than 20 local libraries. The council proposed reducing its library network from 73 to 44 branches in May, in response to government cuts to its budget. After a consultation to which it received more than 7,000 responses, it recommended in a report on Friday that while a few libraries were facing a reprieve, more than 20 others would still be closed. The report goes to the council’s cabinet on 8 September.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – Last-ditch bid to save libraries – Blackpool Gazette. &#34;Angry MP Mark Menzies is pressing for central Government intervention after Lancashire County Council earmarked Lytham, Ansdell, Freckleton and Kirkham libraries for closure in their current form.&#34; … &#34;These include the Friends of Ansdell Library, who have ‘reluctantly’ submitted a business case for a community library in the event that they lose their fight to keep the village library open, and a cartel of parish and town councils in rural Fylde, who are keen to run a range of services from the Kirkham library building.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – MP says time to let local councils hold the budget strings – Lancashire Evening Post. &#34;Tory MP Nigel Evans has hit back at new county council (LCC) cuts by calling for funding to be taken from county councils and given to local borough councils instead.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – Three libraries in Pendle set to close – Pendle Today. &#34;Although there has been criticism from the Conservatives that the cuts have been politically motivated, the Labour administration at County Hall has defended its actions in the circumstances and said that even though some buildings will close, services will continue to be run from elsewhere.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Lancashire","Thu, 01 Sep 2016 20:35:30 +0000","Lancashire – Two libraries and a children’s centre could be closed down – Wigan Today.","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["South Gloucestershire","Thu, 01 Sep 2016 20:35:30 +0000","South Gloucestershire – Council backtracks on plans to close South Gloucestershire libraries after thousands sign petitions – Bristol Post. &#34;It came up with a plan in January to save £650,000 from its libraries, which cost £2.8million to run last year alone. The plan included cutting services, using volunteers to staff libraries, and closing branches around South Gloucestershire except for five. Council agreed to keep the main libraries open with the others turned into satellite libraries. There are 14 in the area, including the mobile library.&#34; … &#34;That plan was met with derision…&#34; … Open+ and volunteers seen as alternative instead. Staff reduced.","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["South Gloucestershire","Thu, 01 Sep 2016 20:35:30 +0000","South Gloucestershire – Library Review – South Gloucestershire Council. &#34;The savings target has been reduced from £650,000 to £500,000 (within a budget of £2.6 million); Staffed opening hours will reflect usage and be more consistent across South Gloucestershire; The service will introduce a technology (commonly known as Open Plus) to enable libraries to open without staff, extending opening times by up to 100% on current hours; The mobile library service will be replaced with community centre based libraries; South Gloucestershire  Council  will fund the building costs of Chipping Sodbury Library with the service being delivered by volunteers&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Wakefield","Thu, 01 Sep 2016 20:35:30 +0000","Wakefield – Library shuts after asbestos uncovered – Brief Report. &#34;Wakefield Council planned to shut Ossett library on September 10 for nine weeks whilst refurbishment work took place.  But it has now brought forward the closure over safety concerns. It said the health and wellbeing of staff and visitors was a &#34;priority&#34; and it closed the building yesterday as &#34;a precautionary measure&#34;. Work to upgrade the library will now take longer than planned and it is expected to be shut until Spring.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Warrington","Thu, 01 Sep 2016 20:35:30 +0000","Warrington – Meetings set to discuss future of town’s libraries – Warrington Guardian. &#34;LiveWire, which runs the libraries in the town, is hosting the events throughout September. Earlier this years hours were cut at libraries across Warrington as bosses said usage had fallen. Plans have already been announced to move Warrington Central Library into a base in the Golden Square Shopping Centre. Sessions start on Monday at 6pm in Stockton Heath Library.&#34;","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Aberdeen","Sun, 04 Sep 2016 20:00:18 +0000","Aberdeen – Aberdeen libraries make plea for lego – Evening Express. &#34;Inspired by the success of Lego Literacy clubs in libraries all over the world, City Libraries decided to establish a free club in the Central Library and launched an appeal for unwanted Lego.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Bedford","Sun, 04 Sep 2016 20:00:18 +0000","Bedford – Consultation may have saved Bedford Borough’s libraries from closure – Bedfordshire on Sunday. &#34;No libraries will be closed across Bedford Borough if a recommendation to the council’s executive is approved next week. This year Bedford Borough Council undertook a two-stage consultation, asking people what they felt about the library service and what was important to them.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Caerphilly","Sun, 04 Sep 2016 20:00:18 +0000","Caerphilly – Ystrad Mynach Library to close for £48,000 refurbishment – Caerphilly Observer. &#34;The library, on High Street, will close its doors to members of the public on Monday, September 5, while £48,000 worth of improvement works take place. It is scheduled to reopen on Monday, October 10. The improvement works will include new furniture, shelving and central staff desk, as well as new carpets and a fresh decor throughout the interior. The refurbishment will also ensure the important town centre amenity is able to offer modern facilities for years to come.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Lancashire","Sun, 04 Sep 2016 20:00:18 +0000","Lancashire – Council jobs at risk when buildings close – 2BR. &#34;More than 125 staff risk losing their jobs and countless others could take pay cuts, as a result of building closures in Lancashire.&#34; but &#34;Following the proposed closure of council owned buildings, the County anticipates that a similar number of [library] jobs will be available, but it’s likely that staff will be forced to take pay cuts, change jobs or work bases. A spokesperson from Lancashire County Council was unavailable to comment on the staffing implications until the proposals have been discussed at cabinet next week.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Lancashire","Sun, 04 Sep 2016 20:00:18 +0000","Lancashire – ‘We’ll carry on fight for our libraries’ – new petition launched – Lancashire Telegraph. &#34;Cllr Atkinson said: &#34;The Conservative Group has an alternative proposal which would enable all of these facilities to remain open. &#34;These issues will be debated at an LCC Scrutiny meeting on September 6 at 2pm.&#34;. The petition will be distributed county wide by all Conservative county councillors and physical copies will also be placed in the library in Whalley, Clitheroe and Longridge as well as the Youth Centre in Berry Lane, Longridge.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Norfolk","Sun, 04 Sep 2016 20:00:18 +0000","Norfolk – Head of libraries service to retire after 35 years – Eastern Daily Press. &#34;Jennifer Holland, Assistant Director for Cultural Services and Head of Norfolk’s Library and Information Service is to retire from Norfolk County Council at the end of September, after 35 years working for the authority. Steve Miller has been appointed as Acting Assistant Director for Culture and Lifelong Learning, pending any decisions on a permanent replacement, and will take up his role when Jennifer retires. Steve is currently Head of Museums and Head of Arts and in addition to his new role will continue to lead on museums and the arts. Jan Holden has been appointed Head of Service for the Norfolk Library and Information Service and will take up her appointment at the beginning of October.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Northamptonshire","Sun, 04 Sep 2016 20:00:18 +0000","Northamptonshire – Tell the county council what you think of the library service in Northamptonshire – Northants Herald and Post. &#34;The library service, delivered by First for Wellbeing on behalf of Northamptonshire County Council, is carrying out a survey of its customers to find out what they think about their library and what could be made better. It runs for the whole of September on the mobile library and for one week in county libraries from October 10 to 16. The Adult Public Library User Survey (APLUS) is a national survey which is carried out every other year.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["North Yorkshire","Sun, 04 Sep 2016 20:00:18 +0000","North Yorkshire – Volunteers take on South Craven libraries provision – Keighley News. &#34;South Craven Library Services will be based at the current Cross Hills premises. Residents will run it, with backing from parish councils. The Stronger Communities programme has provided £200 to help cover start-up costs and the group is seeking charitable status to unlock more potential funding avenues.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Nottingham","Sun, 04 Sep 2016 20:00:18 +0000","Nottingham – Nottingham UNESCO City of Literature appoints Director – Leftlion. Sandy (Sandeep) Mahal appointed. &#34;Sandy worked in libraries for ten years and was named one of the UK’s top ten librarians by the Love Libraries campaign; was formerly Head of Partnerships at The Reading Agency; and for the last eighteen months was director of BBC/Arts Council The Space – a commissioning agency supporting greater digital access to the arts.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Staffordshire","Sun, 04 Sep 2016 20:00:18 +0000","Staffordshire – Community group to take over management of Shenstone Library – Lichfield Live. &#34;The Shenstone Community Group will take on the management of the library after being offered a contract.&#34; … &#34;The council says the plans will &#34;re-energise&#34; libraries which have seen the number of people using them decline.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Staffordshire","Sun, 04 Sep 2016 20:00:18 +0000","Staffordshire – Second round of community library transfers announced – Staffordshire Newsletter. &#34;Eight contracts have been offered to community bodies, schools and a business enterprise group in the second phase of transfers, bringing the total number of libraries transferred from council management, or in the process of transferring, to 19.&#34; … &#34;Twenty of the council’s 43 libraries will be managed and staffed by the county council’s library service, while 23 will be supported by not-for-profit groups in the community.&#34; … &#34;Management groups still have to be appointed for the libraries at Cheslyn Hay, Great Wyrley, Loggerheads and Talke and they will be the subject of a third round of bid development.&#34; … &#34;Community libraries are supported by the county council to take over the day-to-day running and management of the library. They will have access to the library service’s stock and IT network, while the county council remains responsible for agreed utility and maintenance costs.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Sunderland","Sun, 04 Sep 2016 20:00:18 +0000","Sunderland – Future of Sunderland library services to be discussed as part of seven-week consultation – Chronicle. &#34;The council is asking both people who use the libraries and those who don’t what is most important to them about what’s on offer in the city’s libraries, if they don’t use the service, what could be done to change that. Councillor John Kelly, portfolio holder for Public Health, Culture and Wellness at Sunderland City Council, said: &#34;We want to find out how people are using library services, whether they’re aware of the range of library services available and what we can do to encourage them to use them more within the reduced budget we have available. &#34;When we last reviewed library services in 2013 it was on the understanding that the Government’s austerity programme was due to end in 2015.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Swindon","Sun, 04 Sep 2016 20:00:18 +0000","Swindon – Campaign to save Park Library is launched ahead of public meeting showdown – Swindon Advertiser. &#34;Save Swindon’s Libraries campaign is calling on library users across the town to turn out for a public meeting next Tuesday to make their voices heard. The event, which will be held from 7pm to 9pm at St Joseph’s College on Ocotal Way, forms a key part of the ongoing consultation into the council’s library strategy. It is the only opportunity for councillors to hear the views of the public in an open forum setting as all the other events are in the form of drop-in sessions.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Wigan","Sun, 04 Sep 2016 20:00:18 +0000","Wigan – Trend-bucking council defies the savage cuts – Wigan Today. &#34;while many parts of the country have seen mass closures of such institutions, Wigan has managed to maintain virtually all such services, perhaps by reducing staff and/or hours or, through the council’s Deal, by handing over the running of operations to volunteers, trusts, charities and other organisations.&#34; … &#34;Beech Hill Library did close but has been replaced with a Book Cycle outlet where people can still obtain books for free.&#34; … &#34;. Aspull library, which is now being run by the community.&#34;","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Argyll and Bute","Tue, 06 Sep 2016 18:39:53 +0000","Argyll and Bute – Julia Donaldson writes to Sturgeon in ‘dismay’ over librarian cuts – Herald Scotland. &#34;Julia Donaldson cautioned against a decision to remove the librarian at Oban High School, in Argyll and Bute, to budget constraints writing of her &#34;dismay&#34; after learning of the move from distressed pupils. The pupils wrote to the author pleading with her to intervene prompting an open letter from the former Children’s Laureate to Nicola Sturgeon, also know to be an avowed book lover.&#34; see also Julia Donaldson protests to Nicola Sturgeon about axing of school librarians – Guardian and Donaldson criticises school library cuts in Scotland – BookSeller.","2016/09/theres-consultations-and-then-theres.html"],["Darlington","Tue, 06 Sep 2016 18:39:53 +0000","Darlington – Library report – Darlington Council. &#34;It is now clear that what had been previously described as a covenant in the statutory declaration more accurately should have been a reference that Crown Street was held on trust for the purposes of a public library.&#34; … &#34;It is officers’ view that while the legal challenge is defendable, given the risks, expense and delay created by litigation and the developing situation since June, a more considered response is to continue the development of the proposals for the Dolphin Centre, carry out further focussed consultation on the service in this location and then for a more detailed report to be presented to members. At the same time the Cabinet as trustee can meet to consider the implications should the library service relocate to the Dolphin Centre and the future of the Crown Street building.&#34;","2016/09/theres-consultations-and-then-theres.html"],["Darlington","Tue, 06 Sep 2016 18:39:53 +0000","Darlington – Plans to close Darlington library may be ‘set aside’ following legal challenge – Northern Echo.  &#34;Borough Council has announced plans to &#34;set aside&#34; their contentious decision to close Crown Street Library. On the day the authority was due to respond to a legal challenge in relation to the historic library, a lengthy statement was issued saying a &#34;fresh decision&#34; would be made in around three months. Councillors attending a cabinet meeting next week (Tuesday, September 13), are set to approve the proposal to postpone the relocation of the library to the Dolphin Centre.&#34; … &#34;Although the Council is confident that it has grounds on which to defend the legal challenge, it is keen to avoid the substantial cost to the public purse a full judicial review hearing would incur and the delay that would be caused. In light of the issues relating to the Crown Street building and the threat of a judicial review, together with the planned further consultation, it is being recommended that Cabinet members set &#8230;","2016/09/theres-consultations-and-then-theres.html"],["Gateshead","Tue, 06 Sep 2016 18:39:53 +0000","Gateshead – Gateshead’s libraries should not be run by ‘amateur’ volunteers, campaigners say – Chronicle Live. &#34;It was suggested by cost-cutting Gateshead councillors that libraries across the borough could be staffed by volunteers. But anti-closure protesters say volunteers are &#34;amateurs&#34; without training or experience, and that the facilities need to be properly staffed.&#34;. Consultation running until October 8th.","2016/09/theres-consultations-and-then-theres.html"],["Herefordshire","Tue, 06 Sep 2016 18:39:53 +0000","Herefordshire – Library campaign group says fewer people are using libraries due to cut in hours – Ledbury Reporter. &#34;Joint Action for Herefordshire Libraries (JAHL), which represents library users throughout the county, recently submitted a Freedom of Information request to find out how Herefordshire Council cuts have had an impact on library opening hours. It revealed that ten years ago libraries around the county opened for more than 407 hours a week but by 2015/16 they only opened for 253 hours, a drop of nearly 40 per cent.&#34;","2016/09/theres-consultations-and-then-theres.html"],["Lancashire","Tue, 06 Sep 2016 18:39:53 +0000","Lancashire – Councillor slams building closure consultation as ‘a sham’ – 2BR. &#34;Conservative Councillor Terry Hill, who is also Ward Councillor for Whalley, believes the planned closure of more than 100 buildings in Lancashire was decided, even before the consultation went live. He’s shared his views in response to the closure of Whalley Library. He claims the decisions have been made with political motives, and that most of the libraries and children’s centres earmarked for closure are in non-labour areas.&#34;","2016/09/theres-consultations-and-then-theres.html"],["Lancashire","Tue, 06 Sep 2016 18:39:53 +0000","Lancashire – Show support for libraries plea from campaigner Jane – Lancashire Evening Post. Library user &#34;protesting outside county hall in Preston and is urging members of the public to attend two key county council meetings to show the strength of feeling against proposed library closures.&#34; … &#34;Jane, who organised a Save Our Library petition which gained nearly 4,000 signatures, said: &#34;The more members of the public who want to attend or watch the meetings on webcam at 2pm the better.&#34;","2016/09/theres-consultations-and-then-theres.html"],["Lincolnshire","Tue, 06 Sep 2016 18:39:53 +0000","Lincolnshire – Uncertain future for Caistor Arts & Heritage Centre – Market Rasen Mail. &#34;After receiving a Big Lottery grant of £430,000, the creation of Caistor Arts and Heritage Centre was one of six projects featured in the BBC’s Village SOS programme to revitalise rural communities.It is one of only two of the projects still running, but now the future is looking uncertain. &#34;.  Lacks funding.","2016/09/theres-consultations-and-then-theres.html"],["Pembrokeshire","Tue, 06 Sep 2016 18:39:53 +0000","Pembrokeshire – Go digital at Pembrokeshire libraries – Tenby Observer. First Click.","2016/09/theres-consultations-and-then-theres.html"],["Pembrokeshire","Tue, 06 Sep 2016 18:39:53 +0000","Pembrokeshire – Power to approve £3.4m library, gallery and cafe in Haverfordwest granted – Western Telegraph. &#34;The site will become home to the new county library, art and exhibition gallery, play and learn facilities, a tourist information centre, and coffee shop&#34; … &#34;The new library will feature a number of glazed reading pods which will extend onto the overhanging walkway by the river. &#34; … &#34;The £3.4m scheme, supported by Welsh Government funding of £285,000, will feature a ‘ground-breaking’ partnership with the National Library of Wales. &#34;","2016/09/theres-consultations-and-then-theres.html"],["Staffordshire","Tue, 06 Sep 2016 18:39:53 +0000","Staffordshire – Staffordshire libraries get Great War puppy book exclusive – Leek Post and Times. &#34;Now, following a kind donation of 20 copies of the book by The Friends of Cannock Chase, Staffordshire Library Service now has additional copies in all its libraries.&#34;","2016/09/theres-consultations-and-then-theres.html"],["Wakefield","Tue, 06 Sep 2016 18:39:53 +0000","Wakefield – Library closes for refurbishment after asbestos find – Wakefield Express. &#34;Wakefield Council planned to shut Ossett Library on September 10 for nine weeks whilst refurbishment work took place. But it brought forward the closure after the asbestos was found during preparatory work.&#34;","2016/09/theres-consultations-and-then-theres.html"],["Warrington","Tue, 06 Sep 2016 18:39:53 +0000","Warrington – Fate of town’s libraries uncertain after public consultation launched – Warrington Guardian. 30-day consultation, &#34;Since 2010, library visits have decreased by an average of 32 per cent at all libraries in Warrington with the exception of integrated hub libraries in Orford and Woolston which have seen visits increase by an average of 96 per cent over the last six years. &#34; … &#34;The company will spend this month speaking to residents about plans to shut libraries in Stockton Heath, Penketh, Lymm, Culcheth, Warrington Town Centre and Padgate. &#34;","2016/09/theres-consultations-and-then-theres.html"],["Warrington","Tue, 06 Sep 2016 18:39:53 +0000","Warrington – Libraries /  Modernisation Consultation / Proposals – Warrington Livewire. &#34;The 30 day public consultation into the proposed changes to their library and learning offer in Warrington will run from 5th September until 4th October. The neighbourhood wellbeing company has had success in increasing participation and memberships in integrated library sites since it took over the management of 11 libraries in Warrington in 2012, but stand-alone library sites have continued to see a decline in lending and memberships in line with the national trend. Since 2010, library visits have decreased by an average of 32% at all libraries in Warrington with the exception of integrated hub libraries in Orford and Woolston which have seen visits increase by an average of 96% over the last six years. As a result of this and funding cuts to library services from central government, LiveWire and Warrington Borough Council are looking at alternative ways to improve library and learning provision so it is cost effective and more accessible.&#&#8230;","2016/09/theres-consultations-and-then-theres.html"]]