[["Gwynedd","Thu, 29 Jan 2015 21:16:03 +0000","Gwynedd – Singer Bryn Fon joins campaign to save Gwynedd libraries from closure - Daily Post. &#34;C’Mon Midffild star Bryn Fôn has urged cash-strapped Gwynedd council &#34;not to steal libraries&#34; in the county. Llanllyfni born entertainer, who also sang hits such as Rebel Wicend and Ceidwad y Goleudy, made the comments following a protest in Penygroes last Thursday.&#34;","2015/01/news-for-28th-29th-january.html"],["Thurrock","Thu, 29 Jan 2015 21:16:03 +0000","Thurrock – Taxpayers have every right to question why an eye-watering £40 million was spent on agency staff – and why their libraries are under threat – Thurrock Gazette.  Compared £500k library budget with amount spent on agencies.","2015/01/news-for-28th-29th-january.html"],["Lincolnshire","Tue, 27 Jan 2015 23:05:26 +0000","Lincolnshire – Reporting from the Lincs Library Frontline – Behind the Gag – Save Lincolnshire Libraries. &#34;The ongoing and seemingly endless saga of Lincolnshire Libraries has if we are honest inevitably divided opinion amongst librarians themselves. There are some who just want the whole sorry mess sorted out once and for all and others who think that the continuing fight is worth pursuing. What is clear though is that the people who are the very heart of this; i.e. librarians, feel gagged from speaking out no matter what higher management might say about avenues being open to them. Morale is understandably at an all time low as some staff have been forced to take second part time jobs in order to make ends meet after being given pitifully and laughably short hours&#34;","2015/01/a-public-library-news-miscellany.html"],["Sheffield","Sun, 25 Jan 2015 22:50:03 +0000","Sheffield – Protest held at Sheffield library over business centre – Star. &#34;A protest was held outside Sheffield’s Central Library over it becoming a new business centre. Former library staff and activitists took part after part of the reference library was made available for entrepreneurs to check patents . One former library worker said it was an attempt to ‘distract’ people from massive library cuts&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Buckinghamshire","Tue, 20 Jan 2015 20:24:55 +0000","Buckinghamshire – Number of overall visits to Buckinghamshire libraries fall – but ‘literary’ Beaconsfield defies trend - Get Bucks. &#34;Overall, there were an estimated 1.59m visitors to Buckinghamshire’s libraries. That is down 3.9% on the 1.66m who went into the county’s branches in 2013.&#34; but Beanconsfield up 43%.","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Lincolnshire","Tue, 20 Jan 2015 20:24:55 +0000","Lincolnshire – Volunteer Crisis – Save Lincolnshire Libraries. &#34;The council’s plan for Lincolnshire libraries forces 30 libraries into the hands of volunteers, making over 100 people redundant. All the communities we have spoken to do not want to volunteer to take over their libraries and take away jobs from library workers, they feel they are being forced into this. Several groups have already withdrawn their support. The council’s reliance on volunteers to ‘save’ libraries is failing before it’s even implemented. Listen to to the voices of these communities below (newest first):&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Staffordshire","Sun, 18 Jan 2015 20:25:28 +0000","Staffordshire – Staffordshire children’s centres set to close – BBC News. &#34;Forty six children’s centres are to close in Staffordshire, under plans put forward by the county council. Thirty five of them will be transferred to schools and libraries, on the condition they provide some services.&#34;","2015/01/of-reports-and-raspberries.html"],["Devon / Torbay","Tue, 13 Jan 2015 18:01:53 +0000","Devon / Torbay – Shared library service future across Devon and Torbay unlikely to happen before 2016/17 - Torquay Herald Express. &#34;Discusssions between Torbay Council and Devon County Council around progressing to a South West Peninsula Library Plan are unlikely to come to fruition before 2016/17. As part of the plan to maintain an ‘efficient and comprehensive’ library service, discussions between the councils have begun to take place, but Sue Cheriton, Executive Head of Residents and Visitors Services said that Devon had told them it was unlikely to happen in the short term&#34;.&#34; … &#34;&#34;Devon is currently assessing alternative delivery models with community and the emerging entity may wish to grow its business once set up and deliver services for Torbay and Somerset.&#34;&#34;","2015/01/welcoming-the-homeless-in.html"],["Leicestershire","Sun, 11 Jan 2015 19:35:53 +0000","Leicestershire – Council’s plans for local library are outrageous – Leicester Mercury. &#34;Braunstone Town Library is included and we are gravely concerned that it will be &#34;moth-balled&#34; or threatened with closure unless our town council can find acceptable conditions within a county council partnership agreement. It is clear that, despite the partnership recommendations for so-called &#34;community libraries&#34;, we can only expect a greatly reduced service in Braunstone Town. The impact will be even more severe through the council decision to make experienced staff redundant and insistence that replacement by volunteers will not impair service.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Birmingham","Thu, 08 Jan 2015 21:17:25 +0000","Birmingham – Birmingham Library cuts could leave ‘empty shell’, campaigners warn – BBC. &#34;A meeting attended by hundreds of people on Wednesday heard some library services would be &#34;irreparably&#34; damaged under the plans … &#34;the building’s specialist archive and research staff would be lost, and collections would be &#34;irreparably damaged&#34;. &#34;Without the staff…[the library] would just be an empty shell,&#34;","2015/01/je-suis-charlie-birmingham-library-song-and-the-magna-carta.html"],["Nottinghamshire","Thu, 08 Jan 2015 21:17:25 +0000","Nottinghamshire – Rosie Bartram: Libraries are a vital resource which should be run by the council - Nottingham Post. &#34;The county council is looking to change the way libraries are run but Rosie Bartram, who works at Eastwood Library and is branch chair of Notts County Unison, says this isn’t the way forward&#34; … &#34;It might seem that libraries have been spared the worst of the cuts, in terms of closures, but in 2010 we lost the equivalent of 84.5 full-time staff members, then we lost around another 10, and there are around 16 employees currently at risk. Opening hours have been reduced, with some smaller libraries only open eight to ten hours a week; here at Eastwood we are now closed on Tuesday afternoons, Friday after 2, and Saturday afternoons.&#34; … &#34;Once the library service is gone, it’ll be gone forever. If the service goes to arms-length and things don’t work out we could see library closures with buildings being sold off. Some libraries were donated to the public by well-off philanthropists. They were never meant&#8230;","2015/01/je-suis-charlie-birmingham-library-song-and-the-magna-carta.html"],["West Dunbartonshire","Thu, 08 Jan 2015 21:17:25 +0000","West Dunbartonshire – Balloch Library threatened with closure as part of budget cuts - Daily Record. &#34;Plans to close Balloch Library would be &#34;disastrous&#34; for the community, according to a key representative. Murdoch Cameron, chairman of Balloch and Haldane Community Council, hit out after West Dunbartonshire Council earmarked the facility for closure as part of budget cuts. The measure would help save the local authority nearly £500,000, which would also involve it shutting another four libraries in Clydebank.&#34;","2015/01/je-suis-charlie-birmingham-library-song-and-the-magna-carta.html"],["Swindon","Thu, 29 Jan 2015 21:16:03 +0000","Swindon – Stark warning over council’s £70m shortfall – Swindon Advertiser. &#34;&#34;Some councils are already talking about not being able to meet their statutory requirements. &#34;It’s going to be a case of looking at every area and making savings where we can with the minimum impact. &#34;We could do with some clarification in some areas. If you take libraries for example, we are obliged to provide a town-wide service but some authorities have been taken to court and lost because it was decided their proposals didn’t meet this requirement.&#34;","2015/01/news-for-28th-29th-january.html"],["Calderdale","Tue, 27 Jan 2015 23:05:26 +0000","Calderdale – ‘Discretionary’ services may be hit – Hebden Bridge Times.  &#34;Local Liberal Democrats have expressed dismay at the Conservative Cabinet’s proposals that &#34;discretionary services&#34; should take the biggest cut if large savings have to be made in three years’ time (2017/18).. They point out that cutting &#34;discretionary services&#34; could mean anything from shutting libraries, stopping giving grants to voluntary organisations, to reducing gritting to a bare minimum.&#34;","2015/01/a-public-library-news-miscellany.html"],["Lincolnshire","Tue, 27 Jan 2015 23:05:26 +0000","Lincolnshire – Lincolnshire libraries: committee agrees recommendation to turn more than 30 libraries into community-run hubs - Lincolnshire Echo. &#34;Inside, a council scrutiny committee meeting discussed the proposal and agreed its recommendation that the executive implements the scheme when it meets on February 3. The scrutiny committee has heard comments from both residents and councillors, including Maurice Nauta who is a campaigner and former librarian.&#34;","2015/01/a-public-library-news-miscellany.html"],["Lincolnshire","Tue, 27 Jan 2015 23:05:26 +0000","Lincolnshire – Lincolnshire libraries: ‘disgraceful con-trick’ by Conservative councillors, claims Labour - Lincolnshire Echo. Audit report: &#34;Labour says it reveals how Lincolnshire Conservatives were secretly planning to slash library opening hours – at the same time as making county-wide election promises to &#34;improve library opening hours&#34;. see also photographs of the demonstration.","2015/01/a-public-library-news-miscellany.html"],["Lincolnshire","Tue, 27 Jan 2015 23:05:26 +0000","Lincolnshire – Julie Harrison’s speech on libraries","2015/01/a-public-library-news-miscellany.html"],["Lincolnshire","Sun, 25 Jan 2015 22:50:03 +0000","Lincolnshire – Friends of Deepings Library to lobby councillors for change – Rutland and Stamford Mercury. &#34;Members are now focusing on a meeting of the council’s community and public safety scrutiny committee on Tuesday. They hope to convince councillors to include tier 3 libraries, including Deepings Library, in the list sent to tender. A final decision will be made by the council’s executive on February 3.&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["North Yorkshire","Thu, 22 Jan 2015 21:22:40 +0000","North Yorkshire – Please save our library – Northern Echo. &#34;Television did not replace radio, video and DVD did not replace film, e-mail did not replace the telephone and e-books will never replace the free paper books found in libraries. Our library should offer group study, art exhibitions, food/coffee, childrens’ workshops, DVDs and homework clubs. It should be a community centre bridging any age gap providing culture for all.&#34; Concerns Stokesley Library.","2015/01/national-libraries-day-all-growed-up.html"],["Coventry","Tue, 13 Jan 2015 18:01:53 +0000","Coventry – Save Allesley Park Library from Government forced cuts – Epetitions Coventry Council. &#34;&#34;We, the undersigned, urge Coventry City Council to keep the Allesley Park library open in the face of government led cuts. We recognise the difficult decisions that the city council has to make, especially as funding from the Coalition government cuts spending power by nearly 50% in real terms since 2010. However, we believe the shared service model that the Allesley Park library can support, can also help the council keep sufficient library services open in the west of the city during these tough times.&#34;&#34;","2015/01/welcoming-the-homeless-in.html"],["Newport","Sun, 11 Jan 2015 19:35:53 +0000","Newport – Stewart Lee backs campaign to save Welsh writer Arthur Machen’s books and papers - ITV. &#34;Machen was born in Caerleon in 1863. A collection of his work and papers – the only one in the UK – is kept at the central library in nearby Newport. But the building faces closure as Newport City Council tries to cut £10million from its budget&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Leicestershire","Thu, 29 Jan 2015 21:16:03 +0000","Leicestershire – Measham library still at risk of closure - Burton Mail. &#34;Measham library is still at risk of closure after it did not appear on a list of 29 libraries where communities had offered to run their local service.&#34;","2015/01/news-for-28th-29th-january.html"],["Southampton","Thu, 29 Jan 2015 21:16:03 +0000","Southampton – Burgess Road Buddies - Facebook. &#34;Protest against plans to close Burgess Road Library, Southampton, because this is a genuine community library, really needed by the diverse community in this area – the children, the older people, those who need help, advice and the means to find work. Join in our protest day on 7 February by reading out loud. If you can’t be there, do a selfie video of you reading outloud. Post it to us here. If you are on Twitter – tweet it. We are on ‪#‎BurgRdLibBuds‬. We need our library – help us save it.&#34;","2015/01/news-for-28th-29th-january.html"],["Barnet","Tue, 27 Jan 2015 23:05:26 +0000","Barnet – Council to hold consultation evenings about threat of Barnet library closures - Ham and High. &#34;Residents are invited to find out more about Barnet Council’s plans to cut £2.85million from the borough’s libraries service&#34;","2015/01/a-public-library-news-miscellany.html"],["Lincolnshire","Tue, 27 Jan 2015 23:05:26 +0000","Lincolnshire – Libraries: Speech to Lincolnshire County Council - Labour Rose. &#34;Charles Dickens would have dropped everything to have been here today to defend Libraries.Just as he dropped everything over 150 years ago when the Mayor of Manchester invited him to the opening ceremony of the first free Library. In his acceptance note he said &#34;The occasion is far too important and the example too noble to admit hesitation’.&#34;","2015/01/a-public-library-news-miscellany.html"],["Trafford","Sun, 25 Jan 2015 22:50:03 +0000","Trafford – Trafford Lib Dem candidate calls on volunteers to step up as youth centres face cuts – Mancunian Matters. &#34;Ms Ankers is backing the cuts and believes everyone can do their bit. She said: &#34;When it comes to things like parks and libraries it’s something that I would like to preserve as much as possible. &#34;People could step forward and do more work on a voluntary basis or within the community but it’s kind of a question of priorities really. &#34;Keeping somebody fed and looked after in their own home or making sure that children’s services are protected is sometimes more of a priority.&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Bromley","Thu, 22 Jan 2015 21:22:40 +0000","Bromley – Future proposals for the Bromley Library Service - Bromley Council. &#34;The council are consulting about options for the future of the Bromley Library Service which includes: the development of community managed libraries, market testing the core library service, improving current library buildings. Surveys can be completed online or in your local library. The council are consulting about the future of the library services as we must make further budget savings of more than £60 million from a budget of £206 million over the next four years and we are looking carefully at the future of every council service.&#34;","2015/01/national-libraries-day-all-growed-up.html"],["Fife","Thu, 22 Jan 2015 21:22:40 +0000","Fife – Warning over ‘libraries to close’ threat – Fife Today. &#34;A Glenrothes councillor is warning of a public backlash if libraries in the town are forced to close due to impending budget cuts. Cllr Peter Grant claims Labour councillors admitted last week that it was &#34;inevitable&#34; that some libraries would close as a result of budget cuts faced by Fife Cultural Trust. &#34;In their first full budget back in 2013 Labour and their allies voted to cut a total of £3 million from the Cultural Trust’s budget over three years,&#34;&#34;","2015/01/national-libraries-day-all-growed-up.html"],["Hampshire","Thu, 22 Jan 2015 21:22:40 +0000","Hampshire – Contentious plan for Emsworth library gets go-ahead – News. &#34;Councillor Keith Chapman, in charge of libraries in Hampshire, made the decision to move the library from St Peter’s Square in Emsworth to the town’s community centre in North Street. More than 1,000 people signed a petition calling for the library to stay put and almost 70 per cent of people in a consultation wanted it to remain in the town centre. The move will save Hampshire County Council around £30,000 a year.&#34;","2015/01/national-libraries-day-all-growed-up.html"],["Birmingham","Tue, 20 Jan 2015 20:24:55 +0000","Birmingham – Hard Times Ahead for the Library of Birmingham – Library Journal (USA). A detailed look at the cuts to the library, how they have been received and possibilities for the future.","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Kirklees","Tue, 20 Jan 2015 20:24:55 +0000","Kirklees – Kirklees Council library service consultation begins – BBC. &#34;A public consultation into the future of library services in Kirklees has begun as the council looks to cut £2.5m from its budget by 2018. The council says it needs to find new ways to run its 26 libraries in order to reduce spending on the service from £5.7m to £3.2m in the next three years. Among the proposals are plans to hand libraries over to groups of volunteers. The council has cut its overall budget by £83m since 2011 but needs to save a further £69m by 2017/18. The 12-week consultation runs until 10 April.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["North Yorkshire","Tue, 20 Jan 2015 20:24:55 +0000","North Yorkshire – MP seeks reassurances over community library proposals – Yorkshire Post. &#34;At present North Yorkshire County Council runs over thirty libraries and it says volunteer support will be needed at all libraries, even those it is proposing to continue running, as it struggles to balance its books in the light of budget cuts which has seen its spending falling by some £167m. Andrew Jones, Harrogate and Knaresborough MP, says a successful community model has already been adopted at Bilton and Woodfield Community library but he is concerned that if the scheme is widened more libraries would be at risk of closure.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Bristol","Sun, 18 Jan 2015 20:25:28 +0000","Bristol – Reader’s letter: Books have so much to offer us still - Bristol Post. Letter points out that despite newspaper report that library users are small in number, &#34;nationally 35 per cent of people in England use their local libraries, a percentage rising to 50 per cent among poorer and immigrant groups.&#34;","2015/01/of-reports-and-raspberries.html"],["North Yorkshire","Sun, 18 Jan 2015 20:25:28 +0000","North Yorkshire – Skipton Town Council meeting to hear library proposals – Craven Herald. &#34;Next Thursday’s (jan 22) meeting of Skipton Town Council will include a presentation by North Yorkshire’s assistant director, Julie Blaisdale, in addition to the setting of the council precept and budget. It will be one of the last chances for those concerned about the proposals, which include the use of volunteers and a possible reduction in opening hours, to comment in public before the end of the three month consultation next month&#34;","2015/01/of-reports-and-raspberries.html"],["Swansea","Sun, 18 Jan 2015 20:25:28 +0000","Swansea – Libraries could be brought to book – South Wales Evening Post. &#34;They could take on the guise of book clubs as councillor Rob Stewart said they were far cheaper to run and Swansea Council was looking to ensure that services in the east and west of the city are placed on an equal footing. He set out the plan during a meeting of Gorseinon Town Council — where he was the first council leader to ever address members.&#34;","2015/01/of-reports-and-raspberries.html"],["Worcestershire","Sun, 18 Jan 2015 20:25:28 +0000","Worcestershire – Council taking on volunteers is ‘immoral’ – Redditch Standard. &#34;Taking on volunteers to an organisation which is cutting 1,500 staff has been branded ‘immoral’. Worcestershire County Council is calling on unpaid helpers to join them to support the provision of a range of services. But the appeal has been criticised by Labour councillor Graham Vickery who said they were ‘very unhappy with the idea’.&#34;","2015/01/of-reports-and-raspberries.html"],["North Yorkshire","Tue, 13 Jan 2015 18:01:53 +0000","North Yorkshire – MP says library plans are ‘unacceptable’ – Ripon Gazette. &#34;Ripon MP Julian Smith has written to the Chief Executive of the county council expressing his concerns over proposed cuts to Ripon Library. In his letter to North Yorkshire County Council (NYCC) boss Richard Flinton sent last week, Mr Smith describes the local authority’s plans to reduce its commitment down to covering premises costs and the salary of just one member of staff as &#34;wholly disproportionate and unacceptable&#34;.&#34; … &#34;It would appear that the three-tier model being proposed, with Ripon being suggested as a ‘hybrid’ library, takes no account of the varying levels of usage or significance of libraries.&#34;","2015/01/welcoming-the-homeless-in.html"],["East Sussex","Thu, 29 Jan 2015 21:16:03 +0000","East Sussex – Date set for new library opening in Newhaven – Sussex Express. &#34;Newhaven’s new library is set to open its doors to the public in March, East Sussex County Council has announced.  The new facility, which occupies the ground floor of the former M&Co premises at 36 High Street, will open to the public on March 14. The new facility, being created with £1.6 million investment from East Sussex County Council, is currently being fitted out with IT systems, shelving and other bespoke furniture. The old library, also in High Street, will close on February 21, to allow staff to pack up and move to their new home nearby.&#34;","2015/01/news-for-28th-29th-january.html"],["Leicestershire","Thu, 29 Jan 2015 21:16:03 +0000","Leicestershire – Groups express interest in running libraries – Loughborough Echo. Volunteer groups &#34;have registered an interest in running 29 of Leicestershire County Council’s 36 libraries – which were at threat of closure if volunteers were not found. Leicestershire County Council says it will continue to look at how it can encourage the remaining seven.&#34;","2015/01/news-for-28th-29th-january.html"],["Worcestershire","Tue, 27 Jan 2015 23:05:26 +0000","Worcestershire – Hagley Parish Council steps in to save library – Stourbridge News. &#34;An agreement has been reached whereby the county council will continue to provide a library service through the support of volunteers while the parish council takes over the responsibility for the building and the premises management costs involved. &#34;","2015/01/a-public-library-news-miscellany.html"],["Lincolnshire","Sun, 25 Jan 2015 22:50:03 +0000","Lincolnshire – Save Lincolnshire Libraries stage protest at County Offices - Lincolnshire Echo. &#34;Save Lincolnshire Libraries campaigners are staging a protest at Lincolnshire County Council’s offices next week. The demonstration is at 9.15am on Tuesday, January 27, ahead of the authority’s library scrutiny committee meeting at 10am. Six months ago a High Court judge criticised the county council’s plan to turn 30 libraries into community hubs run by volunteers. But now the authority is proposing what campaigners say is fundamentally the same plan.&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["North Yorkshire","Sun, 25 Jan 2015 22:50:03 +0000","North Yorkshire – ‘No guarantees’ on future of North Yorkshire libraries – Wetherby News. &#34;Executive member for library services Coun Chris Metcalfe (Con) said no assurances could be given, responding to Harrogate and Knaresborough MP Andrew Jones’ calls for NYCC to intervene before libraries are allowed to decline. Mr Jones’ concerned request to NYCC comes almost three months after it launched a three-month consultation on cutting £3.6m from its libraries budget by 2020.&#34; … &#34;The consultation on libraries closes in February 2015. Plans include withdrawing council staff and asking volunteers to step in, leading to widespread fears that many libraries could close. Mr Jones has written to NYCC’s chief executive Richard Flinton asking for assurances that if the community model doesn’t work at the three libraries that NYCC will guarantee this will not be allowed.&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Lincolnshire","Thu, 22 Jan 2015 21:22:40 +0000","Lincolnshire – Lincs: County council are pushing forward with its proposal for a new look library service – Guardian series. &#34;Lincs County Council are pushing forward with its original proposals for a new look library service. Under the proposals, the council would continue to provide 15 major libraries, along with online services, mobile libraries and specialist support for those unable to reach their nearest library because of, for instance, disability, age or ill health.&#34;","2015/01/national-libraries-day-all-growed-up.html"],["Manchester","Thu, 22 Jan 2015 21:22:40 +0000","Manchester – Century-old letter for peace to be exhibited in Central Library – Manchester Gov. &#34;The Open Letter, which was signed by 101 women in the winter of 1914/15, will be on display in the library’s Archives+ Centre. Dr Alison Ronan, from Manchester Metropolitan University, will give a free talk at the Central Library’s performance space, on Thursday 22 January (6 – 7pm).  Dr Ronan will explain the fascinating story of the letter, its historical context and take a closer look at some of the extraordinary women who signed it – especially those who came from Manchester. A short film will also be shown, including archive footage of the first winter of the war.&#34;","2015/01/national-libraries-day-all-growed-up.html"],["Birmingham","Tue, 20 Jan 2015 20:24:55 +0000","Birmingham – Bailey takes Birmingham Council to task over city development priorities - Information Daily. &#34;The report says that the Council’s failure to secure external sponsorship or raise sufficient money from land sales led to the council borrowing most of the £188m building and set up costs, with the library also costing some £10m a year to run. This latest city centre ‘vanity project’ has burdened the city with a financial noose that now sees community libraries being shut down and others at risk of closing. Some 100 staff are set to lose their jobs and opening hours at the Library of Birmingham are to set to be slashed from 73hrs a week to just 40. In other words, public resources have been diverted from providing critical services such as social services into another city centre vanity project. Sadly, the library is merely the latest example of Birmingham’s focus on city centre development and glamour projects undertaken at the expense of front line services and the needs of the wider population of Birmingham.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Brent","Tue, 20 Jan 2015 20:24:55 +0000","Brent – More details emerge on Brent Council’s investigation into Kensal Rise Library emails - Wembley Matters.  &#34; if Brent police didn’t seek the ISP subscriber details, did the CPS do so instead? If it didn’t, how could it conclude that the ‘required standard’ of evidence for a prosecution in the fraudulent email affair was unproven? A reply from Brent’s partnership borough chief inspector and the CPS is awaited. &#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Lincolnshire","Tue, 20 Jan 2015 20:24:55 +0000","Lincolnshire – Lincolnshire volunteers pull bid to run local library – Lincolnite. &#34;The Our Wainfleet Library and Community Hub (OWLCHub) group has backed out of its previous commitment to take over the service from the county council, after determining that it was &#34;unrealistic&#34;.&#34; … &#34;OWLCHub is following a number of previous community groups that have withdrawn their bids to run their local facilities. Nettleham Parish Council previously retracted their plans to run the village library and Alford Library Volunteers have also withdrawn their support. The Coningsby-Tattershall library does not currently have a bidder to run the service.&#34; see also Third community group (Wainfleet) withdraws library offer – Save Lincolnshire Libraries.","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["North East Lincolnshire","Tue, 20 Jan 2015 20:24:55 +0000","North East Lincolnshire – Opening of new Scartho library ‘imminent’ – Grimsby Telegraph. &#34;The re-opening of Scartho Library is &#34;imminent&#34;. That’s the pledge of Foresight, the Grimsby charity that is taking over the service from North East Lincolnshire Council. The library closed late last year and was due to reopen under Foresight’s Older People’s Project on Monday, January 5. However, there have been some legal issues which have delayed the signing of the lease, which has put back the opening date.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Brent","Sun, 18 Jan 2015 20:25:28 +0000","Brent – Brent library privatisation hits the front page and two men named James disagree about what it means - Wembley Matters. &#34;The Kilburn Times (above) puts the possible privatisation of Brent libraries management on its front page.  Management would be handed over to a charitable trust although details are not clear.&#34; … &#34;management structure, rather than privatisation and  ‘saves us a huge amount of money with rate changes’.  He recognised the sensitive nature of the changes and said the Council would do ‘only if we find it’s the right thing for us, for our libraries..and our communities.’  James Powney, whose blog has become a lot more interesting since he left the Council, wrote a article on the issue on Thursday morning&#34;","2015/01/of-reports-and-raspberries.html"],["Brent","Sun, 18 Jan 2015 20:25:28 +0000","Brent – Libraries in Brent could be privatised as part of £54m cuts – Brent and Kilburn Times. &#34;Under proposals by the town hall, Ealing Road, Harlesden, Kilburn, Kingsbury, Wembley and Willesden Green Library Centre will be handed over to an outside organisation. The council is hoping a charity will agree to manage the libraries as their status makes them eligible for an 80 per cent rebate on business rate, this would save the town hall £160,000. However other tenders from private operators would be considered.&#34;","2015/01/of-reports-and-raspberries.html"],["Hackney","Sun, 18 Jan 2015 20:25:28 +0000","Hackney – Young readers in Hackney win visit from top children’s author - Reading Agency press release. &#34;Reading for pleasure brings children many rewards, but young readers at Hackney Central Library got to giggle, shout, scream, ask questions and have loads of fun when they met bestselling author Steve Cole today.  It was their prize for winning a UK-wide competition celebrating the first-ever Chatterbooks Week (11-18 October 2014), via national charity The Reading Agency’s ever-growing network of Chatterbooks reading groups for children.The competition asked Chatterbooks groups from all around the country to send in photos of the events they held to celebrate Chatterbooks Week. The judges chose the photos sent in by the Chatterbooks groups throughout Hackney showing a whole range of activities including visits from writers; game and puzzle events and a poetry slam. Steve Cole, author of the hugely popular Magic Ink and Aliens Stink! books, as well as the Astrosaurs and Cows In Action series of books led his young audience on a &#8230;","2015/01/of-reports-and-raspberries.html"],["Nottinghamshire","Sun, 18 Jan 2015 20:25:28 +0000","Nottinghamshire – Bingham Library turns the page with £720,000 revamp - Nottingham Post. &#34;Bingham Library and Children’s Centre has been brought into the 21st century with a refurbishment from Nottinghamshire County Council. The building, in Eaton Place, originates from the 1970s and had become dated.&#34; … &#34;For the first time, there is a public toilet, whereas previously, visitors had to use facilities nearby or parents could take their children to use the staff toilet. The local children’s centre has also moved onto the site, from its previous home in Market Place, bringing a range of family services with it.&#34;","2015/01/of-reports-and-raspberries.html"],["Thurrock","Sun, 18 Jan 2015 20:25:28 +0000","Thurrock – Libraries in Thurrock could be closed to save money - Clacton Gazette. &#34;The mobile library service could also be axed in proposals included in a month long consultation looking at ways in which Thurrock Council can save £500,000 from its budget. &#34;","2015/01/of-reports-and-raspberries.html"],["Walsall","Sun, 18 Jan 2015 20:25:28 +0000","Walsall – Fight goes on to save two Walsall libraries – Express and Star. &#34;Thousands of people have signed petitions to ensure Streetly and Pheasey facilities are retained after being identified to shut under cost-cutting measures. A motion asking Walsall Council to keep them open and find savings from elsewhere was rejected by the Labour-run authority, while they go through the consultation process. There are eight libraries across the borough which are under threat of closure in the next years in a bid to save more than £500,000. Final plans will go before the council next month.&#34;","2015/01/of-reports-and-raspberries.html"],["Coventry","Sun, 11 Jan 2015 19:35:53 +0000","Coventry – ‘Save our library’ campaign launched in Earlsdon as anger grows over plans which could close 17 Coventry libraries - Coventry Telegraph. &#34;Coventry City Council leaders face resistance to plans which could see every library in the city closed down in a bid to save money. Labour Coun Damian Gannon, cabinet member for finance, has already warned the council is looking at shrinking all council service centres into just five hubs across the city – including the city’s 17 libraries. He argues the changes, part of a scheme known as City Centre First, are needed and could save up to £5million as the council prepares for an estimated £65million budget shortfall by 2017. But now a campaign, led by Conservative Earlsdon Coun Ken Taylor, has been launched in a bid to save Earlsdon Library from closure. He has been joined by Tory colleagues Coun Allan Andrews and Coun Michael Hammon to launch a pre-emptive petition to show the council that the local community wants to retain its library.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Slough","Thu, 08 Jan 2015 21:17:25 +0000","Slough – Library fines for youngsters in Slough scrapped – Slough Express. &#34;Overdue library fines for youngsters in Slough have been scrapped. Slough Libraries is permanently cancelling overdue charges for children aged up to 13 and is celebrating the change with a new competition. It will give youngsters the chance to redesign the libraries membership cards with the winning design set to feature on each new card dished out.&#34;","2015/01/je-suis-charlie-birmingham-library-song-and-the-magna-carta.html"],["Lincolnshire","Thu, 29 Jan 2015 21:16:03 +0000","Lincolnshire – Phil Dilks: &#34;Truth finally exposed on The Great Tory Library Betrayal&#34; – Save Lincolnshire Libraries. &#34;Column for Lincolnshire Echo From Phil Dilks, Labour’s Shadow Executive Member for Libraries at Lincolnshire County Council&#34; … &#34;It turns out the Tories had been plotting to close libraries since 2007. They’d given officers ‘a strong political steer’ and saw handing libraries to volunteers as their vision of Cameron’s ‘Big Society’. The report tells us that in 2012, the Conservative group of councillors were given a briefing on the vision. But concerns around ‘the need for careful timing’ led to a deliberate decision to delay public consultation until after the May 2013 elections.&#34; see also Correspondence from Campaigner Maurice Nauta To David Cameron PM - Save Lincolnshire Libraries and Library Scrutiny Meeting – Record of Votes & Opinions - Save Lincolnshire Libraries.","2015/01/news-for-28th-29th-january.html"],["Thurrock","Thu, 29 Jan 2015 21:16:03 +0000","Thurrock – Evie, 6, tells Prime Minister: ‘Please help save our libraries’ – Thurrock Gazette. &#34;Evie, who reads a book every night and has won two reading medals, can’t afford to buy books – and neither can her family. She says her library must stay. The family currently go to Blackshots Library every night on the way home from school. The schoolgirl says she made her local librarian cry when she read out her letter. Evie said: &#34;I would just be really, really sad if they closed it down.&#34; Evie’s mother, Elizabeth Redgrove, who is a teaching assistant at Evie’s school, said: &#34;It would be really upsetting for us if the library closed because she wouldn’t be able to have all the books that she needs.&#34;","2015/01/news-for-28th-29th-january.html"],["Hull","Tue, 27 Jan 2015 23:05:26 +0000","Hull – ‘City of culture’ cuts library hours – Yorkshire Post. &#34;Cash-strapped Labour run Hull Council has agreed to reduce opening hours, including those of popular Central Library, which will close on Wednesday mornings and Friday afternoons from March. Holderness Road library, which had faced closure, will now close two days a week.&#34;","2015/01/a-public-library-news-miscellany.html"],["Peterborough","Sun, 25 Jan 2015 22:50:03 +0000","Peterborough – Vivacity warning £1.45m cuts threaten Peterborough’s culture and leisure services – Peterborough Today. &#34;A cultural desert is being forecasted for Peterborough due to a near £1.5 million budget cut to arts and leisure funding. The chief executive of Vivacity, which runs the the city’s library, culture and sports services, is warning that cuts will be &#34;signficant and far reaching.&#34;&#34; … &#34;The budget proposals are up for public consultation from tomorrow until March 2 and will be voted on by full council two days later. Vivacity, which has made more than £5 million of savings in the past five years, is warning its funding cut will threaten the ‘heart of the city.’&#34; … &#34;The budget proposals are up for public consultation from tomorrow until March 2 and will be voted on by full council two days later. Vivacity, which has made more than £5 million of savings in the past five years, is warning its funding cut will threaten the ‘heart of the city.’&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Birmingham","Thu, 22 Jan 2015 21:22:40 +0000","Birmingham – #Rally4LoB – Public rally for the Libraries of Birmingham – Birmingham Libraries Campaigns. Saturday 7th February 12 to 2pm.  A major demonstration is being planned.","2015/01/national-libraries-day-all-growed-up.html"],["North Yorkshire","Thu, 22 Jan 2015 21:22:40 +0000","North Yorkshire – Bedale campaigners pledge to fight library threat – Northern Echo. &#34;Campaigner Susan Perkins said after the Bedale meeting they had been told it would probably be &#34;cost neutral&#34; if volunteers can be found to run the library in Bedale, so money would not have to be found to pay for rent and other bills. She said: &#34;We are hoping the county council will reconsider the whole thing and we’re calling on the people of Bedale to continue using the library to show how much we value the work the staff do.&#34;","2015/01/national-libraries-day-all-growed-up.html"],["Sheffield","Thu, 22 Jan 2015 21:22:40 +0000","Sheffield – Sheffield library group still fighting for inquiry – Star. &#34;Culture Secretary Ed Vaizey was due to make a final decision on whether to hold an inquiry into the issue in December but that was put back to February 27 after the Broomhill Library Action Group, which originally complained to him, made further submissions. The action group has claimed there are ‘anomalies’ in the council’s needs assessment on which the current library branch rankings were based and an inquiry is needed into constitutes a comprehensive and efficient library service in Sheffield, as required by law.&#34;.  Group may take legal action against the minister if he does not intervene.","2015/01/national-libraries-day-all-growed-up.html"],["Birmingham","Tue, 20 Jan 2015 20:24:55 +0000","Birmingham – Watt and Boulton would ‘turn in their graves’ at Library of Birmingham cuts - Birmingham Post. &#34;Lunar Society chairman Waheed Saleem said the library was key to developing the city’s skills and education and presented a major blow to the city’s heritage. He was speaking after the former head of Birmingham Libraries and Archives John Dolan OBE said the library was heading for a &#34;spiral of decline&#34;. The Lunar Society was founded by the likes of Boulton, Watt, Joseph Priestley and Erasmus Darwin in the 18th century as a collection of prominent thinkers and Mr Saleem said the prospect of less access to education would have disturbed them.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Hull","Tue, 20 Jan 2015 20:24:55 +0000","Hull – Library opening hours in Hull set to be cut in budget squeeze - Hull Daily Mail. &#34;Half-day openings will be extended at many venues and an as-yet-unspecified number of staff redundancies are likely to be made as a result. Hull City Council says reducing opening hours is the only way to avoid more library closures in the face of continued Government funding cuts.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Barnet","Sun, 18 Jan 2015 20:25:28 +0000","Barnet – ‘They are so precious’ – hundreds come out in support of Barnet’s libraries – Times series. &#34;The closure of libraries was described as a &#34;situation too heartbreaking for words&#34; during a packed meeting. Hundreds filled Hartley Hall, Mill Hill, to discuss a consultation into proposals to close some of Barnet Borough Council’s libraries as part of measures to save £2.85m. The panel was made up of Deborah Moggach, author of the Best Exotic Marigold Hotel, MP Matthew Offord, GLA member for Barnet Andrew Dismore and Barnet blogger Theresa Musgrove, also known as Mrs Angry.&#34;","2015/01/of-reports-and-raspberries.html"],["Lincolnshire","Sun, 18 Jan 2015 20:25:28 +0000","Lincolnshire – Former Cosmopolitan magazine editor voices support for Lincolnshire libraries – Lincolnshire Echo. &#34;Sam Baker, who is also a novelist, posted a link to the campaign blog, commenting ‘if you care about the plight of public libraries, wherever in the UK you live, you should read this&#34;","2015/01/of-reports-and-raspberries.html"],["Birmingham","Sun, 11 Jan 2015 19:35:53 +0000","Birmingham – Perilous times for the Library of Birmingham and all public libraries – Shakespeare Institute Library. &#34; if I lived in a rural area or in one of the poorer parts of our large cities it turns out that I might not have that luxury. Shocking that access to public libraries is now becoming a luxury rather than a civic right. I firmly believe in the ideology behind public libraries as places where education is free and accessible to all.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Brighton and Hove","Sun, 11 Jan 2015 19:35:53 +0000","Brighton and Hove – Museum to charge £5 to non-resident visitors – Brighton and Hove Independent. &#34;Free use of library computers will also be limited to one hour, with a £1 an hour charge thereafter. A proposed charge for the popular Baby Boogie sessions at the city’s libraries has been scrapped, and replaced with a call for donations at a suggested rate of £1 per child. Child’s craft activities, however, will be charged at a minimum of £1 per participant, and book groups will have to stump up £30 a year.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Cardiff","Thu, 08 Jan 2015 21:17:25 +0000","Cardiff – City’s library cuts may save £1.4m today… but will end up costing a great deal more tomorrow – Wales Online. &#34;Best of all, is the instantly relaxing atmosphere. No one shouts, no phones ring and you won’t have to listen while someone jabbers into their mobile phone – just let them try. Librarians, notorious for their stern demeanour, are obeyed as few other public servants are. Just watch the next time a toddler goes AWOL by the shelves. Super Nanny could learn a thing or two from your local librarian’s speedy silencing of even the most raucous two year old. And then there’s the people watching.&#34;","2015/01/je-suis-charlie-birmingham-library-song-and-the-magna-carta.html"],["Worcestershire","Thu, 08 Jan 2015 21:17:25 +0000","Worcestershire – Council changes mobile library service - Kidderminster Shuttle. &#34;Worcestershire County Council confirmed that changes to the service, as well as the Library Service at Home (LSAH), will see the mobile libraries based in Stourport, Malvern and Evesham scrapped and replaced with one vehicle to cover the entire county. &#34; … &#34;The new mobile library vehicle will be fitted with wi-fi and has a meeting room space. It will service 20 routes with 267 stops taking in a total of 175 villages. &#34; see also Big mobile library cuts confirmed in Worcestershire as 38% of stops are deleted - Worcester News.","2015/01/je-suis-charlie-birmingham-library-song-and-the-magna-carta.html"],["Northamptonshire","Thu, 29 Jan 2015 21:16:03 +0000","Northamptonshire – New cancer service in Northamptonshire libraries will help teens be themselves - Northampton Chronicle. &#34;The C Word, run by Macmillan Cancer Support, will offer activities from 36 libraries and aims to let 13 to 24-year-olds with a friend, parent, brother or sister with the disease -or who have it themself – to be themselves. They will be offered a range of free activities from film-making to occupational therapy, with people on hand to answer any question they may have about cancer. Part of the reason for the need is that NHS cancer care is firmly split into adult and child care, with nothing in between.&#34;","2015/01/news-for-28th-29th-january.html"],["North Yorkshire","Thu, 29 Jan 2015 21:16:03 +0000","North Yorkshire – South Craven councillors rally around Cross Hills Library – Craven Herald. &#34;South Craven county councillor Philip Barrett (Ind) said: &#34;Crippling budget cuts have placed the county council in an extremely difficult position. However, having examined the consultation proposals in detail I don’t believe they would provide the best library service possible from the available £4.2 million reduced budget. &#34;Alternative proposals need to be considered which could also reduce the unrealistic reliance on volunteer-run community libraries throughout Craven.&#34;&#34;","2015/01/news-for-28th-29th-january.html"],["Monmouthshire","Sun, 25 Jan 2015 22:50:03 +0000","Monmouthshire – Group fights to stop library closure – South Wales Argus. &#34;Around 30 people, including members of Friends of Caldicot Library, met Monmouthshire council officers at the library on Woodstock Way to discuss the future of the library. As part of the budget proposals which will go before full council tomorrow, libraries and one stop shop services will merge into one building … The community hub proposal, if approved, will see a reduction in full-time staff from 43 to 30 and will save the council £300,000 in a full year&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Staffordshire","Sun, 25 Jan 2015 22:50:03 +0000","Staffordshire – Book a date for library takeover – Sentinel. The &#34;first volunteers to take over the running of libraries in Staffordshire are set to be handed the keys to the buildings this autumn. If the proposals are approved by Staffordshire County Council’s cabinet, adverts are likely to be published in June.&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Barnsley","Thu, 22 Jan 2015 21:22:40 +0000","Barnsley – New library is set to be the beacon of Barnsley – Star. &#34;Designed to be the beacon of the town, the new building is set to be a landmark in the centre’s £50 million redevelopment. Proposed plans for the new town centre were announced last August and the central library design is the next step in the development timeline. It is expected to open in early 2017. Barnsley Coun Roy Miller, cabinet member for place, said: &#34;The central library is just one part of the overall town centre development scheme and its high quality design sets the standard for the new town centre. &#34;","2015/01/national-libraries-day-all-growed-up.html"],["Birmingham","Tue, 20 Jan 2015 20:24:55 +0000","Birmingham – Government and bankers to blame for Birmingham Library cuts, says MP - Birmingham Mail. &#34;MP Roger Godsiff (Lab, Hall Green) attacked cuts which will lead to the loss of more than half of the library’s staff and many of its services, including archive and research facilities. But he said the blame lay with Government funding cuts, which had forced Birmingham City Council to make massive savings. In a House of Commons motion, the MP said: &#34;Birmingham City Council’s funding from central Government has been cut heavily over the course of the current Government, and poorer cities such as Birmingham have received a disproportionately heavy share of spending cuts.&#34;&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Cardiff","Tue, 20 Jan 2015 20:24:55 +0000","Cardiff – ‘It is the heart of our village&#39;: Residents step up fight to save Rhiwbina library - Cardiff Online. &#34;A community fighting for the future of its much-loved library will vote on the issue after demanding a poll. Residents in parts of north Cardiff are being invited to the polling stations on February 5 to have their say on the future of Rhiwbina Library, which is threatened by council cuts.&#34; … &#34;Earlier this month, more than 1,000 residents attended a public meeting about the library.&#34; … &#34;Council officials stopped counting after recording the 363rd elector, as only 150 are needed to call for a community poll.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Staffordshire","Tue, 20 Jan 2015 20:24:55 +0000","Staffordshire – Staffordshire County Council backtracks over local libraries plan – Stoke Sentinel. &#34;the council is now set to retain 18 of the 24 sites, where there is not sufficient community interest in taking them on. Paid managers will oversee ‘clusters’ of around three libraries where teams of volunteers will be responsibility for the day-to-day running of the facilities.&#34; … &#34;Paid managers will oversee ‘clusters’ of around three libraries where teams of volunteers will be responsibility for the day-to-day running of the facilities. And the council will remain responsible for paying the buildings’ running costs.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Trafford","Tue, 20 Jan 2015 20:24:55 +0000","Trafford – Trafford council propose to shut three libraries in bid to save £700k - Manchester Evening News. &#34;Trafford council needs to cut a third of its libraries budget as part of £24m savings this year. Bowfell library in Urmston, Davyhulme and Lostock library in Stetford could all close. Town hall chiefs say those three sites are not well used and are close to Urmston and Stretford libraries. They say the majority of Bowfell, Davyhulme and Lostock customers use at least one other library.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["North Yorkshire","Sun, 18 Jan 2015 20:25:28 +0000","North Yorkshire – Fight the stripping of the library counters in North Yorkshire - Library Campaign. &#34;There is an ongoing Library Consultation in North Yorkshire, finishing on the 8th February 2015. John Dean, the contact person for ‘Save North Yorkshire Libraries’, asks any interested parties to act to defend their library service.&#34;","2015/01/of-reports-and-raspberries.html"],["Southampton","Sun, 18 Jan 2015 20:25:28 +0000","Southampton – ‘We’ve no idea where we’ll go if library shuts’ – Daily Echo. &#34;Southampton City Council has put forward plans for community groups to take over at the Cobbett Road, Millbrook, Weston, Thornhill and Burgess Road libraries. So far, the petition has attracted more than 300 signatures. It comes after campaigners at Cobbett Road Library in Bitterne Park launched a petition signed by more than 1,600 people, including Hampshire wildlife expert Chris Packham, calling on the council to re-think its plans.&#34;","2015/01/of-reports-and-raspberries.html"],["Walsall","Sun, 18 Jan 2015 20:25:28 +0000","Walsall – Bid to remove Walsall libraries from planned closure list fails to gain full council support - Walsall Advertiser. &#34;A bid to save two closure-threatened libraries in Walsall from the axe failed to win majority backing at this week’s heated full council debate.&#34;","2015/01/of-reports-and-raspberries.html"],["Falkirk","Sun, 11 Jan 2015 19:35:53 +0000","Falkirk – Falkirk looks to scrap school library service – BookSeller. &#34;The council said it was looking to make savings of £325,000, or the salaries of 10 full-time employees. &#34;By reorganizing our current provision and resources we could provide a decentralised service within each of our secondary schools which would also serve all cluster schools,&#34; it said. But Yvonne Manning, manager of the Falkirk SLS, said the proposed cuts would wipe out the whole service. &#34;I do understand that cuts need to be made, I expected a reduction of some kid, but it was a shock to find that they wanted to stop the service,&#34; she told The Bookseller.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Southampton","Sun, 11 Jan 2015 19:35:53 +0000","Southampton – 1.5K sign to save Cobbett Road Library - Bitterne Park Info. &#34;As previously reported, Cobbett Road is one of five city libraries earmarked by the council for closure or ‘community-led initiatives’. But support group Friends of Cobbett Road Library (FOCRL) have argued that the choice doesn’t have to be between ‘volunteer run’ or ‘closure’, and that running a library on a voluntary basis would be a &#34;quantum leap&#34; from where they are now.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Kent","Thu, 08 Jan 2015 21:17:25 +0000","Kent – Consultation on charitable trust for Kent libraries is launched – Reporter. &#34;An extensive 12-week public consultation on KCC’s plans to modernise its libraries, registration and archives service by the creation of a charitable trust begins on Monday (January 12). The council is facing financial challenges which have led to a review of all its services. The trust concept is KCC’s preferred option for the libraries, to give the service more freedom and flexibility to grow and develop, generate additional income and seek additional grant funding not open to KCC.&#34; … &#34;Under the proposals KCC would remain accountable for the libraries, registration and archives service and would contract with the charitable trust to continue to provide the existing services to all Kent residents&#34;","2015/01/je-suis-charlie-birmingham-library-song-and-the-magna-carta.html"],["Bristol","Tue, 27 Jan 2015 23:05:26 +0000","Bristol – Day-to-day running of St Paul’s community centre transferred from Bristol City Council to ethical investment company – Bristol Post. &#34;Organisations like the Ethical Property Company can be more flexible and agile, and in a better position to service the needs of the local community. &#34;I have a lot of faith that Ethical Property will bring greater stability to the centre and that local people will be able to benefit for years to come.&#34;  The centre is currently managed by the council’s library service. Kate Murray, head of libraries at the council, said: There have been a number of conversations concerning the future of the centre, and the council acknowledged that community management may serve the citizens of St Paul’s more fully than council management.  We are very pleased to be working with Ethical Property around the future of the centre and we are keen for library services to remain at the heart of it.&#34;","2015/01/a-public-library-news-miscellany.html"],["Cumbria","Tue, 27 Jan 2015 23:05:26 +0000","Cumbria – New Barrow library opens – North West Evening Mail. &#34;A bigger and better community library was officially opened to the public with the cutting of a ceremonial ribbon yesterday. It will be based in Ormsgill Nursery and Primary School, in Millbank, where all of the pupils have become library members. The move was the idea of County Councillor Bill McEwan who contributed £3,228 from his local revenue scheme funding towards the library’s refurbishment.&#34; … &#34;&#34;The Library Link wasn’t well used at the children’s centre, so we felt it would benefit from a move to another location. The new library has its own dedicated room in a large space with a wider choice of books and increased opening hours.&#34;&#34;","2015/01/a-public-library-news-miscellany.html"],["Lancashire","Tue, 27 Jan 2015 23:05:26 +0000","Lancashire – Mercury Prize winners ‘Young Fathers’ to play Skelmersdale Library - Southport Visiter. &#34;One of the UK’s hottest bands have confirmed they will play a gig at Skelmersdale library. Scottish hip hop group Young Fathers, who won the 2014 Barclaycard Mercury Prize, will play the library on March 13 as their opening gig on a 19 date tour of the UK. The band are playing the unusual venue as part of a campaign called Get It Loud In Libraries which aims to get young people visiting their local library.&#34;","2015/01/a-public-library-news-miscellany.html"],["Lincolnshire","Tue, 27 Jan 2015 23:05:26 +0000","Lincolnshire – Lincolnshire libraries saga: Martin Hill blames a lack of scrutiny - Lincolnshire Echo. &#34;The leader of Lincolnshire County Council Martin Hill says the chance of a libraries outsourcing deal was missed due to a lack of scrutiny. Councillor Hill was speaking at this morning’s audit committee meeting which considered a damning report into his authority’s handling of the future of libraries.&#34; … &#34;Labour has now rounded on the council following the publication of an internal audit’s findings.  It claims the ruling Conservatives postponed consultation on its libraries decision until after the May 2013 election for political gain.&#34;","2015/01/a-public-library-news-miscellany.html"],["Shropshire","Sun, 25 Jan 2015 22:50:03 +0000","Shropshire – Church Stretton residents say &#34;keep our library where it is&#34; – Shropshire Live. &#34;The rally was to let Shropshire councillors and BBC camera crew, which included reporter and presenter Satnam Rada, know that plans to move the library to an out-of-town site would not be accepted. The Church Stretton Library support group has repeatedly made the point that the relocation will disadvantage our older library users and reduce use as a result of poorer quality access and reduced facilities. In addition the group says it is an attack on the strong links between many community facilities and local shops and cafes which contribute so much to the distinctive character of Church Stretton.&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Barnet","Thu, 22 Jan 2015 21:22:40 +0000","Barnet – Barnet Council Libraries: we put the ’30 minute public transport rule’ to the test – Times series. &#34;The second option put forward, to save £73.5m, includes closing Mill Hill Library but creating a network of eight libraries across the borough. Councillors say that if this option was passed, at least 95 per cent of Barnet’s population would be able to get to a library within 30 minutes by public transport. We put this to the test by travelling from Mill Hill Library to Hendon Library, in Church End…&#34;.  Test does indeed show 30 minutes but stresses uncomfortableness of journey.","2015/01/national-libraries-day-all-growed-up.html"],["Kent","Thu, 22 Jan 2015 21:22:40 +0000","Kent – Should Kent County Council transfer responsibility for its libraries to a charitable trust? – News Shopper. &#34;KCC is hoping the trust model will make its libraries more sustainable as the council needs to cut £3.27million from its budget over the next three years. In July last year, KCC confessed to a &#34;mistake&#34; when a job advert went out to oversee the transformation of the LRA services before publicly consulting on the change or having councillors agree to it.&#34;","2015/01/national-libraries-day-all-growed-up.html"],["Birmingham","Sun, 18 Jan 2015 20:25:28 +0000","Birmingham – Library of Birmingham ‘heading for spiral of decline’, former boss claims - Birmingham Post. &#34;The former head of Birmingham Libraries and Archives has called cuts to the city’s library &#34;distressing&#34; and warned they threaten the city’s heritage. John Dolan OBE contacted the Post to express his fears for the future of the Library of Birmingham with savage council cuts meaning 100 people face redundancy . The proposals would also see the library’s opening hours slashed from 73 to 40 , which Mr Dolan described as &#34;heading for a spiral of decline&#34;.&#34;","2015/01/of-reports-and-raspberries.html"],["Coventry","Sun, 18 Jan 2015 20:25:28 +0000","Coventry – Coventry’s library service to be ‘developed and restructured’ under £15m cuts plan - Coventry Telegraph. &#34;Three petitions have already sprung up calling on the council not to close libraries in Finham, Earlsdon and Allesley Park. Coun David Kershaw, cabinet member for education, clarified the council’s position on the future of the city’s 17 libraries during a full council meeting in the week. He stopped short of ruling out any closures, but Coun Kershaw did talk up the value of libraries and spoke of a desire to &#34;develop and restructure&#34; the city’s existing library service. He said: &#34;Libraries are a golden thread throughout our lives.&#34;","2015/01/of-reports-and-raspberries.html"],["Leicestershire","Sun, 18 Jan 2015 20:25:28 +0000","Leicestershire – Visits by mobile libraries facing cuts - Loughborough Echo. &#34;Mobile library services could be visiting local communities just once a month under new Leicestershire County Council plans. At the moment, the council has six mobile library vans, which serve 3,800 people per year.&#34; see also Mobile library service changes proposed – Hinckley Times.","2015/01/of-reports-and-raspberries.html"],["Lincolnshire","Sun, 18 Jan 2015 20:25:28 +0000","Lincolnshire – Astonishing Misuse of Public Money and Political Power - Save Lincolnshire Libraries. &#34;Lincolnshire County Council has published plans to implement its unlawful decision of December 2013 to close thirty libraries unless volunteers take them over. This not only ignores the High Court judgement of July 2014 that quashed this decision but also the Localism Act which gives charities and social enterprises opportunities to run local services.&#34; see also Labour – the fight to save Lincolnshire Libraries goes on despite out of touch Tory arrogance… – Save Lincolnshire Libraries and Cllr Stephen Palmer’s open letter re Lincolnshire Library Crisis – Save Lincolnshire Libraries. Letter to parliamentary candidates &#34;I know you are not from around here in Lincolnshire but as a parliamentary candidate for Louth and Horncastle I hope you are aware of the long running battle in Lincolnshire County Council over the plans that will make the Library service in Lincolnshire a post code lottery by altering the statutory element o&#8230;","2015/01/of-reports-and-raspberries.html"],["Newport","Sun, 18 Jan 2015 20:25:28 +0000","Newport – Malpas residents hope to save library – South Wales Argus. &#34;Over 100 residents attended a public meeting tonight to hear of an alternative proposal that could see Malpas library saved from closure. &#34; … &#34;Newport City Council’s strategic director for place, Sheila Davies explained in the alternative proposal a librarian would be present for 20 hours a week and space within the library would be reorganised to host other activities that would generate income for the library building. &#34;","2015/01/of-reports-and-raspberries.html"],["Nottinghamshire","Sun, 11 Jan 2015 19:35:53 +0000","Nottinghamshire – Fingers crossed for new Retford tourist information centre - Retford Times. &#34;Similar volunteer-led, independent facilities such as libraries have flourished in other towns and cities around the country and Retford also has the knowledge base, enthusiasm and community spirit to do the same.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Renfrewshire","Thu, 29 Jan 2015 21:16:03 +0000","Renfrewshire – Renfrewshire libraries, museums and town halls move to new trust - Evening Times. &#34;James Harte, convener of the council’s sports, leisure and culture policy board, said transferring the libraries, museums and town halls to Renfrewshire Leisure would retain them in public ownership but they would be run by a not-for-profit organisation with charitable status. He added: &#34;There are strong economic reasons for creating an expanded trust. At a time when the council is facing a funding shortfall of between £20m-£30m over the next three years, it makes sense to take advantage of the £600,000 savings from business rates which trust status would deliver every year.&#34;","2015/01/news-for-28th-29th-january.html"],["Birmingham","Sun, 25 Jan 2015 22:50:03 +0000","Birmingham – Library of Birmingham rally to call for halt in cuts - Birmingham Post. &#34;Local crime writer Judith Cutler and historian Professor Carl Chinn will be guest speakers while Birmingham-born poet Benjamin Zephaniah has sent a message of support which will be read out at the event on February 7, also National Library Day. In December, Birmingham City Council so it was proposing to make around 100 redundancies and reduce opening hours from 73 to 40 as a result of budget cuts at the council. The rally has been organised by the Friends of The Library of Birmingham and will start at midday in Centenary Square.&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["North Yorkshire","Thu, 22 Jan 2015 21:22:40 +0000","North Yorkshire – Join our fight - Gazette Herald. &#34;The large numbers of people signing a petition to keep all North Yorkshire County Council (NYCC) libraries staffed have been encouraged by the efforts of inspired helpers from Whitby, Scarborough, Easingwold, Thirsk, Ripon and beyond, and campaigners in Bentham and Skipton. &#34; List included of future signings.","2015/01/national-libraries-day-all-growed-up.html"],["Thurrock","Thu, 22 Jan 2015 21:22:40 +0000","Thurrock – Campaign to keep Thurrock libraries open begins - Thurrock Gazette. &#34;Thurrock Council has begun a month-long consultation with the public into how the library service can save £500,000 … Among Facebook users writing on the Thurrock Gazette website, Annette Columbine wrote: &#34;Really! It’s disgusting. Libraries are an essential part of everybody’s life. &#34;Taking my girls there when they were young is what has influenced their love of reading now that they’re adults.&#34;","2015/01/national-libraries-day-all-growed-up.html"],["Barnet","Tue, 20 Jan 2015 20:24:55 +0000","Barnet – Barnet Council’s libraries consultation is ‘unfit for purpose’, according to report - Times series. &#34;An investigation into Barnet Borough Council’s library consultation has revealed people find it &#34;impossible&#34; to respond in any meaningful way. The authority is consulting on plans to cut library services – and options in its consultation include closing them altogether, reducing their size or swapping experienced libraries with volunteers. But a report carried out by independent company The Research Practice labeled the wording of the survey &#34;confusing&#34;. The report said: &#34;The longer people spend on the consultation, the more confused they become and the more they perceive the council’s plans to be flawed.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Barnet","Tue, 20 Jan 2015 20:24:55 +0000","Barnet – Barnet Libraries Consultation: A Sham A Joint Letter from the Barnet Bloggers to the Leader of Barnet Council - Barnet Eye. &#34;Barnet Bloggers are appalled by reported plans to outsource libraries and make them available to commercial exploitation to companies such as Starbucks and Waterstones. The real purpose of proposals to cut and shut libraries in Barnet is now clear.&#34; see also The Libraries Consultation: a joint letter by the Barnet bloggers – Broken Barnet.","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Kirklees","Tue, 20 Jan 2015 20:24:55 +0000","Kirklees – Fifty volunteer to help save Holmfirth Library - Huddersfield Daily Examiner. &#34;Fifty residents have signed up to help as volunteers as the services face shutdown in the face of significant cuts to Kirklees’ central government funding. Over 100 people attended a public meeting to discuss the future of the library in Huddersfield Road. +Kirklees Chief Librarian Carol Stump told the meeting that her team were determined to save library services in some form. Friends of library groups have already been set up in Meltham, Honley and Golcar. In places where libraries have been volunteer-led for some time, and they are working well.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Vale of Glamorgan","Tue, 20 Jan 2015 20:24:55 +0000","Vale of Glamorgan – Lawyer warns council of challenges ahead – Penarth Times. &#34;A public interest lawyer has advised that the Vale Council should expect more legal challenges ahead of a conference for library campaigners fighting spending cutbacks. Michael Imperato of Watkins & Gunn Solicitors said the authority will experience more challenges, this year, ahead of a major conference in Cardiff for campaign groups. Mr Imperato, who successfully advised the Rhydyfelin Library Support Group in their case against Rhondda Cynon Taf Council, will be speaking at the Public Law conference at the Hilton Hotel on January, 23 which is expected to attract a number of local library campaign groups fighting local closures.&#34;\n<blockquoteclass=&#34;twitter-tweet&#34; lang=&#34;en&#34;>","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Barnet","Sun, 18 Jan 2015 20:25:28 +0000","Barnet – ‘Libraries are an amazing resource’ – campaigners petition to save libraries in Barnet – This is Local London. &#34;The council is currently consulting on whether to close libraries, make them smaller or run them solely with volunteers. Campaign groups have formed across the borough, with people holding public meetings to devise plans to save them. Ariella Lister, who brings her three-year-old grandson to the library, has been canvassing Mill Hill speaking to people about the plans.&#34; … &#34;Campaigners say groups including chess clubs, toddler rhyme time and meet ups for the elderly, which run from the borough’s libraries, are often overcrowded.&#34;","2015/01/of-reports-and-raspberries.html"],["Harrow","Sun, 18 Jan 2015 20:25:28 +0000","Harrow – Petitions against library closures were submitted to cabinet tonight – Harrow Times. &#34;The first petition submitted to the council, made up of more than 5,000 signatures – along with 24 signatures from community groups, councillors and religious leaders in an open letter – was against the proposed closure of the Bob Lawrence library. Presenting the petition, one campaigner said: &#34;It is vital to the community that it [the library] is close by and easily accessible. It is extremely important we keep community centres like libraries, and keep their value.&#34; A six-year-old boy from Stag Lane School also submitted 140 letters from fellow pupils in objection to the closure of the library in Mollison Way, Edgware. North Harrow library campaigners also presented their petition of 2,797 signatures, while a petition to save Rayners Lane library was also submitted to the Cabinet, with 734 schoolchildren signing and a further 1,555 adult signatories.&#34;","2015/01/of-reports-and-raspberries.html"],["Hull","Sun, 18 Jan 2015 20:25:28 +0000","Hull – Hull, City of Culture 2017, to reduce library hours – Yorkshire Post. &#34;If approved, from March the opening hours of libraries across the city will be curtailed including the Central Library which will close on Wednesday mornings and Friday afternoons. Other libraries in the city will be cut to opening just four, or in some cases three, days a week. Writing in a report to be considered by councillors next week, Coun Terence Geraghty, the portfolio holder responsible for libraries, supports the proposals as a better way of saving money to wholesale library closures.&#34;","2015/01/of-reports-and-raspberries.html"],["Lincolnshire","Sun, 18 Jan 2015 20:25:28 +0000","Lincolnshire – Petition debates wiped out at Lincolnshire’s Full Council – Save Lincolnshire Libraries. &#34;The M.P. responsible for libraries (Ed Vaizey) released a far reaching Review of libraries just before Christmas, having sat on it for two months. Our County Council has gone one better, leaving it until the last Full Council of the year (19th December) to push through a vote removing the &#34;option for a petition to trigger a debate at Council&#34;. You may remember that 23,000 Lincolnshire tax payers and voters signed a petition against the County Council’s proposals to close libraries unless volunteers came forward, and there was a debate as a result of that and two other similar petitions.&#34; see also Lincolnshire – Letter: Urge Lincolnshire residents not to let county council kill democratic debate on libraries - Market Rasen Mail and Lincolnshire libraries: council leader ‘must give answers’ – Lincolnshire Echo and New chapter beckons in the battle for Lincolnshire libraries – Lincolnshire Echo.","2015/01/of-reports-and-raspberries.html"],["Cardiff","Tue, 13 Jan 2015 18:01:53 +0000","Cardiff – Community rallies to save threatened library as Cardiff budget consultation comes to an end – Wales Online. &#34;A petition of more than 2,000 signatures appealing to save a threatened city library has been handed to Cardiff council as the local authority’s budget consultation comes to an end.&#34;","2015/01/welcoming-the-homeless-in.html"],["Lincolnshire","Tue, 13 Jan 2015 18:01:53 +0000","Lincolnshire – Campaigners vow to keep fighting for Lincolnshire libraries – Lincolnite. &#34;Julie Harrison, spokesperson for SLL, said: &#34;Save Lincolnshire Libraries’ aim remains the same as it was when it started in June 2013 – to keep libraries open across Lincolnshire run by professional and paid staff, supported by volunteers. &#34;SLL will continue to campaign and work to ensure that this objective is achieved&#34;","2015/01/welcoming-the-homeless-in.html"],["Lincolnshire","Thu, 29 Jan 2015 21:16:03 +0000","Lincolnshire – Fiasco has so far cost the public £250k – Spalding Today. &#34;a second judicial review could be in the offing with the county council’s ruling executive expected to rubber stamp controversial changes to Lincolnshire’s library service. Deeping St James Labour county councillor Phil Dilks, who has fought hard to keep Market Deeping Library in council control, said he &#34;hopes against hope&#34; that council taxpayers aren’t left picking up the bill for further legal action. &#34;So far it’s cost over a quarter of a million pounds, this exercise,&#34; he said. &#34;It’s time the council listened.&#34;&#34;","2015/01/news-for-28th-29th-january.html"],["Walsall","Thu, 29 Jan 2015 21:16:03 +0000","Walsall – Walsall Council chief: We’ve listened to the public – Express and Star. &#34;The council is still ploughing ahead with plans to close eight libraries – despite thousands of users signing petitions against the move. The closure date of five libraries – Pheasey, Beechdale, Walsall Wood, Walsall South and Streetly – has been deferred by three months, Councillor Coughlan said. They will now close on July 1. Three others in Rushall, New Invention and Blakenall will close after that. Councillor Coughlan added: &#34;Most people do not want the council to close libraries.&#34;","2015/01/news-for-28th-29th-january.html"],["Cardiff","Tue, 27 Jan 2015 23:05:26 +0000","Cardiff – Cardiff libraries: a Council dispossesses its people – Gwallter. &#34;On Saturday 7 February, National Libraries Day, hundreds of people plan to converge on the Central Library in Cardiff for a ‘read in’, to protest against the Council’s intention to cease funding seven of the city’s libraries and further degrade the Central Library.&#34;","2015/01/a-public-library-news-miscellany.html"],["Milton Keynes","Tue, 27 Jan 2015 23:05:26 +0000","Milton Keynes – Library opens to customers today – take a look around! – MK Web. &#34;The new Kingston Library officially opened its doors today (Tuesday January 27). The building boasts modern facilities such as a self-service checking out system, unlimited Wi-Fi and sockets for customers to use their own laptops and tablets in the library space. Many are the first of their kind in Milton Keynes. The library will have a community focus, hosting a children’s hour, story time, play activities, screenings and music. Meeting space will also be available for community groups to hire, and the library’s top floor is home to Explore Learning, who are renting the space&#34;","2015/01/a-public-library-news-miscellany.html"],["Cardiff","Tue, 20 Jan 2015 20:24:55 +0000","Cardiff – Save Cardiff Library Service - 38 Degrees. &#34;Rather than closing libraries or running them down by forcing them to share premises with other inappropriate services, the council should find a way of living up to its legal obligation to provide a comprehensive and efficient service throughout the city.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Worcestershire","Sun, 18 Jan 2015 20:25:28 +0000","Worcestershire – Library axe will cut off villagers, says councillor - Droitwich Standard. &#34;Controversial changes to Worcestershire’s mobile library which come into force on February 1 will see the service cut to a number of villages across Bromsgrove and Droitwich. The alterations have been made by the county council in a bid to save £100,000 a year towards the £20million to £25million it needs to make annually over the next four years.&#34;","2015/01/of-reports-and-raspberries.html"],["Kirklees","Tue, 13 Jan 2015 18:01:53 +0000","Kirklees – Campaign meeting for library – Telegraph and Argus. &#34;The Friends of Heckmondwike Library has started a petition against the move, and is holding the public meeting in the library at 6pm today. Then next Tuesday, a working party will meet at the library at 11am to discuss further plans of action.&#34;","2015/01/welcoming-the-homeless-in.html"],["Leicestershire","Sun, 11 Jan 2015 19:35:53 +0000","Leicestershire – Deadline to register library interest on the horizon - Loughborough Echo. &#34;Communities are being encouraged to register their interest in running libraries in Leicestershire before Friday, January 16. The county council wants to hear from groups who want to run any of the 36 community libraries, with support from the authority. Anyone interested should visit www.leics.gov.uk/haveyoursay/futurelibraries  for an information pack.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["North Yorkshire","Thu, 29 Jan 2015 21:16:03 +0000","North Yorkshire – Appeal for volunteers in bid to save Ryedale’s libraries – Gazette Herald. &#34;&#34;The county council has estimated that Pickering library will need about 50 volunteers, along with library staff. &#34;We think it would be extremely difficult to recruit even more volunteers considering we are a much smaller town than Pickering.&#34;","2015/01/news-for-28th-29th-january.html"],["Cardiff","Tue, 27 Jan 2015 23:05:26 +0000","Cardiff – Campaigners hope Cardiff’s under-threat libraries could still be saved with a reprieve until 2016 - Wales Online. &#34;Hopes are rising that seven under-threat libraries could be given a reprieve until 2016 after months of campaigning by local residents. Cardiff council has proposed withdrawing funding from several libraries in the city in a bid to save £283,000 and plug a gap in the authority’s finances.&#34;.  Due to level of campaigning, &#34;Now campaigners hope councillors will vote in favour of a motion calling for the libraries to be saved when it is put before them at a full council meeting on Thursday.&#34;","2015/01/a-public-library-news-miscellany.html"],["Lambeth","Tue, 27 Jan 2015 23:05:26 +0000","Lambeth – Exclusive: Lambeth Council considering moving Lambeth Archives from Minet Library to Brixton Library – Brixton Buzz. &#34;Lambeth Council is considering moving the Lambeth Archives from the Minet Library to Brixton Library. Brixton Buzz understands that a consultation for this process will start on 30 January. It is uncertain what this would mean for the long-term future of the Minet, should the Lambeth Archives head over to Brixton.&#34;","2015/01/a-public-library-news-miscellany.html"],["Lincolnshire","Tue, 27 Jan 2015 23:05:26 +0000","Lincolnshire – Listen … heartfelt plea from key Lincolnshire library campaigner #LincsLibraryScrutiny – Save Lincolnshire Libraries. &#34;Read out at the Library Scrutiny Meeting (27 January 2015) by Cllr Jackie Brockway on behalf of Maurice Nauta, resident, campaigner and former librarian.&#34;","2015/01/a-public-library-news-miscellany.html"],["Lincolnshire","Sun, 25 Jan 2015 22:50:03 +0000","Lincolnshire – Lincolnshire County Council defies consultation – Lincolnshire Echo. &#34;Following LCC’s statement of intention for the library service, we are at a loss to understand its decision to exclude all tier three libraries from the procurement process and to close them or force them to be run by amateurs. This is in defiance of all representations to the contrary during both consultations, in which not one voice, other than its own, supported ‘voluntary’ libraries.&#34; … &#34;If Woodhall Spa (population 4,000) can meet the criteria for a professional library, the Deepings deserves one. Yet the council is preventing us from having the chance.&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Newport","Sun, 25 Jan 2015 22:50:03 +0000","Newport – Keeping central library ‘important’ for Newport – councillors – South Wales Argus. &#34;A joint scrutiny committee meeting on Wednesday supported proposals made by a policy review group that have been looking into crossovers between the city’s libraries and community centres. The committee’s findings will now go to the council’s cabinet for approval. The new proposals include retaining the Central Library building, but reducing the footprint of the library and museum space to one floor.&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Staffordshire","Sun, 25 Jan 2015 22:50:03 +0000","Staffordshire – All Staffordshire libraries will get professional support even if they become community run says county council libraries guru – Staffordshire Newsletter. &#34;Libraries which are set to be run and managed by their local community will remain part of the county’s library network, Janene Cox told a council scrutiny meeting today, while other volunteer-run libraries will be managed by the county council as part of the amended proposals for the county’s library service.&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Staffordshire","Sun, 18 Jan 2015 20:25:28 +0000","Staffordshire – Staffordshire libraries changes explained – with infographic – Staffordshire Newsletter. &#34;&#34;The public response made it clear there was a greater confidence and appetite to take on management of local libraries in some areas, than others. &#34;Accordingly, we are proposing a twin-track approach. Some community groups will take responsibility for managing and delivering their local library service as soon as they have satisfied the necessary conditions – and will have access to support from Library staff. &#34;For others there will be a transitional stage where volunteers staff the library on a day-to-day basis and the library will be part of a cluster which will have support from a member of library staff on a regular basis.&#34;","2015/01/of-reports-and-raspberries.html"],["Stockton","Tue, 13 Jan 2015 18:01:53 +0000","Stockton – Billingham library and customer service centre opens – Designing Libraries. &#34;The building is a one-stop-shop bringing together customer services for Stockton Council and Thirteen housing group, a cash office and Billingham Town Council headquarters.&#34;","2015/01/welcoming-the-homeless-in.html"],["Haringey","Sun, 11 Jan 2015 19:35:53 +0000","Haringey – Cuts to Haringey Libraries including Marcus Garvey Library (with petition) - Stop the privatisation of public libraries. &#34;I’ve been spending a lot of time helping to fight library cuts and closures in other parts of the UK (and appearing on C4 news, giving interviews to RTTV et al, writing articles for the Guardian and Informed, giving evidence to the Sieghart Inquiry, etc etc) and have taken my eye off my own manor, Haringey. And in that time it seems that Cllr Adam Jogee, the Cabinet Advisor on libraries, and his council colleagues have been making big statements about not closing libraries but at the same time proposing cutting budgets, staff and floorspace, naughty naughty&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Kirklees","Thu, 08 Jan 2015 21:17:25 +0000","Kirklees – Visitors flock to libraries threatened with closure in Kirklees — see which get the most visitors - Huddersfield Daily Examiner. &#34;Libraries threatened with closure in Kirklees have had nearly 750,000 visitors in just six months … Now new figures, obtained exclusively by the Examiner, reveal that the other 24 libraries potentially facing the axe had 749,680 visits between April and October 2014.&#34;.  [NB. Huddersfield Library figures are showing a decrease in visitors and borrowing because it was closed for 4 weeks for refurbishment and installation of self-issue machines – Ed.]","2015/01/je-suis-charlie-birmingham-library-song-and-the-magna-carta.html"],["Hull","Tue, 27 Jan 2015 23:05:26 +0000","Hull – ‘We deserve gold medal for keeping Hull libraries open’ – but hours will be cut – Hull Daily Mail. &#34;Cllr Geraghty, the cabinet portfolio holder for leisure, said: &#34;We did a very extensive consultation on these changes and I was concerned that, having to find these sort of savings, people would think we were just going to close libraries full stop. I was very pleased to find 80 per cent of those who did respond supported a reduction in opening hours as an alternative. &#34;We are going down that route because once a building is closed, in my experience, it doesn’t usually open again.","2015/01/a-public-library-news-miscellany.html"],["Lincolnshire","Tue, 27 Jan 2015 23:05:26 +0000","Lincolnshire – Lincolnshire libraries saga: Martin Hill blames a lack of scrutiny – Lincolnshire Echo. &#34;The leader of Lincolnshire County Council Martin Hill says the chance of a libraries outsourcing deal was missed due to a lack of scrutiny. Councillor Hill was speaking at this morning’s audit committee meeting which considered a damning report into his authority’s handling of the future of libraries.&#34; … &#34;Labour has now rounded on the council following the publication of an internal audit’s findings.","2015/01/a-public-library-news-miscellany.html"],["Northern Ireland","Tue, 27 Jan 2015 23:05:26 +0000","Northern Ireland – Future cuts to libraries not ruled out – Fermanagh Herald. &#34;Libraries NI told the Fermanagh Herald that they have £1.4m of worth of cuts to make across the North, and said that there is an ongoing review of budgets heading into 2015 – which could impact on the county’s three libraries: Enniskillen, Irvinestown, and when completed, Lisnaskea. A spokesman said: &#34;As a result of budget cuts, Libraries NI is required to save at least 4.4% of its budget (£1.4 million) in-year by March 2015. Further in-year savings have not been ruled out and immediate steps must be taken to deliver these spending cuts.&#34;","2015/01/a-public-library-news-miscellany.html"],["Stoke on Trent","Tue, 27 Jan 2015 23:05:26 +0000","Stoke on Trent – Library opens at leisure centre in Abbey Hulton - Stoke Sentinel. &#34;Staff at the Abbey Hulton-based Wallace Sports and Education Centre, in Abbey Hulton, have taken over the running of the book collection service as part of Stoke-on-Trent City Council’s wider volunteer-led library initiative.&#34; … &#34;The mini leisure centre library now houses 250 books, which are replaced and refreshed every six weeks.&#34; … &#34;There are now 10 such facilities including at Ball Green Methodist Church, Swan Bank Methodist Church in Burslem, Blurton Hub, Fenton Hub and the Whitfield Valley Community Centre in Fegg Hayes – to name a few. And more volunteer-led libraries are expected to appear in the coming weeks and months.&#34;","2015/01/a-public-library-news-miscellany.html"],["Hull","Thu, 22 Jan 2015 21:22:40 +0000","Hull – Library hours cuts ‘will break-up community’ in the Avenues - Hull Daily Mail. &#34;Book-lovers say proposals to cut opening hours of the Avenues Library are a &#34;disaster&#34;.  Hull City Council has revealed plans to reduce opening hours at public libraries across the city, which will be considered by councillors next week. Currently, the Avenues Library in Chanterlands Avenue, west Hull, opens six days a week, closing on Sundays. If the changes are approved, the library would closed on Wednesdays and half-day opening would be introduced for the rest of the week.&#34;","2015/01/national-libraries-day-all-growed-up.html"],["Southampton","Tue, 20 Jan 2015 20:24:55 +0000","Southampton – How Cobbett Road Library changed my life – Bitterne Park Info.  &#34;This National Libraries Day on Saturday, February 7, find out how Blue Peter award-winning children’s author Ali Sparkes went from struggling reader to professional writer thanks to Cobbett Road – the library down the road&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Trafford","Tue, 20 Jan 2015 20:24:55 +0000","Trafford – North of Trafford ‘unfairly targeted’ by library cuts says MP – Messenger. &#34;Ms Green said: &#34;I’m disgusted that yet again it’s residents in Stretford and Urmston who are bearing the brunt of Trafford Tory cuts. &#34;Three libraries are earmarked for closure in my constituency while libraries in the south of the borough are getting new investment. The Tories are deliberately choosing to cut the service in poorer parts of Trafford while richer areas are protected.&#34; Meanwhile the Delamere Toy Library, which was established by a group of parents to provide speciality toys to benefit disabled children is set to lose its two part time workers, currently funded by Trafford Council.&#34;","2015/01/trafford-lincs-staffs-cardiff-everywhere-really.html"],["Brighton and Hove","Sun, 18 Jan 2015 20:25:28 +0000","Brighton and Hove – Brighton and Hove City Council poised to decide on plans to increase council service costs – Argus. Council &#34;will today decide whether to ask for public donations as it struggles to fund library and leisure services. Councillors have been urged to approve plans to introduce fees for children’s events at libraries, as well as increase the rent on beach huts and the cost of wedding ceremonies. One proposal is the introduction of a discretionary fee for the popular Baby Boogie sessions for toddlers held at the city’s libraries.&#34;","2015/01/of-reports-and-raspberries.html"],["Bristol","Sun, 18 Jan 2015 20:25:28 +0000","Bristol – Bristol mayor George Ferguson puts £50,000 towards air quality monitoring at city’s key industrial sites - Bristol Post. &#34;The mayor has also pledged £1 million to support the future of libraries, which he said was something that had been widely expressed as an important priority during the consultation.&#34;","2015/01/of-reports-and-raspberries.html"],["Kirklees","Sun, 18 Jan 2015 20:25:28 +0000","Kirklees – Future of Heckmondwike Library still uncertain – Batley and Birstall News. &#34;At a meeting of Friends of Heckmondwike Library, Kirklees Council’s chief librarian, Carol Stump, said help from residents would be necessary as staff make plans to keep the service afloat in the face of their own job losses.&#34;","2015/01/of-reports-and-raspberries.html"],["Cardiff","Sun, 11 Jan 2015 19:35:53 +0000","Cardiff – Three Cardiff libraries faced with closure had almost 250,000 visitors last year - Wales Online. &#34;Some 246,342 visitors went through the doors of Rumney, Rhiwbina and Whitchurch libraries between January and October last year, or 810 people between them per day. Whitchurch recorded an increase in the number of people visiting in the first ten months of 2014 compared to the whole of 2013. As part of proposals by Cardiff council, libraries across the city could be closed to save more than £1.4m.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Stockton","Sun, 11 Jan 2015 19:35:53 +0000","Stockton – New library and plaque opened in Norton, Stockton – Northern Echo. &#34;It had been closed since April. The library will now offer improved services including better IT facilities and a self-service option along with new book stocks. New shelving and furniture, improved lighting and dedicated meeting and community health rooms have also been part of the upgrade.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Birmingham","Thu, 08 Jan 2015 21:17:25 +0000","Birmingham – British Library confirms no approach over Library of Birmingham rescue bid - Birmingham Post. &#34;The council said yesterday the British Library had shown an interest in using the Library of Birmingham as a regional centre but the former has now confirmed it has not been approached about the project. In a statement, it said: &#34;The proposals mentioned in Birmingham City Council’s press statement are part of internal council discussions at this stage and the British Library has not been approached regarding these ideas. &#34;The British Library already works closely in partnership with the Library of Birmingham through a range of projects, including its Business & IP Centre, and looks forward to continuing that close relationship.&#34;&#34;","2015/01/je-suis-charlie-birmingham-library-song-and-the-magna-carta.html"],["Harrow","Thu, 08 Jan 2015 21:17:25 +0000","Harrow – Lonely residents to become isolated should libraries close, councillor warns - Get West London. &#34;Councillor Susan Hall, leader of the Conservative group, said: &#34;I think the Bob Lawrence petitioners have done a fantastic job, not only in terms of getting signatures from local residents, but in making the case for protecting our libraries. &#34;Libraries are a vital community resource for all sorts of reasons, and for a hugely broad spectrum of Harrow’s population, and our worry is that the people who rely on them the most will be left isolated if they close.&#34;","2015/01/je-suis-charlie-birmingham-library-song-and-the-magna-carta.html"],["Lincolnshire","Thu, 29 Jan 2015 21:16:03 +0000","Lincolnshire – County Council is a &#34;disgrace&#34; says Mair – Horncastle News. &#34;Hopes Coningsby and Tattershall Library could be run by volunteers appear to have fallen through as local town and parish council councils aren’t prepared to offer funding. Both councils are concerned about the burden on taxpayers and there are doubts about the future of the current library building at the Barnes Wallis Academy. UKIP’s Colin Mair, who represents Tattershall Castle ward at County Hall, said: &#34;The behaviour of the County Council has been a disgrace.&#34;","2015/01/news-for-28th-29th-january.html"],["Suffolk","Thu, 29 Jan 2015 21:16:03 +0000","Suffolk – Suffolk Libraries launches new book festival – Ipswich Spy. &#34;Alison Wheeler, General Manager of Suffolk Libraries, said, &#34;We wanted to organise a book festival which was a bit different – something accessible and enjoyable for everyone. The aim is to invite a mix of popular, local and up and coming authors to our libraries and run a series of events around Suffolk. I’m delighted with the programme we’ve been able to put together and am looking forward to welcoming some top authors to our libraries.&#34;&#34;","2015/01/news-for-28th-29th-january.html"],["Coventry","Tue, 27 Jan 2015 23:05:26 +0000","Coventry – ‘Libraries are the heart of any community and without them people’s lives would be poorer’ - Coventry Telegraph. Lists reasons why libraries should not close in the city.","2015/01/a-public-library-news-miscellany.html"],["Havering","Tue, 27 Jan 2015 23:05:26 +0000","Havering – Havering budget cuts shake up after consultation – Romford Recorder.  &#34;We have been deliberating,&#34; he said. &#34;We are asking officers to investigate possible changes in savings and to let us have a report at a meeting on February 4. We need to move quickly.&#34; First up was the libraries. Original proposals, which would have seen six of the borough’s 10 facilities have their opening hours halved, caused outrage among residents. Officers will now be asked to look at changing this to five, though there was no word on which one would be saved. The other five would see their hours reduced to 24, rather than the proposed 25. The reading programme would also be safe, Cllr Ramsey confirmed.&#34;","2015/01/a-public-library-news-miscellany.html"],["Thurrock","Tue, 27 Jan 2015 23:05:26 +0000","Thurrock – The future of Thurrock Library Service consultation – Thurrock Council. &#34;There is a strong commitment to both the provision of a library service in Thurrock and the development of this to make it relevant to resident’s changing needs.  In recent years work to support shared delivery with Community Hubs has been developed along with a move towards an improved service for those with limited mobility who are unable to visit libraries through our Home-link Service. We are now developing the next phase of our library delivery transformation and as a part of this we need to also make a 39% saving due to funding changes. To achieve this whilst developing the service on offer for residents we are consulting on the following proposals:&#34; [Some questionable points:  e.g. &#34;Do you think local communities should be able to run their local libraries and seek external funding to support them?&#34; but fails to explain to people that they already pay through taxation for what is a statutory service. Also lists possible services &#8230;","2015/01/a-public-library-news-miscellany.html"],["Coventry","Sun, 25 Jan 2015 22:50:03 +0000","Coventry – ‘The fact that councillors are even suggesting that we can run libraries on a ‘charity shop’ model with volunteers is an insult to our library service’ - Coventry Telegraph. &#34;As a representative of the National Union of Teachers in Coventry, representing over 1,800 teachers, we are extremely concerned with the city council’s intention to reduce dramatically the number of public libraries in Coventry. We believe that libraries are uniquely placed to help foster engagement in reading. They offer free access to learning and a ‘safe’ space for children and young people to study and access resources.&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Harrow","Sun, 25 Jan 2015 22:50:03 +0000","Harrow – School librarian to stand for Green Party in Harrow East on anti-cuts platform - Get West London. &#34;School librarian and community activist Emma Wallace will stand in May’s general election, and has pledged to fight proposed cuts to libraries, health services and children’s centres. She will also push for more affordable housing to be built in the borough to ensure Harrow continues to be a place families can call home.&#34;","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Sheffield","Sun, 25 Jan 2015 22:50:03 +0000","Sheffield – Talks still ongoing over Sheffield library takeover – Star. &#34;A community library is still being run by Sheffield Council – over three months after it was expected to be taken over by volunteers. The facility in Burngreave was one of 15 libraries which the authority relinquished control of in controversial measures to save £650,000 a year despite lengthy protests from residents. While the rest of the libraries have been taken over by community groups, most at the end of September or in early October, Burngreave is still being run by librarians employed by the council.","2015/01/damned-if-you-do-damned-if-you-dont-the-dilemma-of-a-good-librarian-in-austere-times.html"],["Bristol","Thu, 22 Jan 2015 21:22:40 +0000","Bristol – Reader’s letter: Libraries are being used for child-care - Bristol Post. &#34;Mrs/Ms Brown is right that libraries are not just about books; for they have taken over some aspects of parenting that used to be carried out by mums and dads. Once upon a time extended families met the nurturing needs of their children without recourse to an: ‘all-singing, all-dancing’ library service. For example, the library service provides: ‘Baby bounce and rhyme’ sessions with the earth-shattering news that singing rhymes with babies is great fun for: &#34;language development, strengthening the bond between parent/carer and child, and helping children begin understanding the world around them.&#34;.  Letter appears against this development and also against free computer use.","2015/01/national-libraries-day-all-growed-up.html"],["Kent","Thu, 22 Jan 2015 21:22:40 +0000","Kent – Campaign to Save Deal Library has begun – Kent Online. &#34;A Facebook page called Save Deal Library has been set up following plans unveiled by the county council to run libraries in Kent by charitable trust. The council has announced a 12-week consultation on a proposal to pass over the job of running libraries as it bids to save money in the face of a continuing public sector spending squeeze.&#34; … &#34;comment on Deal Watch Facebook page gained more than 100 comments from Deal residents. His highlighted points included where will vulnerable people with poor skills go to make online applications, make housing inquiries and be able to speak to professional staff.&#34;","2015/01/national-libraries-day-all-growed-up.html"],["Manchester","Thu, 22 Jan 2015 21:22:40 +0000","Manchester – Library visitor numbers plunge as cuts force drastic reduction in opening hours - Manchester Evening News. &#34;Seven Manchester libraries have seen visitor numbers plummet by as much as 90per cent since funding cuts led to them being run by volunteers with drastically reduced opening hours. Barlow Moor Library in Chorlton has lost 90.6 pc of its visitors. The community-run library is run from Barlow Moor Community Centre, replacing the smaller one introduced after the original library was axed in council spending cuts.&#34;","2015/01/national-libraries-day-all-growed-up.html"],["Isle of Wight","Sun, 18 Jan 2015 20:25:28 +0000","Isle of Wight – Some councils could be asked to take on running costs of libraries - On the Wight. &#34;Changes to the library service are part of a number of possible ‘savings options’ outlined in the budget strategy that could see some local councils taking on the running costs of local libraries in exchange for community use of the buildings.&#34;","2015/01/of-reports-and-raspberries.html"],["Lincolnshire","Sun, 18 Jan 2015 20:25:28 +0000","Lincolnshire – Changes to library services still ‘the way forward’ - Lincolnshire Council. &#34;In December 2013, the council’s executive agreed to proposals for changes to the library service, in light of changes in the way libraries are used and the authority’s substantially reduced budget. However, this move was subsequently challenged in the High Court. Although the judge agreed that the council’s plans would meet its legal duty to provide a comprehensive and efficient service, he did highlight shortcomings in the way the decision was reached. Now, following additional work over the autumn, officers are recommending that councillors again endorse the plans that were previously agreed.&#34; see also Councillors asked to go ahead with controversial library reform - Boston Standard.","2015/01/of-reports-and-raspberries.html"],["Thurrock","Sun, 18 Jan 2015 20:25:28 +0000","Thurrock – Will Stanford and Corringham libraries close? (Local councillor doesn’t mind as he isn’t up for re-election in 2018!) – Your Thurrock. &#34; chair Cllr Val Morris-Cook opined that it was likely that now specific decision would be made regarding closures as that would be &#34;political suicide&#34;. She then asked the Homesteads councillor: &#34;Would you stand up between now and election day and say you would merge Stanford and Corringham libraries.&#34; Cllr Halden, who was re-elected in May 2014 said: &#34;Ah but I am back in so I have three-and-a -half years.&#34;","2015/01/of-reports-and-raspberries.html"],["Kent","Tue, 13 Jan 2015 18:01:53 +0000","Kent – Libraries, Registration and Archive Service Consultation – Kent County Council. &#34;Library, Registration and Archive (LRA) services are valued by communities, which is why we have given a lot of consideration to how we deliver them for the future. From many options we have looked to find the most sustainable that will deliver customer-focused services and contribute to the savings KCC has to make. KCC’s preferred option is that we set up a Charitable Trust to deliver the LRA service. KCC encourages you to consider the proposal and feedback your thoughts. No formal decision has been taken and we want to hear everyone’s views.&#34;","2015/01/welcoming-the-homeless-in.html"],["Nottinghamshire","Tue, 13 Jan 2015 18:01:53 +0000","Nottinghamshire – South Scarle given 300 books for its new small library depository – Newark Advertiser. &#34;A village with a population of around 200 is the venue for Nottinghamshire’s first small library depository. Around half of South Scarle’s population attended the opening of a library access point in the village’s community centre which is part of St Helena’s Church and the meeting hub in the heart of the village. Library access points are deposits of small collections of books. The county council’s library’s service has given 300 books to South Scarle, half of which will be exchanged at agreed times throughout the year, and volunteers can refresh the collection at Collingham and Newark libraries.&#34;","2015/01/welcoming-the-homeless-in.html"],["Edinburgh","Sun, 11 Jan 2015 19:35:53 +0000","Edinburgh – Edinburgh City Council to axe 1,200 jobs - Scotsman. &#34;UP TO 1,200 jobs could go at Edinburgh City Council as part of plans to make £138 million savings. The council, which employs about 18,500 staff, aims to address a budget gap of £67m over the next three years and has announced a reorganisation of the way it operates.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Leicestershire","Sun, 11 Jan 2015 19:35:53 +0000","Leicestershire – Mobile libraries could face cuts in North West Burton Mail. &#34;The council’s six library vehicles currently serve more than 300 communities in the county, stopping at around 500 places lending books to approximately 3,800 people. Currently, the service operates once a fortnight but under the new plan it will cut down to every three weeks or even as little as once per month.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Lincolnshire","Sun, 11 Jan 2015 19:35:53 +0000","Lincolnshire – Fears raised Spilsby Library could be facing its final chapter – Skegness Standard. &#34;Spilsby Library was earmarked to be run by the community as part of a £2 million cost saving programme put forward by Lincolnshire County County in 2013. The library at West End Villas had been scheduled to close and potentially relocate to the town’s Lincolnshire Co-op store in Post Office Lane.&#34;","2015/01/in-praise-of-local-libraries-and-school-library-services.html"],["Barnet","Thu, 08 Jan 2015 21:17:25 +0000","Barnet – The planned closure of the East Finchley Library – Maja Doodles. &#34;I went to a Christmas fair with my family and found out that the council was planning on closing the East Finchley Library! I always loved going there because I used to go there to look at the Jacqueline Wilson books to see if there were any new ones, and I still do! This library is fantastic because it is open to the public. I was so angry at the council for wanting to close such a wonderful library, that I actually wrote a letter to them…..so here it is … &#34; 10 year old has started a petition too.","2015/01/je-suis-charlie-birmingham-library-song-and-the-magna-carta.html"],["North Yorkshire","Thu, 08 Jan 2015 21:17:25 +0000","North Yorkshire – Meetings arranged to discuss future of Ryedale’s under-threat libraries – Gazette and Herald. &#34;Town mayor, Councillor Chris Dowie said the library has about 20 volunteers, but that between 60 to 80 would be needed in order for the library to stay open. She said: &#34;I just think it is really short-sighted of the county council. It would be difficult for us to recruit that number of volunteers as people don’t want to volunteer for hours the same as another full time job. There is a huge support for libraries to stay open from everyone across the community.&#34;&#34;","2015/01/je-suis-charlie-birmingham-library-song-and-the-magna-carta.html"]]