[["Cambridgeshire","Sun, 02 Oct 2016 19:00:07 +0000","Cambridgeshire – Cambridgeshire’s community and mobile libraries boosted courtesy of online giant Amazon – Wisbech Standard. &#34;The online retailer has contributed 800 non-fiction books to the county’s four mobile libraries, and has donated 50 Amazon Fire tablets to the council’s volunteer-led ‘Library at Home’ service, which supports housebound and vulnerable people across the country. The donations come as part of Amazon’s ‘Amazon in the Community’ programme, which will see the county’s libraries develop six new roving book collections which are aimed at young people and aimed around science, technology and encouraging youngsters to broaden their horizons and develop new skills.&#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Lancashire","Sun, 02 Oct 2016 19:00:07 +0000","Lancashire – Campaigners warn museums and libraries could be closed for good – Lancashire Telegraph. &#34;Ribble Valley Tory MP Nigel Evans said: &#34;I believe these cruel library and museums closures are final. Holding out a false hopes about negotiations to reopen them is a disgrace. If they intended to save them, they would have kept them open during talks.&#34; &#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Lancashire","Sun, 02 Oct 2016 19:00:07 +0000","Lancashire – Lancashire’s cash crisis – museums and libraries close – ITV. &#34;Five museums and six libraries are closing in Lancashire as part of a package of cuts totalling £200 million. The county council says it’s being forced to make savings because of the Government’s austerity measures. But one Lancashire MP says the council is turning the county into a desert&#34;. Video.","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Lancashire","Sun, 02 Oct 2016 19:00:07 +0000","Lancashire – Library closures not the end of the story, vow protesters – Lancashire Evening Post. &#34;Fulwood is one of the first six to shut up shop tonight – the others are Penwortham, Bamber Bridge, Freckleton, Lytham and Thornton. The next batch, including Lostock Hall and Adlington, will follow by the end of November.&#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Lancashire","Sun, 02 Oct 2016 19:00:07 +0000","Lancashire – Lifeline bid submitted for shut down library – Gazette. &#34;The idea is to have a library and a community hub. There as well thought out plans and it is a strong bid with genuine local backing.&#34; … &#34;The Gazette understands the bid has been made by an established community group. It has not come from the Friends of Thornton and Cleveleys Libraries, which had campaigned against the closures.&#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Lancashire","Sun, 02 Oct 2016 19:00:07 +0000","Lancashire – Watch how this boy’s response to Fulwood library closure says it better than most – Blog Preston. &#34;He explains his anger and frustration at the closure of the library as part of Lancashire County Council’s plan to save millions of pounds by closing community buildings.&#34; … &#34;In the video his seven-year-old boy explains he’s even written to the Queen about the closure, and his fears for the future of the staff there.&#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Stockton","Sun, 02 Oct 2016 19:00:07 +0000","Stockton – D-day looms for two popular libraries that face the axe as council tries to save £130k – Gazette. &#34;Stockton Council will decide the fate of both Fairfield and Egglescliffe libraries on next week &#34; … &#34;During a lengthy consultation process, a 3,217 name petition protesting at the possible closure of Fairfield was received, as well as a 659 name petition protesting the possible closure of Egglescliffe. But a new proposal to retain Fairfield Library by sharing the building with a nursery provider will now be considered by the Cabinet.&#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Swindon","Sun, 02 Oct 2016 19:00:07 +0000","Swindon – Arts Council England chief exec visits Swindon – Swindon Advertiser. &#34;Leon Flower, lead librarian, said he was delighted to welcome Darren to town. &#34;It’s a difficult time for the libraries so something like this is what we look forward to,&#34; he said. &#34;We’re really pleased to have Darren here. Arts and culture have a really important place in the town and this enables people to focus on the rich variety we have here.&#34;&#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Swindon","Sun, 02 Oct 2016 19:00:07 +0000","Swindon – Council urged to think again on library closures by 25 headteachers – Swindon Advertiser. &#34;25 primary school headteachers who, in a letter to the council, called for a reconsideration of the ‘drastic’ plans.&#34; … &#34;the headteachers say they believe that such a significant reduction in branch and mobile library provision will be &#34;very detrimental to Swindon children.&#34; &#34; … &#34;Sarah Church, chairman of Save Swindon’s Libraries, said: &#34;We very much hope that the borough council will listen to Swindon’s most experienced teaching professionals now they have written to highlight the importance of the library service and its staff to the school children of Swindon. &#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Warrington","Sun, 02 Oct 2016 19:00:07 +0000","Warrington – MP Helen Jones calls on LiveWire to be more ‘transparent’ with library meetings – Warrington Guardian. Labour MP. &#34;MP Helen Jones has asked LiveWire what it is hiding after reports that there are no briefing notes for one of the library consultation meetings. The Labour politician called on LiveWire to be more transparent about their public consultation regarding the future of the town’s libraries. A spokesman for Ms Jones said briefing notes were circulated after each meeting to summarise the key points raised by residents. But there is no note for the meeting at Culcheth Library, which is described as a ‘highly charged, emotional and eventful’ session by LiveWire’s managing director Emma Hutchinson, who would apparently prefer to give verbal feedback about the meeting to board members.&#34; … &#34;Additionally, the accuracy of the other briefing notes is also questionable, with a number who were present asking ‘were they at the same meeting as I was?’ &#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Worcestershire","Sun, 02 Oct 2016 19:00:07 +0000","Worcestershire – Council property sell off to continue in £19m bonanza for taxpayers – Bromsgrove Advertiser. &#34;Since 2011 more than 100 pieces of council property have been sold ranging from large-scale office blocks to old community halls, day centres, libraries, commercial units, workshops, school sites and more. &#34;","2016/10/what-are-the-ideas-behind-idea-stores.html"],["Barnet","Tue, 04 Oct 2016 19:20:32 +0000","Barnet – Volunteers running Libraries is Outsourcing – John Burgess. &#34;This is critical moment in the future of Libraries. Volunteers are being used now to push through brutal austerity policies and take the livelihoods of thousands of low paid Library workers. Imagine if you will, going into work today. There you are carrying out your job, earning your living, paying your bills feeding your family. Next you receive a tap on the shoulder, you look up and a stranger says &#34; excuse me, erm, this is all a bit awkward for me, I really am unhappy about this but if I don’t do this there will be nothing left.&#34;. You reply &#34;What?&#34;&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Bexley","Tue, 04 Oct 2016 19:20:32 +0000","Bexley – Council scraps library privatisation plans – Bexley Times. &#34;Bexley Council has scrapped plans to privatise the borough’s libraries under a joint outsourcing exercise with Bromley Council. Proposals to outsource the borough’s libraries were revealed last October, but the council has decided to continue running the library service in-house following the receipt of tenders. Joint outsourcing was originally mooted because the two boroughs share the responsibility and cost of managing their back office library services. Cabinet member councillor Peter Craske said: &#34;We have worked really hard to keep our libraries open and we are looking forward to making them even more of a focus for a wide range of leisure and community activities in the future.&#34;&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Bromley","Tue, 04 Oct 2016 19:20:32 +0000","Bromley – Council refuses to back down on library ‘privatisation’ after Bexley scraps outsourcing plan – Bromley Times. &#34;Bromley Council has pledged to continue with plans to ‘privatise’ its libraries after Bexley Council announced its withdrawal from a joint outsourcing project.&#34; … &#34;the council says it will continue to press ahead with the tendering process and sought to reassure residents that there would be no sell-off of assets. Executive councillor for renewal and recreation Peter Morgan said: &#34;The council’s plans have not changed and the tendering process is continuing, with proposals being evaluated and when we can say more, we will.&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Coventry","Tue, 04 Oct 2016 19:20:32 +0000","Coventry – ‘Our council seem to take more notice of outsiders so perhaps they will take note’ – Coventry Telegraph. &#34;The Midlands TUC Creative & Leisure Industries Committee (CLIC) has been disturbed to hear of the proposed cuts to the libraries and museums of Coventry. The Midlands CLIC is made up of unions from across the cultural sector including BECTU, Equity, MU, NUJ, PCS, Unison, NUT, UCU and WGGB.&#34; … &#34;We urge Coventry City Council to end the diminishing of public cultural facilities and services in the city. By doing so you would make a public statement about the type of city you are aspiring to build&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Derby","Tue, 04 Oct 2016 19:20:32 +0000","Derby – Campaigners fighting to save Mickleover Library to hold meeting to discuss their plans – Derby Telegraph. &#34;Derby City Council wants to close 11 of Derby’s 15 libraries, including Mickleover, in a bid to save £648,000 a year. Now, Conservative councillors have called on residents to air their views on the plan.&#34;.  44 out of 100 jobs at risk.","2016/10/dont-keep-it-to-your-shelves.html"],["Lancashire","Tue, 04 Oct 2016 19:20:32 +0000","Lancashire – Campaigners aren’t giving up on Adlington library yet – 2BR. &#34;Lancashire County Council’s executive scrutiny committee will meet later today to consider a number of business cases from groups hoping to keep some libraries in the county open.&#34; … &#34;Friends of Adllington library are now hoping that they’ll be able to take over the running of it after working with Chorley Borough Council to produce a business plan. It’s the latest in a long road for people in the village who are desperate to keep it running&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Lancashire","Tue, 04 Oct 2016 19:20:32 +0000","Lancashire – Chorley residents could be forced to use Horwich library after closure despite recent rivalry – This is Lancashire. &#34;A report that went to the council’s cabinet meeting earlier this month indicates that users of the soon-to-close Adlington facility could travel the 2.6 miles into neighbouring Horwich to use the services at the Lord Street premises, once the closure takes place. &#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Lincolnshire","Tue, 04 Oct 2016 19:20:32 +0000","Lincolnshire – Volunteer Crisis – Save Lincolnshire Libraries. &#34;we continue our campaign by recording what is happening to the service. This includes libraries that have closed for good, volunteers that confirm they are not genuine volunteers but feel forced into saving their community resources and volunteers withdrawing their offers. Help us make this record a true account by letting us know what’s happening with your library, community hub or volunteer group via our contact page.&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Sheffield","Tue, 04 Oct 2016 19:20:32 +0000","Sheffield – Fully-staffed libraries affordable and essential – Yorkshire Post / Letters. &#34;With the total libraries budget comprising less than one per centof the total spend of Sheffield City Council, it’s not as though campaigners and library users are asking for the moon on a stick to have 16 small libraries staffed on a part-time basis. &#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Swindon","Tue, 04 Oct 2016 19:20:32 +0000","Swindon – Headteachers slam Swindon’s plans to close 11 libraries – BookSeller. &#34;Twenty-five headteachers have written an open letter to the council urging it to reconsider the &#34;drastic&#34; plans to close most of the region’s libraries and the mobile library provision.&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Swindon","Tue, 04 Oct 2016 19:20:32 +0000","Swindon – Libraries are haunts of the vulnerable so easy targets, says Barrie Hudson – Swindon Advertiser. &#34; head teachers have written a letter of protest at council plans to shut down all but a handful of our libraries … They are among thousands of people who voiced their horror during the consultation period, so you may be wondering why the local authority hasn’t thrown the scheme out like something mouldy from the back of a fridge.&#34;.  Points out council consultations have no real meaning and are a formality. Also says that the most vulnerable are keen users of libraries but are least likely to protest.","2016/10/dont-keep-it-to-your-shelves.html"],["Wakefield","Tue, 04 Oct 2016 19:20:32 +0000","Wakefield – Warning to ‘use it or lose it’ over local libraries across Yorkshire – Yorkshire Post. &#34; one such library in Wakefield, which has actually seen an increase in membership and longer opening hours since being taken over, says it is possible to make it work. But, organisers have warned, there is only a limited amount of money available. &#34;I dread to think what the future is for libraries,&#34; said Philippa Petty, business co-ordinator at Ackworth Community Library near Wakefield. &#34;Hours are being cut, staffing is being cut. It doesn’t bode well. &#34;I don’t think the future will be volunteer led libraries. Where the funding will come from, I don’t know. There’s only finite amounts of money for a finite amount of libraries.&#34; … &#34;&#34;We now have 1,400 members – more than when it was a local authority library,&#34; she said. &#34;We are open more hours – it was four part days a week, it’s now six. Our library has become a community library. It’s come alive.&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Warwickshire","Tue, 04 Oct 2016 19:20:32 +0000","Warwickshire – Police offer front of counter services at Wellesbourne Library – Herald. &#34;Wellesbourne Library has joined others across the area in offering front of counter police services as the force looks to improve access to its services across the county. Wellesbourne, Alcester, Shipston, Warwick and a number of other libraries across the county are now offering police services as the force works in partnership with Warwickshire County Council. Front of counter services at Stratford Police Station will not be affected and will continue as normal.&#34;","2016/10/dont-keep-it-to-your-shelves.html"],["Wokingham","Tue, 04 Oct 2016 19:20:32 +0000","Wokingham – No danger to library – Henley Standard. &#34;The council says it needs to save £20million over the next three years due to a cut in its government grant but it says that libraries, including the one in Church Street, Wargrave, will not be affected.  In 2011 residents fought plans to privatise the library after the council announced that companies were being sought to take over the service in order to save £170,000 a year. More than 2,000 people signed a petition opposing the plans, which were later scrapped. The council will hold drop- in sessions for residents to discuss the latest cuts, including one at the St Mary’s Church Centre in Twyford on October 17 from 7pm to 9pm.","2016/10/dont-keep-it-to-your-shelves.html"]]