[["Cheshire West and Chester","Sun, 05 Jul 2015 17:36:43 +0000","Cheshire West and Chester – Shared reading in Reader Organisation. &#34;Our new project in partnership with Cheshire West and Chester Council is bringing shared reading to carers and those they care for across the borough. Shared reading provides carers with the valuable time and space to connect with literature and others, improving wellbeing and building resilience. Weekly groups are currently running in Chester Library, Ellesmere Port Library and Northwich Carers Centre, with one-to-one sessions also available&#34;","2015/07/the-importance-of-being-careful-in-emails-and-charging-for-the-latest-in-lego.html"],["Lambeth","Sun, 05 Jul 2015 17:36:43 +0000","Lambeth – &#34;At last, something I can talk about!&#34; – Fun Palaces at Lambeth Libraries - Signal in Transition. &#34;I’m pleased to announce that I’ll be working as a creative producer with the London Borough of Lambeth, helping their library staff to devise and deliver ten Fun Palaces with local communities on Saturday 3rd October 2015. Fun Palaces are the international movement creating pop-up venues for communities to try their hands at science and the arts. Last year, I worked with Parkes Library on Australia’s first Fun Palace which incorporated tabletop games and supervillainous challenges alongside creative play for all ages.&#34;","2015/07/the-importance-of-being-careful-in-emails-and-charging-for-the-latest-in-lego.html"],["Leicestershire","Sun, 05 Jul 2015 17:36:43 +0000","Leicestershire – Volunteer with Us – Reader Organisation. &#34;&#34;I always come away feeling enthusiastic and refreshed. It’s great to meet other group leaders and share experiences.&#34; We’re currently seeking volunteers to help run and assist in regular shared reading groups across Leicestershire as part of our project with Leicestershire Libraries. Volunteers will commit 1.5 hours per week (plus time for preparation and support) and will receive full training.&#34;","2015/07/the-importance-of-being-careful-in-emails-and-charging-for-the-latest-in-lego.html"],["North Yorkshire","Sun, 05 Jul 2015 17:36:43 +0000","North Yorkshire – Meeting to decide fate of North Yorkshire’s libraries – Darlington and Stockton Times. &#34;North Yorkshire County Council’s executive committee will meet on Tuesday, July 7 to decide whether to press ahead with a recommendation to axe staff at 21 libraries, whilst offering some support to help them stay open. When the proposals to reduce some libraries to volunteer-run centres were first proposed, more than 17,000 people protested to the council.&#34; … &#34;Volunteers at Great Ayton have to raise tens of thousands of pounds every year and receive £30,000 a year from the parish council to keep it running. Speaking after the proposals were discussed at a scrutiny committee meeting at County Hall, Cllr Blackie said it left the community-managed libraries with the &#34;haves and have-nots&#34;.&#34; … &#34;The Chartered Institute of Library and Information Professionals has expressed concern nationally at the trend for libraries to become volunteer-led, as councils balance diminishing budgets&#34;","2015/07/the-importance-of-being-careful-in-emails-and-charging-for-the-latest-in-lego.html"],["South Lanarkshire","Sun, 05 Jul 2015 17:36:43 +0000","South Lanarkshire – East Kilbride library axed in council budget cuts hosts farewell tea for loyal customers – Daily Record. &#34;Calderwood Library closed its doors yesterday after falling victim to local authority budget cuts. The closure was branded a ‘disgrace’ by loyal customers. &#34; … &#34;The library was due to close its doors yesterday (Tuesday) and last week staff organised a farewell tea for their loyal customers. A whole host of groups used the library for meetings and it was also popular with young mums and children.&#34;","2015/07/the-importance-of-being-careful-in-emails-and-charging-for-the-latest-in-lego.html"],["Leicestershire","Sun, 05 Jul 2015 17:36:43 +0000","Leicestershire – Burbage Parish Council makes bid to save village library - Hinckley Times. &#34;Burbage Parish Council is the latest to throw its hat into the ring in a bid to save the village’s library. The parish council held an extraordinary meeting on Monday to discuss the issue and decided it would enter the running.&#34; … &#34;Only last week Leicestershire county Council confirmed Elliswood Brewery in Hinckley had put forward a proposal to run the library in Church Street.&#34;","2015/07/the-importance-of-being-careful-in-emails-and-charging-for-the-latest-in-lego.html"],["Lincolnshire","Sun, 05 Jul 2015 17:36:43 +0000","Lincolnshire – Council merger – Let’s focus on north-west - Market Rasen Mail. &#34;There would be the chance, if local voters choose, of using some of the resulting cost savings on things such as reinstating the warden system within our sheltered housing complexes and supporting libraries&#34;","2015/07/the-importance-of-being-careful-in-emails-and-charging-for-the-latest-in-lego.html"],["Leicestershire","Sun, 05 Jul 2015 17:36:43 +0000","Leicestershire – First volunteer-run library to be launched - Loughborough Echo. &#34;Barrow-upon-Soar is set to be the first library in the county to be entirely manned by volunteers, according to Leicestershire County Council. Last year, the council called for volunteers to run rural libraries otherwise they would face closure. The county wants to save £800,000 from its current £5.6m libraries budget and felt these cuts could be made from job losses. The council will be providing villages with a package of support, including funding for the next seven years, but will remove its involvement after such time. At a cabinet meeting on Tuesday, June 16, the council detailed the current status of all 36 community libraries. It stated that Barrow-upon-Soar will be the first community library in Leicestershire and is set to open by mid to late July.&#34;","2015/07/the-importance-of-being-careful-in-emails-and-charging-for-the-latest-in-lego.html"],["Sefton","Sun, 05 Jul 2015 17:36:43 +0000","Sefton – Birkdale library; anger as Sefton is set to sell site to developers – Visiter. &#34;The Friends of Birkdale Library group has expressed anger that the public building could be demolished to make way for 14 new homes. A Sefton Council report has revealed that they have received a lucrative offer to build 14 semi-detached homes on the site. Len Davies, vice chairman of the Friends of Birkdale Library, said to the Visiter: &#34;I cannot understand the cabinet’s decision. There are 4,800 children in the Birkdale area that need a library. There are several schools within one mile of the Birkdale Library site.&#34; … &#34;Birkdale library closed in 2013, as part of Sefton’s radical cost cutting agenda. The closure was bitterly opposed by the Birkdale Library Action Group, and the ‘Friends’ group&#34;","2015/07/the-importance-of-being-careful-in-emails-and-charging-for-the-latest-in-lego.html"],["Lincolnshire","Sun, 05 Jul 2015 17:36:43 +0000","Lincolnshire – Wainfleet Library - Lincolnshire County Council. &#34;Wainfleet Library will be closed from 1pm on Saturday 6 June. The County Council’s lease on the building is coming to an end, and, in light of the planned changes to library services, the authority has decided not to renew it. Efforts are being made locally to develop plans for a volunteer-run facility, something the Council wholeheartedly supports. In the meantime, the Council will be providing a mobile so people can continue to use services.&#34;","2015/07/the-importance-of-being-careful-in-emails-and-charging-for-the-latest-in-lego.html"],["Cambridgeshire","Tue, 07 Jul 2015 21:58:14 +0000","Cambridgeshire – New plans to help transform future of Cambridgeshire’s libraries - Cambridge News. &#34;A spokesman for Cambridgeshire County Council said: &#34;Social prescribing is about linking people to local activities to improve their health and wellbeing and is potentially a good fit for libraries as these are in the heart of our communities.&#34; … &#34;Cllr Scutt acknowledges that the present plans are vague, adding that officers were torn between turning to the private sector or reframing libraries as welfare centres in the wake of &#34;savage funding cuts&#34;.","2015/07/hang-on-weve-seen-this-before-isle-of-wight-north-yorkshire-go-for-round-two.html"],["Lincolnshire","Tue, 07 Jul 2015 21:58:14 +0000","Lincolnshire – &#34;handing libraries over to volunteers would be a disaster&#34;- Save Lincolnshire Library. &#34;Having responded to Ed Vaisey’s request for further comments on his reluctance to intervene in LCC’s plans for the library service and having not had any kind of acknowledgement or response, I am writing again. This time it is a second copy to Ed Vaisey with a covering letter and also a covering letter (and a copy of the original) to John Whittingdale, the new Secretary of State for Culture, Media and Sport.&#34;","2015/07/hang-on-weve-seen-this-before-isle-of-wight-north-yorkshire-go-for-round-two.html"],["Fife","Tue, 07 Jul 2015 21:58:14 +0000","Fife – Dunfermline youth MSP starts fight against library closures – Dunfermline Press. &#34;Libraries threatened with the axe have been given a temporary reprieve while a public consultation is carried out but Dunfermline MYSP Lewis Akers is keen that people across Fife make their voices heard. &#34;We’ve set up a campaign group to save the libraries and have planned action over the next couple of weeks,&#34; he said. &#34;One of my manifesto points as an MSYP was to fight against education cuts and this ties in with that. It was a group of community activists who set it up and now we have a Facebook page and organised meet-ups.&#34; Keep Fife’s Libraries Open describes itself as a campaign group that says no to the &#34;brutal execution&#34; of the 16 libraries under threat. The grassroots community activists are campaigning to save the libraries that act as a lifeline to many across Fife.&#34; … &#34;So far, the group’s petition has gathered almost 3000 signatures and Lewis recently visited Dunfermline Gala to give away leaflets an&#8230;","2015/07/hang-on-weve-seen-this-before-isle-of-wight-north-yorkshire-go-for-round-two.html"],["Lincolnshire","Tue, 07 Jul 2015 21:58:14 +0000","Lincolnshire – University of Lincoln lecturers slam county council plans to axe Lincolnshire’s libraries - Lincolnshire Echo. &#34;The academics say the cuts in the services will leave one library for every 66,667 people in the county and say this is not good enough.&#34;","2015/07/hang-on-weve-seen-this-before-isle-of-wight-north-yorkshire-go-for-round-two.html"],["Plymouth","Tue, 07 Jul 2015 21:58:14 +0000","Plymouth – Eyecatching designs for Plymouth’s colourful new-look library revealed - Plymouth Herald. &#34; a series of bold, colourful designs created using artists’ impressions have been put on display showing what the proposed library will look like in its new surroundings.&#34;","2015/07/hang-on-weve-seen-this-before-isle-of-wight-north-yorkshire-go-for-round-two.html"],["Devon","Thu, 09 Jul 2015 20:35:46 +0000","Devon – Chair appointed to lead exciting future for Devon’s libraries - Devon County Council. &#34;&#34;Having a representative of the community involved in the recruitment process shows how committed the county council is to working closely with communities and friends groups in order to make a real difference to the development of the service. &#34;Julie was a very impressive candidate, not only does she have lots of experience as a Chair, she also has a great enthusiasm for libraries and a  vision for the future of Devon’s libraries.  She will no doubt provide excellent leadership and guidance for the organisation.&#34;&#34;","2015/07/dedications-all-you-need.html"],["Suffolk","Thu, 09 Jul 2015 20:35:46 +0000","Suffolk – Halesworth Library to launch iPad lending scheme – Suffolk Libraries. &#34;In what may be the first scheme of its kind in the country, Halesworth Library is launching a new iPad lending service to customers. The new iPads will be available from Wednesday 22 July when the new service is launched at a special ‘Get Connected’ event at the library. The event takes place from 10am to 1pm and will provide an opportunity for people to find out more about the iPad lending service and other online services available at the library. The library will be lending four iPads to start with, which have been purchased with money raised by the Friends of Halesworth Library and thanks to a significant discount from the local Hughes store. Staff from Hughes will also be on hand during the event to offer advice on the range of products available from their stores. It’s thought to be one of, if not the first, schemes of its kind operating from a public library in the UK.&#34;","2015/07/dedications-all-you-need.html"],["Gloucestershire","Tue, 07 Jul 2015 21:58:14 +0000","Gloucestershire – Book-swap buses swing into action in Gloucester with new Stagecoach reading initiative - Gloucester Citizen. &#34;Chosen buses in the city are to trial a scheme whereby passengers can leave books for each other to take home and read.&#34; … &#34;Cllr Andrew Gravells, cabinet member responsible for libraries in Gloucestershire, welcome any scheme which encouraged people to read. &#34;New ideas like this which encourage more people to pick up a book is a really great thing. &#34;Don’t forget that books are free at your local library too so if you get the buzz back from your bus journey then why not drop in to your library for more.&#34;","2015/07/hang-on-weve-seen-this-before-isle-of-wight-north-yorkshire-go-for-round-two.html"],["North Yorkshire","Tue, 07 Jul 2015 21:58:14 +0000","North Yorkshire – Library cuts go ahead with more support offered for volunteer run sites – Minster FM. &#34;The authority has acknowledged that the level of savings required will mean a radical transformation in the way that the library service is currently delivered. Under the recommendations approved today, the service will become a networked &#34;family&#34; of libraries through a partnership with volunteers.&#34; … &#34;The consultation revealed overwhelmingly that the county’s library service is valued highly by North Yorkshire’s residents.  It also revealed that while a majority of people back the idea of volunteers being involved in running libraries, most felt that community-managed libraries would need some dedicated staff input to succeed.&#34;.  Therefore &#34;the larger, busier libraries in Filey, Knaresborough, Pickering, Ripon and Whitby – will retain a 40 per cent staffing level alongside volunteers, an increase on the 25 per cent staffing level originally proposed. &#34; see also Tomorrow is a vital day for North York&#8230;","2015/07/hang-on-weve-seen-this-before-isle-of-wight-north-yorkshire-go-for-round-two.html"],["Isle of Wight","Tue, 07 Jul 2015 21:58:14 +0000","Isle of Wight – Have your say on the future of Isle of Wight libraries - On the Wight. Multiple comments on £280k cut including &#34;How does paying workers nothing (i.e. volunteers) sit with the vote to pay all council workers the living wage?&#34;and &#34;some volunteers [in Bembridge Library] seem more interested in having a cosy chat and playing at libraries than helping customers.&#34;  see also Community called on to support Isle of Wight libraries - Isle of Wight County Press..","2015/07/hang-on-weve-seen-this-before-isle-of-wight-north-yorkshire-go-for-round-two.html"],["Isle of Wight","Tue, 07 Jul 2015 21:58:14 +0000","Isle of Wight – Proposal for more cuts to Isle of Wight library service – BBC. &#34;&#34;Our position is strongly influenced by the national austerity agenda to make the most effective use of the limited resources available to us.&#34; &#34;","2015/07/hang-on-weve-seen-this-before-isle-of-wight-north-yorkshire-go-for-round-two.html"],["Isle of Wight","Tue, 07 Jul 2015 21:58:14 +0000","Isle of Wight – Library Consultation – Isle of Wight Council. &#34;Cowes, Freshwater and Ventnor libraries operate in premises which are shared by and funded by local partners.  This is a third kind of library, a Community Supported Library.  This will be a cross between a full community library, entirely managed and paid for by the community and a full branch library which is entirely funded by the council.&#34;","2015/07/hang-on-weve-seen-this-before-isle-of-wight-north-yorkshire-go-for-round-two.html"],["Stockton on Tees","Tue, 07 Jul 2015 21:58:14 +0000","Stockton on Tees – Billingham Library gets building excellence award – Designing Libraries. &#34;Designed by Stockton-on-Tees Borough Council and built by Stockton-based company Interserve Construction, the state-of-the-art facility sits on the site of the town’s former Art Gallery and council offices. It acts as a ‘one-stop shop’ with new and improved library facilities including the latest in self-service technology, improved ICT and reference facilities combined with customer services for Stockton-on-Tees Borough Council and Thirteen housing group. It also houses a cash office and Billingham Town Council’s headquarters under one roof.&#34;","2015/07/hang-on-weve-seen-this-before-isle-of-wight-north-yorkshire-go-for-round-two.html"],["Staffordshire","Tue, 07 Jul 2015 21:58:14 +0000","Staffordshire – Community urged to step forward and save Barton library - Burton Mail. &#34;Barton Parish Council has raised concerns that the reality of it closing its doors for good, due to council cuts, has not been fully realised by residents. Barton Library in Dunstall Road, is one of 23 across the county which will no longer be staffed by the Staffordshire County Council and instead will need to rely on volunteer help. But as of yet, no one has stepped forward to take on the role, something which is beginning to worry those on the parish council.&#34;","2015/07/hang-on-weve-seen-this-before-isle-of-wight-north-yorkshire-go-for-round-two.html"],["Cheshire West and Chester","Thu, 09 Jul 2015 20:35:46 +0000","Cheshire West and Chester – Read all about it - Re:New. &#34;Chester’s new cultural centre will accommodate a world class library, a café/bar and a new 100-seat cinema screen at the heart of the building.  To the west, a new extension will house the main 500/800-seat theatre and its support spaces, whilst a flexible studio theatre and its dedicated bar will sit on the roofline, with panoramic views over the city. The new, £37m centre opens at the end of 2016, with a home-produced Christmas show.&#34;","2015/07/dedications-all-you-need.html"],["Cornwall","Thu, 09 Jul 2015 20:35:46 +0000","Cornwall – Cornwall’s Libraries Face Being Hived Off – Pirate FM. &#34;A public consultation has taken place on four options and County Hall says the most likely is Option Two: to formally tender for provision of the whole service under a separate organisation &#34;.  Council suggests likely that it will  &#34;formally tender for provision of the whole service under a separate organisation.&#34;. 2000 responses.","2015/07/dedications-all-you-need.html"],["Lincolnshire","Thu, 09 Jul 2015 20:35:46 +0000","Lincolnshire – Lincolnshire residents urged by campaigner to visit their local libraries to find out what is going on - Save Lincolnshire Libraries. &#34;Evidently the County Council plans to close all the so called ‘Tier 3′ libraries over the summer period. If that is true, I am sure you would like to know well in advance when your own local library will close. Will those taking a holiday in the summer return to find their library shut?&#34; … &#34;visit your local library with some urgency, find out what is going on, and please let us know in the comments below. &#34;","2015/07/dedications-all-you-need.html"],["Fife","Thu, 09 Jul 2015 20:35:46 +0000","Fife – Knowledge is power: grassroots campaign in Fife to defend libraries from closure - Common Space. &#34;Speaking to CommonSpace, Alan Mackie, member of the Keep Fife’s Libraries Open campaign, which was formed in response to the threatened closures, stated that &#34;the closure of libraries is ultimately an issue of social justice&#34;. He continued: &#34;Why should our public services suffer for the economic mismanagement of those at the top? Why should a key site of cultural enrichment come into the firing line because of the behaviour and failures of the people who caused economic catastrophe? Bottom line – it shouldn’t.&#34;&#34;","2015/07/dedications-all-you-need.html"],["Lambeth","Thu, 09 Jul 2015 20:35:46 +0000","Lambeth – Lambeth Council delays announcing outcome of Cultural Consultation until September - Brixton Buzz. &#34;Lambeth Council has delayed publishing the outcome of the extensive Cultural Consultation that will decide upon the future of library and leisure services in the borough. We thought that it was odd that the final recommendations didn’t appear in the agenda for the July Cabinet meeting, as was the original aim.&#34;","2015/07/dedications-all-you-need.html"],["Sheffield","Thu, 09 Jul 2015 20:35:46 +0000","Sheffield – Calls to postpone sale of historic library building in Sheffield – Star. &#34;Hundreds of people have signed a petition to postpone the sale of a Sheffield library to a restaurant group. Walkley Library was the only library which had two business plans submitted after Sheffield Council decided to relinquish control of 15 facilities last year – but the rival groups have now united with a new plan. The scheme would lead to part of it becoming a coffee shop and restaurant, with Forum Café Bars, which was behind one of the plans, hoping to buy it and lease areas back so volunteers from Walkley Carnegie Library Group, who were behind the other plan and are currently running the library, can continue to do so.&#34; … &#34;a third group has launched a petition calling for the council to put the sale of the Grade II-listed building on hold until other options are considered – and it has now been signed by 1,862 people.&#34;","2015/07/dedications-all-you-need.html"],["North Yorkshire","Thu, 09 Jul 2015 20:35:46 +0000","North Yorkshire – Libraries plan reduced from a slash to a paper cut - Scarborough News.","2015/07/dedications-all-you-need.html"],["Staffordshire","Thu, 09 Jul 2015 20:35:46 +0000","Staffordshire – Leek residents are being urged to help shape delivery of new vision for County’s Archives Service – Leek News. &#34;People from across the county are being asked to help shape plans to deliver a new vision for the Staffordshire and Stoke on Trent Archive and Heritage Service. The new vision for the service sets out how the ten million historical records, 27,000 objects, 43,000 photographs and 1,800 works of art documenting the county’s past will be preserved and protected for future generations to enjoy. Giving more people access to the service, making more records available online and getting local communities and schools more involved in activities are also outlined in the plans.&#34;","2015/07/dedications-all-you-need.html"],["Staffordshire","Thu, 09 Jul 2015 20:35:46 +0000","Staffordshire – Jobs under threat at Tamworth Library in shake-up – Tamworth Herald. &#34;Although Tamworth is one of the 20 which will remain under county council control, redundancies will be made across the whole service, meaning that it could affect Tamworth. Staff are said to have been briefed on the proposals, although chose not to comment when approached by the Herald.&#34;","2015/07/dedications-all-you-need.html"],["Suffolk","Thu, 09 Jul 2015 20:35:46 +0000","Suffolk – Breaking records at Felixstowe Library - Youtube.  &#34;Felixstowe based record breaker Dean Gould broke two of his own records at Felixstowe Library to inspire pupils from Langer Primary Academy to get involved in this year’s Summer Reading Challenge. The theme of the reading challenge is Record Breakers in 2015.&#34;","2015/07/dedications-all-you-need.html"],["Cardiff","Sun, 12 Jul 2015 21:20:10 +0000","Cardiff – Roath library will not be sold off – but only if community group take it over and keep it as a library - Wales Online. &#34;Roath library will not be sold off but only if a community group agrees to take it over, Cardiff council has said. A plan to sell the Grade II listed building has been shelved as the council looks for a community group who will keep it as a library to be found.&#34; … &#34;Books and computers have been removed from the library, which does not have a working boiler. Including the cost of remedial works to ceilings and the roof, the repairs needed totals £255,340.&#34; … &#34; new mobile van to provide outreach in the Adamsdown and Plasnewydd areas. Digital Inclusion and Into Work services held at Plasnewydd Community Centre and a pop-up library provision will continue as will Storytime and Rhymetime classes that have been moved to the Star centre.&#34;","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["Swindon","Sun, 12 Jul 2015 21:20:10 +0000","Swindon – Flashmob launches summer reading record attempt – Swindon Advertiser. &#34;A flashmov took to Central Library on Saturday afternoon to launch the start of the Summer Reading Challenge – and hope to break some records in the process. The surprise Macarena was taken up by users young and old, as an outreach team and library staff performed in the lobby while pledges to the challenge were taken. The scheme encourages children to read at least six books during the summer holidays – one a week – and is backed this year by the Guinness Book Of World Records. If more than 100,000 pledges are received nationally, the scheme will earn its place in the book.&#34; … &#34;Justin Tomlinson, MP for North Swindon, presided over the pledges at Central Library. &#34;I launch this in Parliament every year as the former chair of the All Party Parliamentary Group for Libraries,&#34;","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["Dudley","Sun, 12 Jul 2015 21:20:10 +0000","Dudley – Three mobile libraries stolen in raid on Dudley site - Express and Star. &#34;The council-owned home library vans, which had books and audio books on board at the time, were stolen from a locked compound. The service, which supports people confined to their own homes in Dudley and Wolverhampton, had to be halted for a day following the thefts.&#34; … &#34;The white Transit vans were emblazoned with the Dudley Council logo and the words ‘Home Library Service. One of the vans has since been recovered. It was found in Hazelbeech Road, West Bromwich at about 9.30am but the other two have not turned up.&#34;","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["North Yorkshire","Sun, 12 Jul 2015 21:20:10 +0000","North Yorkshire – Closed book on changes to libraries - Whitby Gazette. &#34;Over half the amount of people surveyed about proposed changes to the way Whitby Library migbt be run in the future have said they don’t think it will work.&#34; … &#34;This means for Whitby it will be manned by 75% volunteers alongside fewer full time staff.&#34;","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["Wrexham","Sun, 12 Jul 2015 21:20:10 +0000","Wrexham – Progress on plans for trust to run libraries in Wrexham – Leader. &#34;Members of Wrexham Council debated plans to hand over libraries to a trust set up by the council, which could bring in much-needed funding through its charitable status. The move could also save the council £75,000 a year.&#34; … &#34;Much of the debate surrounded the issue of whether or not the council would eventually need to work with other councils in North East Wales in a bid to run its services, with mergers looking increasingly likely.&#34;","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["Dumfries and Galloway","Sun, 12 Jul 2015 21:20:10 +0000","Dumfries and Galloway – Councillors want more details on Kirkcudbright Library move plans - Daily Record. &#34;Councillors want more information about plans to move Kirkcudbright Library due to the costs involved. When members of Stewartry area committee were told about plans to move the library into the council offices on Daar Road they were presented with two options – one costing at least £90,000 and another costing at least £120,000. They agreed to move ahead with the cheaper of the two options which will see the town’s library and customer service facility moved to the ground floor of Daar Road.&#34;","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["Fife","Sun, 12 Jul 2015 21:20:10 +0000","Fife – Fife Council leader accuses SNP of ‘moving the goalposts’ in talks on library closure plans – Courier. &#34;&#34;With the backing of council officers, the trust assured us that it could carry out a proper consultation within these timescales – that was accepted by all parties on the executive,&#34; he said. But SNP group leader Brian Goodall has now said the September report should be viewed as an interim update on ongoing community consultation and a further debate. &#34;We’ll keep up the pressure on the Labour party to allow time to genuinely explore all the options,&#34; he said. Mr Ross said the SNP previously agreed the timetable with the trust to come back with revised proposals. &#34;They now seem to want to extend this indefinitely,&#34; he said.&#34;","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["Poole","Sun, 12 Jul 2015 21:20:10 +0000","Poole – Borough of Poole looks to tackle budget savings - Blackmore Vale magazine. £50k cut considered to delete mobile library. 2 new &#34;community libraries&#34; launched in Bearwood.","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["Leicestershire","Sun, 12 Jul 2015 21:20:10 +0000","Leicestershire – Leicestershire county council upbeat over library handover – BBC. &#34;threatened with closure, officials have said. An appeal for volunteers to run 36 branches was made after the county council said it could not longer afford to staff them. Friday was the deadline to register an interest in taking over one of 12 unallocated libraries. The council expects every branch to have an offer and said enough groups may have come forward to keep all open.&#34;","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["Reading","Sun, 12 Jul 2015 21:20:10 +0000","Reading – Reading council spending cuts: £7m announced and £16m more to come - Get Reading. &#34;After protecting frontline services like libraries in the past, leader of the council Jo Lovelock says these cuts are ‘going to bite’ &#34;. She &#34;admits now that nothing is off limits for cuts, including libraries, public loos and grants to the voluntary sector which have so far been protected.&#34; see also Reading Borough Council could cut 50 jobs – BBC.","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["Reading","Sun, 12 Jul 2015 21:20:10 +0000","Reading – Reading libraries to face a £600,000 cut and a review of buildings - Get Reading. &#34;Leader of the council Councillor Jo Lovelock announcing a range of proposed cuts in the coming year said the review was &#34;really about a better use of our buildings&#34;. &#34; …&#34;She also pointed out that some local authorities had rushed into library closures which would not be happening in Reading.&#34;","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["Sefton","Sun, 12 Jul 2015 21:20:10 +0000","Sefton – Birkdale library to be sold to developers - Visiter. &#34;Sefton’s cabinet met on Friday, when the fate of the former library building was decided. Len Davies, vice chairman of the Friends of Birkdale Library, said : &#34;This is a bad day for the community , school children and the disabled.I would like to say a thank you to the community which has supported FOBL in the past. We have not given up and we will be calling for a public meeting to map out plan B.&#34;&#34;","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["West Lothian","Sun, 12 Jul 2015 21:20:10 +0000","West Lothian – Culture and Leisure Policy Development and Scrutiny Panel - West Lothian Council. £260k 2015/16 cut inc £175k bookfund cut. &#34;Library opening hours will be altered to reflect demand&#34;. Opening hours cut from total of 656 to 526 per week.  Further £46k p.a. cut 2016/17. 4 FTE lost.","2015/07/175-innovations-for-your-public-library-service-and-343-volunteer-libraries.html"],["Anglesey","Tue, 14 Jul 2015 21:54:27 +0000","Anglesey – Anglesey town councils will be asked to take over services as local authority faces further £5m cuts – Daily Post. Libraries not explicitly mentioned.","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Camden","Tue, 14 Jul 2015 21:54:27 +0000","Camden – Is West Hampstead library at risk? - West Hampstead Life. &#34;West Hampstead Library is a vital community asset, sitting in the heart of West Hampstead. It is about so much more than books. As well as lending books, it serves as a space for community groups, hosts IT facilities for those who do not have them at home, and has various other classes and activities for people of all ages. During elections it serves as a polling station. It is also an attractive building with a good presence on the West End Lane high street. Public libraries are among the last indoor spaces in West Hampstead – or indeed anywhere – where you can sit for free. However, its future may be in jeopardy …&#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Peterborough","Tue, 14 Jul 2015 21:54:27 +0000","Peterborough – Peterborough’s landmarks celebrated through free walk and talk trail quiz competition to support literacy – Peterborough Literacy Campaign. &#34;Families are being encouraged to visit Peterborough’s best known landmarks as part of a quiz which aims to improve children’s literacy. The Peterborough Literacy Campaign has teamed up with Peterborough’s cultural services, Vivacity to launch a fun literacy competition for families this summer called the Peterborough walk and talk trail quiz. Following on from the spectacular Peterborough Heritage Festival, the activity celebrates Peterborough’s rich heritage by quizzing families during a fun day out.&#34; … &#34;Museums and libraries are a vital part of children’s education and we hope that the quiz will encourage more families to visit the Peterborough Museum and join their local library. &#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Sheffield","Tue, 14 Jul 2015 21:54:27 +0000","Sheffield – Sheffield library disposal decision to go under further scrutiny – Sheffield Telegraph. &#34;The library was the only one in the city where two rival business plans submitted, but both sides have united with a new plan of sharing the site as a restaurant or cafe as well as a library. &#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Barnet","Tue, 14 Jul 2015 21:54:27 +0000","Barnet – Barnet Childrens’ March for Libraries on 12/9/15 – A call out to all library campaigners/supporters.- Stop the privatisation of public libraries. &#34;This is a call out to all library campaigners and supporters in London and beyond. Bring your banners, placards and voices and show your solidarity with Save Barnet Libraries, Barnet Unison and the children of Barnet on Saturday 12/9/15. We need to unite and fight&#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Gloucestershire","Tue, 14 Jul 2015 21:54:27 +0000","Gloucestershire – CILIP CEO Nick Poole this a.m. talking about volunteer & community-managed libraries – BBC Radio Gloucester. starts 1:07:30.","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Somerset","Tue, 14 Jul 2015 21:54:27 +0000","Somerset – Success story continues – Somerset County Council Newsroom. &#34;The Borough of Poole and Dorset County Council library authorities have become part of the consortium, alongside those of Somerset, Bath & North East Somerset, Bristol City, North Somerset and South Gloucestershire councils. The new Consortium will deliver new and improved services and deliver value for money for all the Authorities. Having more authorities on board gives the consortium more buying power and access to increased collections.&#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Buckinghamshire","Tue, 14 Jul 2015 21:54:27 +0000","Buckinghamshire – What Should Buckingham’s Library Be Like? – Mix 96. &#34;How do you think Buckingham’s library should be set out? £100,000 is being spent on it, creating a new computer area, better children’s library and meeting spaces. The plans are on show at the library from 10 til 2″","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Camden","Tue, 14 Jul 2015 21:54:27 +0000","Camden – Have your say on £800,000 cuts threatening Camden libraries with closure – Ham and High. £800k cut. &#34;Libraries could close, see opening hours slashed, be privatised, or become self-service under cost-saving options to be presented to residents in a 12-week consultation this week&#34; … &#34;Residents will be given four or five options for ways to make cuts to the libraries service. It will consult on the potential closure of any one of its libraries, including Highgate, Swiss Cottage, Kentish Town, West Hampstead, Queen’s Crescent and Camden Town libraries. But Cllr Hai stressed that there is little risk that one of its largest, Swiss Cottage, would close. The council could also save about £200,000 by outsourcing the running of libraries to a private company, an option thought to be unpopular with residents&#34; … &#34;Another option is to base all libraries on the cost-saving model at Highgate Library in Chester Road, where volunteers run the service in partnership with one council staff member.&#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Poole","Tue, 14 Jul 2015 21:54:27 +0000","Poole – Council to consider axing mobile library to save £50k a year – Dorset Echo. &#34;The library bus served almost 300 residents last year – including 125 who use the service provided to sheltered housing schemes, and 141 in areas where there are no branch libraries. It came under threat last year when a consultation saw 59 per cent of home stop respondents, and 56 per cent of public stop residents saying withdrawing the service would have a major effect on them. …&#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Dorset","Tue, 14 Jul 2015 21:54:27 +0000","Dorset – Mobile libraries for the axe as dwindling numbers of residents use them – Dorset Echo. &#34;a decline of 35 per cent in usage over the last seven years.&#34;.  May lose 75 stops. &#34;Less than four people are using the service in some areas and on average less than 10 items are issued per visit. One of the vehicles needs replacing- at a cost of £100,000- and the council says it can’t afford this.&#34; … &#34;The council currently provides a mobile library service to rural and outlying areas of the county, visiting over 250 locations by four mobile libraries. The service fills a gap left after nine libraries were axed in 2011-some were taken over by community groups-in a bid to save £800,000.&#34; To be implemented April 2016. see also Dorset residents to have their say on mobile libraries future - Western Gazette.","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Dorset","Tue, 14 Jul 2015 21:54:27 +0000","Dorset – Don’t begrudge time for toddlers in libraries - Blackmore Vale Magazine. Notes that toddler time is only one hour per week and so the prior complaining letter may be a little bit over the top. See also Visit libraries at another time if you find children annoying - Blackmore Vale Magazine and Ferndown councillor defends multi-use of libraries - Blackmore Vale Magazine. &#34;Libraries have changed and are now social hubs&#34;.","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Haringey","Tue, 14 Jul 2015 21:54:27 +0000","Haringey – Libraries to Take Burden of Dispensing Council Services - Harringay Online. &#34;In a sign of the cash-strapped times in which we live, two of Haringey’s biggest libraries are to become key customer service centres for the Council. With council staff being cut-back and offices closing, Haringey Council took the decision earlier this year to use two of its biggest libraries to offer servives such as parking permits and benefits claims.&#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Lancashire","Tue, 14 Jul 2015 21:54:27 +0000","Lancashire – Lancashire libraries in the running for national awards - Lancashire County Council. &#34;The Get it Loud in Libraries initiative has made it to the finals of the National Lottery Awards 2015. This innovative project, the original idea of libraries cultural youth lead Stewart Parsons, was developed by Lancashire County Council’s Library Service.  It has been shortlisted with six other schemes in the Best Arts Project category. &#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["North Yorkshire","Tue, 14 Jul 2015 21:54:27 +0000","North Yorkshire – Kirkbymoorside doesn’t need a library – Kirkbymoorside Blog. &#34;When printing was invented, did scholars rejoice? No, they did not. Back in the fourteenth century, they feared that access to the printed word would stop rote learning, which was the only way really to know and understand a work. If you could just look it up, where was the learning in that? By analogy, we are here at another great tipping point in the availability of literature, information, and yes, dross. Older folk – I’m one – love the smell, feel, and reliability of the printed word, but it is in decline, and rightly so. Today’s children, brought up with computers, will consider print as out dated as parchment. So don’t be a Luddite, face the future, acknowledge change, and say good bye to the local library, which was wonderful in its day, but that day is now over.&#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Worcestershire","Tue, 14 Jul 2015 21:54:27 +0000","Worcestershire – Council accused of &#34;ducking and diving&#34; over mobile library reductions – Worcester News. &#34;A fresh report has been published looking back on the last year within the library service during a time of unprecedented change. The report, which includes all the responsibilities under Councillor Lucy Hodgson, the cabinet member for localism and communities, makes no mention of February’s changes which saw 38 per cent of mobile library stops deleted.&#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Camden","Thu, 16 Jul 2015 21:03:26 +0000","Camden – 600 sign petition to save West Hampstead Library as Camden consults on closures – Ham and High. &#34;The admission has prompted nearly 600 people in West Hampstead in just five days to sign a petition opposing the proposed closure of their library, while many others across the borough have also rallied against the plans. West Hampstead Labour councillor Phil Rosenberg, who launched the petition last week, said: &#34;We understand the council has to make cuts with their funding slashed by 50 per cent, which is hard for anyone to stomach, but closure should not be an option.&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Cardiff","Thu, 16 Jul 2015 21:03:26 +0000","Cardiff – Do right thing and reopen city library – Wales Online. &#34;The fate of Roath Library is due to be decided tomorrow during a cabinet meeting. There will be a protest outside from 3pm, as we try to put some brakes on this process, where our local stand-alone libraries are systematically removed from the cultural landscape. There are deep and widely held concerns regarding the efficacy of the process so far.&#34; … &#34;Their local library was abruptly closed a fortnight before consultation began – with no information, planned continuation of service, or sign on the door, for three months. The lack of awareness was then used to imply low interest (page 36 item 5) in the cabinet report, when this was not true. Subsequent petitions calling for the refurbishment and re-opening of Roath Library, or an equivalent service, garnered 1,000-plus signatures within four weeks.&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Lincolnshire","Thu, 16 Jul 2015 21:03:26 +0000","Lincolnshire – County council refuses to reconsider its plans to get rid of staff from libraries – Save Lincolnshire Libraries. &#34;On Tuesday 21st July the High Court in London will once again hear the case against Lincolnshire County Council’s plans to get rid of staff from most of its libraries … Speaking on behalf of Save Lincolnshire Libraries, John Hough said &#34;We appeal to the County Council even at this late hour to discuss with Simon Draper and Save Lincolnshire Libraries a way out of legal proceedings that are costly and unnecessary. &#34;Despite repeated attempts to get the Council to come to the table to discuss the issues they have refused to engage with the people of Lincolnshire on finding a way forward for the library service that offers an alternative to closure or to withdrawing valued and experienced staff from the existing libraries.&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Lincolnshire","Thu, 16 Jul 2015 21:03:26 +0000","Lincolnshire – Lincolnshire library cuts in High Court once more – Rutland and Stamford Mercury. &#34;Despite repeated attempts to get the council to come to the table to discuss the issues they have refused to engage with the people of Lincolnshire on finding a way forward for the library service that offers an alternative to closure or to withdrawing valued and experienced staff from the existing libraries.&#34; … The council’s executive member for libraries Nick Worth (Con) said the council had prepared &#34;the strongest possible defence.&#34; He added: &#34;In the meantime, we’ll continue to implement our plans to create a new-look library service, including working with local groups to develop the network of community hubs.&#34;&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Wolverhampton","Thu, 16 Jul 2015 21:03:26 +0000","Wolverhampton – New round of cuts for Wolverhampton: Libraries and children’s services in the firing line – Express and Star. &#34;Hundreds of jobs will go under the latest measures being drawn up as part of five years worth of austerity measures to save £134 million, as councillors warned ‘there is more pain to come’.&#34; … &#34;The measures will see the city’s 16 libraries, most of which have already lost staff and had their opening hours scaled back, lose a further £500,000 of their remaining £1.7m a year funding. Councillors have warned that even Central Library, which has so far been spared the same fate as smaller branches, may also have its opening hours reduced along with others facing the axe again. They appealed to volunteers to come forward to save services but cuts already imposed have not resulted in enough people coming forward to help branches to re-open full time.&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Cardiff","Thu, 16 Jul 2015 21:03:26 +0000","Cardiff – Anger as 10,000 damaged books from Roath library are ‘pulped’ by council - Wales Online. &#34;Cardiff council say the books at the library, which is in the city’s Adamsdown ward, were damaged after a ceiling collapse and leak. But campaigners say it shows a lack of respect and dispute all the books were so badly damaged they had to be destroyed.&#34; … &#34;The council said the market value of the books was just 28 pence each, as that was the price it received on average when it sold second-hand books, giving the entire collection a value of £2,800.&#34; [This is a very low value – normally one would expect replacement value, in which case assume £5-10 per book – Ed.]","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Derby","Thu, 16 Jul 2015 21:03:26 +0000","Derby – Crunch talks with Government over Derby City Council debt - Derby Telegraph.  Libraries may be &#34;affected by the cuts&#34; and &#34;paring down the bare minimum&#34; of statutory services. Consultation.","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Staffordshire","Thu, 16 Jul 2015 21:03:26 +0000","Staffordshire – Penkridge Library campaigners urge residents to have say on opening hours and mobile library - Staffordshire Newsletter. &#34;Campaigners fighting for Penkridge’s libraries will hold their own information events over the summer amid fears not enough people know they could lose services. Earlier this month Staffordshire County Council launched two consultations on the future of opening hours at the library. But there is also a consultation at the same time on the future of mobile library services, which could see Penkridge losing out. Both will run until September.&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Dorset","Thu, 16 Jul 2015 21:03:26 +0000","Dorset – Doreet joins LibrariesWest Consortium - Dorset County Council. &#34;From Spring 2016, anyone with a library card will be able to search and reserve items via a shared catalogue, as well as borrow and return items in over 140 libraries stretching from Porlock to Poole and Bristol to Bridport.&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Vale of Glamorgan","Thu, 16 Jul 2015 21:03:26 +0000","Vale of Glamorgan – ‘Libraries are a necessity to the community&#39;: Campaigners set to take their fight to save Rhoose Library to court - Wales Online. &#34;The Save Rhoose Library campaign group believes there are &#34;significant flaws&#34; in the way the Vale of Glamorgan Council carried out its consultation over the future of the library. The group has secured legal aid for a judicial review of the council’s actions and is preparing to challenge the authority in the High Court. The campaigners claim alternative ways of achieving budget savings were not adequately considered. Under the council’s strategy review, councillors voted to close Rhoose library as part of a budget-saving plan, unless volunteers come forward to take over the library and run it as a community-funded service.&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Lincolnshire","Thu, 16 Jul 2015 21:03:26 +0000","Lincolnshire – Lincolnshire library campaigners head to high court – BookSeller. &#34;The Stamford Mercury said Lincoln resident Simon Draper, acting on behalf of Save Lincolnshire Libraries, will be in the High Court on Tuesday and Wednesday (21st-22nd) July to fight the council’s decision to stop funding 32 of its 47 libraries. Labour county councillor John Hough, speaking on behalf of campaigners, said: &#34;We appeal to the county council even at this late hour to discuss with Simon Draper and Save Lincolnshire Libraries a way out of legal proceedings that are costly and unnecessary.&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Worcestershire","Thu, 16 Jul 2015 21:03:26 +0000","Worcestershire – Council accused of &#34;ducking and diving&#34; over mobile library reductions – Malvern Gazette. &#34;The report, which includes all the responsibilities under Councillor Lucy Hodgson, the cabinet member for localism and communities, makes no mention of February’s changes which saw 38 per cent of mobile library stops deleted. At the time, bosses decided to reduce the number of stops from 420 to 267 and visit each area once every month instead of every three weeks to save cash. The report does not detail those events but does highlight how the council has allowed community groups to take over the running of some libraries, which has been credited with no closures taking place.&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["North Yorkshire","Thu, 16 Jul 2015 21:03:26 +0000","North Yorkshire – Campaigners win battle to save Norton Library from closure – Gazette and Herald. &#34;The library was given community status by North Yorkshire County Council at a meeting to debate the future of libraries across the county last week. A steering group was set up earlier this year to help transform the library in Commercial Street into a community hub ahead of financial cuts from the county council.&#34; … &#34;They would also be providing a temporary pop-up café in the library throughout August on the days and hours that the library is normally open. &#34; … &#34;However, the mayor of Kirkbymoorside Councillor Chris Dowie said she was very disappointed with the decision to turn the town’s library into one funded and run by the community. &#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["North Yorkshire","Thu, 16 Jul 2015 21:03:26 +0000","North Yorkshire – Libraries are for all ages - Blackmore Vale Magazine. Mother or rhymetimer says sessions are there to instil love of reading.","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Swindon","Thu, 16 Jul 2015 21:03:26 +0000","Swindon – MP helps to launch primary school reading campaign – Swindon Advertiser. &#34;North Swindon MP Justin Tomlinson is urging youngsters to join this year’s Summer Reading Challenge, which launched on Saturday(July11).&#34; … &#34;&#34;I hope parents, grandparents and carers in North Swindon will take their children to the library over the summer to pledge their support for children’s reading and sign up for the Summer Reading Challenge. It’s free, inclusive and makes reading fun – a vital ingredient in building literacy. Last year 3578 children in Swindon took part in the Challenge. I hope we can increase that number this year, show local libraries what a valuable asset they are to us and our community and help set a world record at the same time.&#34; &#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Bristol","Sun, 19 Jul 2015 20:07:59 +0000","Bristol – Fresh proposals for the future of Bristol’s library service have been revealed – Bristol Council. &#34;&#34;Our network of libraries is vitally important to the city, but we must make sure we continue to improve and modernise the service, to best serve the people of Bristol. There are a number of innovative proposals, including smart card access to allow greater community access and improve usage across the city.&#34;","2015/07/bristol-u-turn.html"],["Central Bedfordshire","Sun, 19 Jul 2015 20:07:59 +0000","Central Bedfordshire – Mobile library service ‘at risk’  in consultation – Biggleswade Today. £37k cut. &#34;There were 241 regular users of the service in 2014/15. The Council needs to develop capacity to meet the increasing need for the Housebound Service in line with the growing and ageing population. Its’ preferred option is to stop providing the mobile library vehicle ‘walk-on’ service and focus on providing book bundles.&#34; Consultation.","2015/07/bristol-u-turn.html"],["Liverpool","Sun, 19 Jul 2015 20:07:59 +0000","Liverpool – Sefton Park library’s crime section left empty after ‘mass borrowing’ – Liverpool Echo. &#34;Lovers of ‘crime’ novels were faced with a mystery at a Liverpool library after all the genre’s books &#34;disappeared&#34; from the shelves. The crime books vanished from the shelves after Sefton Park library’s ‘Crime Section’ was targeted in &#34;a mass borrowing&#34; by members of the Save Liverpool Libraries campaign. Campaigners say the wanted to highlight the wait to hear what the council plans for the city’s libraries. But Liverpool Mayor Joe Anderson hit back at the campaigners. He said: &#34;It is a shame they didn’t check out some Economic books and learnt about the devastating impact of losing 58% of funding from Government on services such as social care. I pledged to keep all the libraries open and they are all still open.&#34;&#34;","2015/07/bristol-u-turn.html"],["Bristol","Sun, 19 Jul 2015 20:07:59 +0000","Bristol – Plans to close seven Bristol libraries revised – BBC. &#34;Six of seven libraries in Bristol which were to be closed to save money could remain open, it has been revealed. Bristol City Council wanted to save £1.1m from its 2016-17 library budget, but following protests Mayor George Ferguson has made &#34;fresh proposals&#34;. Now six libraries could remain open, with reduced staff and opening hours, with just Eastville library facing closure or relocation. Mr Ferguson said it was &#34;positive&#34; but &#34;no decision has yet been made&#34;.&#34; … &#34;Assistant Mayor Daniella Radice said the response from a recent consultation on the future of the city’s library service had indicated users wanted to keep all 27 open.&#34; See also Under-threat Bristol libraries saved but opening hours face cut - Bristol Post.","2015/07/bristol-u-turn.html"],["Cardiff","Sun, 19 Jul 2015 20:07:59 +0000","Cardiff – Roath library campaigners ask again for the building to be saved as councillors discuss its future – Wales Online. &#34;Members of the Save Roath Library group waited outside Cardiff’s City Hall on Thursday as a meeting of Cardiff council’s Cabinet was held inside. They carried messages such as ‘I love libraries’ and ‘Give us back our 10,000 books’ as councillors discussed the future of Roath Library inside. It came after revelations that 10,000 books from the library had been destroyed by Cardiff council after being damaged when a ceiling collapsed. Many people also left messages at the entrance of Roath library. One read: &#34;State Policy: Neglect, Dismantle, Sell.&#34; … &#34;Coun Bradbury said the preferred option was for a community group to take over the building but that they would consider any offer, even from a private company.&#34;","2015/07/bristol-u-turn.html"],["Fife","Sun, 19 Jul 2015 20:07:59 +0000","Fife – New chapter in Fife library library row – Courier. &#34;Fife Council has been accused of using Fife Cultural Trust as a &#34;front&#34; in the row over library closures … a member of the Scottish Youth Parliament has hit out at the local authority’s lack of transparency over what he called the &#34;lifeline&#34; libraries afford the most vulnerable in society. Backing a campaign to save the libraries, Lewis Akers said: &#34;The consultation from the start has been flawed.&#34;","2015/07/bristol-u-turn.html"],["Lincolnshire","Sun, 19 Jul 2015 20:07:59 +0000","Lincolnshire – Lincolnshire libraries given date of when they will open as community hubs – Lincolnshire Echo. &#34;Ermine Library is set to be the first of the Lincoln libraries to close and reopen as a community hub.&#34; … &#34;Some of the other libraries to open as community hubs in the near future are reported to be Sutton-on-Sea, on July 27, and Birchwood, on August 17. In July last year, a High Court judge threw out the council’s original libraries plan, which included turning 30 libraries into community-hubs.&#34; [NB: &#34;community hub&#34; in this case means volunteer-run and staffed – Ed.]","2015/07/bristol-u-turn.html"],["Poole","Sun, 19 Jul 2015 20:07:59 +0000","Poole – Axed mobile library leaves residents ‘with no alternative’ – Bournemouth Echo. &#34;axing of Poole’s mobile library has been described as a &#34;very sad day&#34; by a councillor whose Merley residents are among those to be left without any alternative provision. Cllr David Brown, who fought to retain the vehicle which costs taxpayers £50,000 a year, said it visited three stops in Merley every fortnight and two sheltered housing complexes.&#34;","2015/07/bristol-u-turn.html"],["Surrey","Sun, 19 Jul 2015 20:07:59 +0000","Surrey – New library and community centre opens in Cobham – Surrey News (Council webpage). &#34;Cobham Library has reopened in a spacious new building which also offers a range of community services. The revamped library is part of the new Cedar Centre in Cedar Road – a busy community hub which also boasts a children’s centre, meeting spaces, information drop-in sessions and coffee facilities.&#34; … &#34;Surrey County Council runs the centre in conjunction with a not-for-profit group made up of members of the community, helping ensure that services offered are responsive to local needs. The council operates the library but leases the rest of the building to Cobham Cedar Centre Limited, an innovative social enterprise run ‘by the community for the community’&#34; … &#34;‘The way people use libraries is changing which is why it’s so important we continue to adapt and improve our library service, while the social enterprise which runs the community hub at the Cedar Centre is a great example of the community pulling together to help shap&#8230;","2015/07/bristol-u-turn.html"],["Wrexham","Sun, 19 Jul 2015 20:07:59 +0000","Wrexham – Record Breaking Attempt at Wrexham Library – Wrexham.com. &#34;To encourage the children who attend our record breaking attempt children will be offered the chance to meet other successful record breakers in Wrexham Library on Monday 20th July from 11.00am – 11.30am. Sasha Kenny a Guinness World Record holder of Hoolanation, is confirmed to be a guest in attendance during the event.&#34;","2015/07/bristol-u-turn.html"],["Bristol","Wed, 22 Jul 2015 22:23:07 +0000","Bristol – Bristol libraries could be saved after council u-turn – BookSeller. &#34;A consultation on the future of the city’s library service closed at the beginning of July, with more than 4,600 responses being received. The council wanted to save £1.1m from its library budget for 2016/17, and had proposed shutting libraries in Clifton, Redland, Sea Mills, Marksbury Road in Bedminster, Westbury, Wick Road in Brislington and Eastville. But mayor George Ferguson has already said &#34;fresh proposals&#34; have been made, reported the BBC, which say Eastville could close or relocate, while the other six libraries could remain open, although with reduced staff and opening hours.&#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Lincolnshire","Wed, 22 Jul 2015 22:23:07 +0000","Lincolnshire – Lincolnshire library plans ‘perverse’ High Court told - BookSeller. &#34;Lincolnshire library campaigners have called the council’s aim of transforming its library service &#34;perverse&#34; at the High Court.  Lincoln resident Simon Draper, acting on behalf of Save Lincolnshire Libraries, was in the High Court yesterday and today (21st-22nd July) with his counsel Fionnuala McCredie QC, to fight the council’s decision to stop funding 32 of its 47 libraries.  He had already won a court victory last year, when the High Court quashed the plans for library cuts.. However, Draper launched a new offensive this year because the council proposed the same cuts in January.&#34; … &#34;In response, Nigel Giffin QC, speaking for Lincolnshire Council, said the reorganisation scheme was already well advanced and many members of library staff had been handed their redundancy notices.&#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Wirral","Wed, 22 Jul 2015 22:23:07 +0000","Wirral – Fewer people using Wirral libraries since opening hours were cut - Liverpool Echo. &#34;The figures show that since then the libraries have seen the average number of visits fall from almost 8,000 to less than 5,000, while the average number of loans has dropped from 5,535 to 3,750. The figures included in a report to the council’s transformation and resources committee also showed the &#34;hourly use&#34; had risen by 45% and the report said libraries were now &#34;more efficient&#34;.","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Cornwall","Wed, 22 Jul 2015 22:23:07 +0000","Cornwall – Decision Delayed On Future Of Cornwall’s Libraries – Pirate FM. &#34;Following consultation and engagement on the review of the Library and One Stop Shop service, the Communities Policy Advisory Committee (PAC) met on Friday 17 July to consider the report and recommendation (option 2) to formally procure a service provider for the whole Face to Face (Library/One Stop Shop) service. However, having discussed the issue in detail, the PAC is instead recommending that further work is done (in line with Option 3 in the report) before a decision is made on the future delivery of the library and one stop shop service&#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Kirklees","Wed, 22 Jul 2015 22:23:07 +0000","Kirklees – You are vital to keeping your library running: results of survey on Kirklees Council libraries show public involvement is key for future – Huddersfield Daily Examiner. &#34;More than 5,000 people have had a say on the future of library services in Kirklees. The results of a major public consultation show support for community involvement in maintaining local libraries ahead of £1.8m cuts to Kirklees Council’s budget. It leaves a budget of £3.9 million – still some way off the £6m budget the library service once had. So the council is exploring how volunteers can help support library services – with 59% in favour of local libraries having one paid member of staff working with local volunteers. But if local libraries were to close, the service could lose 46% of its users.&#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Cornwall","Wed, 22 Jul 2015 22:23:07 +0000","Cornwall – Do You Fancy Running Cornwall’s Leisure Services? - Pirate FM. &#34;Cornwall Council is inviting organisations interested in running its leisure services to take part in a soft market test from 20 July to 21 August 2015. The Council wants to hear from community groups, other public sector organisations and businesses about how they could help deliver its ambition for a sustainable network of leisure facilities for residents and visitors, within the reduced annual leisure subsidy.&#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Shropshire","Wed, 22 Jul 2015 22:23:07 +0000","Shropshire – Star comment: Plight of library is a timely reminder – Shropshire Star.  &#34;The savings made at Bishop’s Castle Library are a drop in the ocean. However, the impact they will have is vast. Libraries are particularly important in rural areas. They provide community cohesion, a space for people to meet and they also supply IT equipment to those without access to it.&#34; … &#34;Of course, there are no economic data systems that show the value of our libraries. While accountants can compute the value of, say, a new road or HS2, equations to show the value of libraries are not so easily found.&#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Shropshire","Wed, 22 Jul 2015 22:23:07 +0000","Shropshire – Residents’ views sought on proposals for Bishop’s Castle Library – Shropshire Newsroom / Council. &#34;The proposals detailed within the consultation document, which people are being asked to respond to are: (1) Transferring the day-to-day running of the library to Enterprise South West Shropshire. This means the library will remain in its existing location and opening times will not be affected. Existing library staff will transfer to Enterprise South West Shropshire, who will continue to provide the same range of services currently available. (2) The library remaining under council management, with reduced opening hours. There is also an opportunity for residents to suggest other sustainable and cost-effective alternatives the council should consider for the future delivery of the library service in Bishop’s Castle.&#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Dumfries and Galloway","Wed, 22 Jul 2015 22:23:07 +0000","Dumfries and Galloway – A temporary Kirkcudbright library is set to cost as much as £157,000 as it moves from sheriff court – Daily Record. &#34;Councillors were told that plans for the interim facility could cost £157,000 – just a month after a £90,000 price tag had been suggested for the same Daar Road project. Members of the Stewartry area committee were told that the potential bill had risen sharply since they’d agreed to place the library on the ground floor of the building last month. Councillor Wyper told the meeting last Wednesday: &#34;We thought £90,000 was a lot of money for a temporary library – now it’s £150,000!&#34;&#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Lincolnshire","Wed, 22 Jul 2015 22:23:07 +0000","Lincolnshire – Libraries – Council jumping gun - Market Rasen Mail. &#34;It seems that the County Council plans to close the so called ‘Tier 3’ libraries over the summer period … I suggest that your readers visit their local library to find out what is going on. Please thank the staff for their service and wish them well for the future.&#34; see also Lincolnshire campaigners head to London to seek legal challenge over libraries shake-up - Lincolnshire Echo. &#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Fife","Wed, 22 Jul 2015 22:23:07 +0000","Fife – Young campaigner urges public to fight for future of libraries – Central Fife Times. &#34;Libraries threatened with the axe have been given a temporary reprieve while a public consultation is carried out, but MYSP Lewis Akers, from Dunfermline, is keen that people across Fife make their voices heard. He said this week that an online petition against any closures had already received 4000 signatures and he urged people through the Cowdenbeath-Lochgelly area to join the campaign and back the petition&#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Kirklees","Wed, 22 Jul 2015 22:23:07 +0000","Kirklees – Debate on plans to close libraries in Cleckheaton, Birstall and Heckmondwike – Telegraph and Argus. &#34;Just over half of the respondents agreed the local community should take a more active role in running libraries, but only 18 per cent said they would be willing to volunteer. Opinions were mixed as to whether moving services into community facilities would be acceptable.&#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Birmingham","Sat, 25 Jul 2015 21:34:29 +0000","Birmingham – Google offers boost to troubled Library of Birmingham - Birmingham Post. &#34;Technology giant Google is launching a venture at the Library of Birmingham as plans gather pace to build a new future for the £188 million building. The Silicon Valley giant has chosen the landmark building as the first UK site for a groundbreaking initiative working with businesses called Google Digital Garages. Part of the library, which recently saw its hours slashed in council budget cuts, will be given up for a new area offering the digital training for the skills small and medium-sized businesses need to thrive. It will open its doors on Monday. Coun Penny Holbrook, Birmingham City Council’s cabinet member for skills, learning and culture, said Google’s arrival was a shot in the arm for the library after 100 staff were axed and opening hours cut.&#34;","2015/07/a-look-at-the-ridiculous-theres-more-libraries-now-claim-plus-also-chris-riddell-cartoon-the-grace-of-libraries.html"],["Brent","Sat, 25 Jul 2015 21:34:29 +0000","Brent – What will be in the New Willesden Library Centre? - James Powney’s Blog. &#34;Unlike other Brent libraries, Willesden is promised to open from 9am on week days (the rest open from 10am)&#34;… lists items like 66 public computers and 14 iPads. &#34; The library also has a cafe, which is one of the features that makes Wembley Library such a success.  &#34;","2015/07/a-look-at-the-ridiculous-theres-more-libraries-now-claim-plus-also-chris-riddell-cartoon-the-grace-of-libraries.html"],["Camden","Sat, 25 Jul 2015 21:34:29 +0000","Camden – Camden library campaigners celebrate small victory in fight against closures – Ham and High. &#34;Libraries chief Cllr Abdul Hai this week admitted that not enough work has yet been done to research alternative cost-saving measures as Camden Council looks to make £800,000 worth of cuts to the libraries service to help plug a £70 million funding gap. The cabinet member for customers, communities and culture has now agreed to develop its ongoing research into alternatives to closures, after speaking to the leader of the campaign to save West Hampstead Library, Labour councillor Phil Rosenberg.&#34;","2015/07/a-look-at-the-ridiculous-theres-more-libraries-now-claim-plus-also-chris-riddell-cartoon-the-grace-of-libraries.html"],["Fife","Sat, 25 Jul 2015 21:34:29 +0000","Fife – Campaign launched to save Kinghorn library from closure – Fife Today. &#34;Led by local councillor George Kay, the high awareness campaign aims to gain the support of the people of the town to challenge the proposal by Fife Cultural Trust to close the facility as part of an £800,000 money saving package.&#34; … &#34;&#34;Questions asked by myself have shown that Kinghorn uses less than £20,000 a year to provide what should be seen as a necessity of life. The library is not just about books, but about jobs, about social interaction and about a healthy barometer of the life of the Kinghorn community.&#34;","2015/07/a-look-at-the-ridiculous-theres-more-libraries-now-claim-plus-also-chris-riddell-cartoon-the-grace-of-libraries.html"],["Poole","Sat, 25 Jul 2015 21:34:29 +0000","Poole – Axed mobile library to be used at school for next three years – Bournemouth Echo. &#34;Concerns have been raised about Poole’s mobile library, which is to be taken off the road and used as a static library at a Wallisdown school. Residents in the area were among those left without any provision after the axing of the vehicle which will save Borough of Poole £50,000 a year.&#34;. Library service manager says &#34;&#34;By placing the vehicle permanently at Talbot Primary School we will be able to save these costs, whilst at the same time providing a community library for residents in the Wallisdown area.&#34;","2015/07/a-look-at-the-ridiculous-theres-more-libraries-now-claim-plus-also-chris-riddell-cartoon-the-grace-of-libraries.html"],["Cornwall","Wed, 22 Jul 2015 22:23:07 +0000","Cornwall – Do You Fancy Running Cornwall’s Leisure Services? – Pirate FM. &#34;Cornwall Council is inviting organisations interested in running its leisure services to take part in a soft market test from 20 July to 21 August 2015. The Council wants to hear from community groups, other public sector organisations and businesses about how they could help deliver its ambition for a sustainable network of leisure facilities for residents and visitors, within the reduced annual leisure subsidy.&#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Camden","Tue, 14 Jul 2015 21:54:27 +0000","Camden – Is West Hampstead library at risk? – West Hampstead Life. &#34;West Hampstead Library is a vital community asset, sitting in the heart of West Hampstead. It is about so much more than books. As well as lending books, it serves as a space for community groups, hosts IT facilities for those who do not have them at home, and has various other classes and activities for people of all ages. During elections it serves as a polling station. It is also an attractive building with a good presence on the West End Lane high street. Public libraries are among the last indoor spaces in West Hampstead – or indeed anywhere – where you can sit for free. However, its future may be in jeopardy …&#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Haringey","Tue, 14 Jul 2015 21:54:27 +0000","Haringey – Libraries to Take Burden of Dispensing Council Services – Harringay Online. &#34;In a sign of the cash-strapped times in which we live, two of Haringey’s biggest libraries are to become key customer service centres for the Council. With council staff being cut-back and offices closing, Haringey Council took the decision earlier this year to use two of its biggest libraries to offer servives such as parking permits and benefits claims.&#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Bristol","Sun, 19 Jul 2015 20:07:59 +0000","Bristol – Plans to close seven Bristol libraries revised – BBC. &#34;Six of seven libraries in Bristol which were to be closed to save money could remain open, it has been revealed. Bristol City Council wanted to save £1.1m from its 2016-17 library budget, but following protests Mayor George Ferguson has made &#34;fresh proposals&#34;. Now six libraries could remain open, with reduced staff and opening hours, with just Eastville library facing closure or relocation. Mr Ferguson said it was &#34;positive&#34; but &#34;no decision has yet been made&#34;.&#34; … &#34;Assistant Mayor Daniella Radice said the response from a recent consultation on the future of the city’s library service had indicated users wanted to keep all 27 open.&#34; See also Under-threat Bristol libraries saved but opening hours face cut – Bristol Post.","2015/07/bristol-u-turn.html"],["Vale of Glamorgan","Thu, 16 Jul 2015 21:03:26 +0000","Vale of Glamorgan – ‘Libraries are a necessity to the community&#39;: Campaigners set to take their fight to save Rhoose Library to court – Wales Online. &#34;The Save Rhoose Library campaign group believes there are &#34;significant flaws&#34; in the way the Vale of Glamorgan Council carried out its consultation over the future of the library. The group has secured legal aid for a judicial review of the council’s actions and is preparing to challenge the authority in the High Court. The campaigners claim alternative ways of achieving budget savings were not adequately considered. Under the council’s strategy review, councillors voted to close Rhoose library as part of a budget-saving plan, unless volunteers come forward to take over the library and run it as a community-funded service.&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Lancashire","Tue, 14 Jul 2015 21:54:27 +0000","Lancashire – Lancashire libraries in the running for national awards – Lancashire County Council. &#34;The Get it Loud in Libraries initiative has made it to the finals of the National Lottery Awards 2015. This innovative project, the original idea of libraries cultural youth lead Stewart Parsons, was developed by Lancashire County Council’s Library Service.  It has been shortlisted with six other schemes in the Best Arts Project category. &#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Birmingham","Sat, 25 Jul 2015 21:34:29 +0000","Birmingham – Google offers boost to troubled Library of Birmingham – Birmingham Post. &#34;Technology giant Google is launching a venture at the Library of Birmingham as plans gather pace to build a new future for the £188 million building. The Silicon Valley giant has chosen the landmark building as the first UK site for a groundbreaking initiative working with businesses called Google Digital Garages. Part of the library, which recently saw its hours slashed in council budget cuts, will be given up for a new area offering the digital training for the skills small and medium-sized businesses need to thrive. It will open its doors on Monday. Coun Penny Holbrook, Birmingham City Council’s cabinet member for skills, learning and culture, said Google’s arrival was a shot in the arm for the library after 100 staff were axed and opening hours cut.&#34;","2015/07/a-look-at-the-ridiculous-theres-more-libraries-now-claim-plus-also-chris-riddell-cartoon-the-grace-of-libraries.html"],["Lincolnshire","Wed, 22 Jul 2015 22:23:07 +0000","Lincolnshire – Libraries – Council jumping gun – Market Rasen Mail. &#34;It seems that the County Council plans to close the so called ‘Tier 3’ libraries over the summer period … I suggest that your readers visit their local library to find out what is going on. Please thank the staff for their service and wish them well for the future.&#34; see also Lincolnshire campaigners head to London to seek legal challenge over libraries shake-up – Lincolnshire Echo. &#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["Derby","Thu, 16 Jul 2015 21:03:26 +0000","Derby – Crunch talks with Government over Derby City Council debt – Derby Telegraph.  Libraries may be &#34;affected by the cuts&#34; and &#34;paring down the bare minimum&#34; of statutory services. Consultation.","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Dorset","Tue, 14 Jul 2015 21:54:27 +0000","Dorset – Don’t begrudge time for toddlers in libraries – Blackmore Vale Magazine. Notes that toddler time is only one hour per week and so the prior complaining letter may be a little bit over the top. See also Visit libraries at another time if you find children annoying – Blackmore Vale Magazine and Ferndown councillor defends multi-use of libraries – Blackmore Vale Magazine. &#34;Libraries have changed and are now social hubs&#34;.","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Cardiff","Thu, 16 Jul 2015 21:03:26 +0000","Cardiff – Anger as 10,000 damaged books from Roath library are ‘pulped’ by council – Wales Online. &#34;Cardiff council say the books at the library, which is in the city’s Adamsdown ward, were damaged after a ceiling collapse and leak. But campaigners say it shows a lack of respect and dispute all the books were so badly damaged they had to be destroyed.&#34; … &#34;The council said the market value of the books was just 28 pence each, as that was the price it received on average when it sold second-hand books, giving the entire collection a value of £2,800.&#34; [This is a very low value – normally one would expect replacement value, in which case assume £5-10 per book – Ed.]","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Dorset","Thu, 16 Jul 2015 21:03:26 +0000","Dorset – Doreet joins LibrariesWest Consortium – Dorset County Council. &#34;From Spring 2016, anyone with a library card will be able to search and reserve items via a shared catalogue, as well as borrow and return items in over 140 libraries stretching from Porlock to Poole and Bristol to Bridport.&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Staffordshire","Thu, 16 Jul 2015 21:03:26 +0000","Staffordshire – Penkridge Library campaigners urge residents to have say on opening hours and mobile library – Staffordshire Newsletter. &#34;Campaigners fighting for Penkridge’s libraries will hold their own information events over the summer amid fears not enough people know they could lose services. Earlier this month Staffordshire County Council launched two consultations on the future of opening hours at the library. But there is also a consultation at the same time on the future of mobile library services, which could see Penkridge losing out. Both will run until September.&#34;","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Brent","Sat, 25 Jul 2015 21:34:29 +0000","Brent – What will be in the New Willesden Library Centre? – James Powney’s Blog. &#34;Unlike other Brent libraries, Willesden is promised to open from 9am on week days (the rest open from 10am)&#34;… lists items like 66 public computers and 14 iPads. &#34; The library also has a cafe, which is one of the features that makes Wembley Library such a success.  &#34;","2015/07/a-look-at-the-ridiculous-theres-more-libraries-now-claim-plus-also-chris-riddell-cartoon-the-grace-of-libraries.html"],["Barnet","Tue, 14 Jul 2015 21:54:27 +0000","Barnet – Barnet Childrens’ March for Libraries on 12/9/15 – A call out to all library campaigners/supporters.– Stop the privatisation of public libraries. &#34;This is a call out to all library campaigners and supporters in London and beyond. Bring your banners, placards and voices and show your solidarity with Save Barnet Libraries, Barnet Unison and the children of Barnet on Saturday 12/9/15. We need to unite and fight&#34;","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Dorset","Tue, 14 Jul 2015 21:54:27 +0000","Dorset – Mobile libraries for the axe as dwindling numbers of residents use them – Dorset Echo. &#34;a decline of 35 per cent in usage over the last seven years.&#34;.  May lose 75 stops. &#34;Less than four people are using the service in some areas and on average less than 10 items are issued per visit. One of the vehicles needs replacing- at a cost of £100,000- and the council says it can’t afford this.&#34; … &#34;The council currently provides a mobile library service to rural and outlying areas of the county, visiting over 250 locations by four mobile libraries. The service fills a gap left after nine libraries were axed in 2011-some were taken over by community groups-in a bid to save £800,000.&#34; To be implemented April 2016. see also Dorset residents to have their say on mobile libraries future – Western Gazette.","2015/07/cuts-in-camden-more-details-on-losses-in-bucks-dorset-and-worcs.html"],["Wirral","Wed, 22 Jul 2015 22:23:07 +0000","Wirral – Fewer people using Wirral libraries since opening hours were cut – Liverpool Echo. &#34;The figures show that since then the libraries have seen the average number of visits fall from almost 8,000 to less than 5,000, while the average number of loans has dropped from 5,535 to 3,750. The figures included in a report to the council’s transformation and resources committee also showed the &#34;hourly use&#34; had risen by 45% and the report said libraries were now &#34;more efficient&#34;.","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"],["North Yorkshire","Thu, 16 Jul 2015 21:03:26 +0000","North Yorkshire – Libraries are for all ages – Blackmore Vale Magazine. Mother or rhymetimer says sessions are there to instil love of reading.","2015/07/the-laws-still-there-as-lincs-and-the-vale-of-glamorgan-know-all-too-well.html"],["Lincolnshire","Wed, 22 Jul 2015 22:23:07 +0000","Lincolnshire – Lincolnshire library plans ‘perverse’ High Court told – BookSeller. &#34;Lincolnshire library campaigners have called the council’s aim of transforming its library service &#34;perverse&#34; at the High Court.  Lincoln resident Simon Draper, acting on behalf of Save Lincolnshire Libraries, was in the High Court yesterday and today (21st-22nd July) with his counsel Fionnuala McCredie QC, to fight the council’s decision to stop funding 32 of its 47 libraries.  He had already won a court victory last year, when the High Court quashed the plans for library cuts.. However, Draper launched a new offensive this year because the council proposed the same cuts in January.&#34; … &#34;In response, Nigel Giffin QC, speaking for Lincolnshire Council, said the reorganisation scheme was already well advanced and many members of library staff had been handed their redundancy notices.&#34;","2015/07/wifi-de-facto-beating-de-jure-and-the-efficiency-of-cutting-hours.html"]]