[["South Gloucestershire","Thu, 01 Sep 2016 20:35:30 +0000","South Gloucestershire – Open+ and volunteers to replace paid staff to keep libraries open.","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Wakefield","Thu, 01 Sep 2016 20:35:30 +0000","Wakefield – Ossett Library to close for nine weeks due to asbestos.","2016/09/lancashire-cuts-fallout-south-glos-goes-open-plus-catalogue-concerns.html"],["Bedford","Sun, 04 Sep 2016 20:00:18 +0000","Bedford – Consultation closes: likely that all libraries will stay open in some form.","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Caerphilly","Sun, 04 Sep 2016 20:00:18 +0000","Caerphilly – £48k refurbishment for Ystrad Mynach Library.","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Staffordshire","Sun, 04 Sep 2016 20:00:18 +0000","Staffordshire – Shenstone and seven other libraries passed to volunteers.","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Sunderland","Sun, 04 Sep 2016 20:00:18 +0000","Sunderland – Consultation on how to reduce budget of library service. Central may return to being co-located with museum.","2016/09/staffordshire-sunderland-bedford-and-ping-pong.html"],["Darlington","Tue, 06 Sep 2016 18:39:53 +0000","Darlington – Closure of Crown Street Library may be cancelled due to legal challenge.","2016/09/theres-consultations-and-then-theres.html"],["Herefordshire","Tue, 06 Sep 2016 18:39:53 +0000","Herefordshire – Budget cuts expected: £380,000 cut in 2017/18, with a further £380,000 funding reduction in 2018/19.","2016/09/theres-consultations-and-then-theres.html"],["Lincolnshire","Tue, 06 Sep 2016 18:39:53 +0000","Lincolnshire – Volunteer-run Caistor Arts Centre/Library future now in doubt.","2016/09/theres-consultations-and-then-theres.html"],["Pembrokeshire","Tue, 06 Sep 2016 18:39:53 +0000","Pembrokeshire – £3.4m new library/gallery/café in Haverfordwest.","2016/09/theres-consultations-and-then-theres.html"],["Warrington","Tue, 06 Sep 2016 18:39:53 +0000","Warrington – 5 libraries to pass to volunteers, 2 to be closed/be book drops. Large scale job losses. Warrington Central to be moved into smaller retail unit.","2016/09/theres-consultations-and-then-theres.html"],["Lincolnshire","Thu, 08 Sep 2016 21:49:59 +0000","Lincolnshire – Desford likely to close as volunteer deal falls through due to repair cost.","2016/09/a-rallying-cry-against-library-volunteers.html"],["Brent","Thu, 08 Sep 2016 21:49:59 +0000","Brent – September 2016 – Brent Libraries. &#34;Autumn is now upon us and if you have any fruit trees overburdened with the fruits of the season then we can help.  We have a 4 metre telescopic picking tool available to borrow from Kilburn Library.&#34;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Lancashire","Thu, 08 Sep 2016 21:49:59 +0000","Lancashire – Breaking: cuts for Lancashire approved – 2BR. &#34;it has been decided that registration centre is going to be based at Rawtenstall Library instead of Haslingden Library, which was the original plane. People in Pendle will have to wait to hear more about the Brierfield Library as that’s still up for further consideration. Other cuts have gone ahead as planned.&#34;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Lancashire","Thu, 08 Sep 2016 21:49:59 +0000","Lancashire – County Hall bosses rubber stamp libraries sell-off – Longridge News. &#34;Plans to sell more than 100 libraries, children’s centres and other facilities across Lancashire have been rubber stamped by County Hall chiefs. The authority’s cabinet has agreed changes to the way county council services are delivered, which bosses say will &#34;ensure people still have good access to good services&#34;, while delivering millions in savings.&#34;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Lancashire","Thu, 08 Sep 2016 21:49:59 +0000","Lancashire – Cuts to libraries and public buildings come under LCC scrutiny – Rossendale Free Post. &#34;County hall chiefs have revealed that no valuation process has yet begun on public buildings and libraries due to close as a result of budget cuts. Deputy county council leader Coun David Borrow confirmed that no steps to assess the value of buildings deemed ‘surplus to requirements’ had yet been taken by officers&#34;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Lancashire","Thu, 08 Sep 2016 21:49:59 +0000","Lancashire – Four years of four per cent council tax rises predicted – Lancashire Evening Post. &#34;Campaigners including Jane Porter and Alison Stevens attended the county hall meeting to hear what councillors had to say about the plans to close Fulwood Library. .Jane and the Help Save Fulwood Library group had collected more than 3,930 signatures on a protest petition against the planned closure&#34; … &#34;Beforehand Jane was still optimistic the library could be saved and said her MP, Ben Wallace, was &#34;monitoring the situation&#34;. Tory Coun Vivien Taylor asked what price the library could expect to be sold for and was told no valuations had been made. She also challenged council leader County Coun Jenny Mein who said last week Fulwood library users would be able to get a bus into Preston to use the Harris Library instead, asking whether she would like to send children into town to complete homework tasks. Tory councillors – angered they had been given days to analyse 1,000-page reports – failed in a bid to force a delay.&#3&#8230;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Lancashire","Thu, 08 Sep 2016 21:49:59 +0000","Lancashire – Tory pledge over libraries – Blackpool Gazette. &#34;County Coun Tim Ashton, whose Lytham ward covers both the town’s library and that at Ansdell, said: &#34;We would certainly reopen any closed libraries in the event of us regaining control of the County Council but for now, I have to stress that all is not lost and I will be doing everything I can to preserve our libraries.&#34;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Leicestershire","Thu, 08 Sep 2016 21:49:59 +0000","Leicestershire – Closure threat as deal to run Desford Library falls through – Hinckly Times. &#34;Plans for a community group to take over Desford Library have fallen through and the centre is at risk of being closed if no deal can be reached. Cash-strapped Leicestershire County Council is in the process of transferring up to 36 libraries to volunteer groups to slash £800,000 from its budget. Desford Community Group submitted a successful bid to the council to take over the library in May last year. But following legal advice, the group says it wants the council to spend £45,000 on repairs before it signs a 10-year lease agreement.&#34; … &#34;If no deal can be reached by the end of September, the council will launch a three-month consultation recommending the library be replaced with a mobile service.&#34;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Renfrewshire","Thu, 08 Sep 2016 21:49:59 +0000","Renfrewshire – Skoobmobile in the running for national library award – Renfrewshire 24. &#34;Renfrewshire’s mobile children’s library outreach service, the uniquely named Skoobmobile, featuring friendly book monsters known as the Skoobs, has been shortlisted for the prestigious CILIP Libraries Change Lives Award for best practice in UK library services. Promoting reading and play combined for children age 0-12, the mobile library stocks a broad range of children’s books in a flexible space that houses a range of activities based around play, reading and physical and digital activity. The bus tours the community to open its doors to children and adults at schools, nurseries, community spaces and family events","2016/09/a-rallying-cry-against-library-volunteers.html"],["South Gloucestershire","Thu, 08 Sep 2016 21:49:59 +0000","South Gloucestershire – Library changes will see jobs lost in South Gloucestershire – Hinckley Times. &#34;The changes approved by members of South Gloucestershire Council’s Environment and Community Services (ECS) committee yesterday mean visitors to libraries will use a swipe card to gain entry, in a move designed to extend the opening hours to 9am to 8pm and allow a seven-day service. However, the introduction of the Open Plus technology would mean that not as many library staff are needed, leaving workers fearing for their future.&#34;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Suffolk","Thu, 08 Sep 2016 21:49:59 +0000","Suffolk – How Suffolk Libraries uses Chrome devices to keep visitors coming back for more – Google for Work Blog. &#34;Today we hear from Leon Paternoster, Deputy Head of IT at Suffolk Libraries in Ipswich, UK. Suffolk Libraries serves the UK county’s population of over 700,000. Learn how Suffolk Libraries uses mobile technology to keep its members engaged and interested in visiting their local branch.&#34;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Swindon","Thu, 08 Sep 2016 21:49:59 +0000","Swindon – Anomaly of libraries – Swindon Advertiser / Letters. &#34;This town almost gave birth to the principle of lending libraries – as with NHS – so why do we find ourselves now lagging behind in this respect?&#34;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Swindon","Thu, 08 Sep 2016 21:49:59 +0000","Swindon – Staff proposal to save more libraries revealed despite council’s best efforts – Swindon Advertiser. &#34;Representatives from the council were left red-faced on Tuesday evening when a staff proposal for an alternative future for Swindon’s libraries was leaked at their own public meeting. The council team took receipt of the proposal last month but chose not to declare its existence to the public despite delivering an extensive presentation which purported to include alternative options to the existing strategy.&#34; … &#34;The staff proposal would see the number of libraries saved rise to five, crucially including Park Library which serves the more socially and economically disadvantaged communities in its surrounding area. The model would also see far more staffed hours maintained, with 31 per week in North and West Swindon and 27 in Highworth and Park.&#34;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Warrington","Thu, 08 Sep 2016 21:49:59 +0000","Warrington – Petition launched to save town’s libraries from closure – Warrington Guardian. &#34;The campaign was set up by childminder Dina Kingsnorth-Baird who said children who are home schooled would be especially affected by the closures. She said: &#34;People are worried about losing their library buildings. They want a place to be able to browse real books within a real community.&#34;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Warrington","Thu, 08 Sep 2016 21:49:59 +0000","Warrington – Save Warrington’s libraries – 38 Degrees / Petition. &#34;Bin your proposals to close, move and water down Warrington’s libraries. Instead, commit to retain all existing libraries, consult with the public and community groups on ways to involve even more community groups in to existing libraries and do more to publicly promote and celebrate the many activities already on offer across the network.&#34;","2016/09/a-rallying-cry-against-library-volunteers.html"],["Leicestershire","Thu, 08 Sep 2016 21:49:59 +0000","Leicestershire – Desford likely to close as volunteer deal falls through due to repair cost.","2016/09/a-rallying-cry-against-library-volunteers.html"],["North Tyneside","Sun, 11 Sep 2016 20:34:46 +0000","North Tyneside – Five year strategy for libraries / consultation.","2016/09/the-library-news-since-8th-september.html"],["Northumberland","Sun, 11 Sep 2016 20:34:46 +0000","Northumberland – Cramlington Library closed: library services moves into new leisure centre.","2016/09/the-library-news-since-8th-september.html"],["Rotherham","Sun, 11 Sep 2016 20:34:46 +0000","Rotherham – £474k p.a. cut; single staffing, Maltby Library to close (merged with customer service centre), mobile to close.","2016/09/the-library-news-since-8th-september.html"],["Southend","Sun, 11 Sep 2016 20:34:46 +0000","Southend – Kent Elms Library to be refurbished: new entrance and meeting room.","2016/09/the-library-news-since-8th-september.html"],["Telford and Wrekin","Sun, 11 Sep 2016 20:34:46 +0000","Telford and Wrekin – Donnington, Dawley and Stirchley will be run by town/parish councils rather than closed a originally planned. Mobile library service will end from 31st March 2017.","2016/09/the-library-news-since-8th-september.html"],["Bromley","Tue, 13 Sep 2016 20:27:29 +0000","Bromley – Preferred bidder for 8 libraries turning volunteer has withdrawn.","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Gwynedd","Tue, 13 Sep 2016 20:27:29 +0000","Gwynedd – 9 largest libraries (Barmouth, Bangor, Blaenau Ffestiniog, Caernarfon, Dolgellau, Porthmadog, Pwllheli, Tywyn and Y Bala) to stay open with possibly changed opening hours. 4 libraries to become volunteer or close (Bethesda, Penygroes, Criccieth and Nefyn). 4 libraries to close (Llanberis, Deiniolen, Penrhyndeudraeth and Harlech).","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Hertfordshire","Tue, 13 Sep 2016 20:27:29 +0000","Hertfordshire – Buntingford Library, for now, to stay in current location.","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Lincolnshire","Tue, 13 Sep 2016 20:27:29 +0000","Lincolnshire – Book loans reduced from four weeks to three weeks. Eight week fines amnesty.","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Slough","Tue, 13 Sep 2016 20:27:29 +0000","Slough – £22m &#34;The Curve&#34; library and cultural centre opened.","2016/09/14-new-or-upgraded-libraries-so-far-this-year-with-the-latest-opening-in-slough.html"],["Aberdeenshire","Tue, 20 Sep 2016 21:16:05 +0000","Aberdeenshire – Libraries may be moved into non-profit trust.","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Wakefield","Tue, 20 Sep 2016 21:16:05 +0000","Wakefield – Cuts amended: all 13 libraries to have opening hour cuts.","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Wigan","Tue, 20 Sep 2016 21:16:05 +0000","Wigan – £1.4m cut: volunteers, staff mergers and losses to be considered.","2016/09/award-ceremonies-galore-lancashire-yorkshire-and-the-rest.html"],["Bolton","Sun, 25 Sep 2016 19:19:25 +0000","Bolton – New library possibility at Little Lever.","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Fife","Sun, 25 Sep 2016 19:19:25 +0000","Fife – Glenwood to be volunteer-run.","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Lambeth","Sun, 25 Sep 2016 19:19:25 +0000","Lambeth – Waterloo moves to new temporary site.","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Plymouth","Sun, 25 Sep 2016 19:19:25 +0000","Plymouth – 2 libraries under threat. £48k cut.","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Shropshire","Sun, 25 Sep 2016 19:19:25 +0000","Shropshire – Shawbury Library closes.","2016/09/party-political-responses-to-library-cuts-volunteers-open-and-authors.html"],["Devon","Tue, 27 Sep 2016 19:37:14 +0000","Devon – Ottery St Mary’s Library to move into ex-bank.","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Lancashire","Tue, 27 Sep 2016 19:37:14 +0000","Lancashire – Confirmed 21 libraries to close on this Friday.","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Wakefield","Tue, 27 Sep 2016 19:37:14 +0000","Wakefield – Opening hours cuts confirmed.","2016/09/theres-more-than-one-way-to-ban-a-book.html"],["Oxfordshire","Thu, 29 Sep 2016 20:40:00 +0000","Oxfordshire – Summertown and Evesham Libraries to have £25k Open+ as pilot scheme: opening hours extended in evenings until 11.30pm.","2016/09/viciously-reducing-bookfunds.html"],["Oxfordshire","Thu, 29 Sep 2016 20:40:00 +0000","Oxfordshire – Summertown and Eynsham Libraries to have £25k Open+ as pilot scheme: opening hours extended in evenings until 11.30pm.","2016/09/viciously-reducing-bookfunds.html"]]