[["Bexley","Tue, 05 Jul 2016 14:19:12 +0000","Bexley – Libraries set to expand under new ownership – Bexley Times. &#34;Two libraries in Bexley are to be transferred to new ownership, in a move that could lead to a bigger range of services, events, activities and opportunities. Bexley Village Library, which was the borough’s first community library, and Slade Green Library, were set up by Greener Bexley, but now they are on a secure footing the charity has decided to pass them on. From July 2016, Bexley Community Library will be managed by the Bostall Library Community Group, who recently took on the community management of Bostall Library. Slade Green Library will transfer to the management of Eco Communities, which currently runs the Slade Green and Howbury Community Centre.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Blackpool","Tue, 05 Jul 2016 14:19:12 +0000","Blackpool – Many use them, even if you don’t – Blackpool Gazette / Letters. &#34;As a disabled person, who has to use a mobility device, I cannot take advantage of swimming pools, gyms etc. but that does not mean that I am against sport and games. These are a wonderful recreation for those who are able to participate. It’s the same with libraries, they are there for those who want and are free to take advantage of the services they offer. But don’t begrudge something you cannot or do not use. &#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Lancashire","Tue, 05 Jul 2016 14:19:12 +0000","Lancashire – Pupils on march in fight for libraries – Gazette. &#34;Around 60 year-five students from Manor Beach and Northfold schools in Cleveleys staged their own protest march – angry at County Hall proposals which would see their two local library branches close … Despite both schools being controlled by the County Council, pupils – led by their headteachers – marched through the streets with banners and placards, asking councillors to think again.&#34; see video at Pupil power in battle to save libraries – Gazette.","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Blaenau Gwent","Tue, 05 Jul 2016 14:19:12 +0000","Blaenau Gwent – Modernisation at Ebbw Vale Library – Designing Libraries. &#34;&#34;Ebbw Vale Library will have a modern feel, without losing the traditional features of the historic building, with a mix of old and new. The refurbishment will transform service delivery at Ebbw Vale, enabling greater community involvement, improved IT facilities and providing an opportunity to increase our partnership work with a wide range of organisations.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Fife","Tue, 05 Jul 2016 14:19:12 +0000","Fife – Fight to save Fife libraries continuing – Courier. &#34;New chapters in book lending are being written in villages including Kinghorn, Pittenweem, Colinsburgh and East Wemyss. Earlier this year Fife Council rubber stamped the axing of 16 libraries by Fife Cultural Trust, but the closure of some was delayed to allow communities to develop alternative proposals. Among the projects underway is that of Kinghorn Library Renewed, a community group preparing a business plan to take over the management of Kinghorn Library.&#34; … &#34;A survey of residents brought forward more than 40 people willing to volunteer and donation pledges of more than £2,500.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Lancashire","Tue, 05 Jul 2016 14:19:12 +0000","Lancashire – Mum’s library plea as fight hits parliament – Gazette. &#34;A woman who is home schooling her autistic daughter has called on Lancashire County Council not to shut down a space in which she feels safe. Nicky Frankland, 40, from Thornton, saw her tale and that of five-year-old Belle being mentioned in Westminster last week when MP Paul Maynard took his battle to save two Wyre libraries to the halls of power.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Leicestershire","Tue, 05 Jul 2016 14:19:12 +0000","Leicestershire – Two thirds of Leicestershire’s libraries to be run by volunteers – BookSeller. &#34;Leicestershire county council is to transfer 26 libraries to community groups in order to help make £800,000 worth of savings. By the end of the month, more than two thirds of Leicestershire’s community libraries will be run by local groups, ITV news has reported. So far, 23 libraries have transferred, with more due to transfer throughout July. Councillor Richard Blunt, cabinet member for libraries, said: &#34;I’m delighted that 23 communities are now running their village library and have lots of ideas to make them even more popular and well-used. The council has been carrying out further work with those communities which need more help with their plans and I’m confident that the vast majority of the 36 libraries will be community-run by next year.&#34;&#34; see also Third of Leicestershire libraries to be run by volunteers – ITV.","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Brent","Tue, 05 Jul 2016 14:19:12 +0000","Brent – Brent Libraries Continue to Improve – James Powney’s Blog. &#34;The most recent Public Library User Services were made available at a brief meeting on Brent’s cultural services I attended yesterday.  Once again they are up in every category, although some only just.  It is another indication that Brent’s Libraries Transformation Project turned the library service around. &#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Northern Ireland","Tue, 05 Jul 2016 14:19:12 +0000","Northern Ireland – Pawesome library challenge – Lurgan Mail. With animal themed events, animal books, puzzles and animal crafts, children across Northern Ireland are being encouraged to keep reading during the summer holidays. Simply bring your child along to the library and sign up for the challenge to read any number of books of your own choice (choose your personal target between 2 and 25 books), collecting an activity booklet and bookmarks along the way.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Northern Ireland","Tue, 05 Jul 2016 14:19:12 +0000","Northern Ireland – World War One: Belfast ‘library men’ archive gives glimpse into frontline life – BBC. &#34;During the war, 11 members of staff from Belfast public libraries enlisted in various regiments of the Army. More than 200 letters were exchanged between these ‘library men’ and the chief librarian between 1914 and 1919. They were written in order to receive the half-pay that Belfast Public Libraries continued to give their staff during war service.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Sheffield","Tue, 05 Jul 2016 14:19:12 +0000","Sheffield – Libraries are more important than offices – Yorkshire Post / Letters. &#34;Stannington Library is a small library about twice the size of two or three moored caravans, the kind you find at holiday parks on the Yorkshire coast. The building is modern and small, so overhead costs must be low. The staff were only part-time so they, too, can’t have cost that much. In the last few months, our council has borrowed tens of millions to build more shops and offices in the city centre which no one needs or wants, and which the council has admitted it has no idea how much it will benefit from financially. Yet we are told that the council cannot afford the three wonderful part-time library  staff that we lost a couple of years ago&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Shropshire","Tue, 05 Jul 2016 14:19:12 +0000","Shropshire – Fresh talks over Church Stretton library’s future – Shropshire Star. &#34;Shropshire Council has said it will open talks with community groups that might want to take the library on. It comes after controversial plans to move it to Church Stretton School were halted following two years of campaigning by supporters and an aborted legal challenge. Lee Chapman, Shropshire Councillor for Church Stretton and Craven Arms, said: &#34;We are pleased we can now get back to work looking for a long-term solution for our library service and our visitor information service in Church Stretton.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Wokingham","Tue, 05 Jul 2016 14:19:12 +0000","Wokingham – Wokingham libraries’ opening hours set to be extended – Get Reading. &#34;Wokingham Borough Council has drafted plans to extend opening hours by 17.5 hours a week and make a number of other changes as it looks to meet the needs of a growing number of visitors. &#34; … &#34;Self-service technology would also be installed so libraries can operate with less staff. The technology – which would be funded by contributions from housing developers – will allow visitors to check out or return books, pay fines and search for and reserve items. The council had also considered introducing unstaffed opening hours, but the plans were dropped after a number of residents raised concerns about the initiative during a public consultation .&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Brent","Tue, 05 Jul 2016 14:19:12 +0000","Brent – Writers support Kensal Rise Library Fundraising Appeal – Save Kensal Rise Library (press release). &#34;Maggie Gee, author of The White Family, and Nick Rankin, author of Ian Fleming’s Commandos, have donated £1,000 to the Kensal Rise Library Appeal to help re-open the library, following its 2011 closure by Brent Council and sale by All Souls College Oxford to property developers.  Maggie said: &#34;In 2012 we left Kensal Rise after 26 years, but we still love the library that Mark Twain opened and that local people, including us, fought so long and hard for. The war is won, it’s time to fund the peace.&#34;. The space is finally safe, but the community library needs complete renovation including flooring, plumbing, wiring, plus equipment and books&#34; see also Writers donate to re-open Kensal Rise Library – BookSeller.","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Darlington","Tue, 05 Jul 2016 14:19:12 +0000","Darlington – Campaigners say Darlington deserves better after council agrees to cuts – Northern Echo. Includes protests at Crown Street Library.","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Dudley","Tue, 05 Jul 2016 14:19:12 +0000","Dudley – Dudley borough’s library opening times slashed by more than 100 hours – Dudley News. &#34;From August 1, more than 100 hours will be lost each week at the 14 libraries and archive centre combined, which the local authority claim is due to &#34;meeting the demands of budget cuts from central government&#34;.  Four of the borough’s main libraries – Brierley Hill, Dudley, Halesowen, and Stourbridge – will each see their opening times reduced by 11.5 hours a week, while Sedgley Library will be closed for an extra 22.5 hours. Opening hours will also be drastically cut at the borough’s Archive and Local History Centre, as well as the libraries in Coseley, Cradley, Gornal, Kingswinford, Long Lane, Lye, Netherton and Wordsley. &#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Lambeth","Tue, 05 Jul 2016 14:19:12 +0000","Lambeth – Library campaigners plan Rec protest – Brixton Blog. &#34;Lambeth library campaigners will today (28 June) protest outside Briton Rec at 6pm. They will be demanding answers on the future of borough libraries – and also the Rec itself – from both Lambeth council and its leisure provider GLL. GLL, now renamed Better, runs the Rec and will run Lambeth’s Carnegie and Minet libraries after they are converted to &#34;healthy living centres&#34; incorporating gyms and a reduced library service.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Lewisham","Tue, 05 Jul 2016 14:19:12 +0000","Lewisham – Library Workers Strike 5th July – Save Lewisham Libraries. &#34;Tuesday’s strike will be in solidarity with Greenwich library workers who are striking to save their mobile library. We stand in solidarity with teachers who will hold a national strike on the same day. The strike will help to build momentum for the vital lobby of Lewisham council on 13th July.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Powys","Tue, 05 Jul 2016 14:19:12 +0000","Powys – Deadline looms for library savings plan – Brecon and Radnor Express. &#34;The council’s library service must save a quarter of a million pounds by April 2019 towards the authority’s overall £27m savings target with £100,000 having to be found by April 2018. A consultation on the library service and plans around how it could generate income, work with others and move libraries to other buildings closes on Sunday, July&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Dorset","Tue, 05 Jul 2016 14:19:12 +0000","Dorset – Dorset mobile library cuts finalized by county cabinet – BBC. &#34;copyright Dorset County Council Image caption  Three Dorset mobile library vehicles will be withdrawn by the end of the March. Three out of four of Dorset’s mobile library vehicles are to be taken off the road following a council vote. The plan, approved by the council cabinet, is aimed at saving around £126,000 over two years, as well as the cost of replacing vehicles. One of the county’s four mobile libraries will be retained to serve care homes and sheltered accommodation. The county council said people who were housebound would be able to have books delivered to their homes by volunteers. A contract with the Royal Voluntary Service, which is already providing home deliveries, is due to be extended. The council insisted older people who used the mobile libraries because of loneliness would be helped through befriending schemes&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Northern Ireland","Tue, 05 Jul 2016 14:19:12 +0000","Northern Ireland – Protest at cuts to Lurgan library today – Lurgan Mail. &#34;Over recent years the number of hours the library is open has been significantly reduced … And there are further proposals to chop a further five hours from the service.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Western Isles","Tue, 05 Jul 2016 14:19:12 +0000","Western Isles – Consulting on library service – Stornoway Gazette. &#34;A public consultation is taking place to review the community public libraries: Shawbost, Tarbert, Liniclate, Daliburgh and Castlebay. This will include looking at location, opening hours, use of technology and opportunities to work more closely with other Comhairle services and community groups. The consultation is part of a larger review, launched in 2015 with the Library Forward Plan, Seirbheis Leabharlainn airson an Àm ri Teachd : A Library Service for the Future. The plan aims to look at alternative ways of delivering the service in the future to ensure that the Comhairle delivers an up-to-date service.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Glasgow","Tue, 05 Jul 2016 14:19:12 +0000","Glasgow – Glasgow attractions enjoy record-breaking year with resident visits over 18 million – Evening Times. &#34;In the last financial year, Glasgow Life recorded a record-breaking 1.4m attendances at community facilities and over 5.2m at the city’s 32 community libraries and the Mitchell Library. Free wi-fi was rolled out across libraries, community facilities, public halls and major cultural and sporting facilities. There were 6.2m attendances across city sports facilities and Glasgow Life delivered 320 adult learning programmes, helping change the lives of more than 3,700 adults.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Greenwich","Tue, 05 Jul 2016 14:19:12 +0000","Greenwich – Strike called to fight Greenwich mobile library cuts – Wharf. &#34;Unite decide to carry out the 48-hour industrial action after councillors in the east London borough go ahead with plans to scale back services that deliver 33,000 books a year to children&#34; … &#34;According to the union, the mobile service delivers 33,000 books a year to children, an increase on last year’s 22,000. In a statement, Unite claimed children’s literacy was at stake and did not justify a &#34;comparatively small&#34; saving of £126,000.&#34; see also 84 Greenwich Library Workers Battle To Save Books For Kids – Morning Star.","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Haringey","Tue, 05 Jul 2016 14:19:12 +0000","Haringey – New-look Tottenham library fully re-opens on Monday after £3m facelift – Haringey Advertiser. &#34;The new-look hi-tech Marcus Garvey library in Tottenham is set to fully re-open from next week following its £3 million revamp-with other council services now also sharing the buildiing. Haringey Council has relocated some of its customer services to the building in Philip Lane from Apex House in Seven Sisters Road which is being demolished for housing. Re-named the Marcus Garvey Centre, the library has been partially open to the public to test facilities since Tuesday, but will be fully open from Monday&#34; … &#34;The facelift includes new state-of-the-art technology, a more spacious layout, modern furniture, 52 computers compared to the previous 22, a refurbished children’s library and an extra 22,000 new books.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Lincolnshire","Tue, 05 Jul 2016 14:19:12 +0000","Lincolnshire – Deepings Community Library launches new free bus service – Spalding Today.","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["St Helens","Tue, 05 Jul 2016 14:19:12 +0000","St Helens – Libraries’ arts programme backed by Johnny Vegas shortlisted for award – St Helens Star. &#34;The project beat off stiff competition from over 600 organisations to reach the public voting stage in the annual search for the UK’s favourite Lottery-funded projects and is up against six others to be crowned the winner of the Arts category. Funded through National Lottery money it has enabled both established professional and emerging arts companies, performers and artists from across the country to bring their talents to St Helens with a diverse programme shown across the borough’s 13 libraries&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Lewisham","Tue, 05 Jul 2016 14:19:12 +0000","Lewisham – Library savings programme update – Lewisham Council. Forest Hill Library + Torridon Road to become volunteer/community managed, Manor House still looking for a &#34;partner&#34;, £1m cut.","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Sheffield","Tue, 05 Jul 2016 14:19:12 +0000","Sheffield – City libraries make the move to wireless – Star. Wifi now available in all paid libraries and &#34;most&#34; volunteer ones.","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["South Tyneside","Tue, 05 Jul 2016 14:19:12 +0000","South Tyneside – Hebburn Central a success – Designing Libraries. &#34;Since its opening a year ago the centre has become an integral part of the local community in South Tyneside. The venue has already won three awards and been shortlisted for a fourth. Hebburn Central includes a six-lane swimming pool, a learner pool with bubble pools, sauna and steam room, fitness suite, sports hall, dance studio, soft play area, library, learning centre and cafe, as well as meeting rooms, a customer service centre, local police help point and an outdoor multi-use games area.&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Northern Ireland","Tue, 05 Jul 2016 14:19:12 +0000","Northern Ireland – Lisburn picket is new chapter in campaign – Lisburn Today. &#34;Following weekend protests outside branches, the Hands Off Our Libraries Campaign’s Sean Burns said protesters meant to picket the Castle Street office of Lagan Valley MLA Mr Givan, whose own local library he described as being &#34;on the chopping block&#34;&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Worcestershire","Tue, 05 Jul 2016 14:19:12 +0000","Worcestershire – Hagley Parish Council steps in to prevent further cuts at village library – Stourbridge News. &#34;It’s only two years since the parish council had to intervene to stop the library closing altogether. Under the current arrangement, the parish council funds the cost of the library building while the county council maintains and funds the library service.&#34; Parish council says &#34;&#34;We will also be seeking assurances from the county council that no further reviews or library cutbacks will be proposed. &#34;It’s simply not fair to expect residents to pay twice for services they are already funding through their council tax&#34;","2016/07/the-big-friendly-success-here-comes-the-summer-reading-challenge-2016.html"],["Barking and Dagenham","Sun, 10 Jul 2016 20:50:21 +0000","Barking and Dagenham – Adding a Chrome finish – Panlibus. &#34;See how the London Borough of Barking and Dagenham switched to Chrome devices and saved £400,000″","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Coventry","Sun, 10 Jul 2016 20:50:21 +0000","Coventry – 10 libraries, kids centres & youth clubs face Coventry council cuts axe – Coventry Observer. &#34;Ten libraries could close if community groups do not step in to run them; six council-run children’s centres would close; council-run nursery provision would end unless private nursery providers take them off the council’s hands; and 14 council-run youth clubs would be lost in the latest cuts. It is expected that around 100 full-time members of staff could lose their jobs – 30 from libraries, 22 in children’s centres, 33 in nurseries and 12 in youth services.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Lancashire","Sun, 10 Jul 2016 20:50:21 +0000","Lancashire – Julie Hesmondhalgh letter pays tribute to our under-threat libraries – Accrington Observer. &#34;Julie Hesmondhalgh argues that the range of benefits these public buildings bring is ‘better than gold’. It comes as a campaign has been launched to save Oswaldtwistle library, which is under threat of closure along with Rishton and Clayton-le-Moors libraries.The Save Oswaldtwistle’s Unique Library (SOUL) group has received hundreds of petition signatures. Chris Brindle, of SOUL, said they have put in an ‘expression of interest’ to Lancashire County Council (LCC) and are now working on a business plan to take over the running of the 101-year-old library.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Lancashire","Sun, 10 Jul 2016 20:50:21 +0000","Lancashire – Lancashire Reading Journey 2016 – Lancashire. Library service decides to continue with it’s own Summer Reading Challenge rather than buying into that created by the Reading Agency.","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Waltham Forest","Sun, 10 Jul 2016 20:50:21 +0000","Waltham Forest – Plans to relocate libraries put forward to council cabinet – Guardian series. &#34;The proposals would apply to Hale End Library, in Castle Avenue, Highams Park; Higham Hill Library, in North Countess Road, Walthamstow; and Wood Street Library, in Forest Road, Walthamstow. In addition, Lea Bridge Library, in Lea Bridge Road, Leyton, will be refurbished. The council says the plan is part of its commitment to ensure everybody in the borough lives within one-and-a-half miles of a library.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Bradford","Sun, 10 Jul 2016 20:50:21 +0000","Bradford – Mum starts online petition to save Holme Wood library – Telegraph and Argus. &#34;Within days of Caroline Heward, 37, starting the petition on change.org to keep Holme Wood Library open and staffed, more than 300 people had backed it. The petition will keep running throughout the summer holidays before it is handed over to Bradford South Labour MP Judith Cummins.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Lancashire","Sun, 10 Jul 2016 20:50:21 +0000","Lancashire – Fight to save library threatened with closure – ITV. Video. &#34;Campaigners have formed a human chain around a library that’s threatened with closure. Lancashire County Council’s trying to save £85 million a year. But people in Adlington say the library’s a vaulable community resource.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Northamptonshire","Sun, 10 Jul 2016 20:50:21 +0000","Northamptonshire – Northamptonshire mobile library service is a reading lifeline throughout the county – Herald and Post. &#34;It might not seem like a large number of people but it is a vital lifeline for those it serves in remote communities.Northamptonshire County Council’s mobile library service visits villages and towns across the county which do not have one of the county’s 36 ‘bricks and mortar’ libraries. Every year the service is reviewed, including where it visits and what impact it is having in each location.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Northern Ireland","Sun, 10 Jul 2016 20:50:21 +0000","Northern Ireland – Dungannon students win UK-wide accolade for cancer treatment books – Irish News. &#34;They recently secured a deal with Libraries NI to stock the books in libraries across the north including Belfast Central, Coleraine, Derry Central, Dungannon, Enniskillen and Portadown.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Carillion","Sun, 10 Jul 2016 20:50:21 +0000","Carillion – Managing library services – rethinking local public libraries – Carillion.  Emphasises partnership with Lego and Wimbletech.","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Coventry","Sun, 10 Jul 2016 20:50:21 +0000","Coventry – Coventry libraries will be ‘devastated’ by cuts say leading children’s authors – Coventry Telegraph. &#34;Best-selling children’s author Cathy Cassidy and children’s laureate Chris Riddell say proposed cuts will devastate the library service in Coventry. Cathy has written a passionate letter to the Coventry Telegraph and Coventry City Council explaining how visits to Coventry libraries set her on the path to becoming an author. The letter is signed by more than 100 others, including children’s laureate Chris Riddell, author of the Artemis Fowl books Eoin Colfer, author of Millions Frank Cottrell-Boyce and Carnegie medal winners Meg Rosoff and Tanya Landman.&#34; see also Protests over closure plans for Coventry libraries – BBC. &#34;Sarah Smith, from Save Coventry’s Libraries Group, taught herself to read at the city’s libraries, and said they serve a far wider purpose for many vulnerable families. &#34;Libraries are no longer just for people to borrow books. They are people to do homework, do job searches, they are a place&#8230;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Herefordshire","Sun, 10 Jul 2016 20:50:21 +0000","Herefordshire – New library consultation prompts fears of further cuts – Ledbury Reporter. &#34;The council has started a consultation to gauge a range of views from those who use libraries and customer service centres and those who currently do not. Herefordshire Council said the answers will be used to help make decisions on the best way of using the services in the future and how to prioritise services. But William McMorran, chair of the Hereford Library User Group (HLUG), said: &#34;HLUG fears that this survey is designed to find a way of justifying further cataclysmic service reductions over the next three years.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["North Somerset","Sun, 10 Jul 2016 20:50:21 +0000","North Somerset – Consultation on closure and merger of North Somerset libraries and children’s centres – North Somerset Times. &#34;North Somerset Council, as previously reported by the Times, hopes to save about £500,000 by altering the community services. It is launching a 12-week consultation from today after unveiling last month a raft of possible changes. Options under consideration including merging children’s centres in Yatton and Congresbury and even possibly closing libraries in Long Ashton and Congresbury&#34;. 76% of people in poll say they use the library.","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Worcestershire","Sun, 10 Jul 2016 20:50:21 +0000","Worcestershire – Bewdley Library to temporarily close ahead of its move to new home – Kidderminster Shuttle. &#34;The current library, in Load Street, will move to the Medical Centre site, in Dog Lane, ahead of its reopening on Monday, August 8. While the building is out of action, the nearest libraries will be at the Stourport Civic Centre, in New Street, or Kidderminster Library, in Market Street. A spokesman from Worcestershire County Council said the relocation will offer Bewdley residents a brand new library, benefit from a shared location and achieve savings which will help ensure the sustainability of the local library service.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Cheshire East","Sun, 10 Jul 2016 20:50:21 +0000","Cheshire East – Crewe’s £15m Lifestyle Centre creates waves – Designing Libraries. &#34;For the library, Tom Appleby, Library Manager at Crewe and Nantwich Libraries, said: &#34;Our priority was to make this a library that was accessible to everyone, which is important when you have a space over two floors. We also wanted to recycle as much as we could from the old library and at the same time create a completely new look. The Demco designer was excellent and worked collaboratively with the team from the start of the project to handover.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Manchester","Sun, 10 Jul 2016 20:50:21 +0000","Manchester – South Manchester libraries to get £250,000 makeover – South Manchester News. &#34;The Wolfson Foundation has provided the grant to improve the offer for children at Gorton, Longsight, Withington and Wythenshawe Forum libraries, as well as Newton Heath and North City (Harpurhey). The funding will also allow a new programme of digital activities for children to be developed within all six libraries. New furnishings such as sofas, picture book boxes, new shelving, wall motifs and some quirkier and more striking book display units will be installed across the libraries, creating brighter and more welcoming spaces for children and their families to enjoy.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Swindon","Sun, 10 Jul 2016 20:50:21 +0000","Swindon – Libraries strategy met with concern from campaigners and councillors – This is Wiltshire. Labour councillors says &#34;We’re really concerned about where the volunteers would come from but mainly, our biggest disappointment, is that the Council have gone out for consultation on this but they haven’t listened to the clear overwhelming voice of Swindon residents.&#34;&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Cheshire West and Chester","Sun, 10 Jul 2016 20:50:21 +0000","Cheshire West and Chester – Tarporley library to close for summer due to building work at school – Chester Chronicle. &#34;It comes after the school announced a £2.5m government funding boost will ‘revitalise’ the school and its Sixth Form College.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Lancashire","Sun, 10 Jul 2016 20:50:21 +0000","Lancashire – Council grants £10,000 to help save under-threat Hyndburn libraries – Accrington Observer. &#34;Two one-off grants have been approved by Hyndburn council to look into how best to save Rishton library and secure the long term future of the library and civic hall in Clayton-le-Moors. Both buildings were earmarked for closure by Lancashire County Council (LCC) as part of plans to shut 54 libraries and children’s centres. Rishton library campaigners have been granted £5,000 to work with community group Mercer House 1842 to look at the feasibility of keeping Rishton library open. Another £5,000 has also been approved towards options for preserving the long-term future of the Clayton-le-Moors civic hall – without county hall involvement.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Swindon","Sun, 10 Jul 2016 20:50:21 +0000","Swindon – Campaign as council plans to cut 75% of its libraries – ITV. Includes two video interviews.","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Swindon","Sun, 10 Jul 2016 20:50:21 +0000","Swindon – Council to cut 11 out of 15 libraries within next 12 months – Swindon Advertiser. &#34;The task of providing a library service in those areas will now be down to volunteer groups, charities, community groups and local residents. A one-off pot of £500,000 will be made available to support groups looking to provide some sort of library service locally&#34; … &#34;The suggestion is that pubs, coffee shops and community centres could apply for some of the transitional funding with a view to providing a library-related service, such as a book-drop facility, albeit not in a building that is actually called a library.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Coventry","Sun, 10 Jul 2016 20:50:21 +0000","Coventry – Several libraries could close if community groups cannot be found to run them – Coventry Telegraph. &#34;Under the proposals Caludon, Cheylesmore, Coundon, Finham and Earlsdon libraries will be shut if community groups do not take them on. They will be able to use existing stock, equipment and in some cases buildings and will receive council advice and support but no staff. It is hoped that libraries in Aldermoor, Canley, Hillfields, Jubilee Crescent and Allesley Park will be run on a partnership basis with other groups and could be located with other community organisations or services.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Northern Ireland","Sun, 10 Jul 2016 20:50:21 +0000","Northern Ireland – Nipsa is deluded over library service battle – Belfast Telegraph / Letter. &#34;A circular sent to library branches by public service union Nipsa to discourage members from supporting the Hands Off Our Libraries campaign must be condemned. The circular claims the campaign has the potential to undermine the Nipsa campaign and distract from legitimate debate with Libraries NI. The community – as well as the unions – have had a pivotal role in defence against library cuts. Many Nipsa members are involved in the Hands Off campaign. The Nipsa officials delude themselves that they are the sole and legitimate campaign against library cuts. The Hands Off Our Libraries campaign is backed by Unite the Union, the Labour Party NI and other socialist parties.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Gateshead","Sun, 10 Jul 2016 20:50:21 +0000","Gateshead – Six Gateshead libraries face uncertain future as council considers fresh cuts – Chronicle. £700k cut. &#34;Whickham, Crawcrook, Pelaw, Felling, Rowlands Gill and the Mobile Library &#34; under threat. 20 FTE jobs at risk, with possibility of compulsory redundancy.","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Swindon","Sun, 10 Jul 2016 20:50:21 +0000","Swindon – Let’s create innovative library service, says David Renard – Swindon Advertiser. &#34;In fact, if community-led solutions can be identified in Parks and Wroughton, for example, 95 per cent of people in the borough will be within two miles of a library. The strategy also proposes investing in self-service technology so we can keep libraries open for longer, while provision will also be made for increasing volunteering within the service and providing targeted outreach and learning services.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Lambeth","Sun, 10 Jul 2016 20:50:21 +0000","Lambeth – Library campaigners summon ghosts of Carnegie past – Brixton Blog. &#34;The future of Herne Hill’s Carnegie library continues to provoke controversy as local residents contest its future. Campaigners will tomorrow (9 July) mark with a protest the 110th anniversary of the opening of the library and 100 days since it was closed, while another group has called for more people to join its plans to take over the building from Lambeth council and turnout into a &#34;community hub&#34;.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Lancashire","Sun, 10 Jul 2016 20:50:21 +0000","Lancashire – Politicians should be careful with our cash – Blackpool Gazette / Letters. &#34;When David Cameron ordered the remain leaflet, I suppose he never even thought about the library and museum staff he could have saved from redundancy and the residents denied access to local libraries. The Prime Minister has fallen on his sword, though unlike library staff he has a second job as an MP&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Surrey","Sun, 10 Jul 2016 20:50:21 +0000","Surrey – Reigate, Merstham and Horley libraries earmarked as sites for new homes under Local Plan – Surrey Mirror. &#34;the council says retention or replacement of the current library service would be required to support any development. Merstham’s library, in Weldon Way, is also a designated site for ten homes and community use . According to the council’s consultation document, a search for an alternative site is already underway as part of regeneration activities. Reigate and Banstead Borough Council has previously said that the community hub on the Triangle site, in Merstham, will include a library, training rooms, a cafe and staff rooms.&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Vale of Glamorgan","Sun, 10 Jul 2016 20:50:21 +0000","Vale of Glamorgan – Barry library to be upgraded to learning hub – Barry Gem.  £100k to add adult learning centre with three classrooms.","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Wiltshire","Sun, 10 Jul 2016 20:50:21 +0000","Wiltshire – This is what Wiltshire’s councillors have done for you – Reform Together. &#34;Library services slashed&#34;. &#34;We are committed to the valuable service libraries offer in Wiltshire and to ensuring provision across our cities, towns and villages. We believe that libraries are not a luxury but play a vital role in the social, educational and cultural value of our communities: for families with young children, school children without a place to work at home, job seekers trying to gain new skills and employment, elderly people living in isolation, and community groups&#34;","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Wrexham","Sun, 10 Jul 2016 20:50:21 +0000","Wrexham – U-turn over plan for Wrexham’s libraries to be run by a trust – Daily Post. Council decides to keep libraries in-house, saying transferring service to a trust would cost £200k more per year.","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["York","Sun, 10 Jul 2016 20:50:21 +0000","York – Library to shut due to fears over building’s safety – Press. &#34;Ongoing structural concerns&#34; mean Haxby Library will close from 16th July while building work goes on. Books to be transferred to school so summer reading challenge can continue.","2016/07/trusts-cost-more-co-locations-new-york-success-and-libraries-meet-un-targets.html"],["Bracknell Forest","Tue, 12 Jul 2016 19:28:44 +0000","Bracknell Forest – Bracknell budget: £6 million cuts likely to hit adult social care, roads and community centre – Get Reading. &#34;Cllr Heydon said: &#34;The first thing is we have statutory obligations we have to make sure we meet. &#34;We have a statutory obligation to run a library service, but what is a statutory library service? &#34;Is it one room or nine libraries?&#34;","2016/07/the-increasingly-ironically-named-reading-ealings-primark-library-and-pokemon-go.html"],["Coventry","Tue, 12 Jul 2016 19:28:44 +0000","Coventry – Dozens of protesters campaign about library cuts outside Coventry Council House – Coventry Telegraph. &#34;Dozens of campaigners staged a protest today outside the Council House to highlight the plight of Coventry’s libraries. They gathered after it emerged a number of libraries could shut if community groups cannot be found to take them over in a bid to save millions from the council budget&#34; … &#34;Nicky Downes, who chairs Save Coventry Libraries and works as a teacher, said librarians at Hillfields library were the lifeblood of the library and supported children’s learning.&#34;","2016/07/the-increasingly-ironically-named-reading-ealings-primark-library-and-pokemon-go.html"],["Reading","Tue, 12 Jul 2016 19:28:44 +0000","Reading – Reading libraries: none will close but opening hours will be cut – Get Reading. &#34;Councillors expected to rubber stamp the plan to save £290,000 based on a public consultation and user numbers … All seven libraries in Reading will stay open but the hours of business will be cut. Reading Borough Council’s policy committee will be looking at the proposals at its meeting on Monday, July 18 which follows a public consultation in which 2,547 people responded.&#34;","2016/07/the-increasingly-ironically-named-reading-ealings-primark-library-and-pokemon-go.html"],["Ealing","Tue, 12 Jul 2016 19:28:44 +0000","Ealing – Ealing Central Library set to move above Primark – but will lose almost 90,000 books – Get West London. &#34;Ealing Central Library is set to move to a smaller location and will lose 70% of its books in a bid to cut costs and improve its technology. Ealing Council will on Tuesday (July 12) discuss plans to move the library from its current two-floor site in Ealing Broadway Shopping Centre to a one-floor facility above the nearby Primark. It will be used as a temporary home, for an expected five years from mid-2017, before the library moves permanently to Perceval House – which is being redeveloped&#34;","2016/07/the-increasingly-ironically-named-reading-ealings-primark-library-and-pokemon-go.html"],["Gateshead","Tue, 12 Jul 2016 19:28:44 +0000","Gateshead – Library campaigners beg Gateshead Council bosses not to close the book on ‘lifeline’ service – Chronicle. &#34;Muriel Davison, 85, is a widow from Felling who says the library is her only lifeline to the outside world. She said: &#34;I live on my own and only get out of the house when I go to Felling Library every Tuesday. I get the chance to see other people and meet all the young children who use the service.&#34;","2016/07/the-increasingly-ironically-named-reading-ealings-primark-library-and-pokemon-go.html"],["Staffordshire","Tue, 12 Jul 2016 19:28:44 +0000","Staffordshire – Community managed libraries: Do you have a great idea to put the community at the heart of your local library? – Staffordshire County  Council. &#34;Communities across the Staffordshire are already benefiting from the flexibility, community spirit and health and wellbeing benefits that community libraries bring. Eleven community libraries due to open their doors in the next few months. We’re now encouraging community groups in twelve other neighbourhoods to apply to manage and deliver their local library:&#34; … &#34;So if you are part of a community or voluntary group are as passionate as  we are about developing library spaces run by local people for local people, please apply before Friday 29 July 2016. If you would like help to fill in the application form, please contact VAST who will be more than happy to help you. &#34;","2016/07/the-increasingly-ironically-named-reading-ealings-primark-library-and-pokemon-go.html"],["Wrexham","Tue, 12 Jul 2016 19:28:44 +0000","Wrexham – Wrexham Council scraps plans to outsource libraries – BookSeller. &#34;&#34;A trust would need to form a management structure, funds for which would need to be sought from within the service budget which would inevitably lead to either increased costs or a need to find a saving from within the operational budget. This would inevitably lead to service changes such as reduction of service/opening hours. Even the most efficient management structure would result in a trust costing £202,000 more per year than an in house model&#34;","2016/07/the-increasingly-ironically-named-reading-ealings-primark-library-and-pokemon-go.html"],["Swindon","Tue, 12 Jul 2016 19:28:44 +0000","Swindon – Swindon Council Leader urged to reconsider public library cuts – CILIP. &#34;CILIP Chief Executive Nick Poole has written to Swindon Council Leader David Renard, urging him to reconsider the extent of the Council’s proposals – which would see 11 out of 15 libraries in Swindon close.&#34; … &#34;The decision to remove a library service is far more than a spreadsheet exercise. We understand your need to find cost-savings but it is vital that you are clear about the social and economic cost both to your Authority and the people you serve&#34;. Three key points; Libraries make places that people want to live in; Libraries make places that people want to work in; Libraries amplify the reach & cost-effectiveness of Council services.","2016/07/the-increasingly-ironically-named-reading-ealings-primark-library-and-pokemon-go.html"],["Swindon","Tue, 12 Jul 2016 19:28:44 +0000","Swindon – Swindon set to close 11 of its 15 libraries – Guardian. &#34;The latest proposals, which go before the council’s cabinet on Wednesday, also suggest that three of the four libraries remaining open would only be staffed for 15 hours a week, with volunteers or self-service technology suggested as a way of keeping the branches open&#34; see also Swindon Council urged to rethink ‘severe’ library closures – BookSeller.","2016/07/the-increasingly-ironically-named-reading-ealings-primark-library-and-pokemon-go.html"],["Swindon","Tue, 12 Jul 2016 19:28:44 +0000","Swindon – Visionaries of Swindon’s railway age often decades ahead of the rest, says Graham Carter – Swindon Advertiser. &#34;It’s clear the council is unwilling or incapable of providing a full library service any more, and the people of Swindon are being asked to help out. But we should understand it’s not so much taking it over as taking it back. And I can’t help thinking that members of the Mechanics’ Institute would have seen the current reinvention of public libraries – because that’s what it is, effectively – as an opportunity, as much as it is a challenge.&#34;","2016/07/the-increasingly-ironically-named-reading-ealings-primark-library-and-pokemon-go.html"],["Barnet","Thu, 14 Jul 2016 20:56:07 +0000","Barnet – Questions asked over move to up communications team budget at Barnet Council while other services face cuts – Times Series. &#34;Anger has been expressed at plans to increase Barnet Council’s communication team budget by more than £450,000 – while other services face drastic cuts.&#34; Library protesters pictured. Local blogger says &#34;&#34;Library staff are being made redundant and my local library, East Barnet, turned into a volunteer only library open just 15 hours a week. &#34;The council should be there to deliver services to residents not spending money on spin.&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Lancashire","Thu, 14 Jul 2016 20:56:07 +0000","Lancashire – Rallying call to save our libraries – Blackpool Gazette. &#34;Friends of Ansdell Library has stressed how vital it is that as many people as possible make their voices heard before the consultation period concludes on August 14.&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Swindon","Thu, 14 Jul 2016 20:56:07 +0000","Swindon – Letters – Swindon Advertiser. &#34;We all know the decision is done and dusted, so who’s kidding whom? The council merely go through the motions and await their collective Bafta award. What are frail and immobile pensioners supposed to do who live on Swindon’s outskirts? Four wall syndrome will return.&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Bury","Thu, 14 Jul 2016 20:56:07 +0000","Bury – Petition launched to keep Ramsbottom Library open – Bury Times. &#34;The Keep Ramsbottom Library Safe Facebook page and petition were set up by local resident Paul Jenkins. he petition came about as Bury Council launched the library service review. The consultation is designed to look at the services the libraries provide for the public before a decision is made next year about what changes to make. Mr Jenkins said: &#34;The library is a focal point for us in the community and we already know how important it is to the people of Ramsbottom.&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Bury","Thu, 14 Jul 2016 20:56:07 +0000","Bury – Town hall answers rumours over library closures – Guide. &#34;&#34;Some of these rumours have been going around on social media. The consultation at this stage is just on service provision. &#34;As a council, we have a duty to provide a library service to the public. &#34;There aren’t specifics around budgets in this consultation because we didn’t want to set out a budget at the start and work towards it. What we want to do is look ahead and see what the needs are for the public.&#34; … &#34;It’s two-and-a-half years since the last consultation. To be frank and honest, we didn’t get it quite right last time. We made the savings that we were asked to because that was the first thing in that review. &#34;The savings are the last thing in this one, we are trying to get it right this time so that we can provide a service that’s not only good for now but good for the next five or 10 years or more. That can adapt for the needs of all.&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Ealing","Thu, 14 Jul 2016 20:56:07 +0000","Ealing – Ealing Central Library gets Primark move as council approves downsize – Get West London. &#34;The library will now be housed in a smaller location and will lose 70% of its books as part of a bid to cut costs and improve its technology&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["East Sussex","Thu, 14 Jul 2016 20:56:07 +0000","East Sussex – Council chiefs may slash library hours to save £500,000 – Eastbourne Herald. &#34;East Sussex County Council’s Cabinet will meet on July 19, to decide whether to agree revised opening hours which could save the authority around £500,000 per year. Residents were asked for their views during a 12-week consultation earlier this year and proposals have been revised to take into account the feedback received.&#34; … &#34;Libraries that currently open later than 5.30pm would retain one evening opening until 6pm on a Thursday, with the exception of Ringmer Library. Following feedback from the public, changes have been made to the proposals for 11 libraries including Seaford Library having one late opening and Ringmer Library opening on a Saturday morning instead of a Tuesday evening.&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Suffolk","Thu, 14 Jul 2016 20:56:07 +0000","Suffolk – Aldeburgh Library set for £30,000 improvements thanks to Foundation’s fundraising – EADT. &#34;Aldeburgh Library is set to close for the first fortnight of September while new decoration, shelving and IT equipment is installed. The work is being funded by the Aldeburgh Library Foundation (ALF), which has raised the five figure sum in just three years using profits from its popular adult education classes, loyalty scheme and charity Christmas cards. Suffolk County Council (SCC) and Aldeburgh Town Council have also provided grants.&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Lancashire","Thu, 14 Jul 2016 20:56:07 +0000","Lancashire – Ribble Valley councillors unite to fight closure of libraries and centres – Lancashire Telegraph. &#34;A six-strong working group, chaired by Whalley councillor and deputy borough leader, Terry Hill, is looking into the impact of the potential losses of the centres&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Waltham Forest","Thu, 14 Jul 2016 20:56:07 +0000","Waltham Forest – Campaigners angered by proposals to relocate libraries – Guardian Series. &#34;Campaigners have expressed their anger at the council proposals to relocate libraries. Waltham Forest Council Cabinet voted to consult the public about relocating three libraries in Hale End, Higham Hill and Wood Street. A fourth library, in Lea Bridge Road, will be renovated.&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Northern Ireland","Thu, 14 Jul 2016 20:56:07 +0000","Northern Ireland – ‘Only a matter of time before libraries close’ – Carrickfergus Times. &#34;Mid and East Antrim Borough Council has said it is &#34;disappointed&#34; over plans to cut opening hours at local library branches. Under the proposals from Libraries NI, Ballymena Central and Carrickfergus Libraries are to be reduced from 50 hours per week to 45. The reduction forms part of an overall package of savings that Libraries NI is implementing.&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Swindon","Thu, 14 Jul 2016 20:56:07 +0000","Swindon – Letters – Swindon Advertiser. (1) Letter by Nick Poole. &#34;As the chief executive of CILIP, the UK’s library association, I am deeply concerned about the proposed cuts to Swindon’s libraries. I have written to the council leader, David Renard, urging Swindon Council to reconsider the extent of the proposals – which would see 11 out of 15 libraries in Swindon close. The decision to shut libraries cannot be just a cost-saving, spreadsheet exercise. We recognise the financial pressures that local authorities are under but these drastic proposals would massively reduce investment in Swindon and have disproportionate social and economic costs to the council and residents. I urge Coun Renard to consider the following points in the council’s debate…&#34; (2) &#34;Cameron says the British economy is strong and the fifth largest in the world. The fact that Britain can no longer afford libraries suggests that British economy is much weaker that Cameron has been telling us&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Warwickshire","Thu, 14 Jul 2016 20:56:07 +0000","Warwickshire – Pirates and other performers haul in crowds at Warwickshire libraries – Leamington Courier. &#34;Thanks to a £49,900 from the Arts Council, the library service ran 74 Fantastic Fun With Words sessions across 17 libraries in the county.&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Worcestershire","Thu, 14 Jul 2016 20:56:07 +0000","Worcestershire – Council chiefs scale back cuts to library opening hours in Wyre Forest – Shuttle. &#34;Controbersial proposals to slash 78.5 hours off library opening times across Worcestershire – including Stourport, Kidderminster and Bewdley libraries – has been scaled back, it has emerged. Worcestershire County Council has decided to reduce the cutbacks to 55 hours a week, after it faced criticism during a public consultation. It was revealed in April the county council had hatched a plan to shave opening hours off 17 different sites as part of a fresh plan to save £1 million. But following an outcry, 23.5 hours will be ‘added’ back into the mix, saving several libraries from unpopular changes&#34;","2016/07/wifi-digital-inclusion-nhs-public-libraries-and-a-new-culture-secretary.html"],["Bracknell Forest","Mon, 18 Jul 2016 20:30:59 +0000","Bracknell Forest – Bracknell austerity protesters fail to stop £6 million cuts – Get Reading. &#34;Members of the Defend Our Community Services (DOCS) group lobbied Bracknell Forest Councillors before the council meeting on Wednesday, July 13 protesting austerity measures the Executive committee recommended in May. Councillors paid little heed to the protesters once the meeting began swiftly passing more than £6 million of cuts and axing 10 jobs in a bid the balance Bracknell’s books.&#34; … &#34;Other members of DOCS, Diane Thomas, 70, Nicola Waugh, 52, Amanda Preece, 50, and Alan Cocks, 73, explained they worried about potential library cuts and argued the case for libraries as a cultural custodian.&#34;","2016/07/goodbye-ed-vaizey.html"],["Bromley","Mon, 18 Jul 2016 20:30:59 +0000","Bromley – All-out strike of council services planned for this week – Bromley Times. &#34;Bromley library workers started seven days of strike action on Saturday. From July 16, libraries will face the latest wave of strike action, with the workers’ union Unite claiming &#34;workers are taking action against cuts and privatisation&#34;. All council services are planning an all-out strike on Wednesday, July 10″","2016/07/goodbye-ed-vaizey.html"],["East Sussex","Mon, 18 Jul 2016 20:30:59 +0000","East Sussex – Library opening hours expected to be cut – Argus. &#34;Cabinet will meet on Tuesday to decide whether to agree revised opening hours which could save around £500,000 per year. The plan is an average 25 per cent reduction in opening hours across the county’s 24 libraries, following a 12-week public consultation. If agreed, opening times will continue to vary across the county but libraries will generally not open before 10am or after 5pm.&#34;","2016/07/goodbye-ed-vaizey.html"],["Herefordshire","Mon, 18 Jul 2016 20:30:59 +0000","Herefordshire – Book fair fund-raisers to become bi-annual at Ledbury Library? – Ledbury Reporter. &#34;book fair in the Panelled Room of Ledbury Library raised £800 for stackable chairs, which will help the venue to host more community events in the future, including for local schools. In fact, the two and a half day book sale was so successful, plans are afoot to run book fair fund-raisers twice a year, for a week each time. Ledbury Library Development Group spokesman, Nina Shields said: &#34;It became clear that the two and a half days was not long enough for the bibliophiles of Ledbury. The response with book donations and with people coming to buy was wonderful. We have nowhere to store the unsold books so will be selling them through other outlets. The amount raised is about £800 and as a result we will be able to buy the much needed stackable chairs together with a stand for storage.&#34;","2016/07/goodbye-ed-vaizey.html"],["Swindon","Mon, 18 Jul 2016 20:30:59 +0000","Swindon – Swindon library closures: Campaigners urge rethink – BBC. &#34;Shirley Burnham, from Save Swindon’s Libraries, said they want &#34;the town consulted properly&#34;. &#34;We hope for a rethink…a well costed and well thought out alternative,&#34; she said.&#34;","2016/07/goodbye-ed-vaizey.html"],["Devon","Mon, 18 Jul 2016 20:30:59 +0000","Devon – People behind the business: Ciara Eastell, Libraries Unlimited – Exeter Express and Echo. &#34;I’m the chief executive of Libraries Unlimited, a new social enterprise running libraries across Devon….  The best thing about my job is… Seeing the difference that great libraries can have on individuals and local communities – for example, helping people find a job, set up a business or seeing a child who grows to love books from the support of a librarian. At Libraries Unlimited, we want to ensure libraries can have as much impact as possible on the way people – of all ages – learn, read and connect with others. Over 120,000 people across Devon regularly use our services – that’s a great starting point for a new business and we’d love to welcome many more people back to libraries to see what’s now on offer.&#34;","2016/07/goodbye-ed-vaizey.html"],["Swindon","Mon, 18 Jul 2016 20:30:59 +0000","Swindon – Cabinet offers cautious backing to libraries strategy – This is Wiltshire. &#34;Cabinet has voted in favour of the libraries strategy, paving the way for a move from 15 funded libraries down to four. In a wide ranging debate during their meeting on Wednesday, cabinet members discussed issues including the role of volunteers, finding new income streams, the mobile library and the use of transitional funding. But observers hoping for greater clarification on detail or specifics will have been disappointed, instead it appeared that a sense of hope was the driving force behind the plans as they currently stand.&#34;","2016/07/goodbye-ed-vaizey.html"],["Dumfries and Galloway","Mon, 18 Jul 2016 20:30:59 +0000","Dumfries and Galloway – Council engaging population – Galloway Gazette. Changing traditional libraries into ‘integrated facilities’ three years ago has increased footfall by 18 per cent. This welcome news was given to elected members at the Wigtown Area Committee monthly meeting in Stranraer on Wednesday, but Wigtown West Councillor Grahame Forster commented that although library attendance had gone up in Stranraer, there was no way of knowing why those going through the doors were there, since customer services, registration and libraries were combined&#34;","2016/07/goodbye-ed-vaizey.html"],["Northern Ireland","Mon, 18 Jul 2016 20:30:59 +0000","Northern Ireland – Video: Hands Off Our Libraries Campaign in Belfast – Belfast Telegraph. &#34;Campaigners deliver a partition [sic] to the Department for Communities calling on Minister Paul Givan to make funds available to halt further cuts of library hours. &#34;","2016/07/goodbye-ed-vaizey.html"],["Waltham Forest","Mon, 18 Jul 2016 20:30:59 +0000","Waltham Forest – Update: Fight to save library from demolition enters next phase – This is Local London. &#34; vote to relocate four libraries in Waltham Forest, including the &#34;much-loved&#34; Hale End Library in Highams Park, was passed by the council on Tuesday (July 14). Campaign organiser, Oliver Shykles, said this was an &#34;expected setback&#34; and it is now up to concerned supporters to voice their anger against the plans. A consultation phase has begun where those wishing for the library to remain at its Castle Avenue site can actively oppose the council’s plans.&#34;","2016/07/goodbye-ed-vaizey.html"],["Lancashire","Mon, 18 Jul 2016 20:30:59 +0000","Lancashire – Calls for legal fight against Morecambe Library and kids centre cuts – Visitor. &#34;After feelings ran high at a town meeting over the future of the library and children’s centres, there were calls for a legal challenge to government cuts in Lancashire. Councillors said they would back a judicial review if controversial plans to turn Morecambe Library into a self-service ‘satellite library’ and sell off Poulton, Balmoral and Heysham children’s centres go ahead.&#34;","2016/07/goodbye-ed-vaizey.html"],["Leicestershire","Mon, 18 Jul 2016 20:30:59 +0000","Leicestershire – Barwell is the sole library to close in cost-cutting plans – Hinckley Times. &#34;Just one library has closed following cost-cutting plans by Leicestershire County Council to transfer control to community groups. Barwell is the only village library to shut down after volunteers pulled their bid to take responsibility because of fears over its long-term sustainability.&#34;","2016/07/goodbye-ed-vaizey.html"],["North Lanarkshire","Mon, 18 Jul 2016 20:30:59 +0000","North Lanarkshire – Children take part in last-gasp protest against closure of Coatbridge library – Daily Record. Old Monkland: &#34;They staged a show of support for the Coatbridge facility this week – making posters and banners to protest against the decision that it will shut its doors for the final time in the next month. It is among four North Lanarkshire libraries, also including Petersburn in Airdrie, which will close following a £1.1million reduction in the management fee paid to operators Culture NL by the council. Read more at http://www.dailyrecord.co.uk/news/local-news/children-take-part-last-gasp-8413888#jjTspi3oDPXpBxJZ.99″","2016/07/goodbye-ed-vaizey.html"],["Swindon","Mon, 18 Jul 2016 20:30:59 +0000","Swindon – Last ditch attempt to save Swindon’s libraries – ITV. &#34;Campaigners will be protesting outside Swindon Borough Council later in a final bid to save some of Swindon’s doomed libraries&#34;","2016/07/goodbye-ed-vaizey.html"],["North Somerset","Mon, 18 Jul 2016 20:30:59 +0000","North Somerset – Parish council set to take over under-threat village library? – Mercury. &#34;Congresbury Library is one of several children’s centres and libraries which could be closed or merged into single buildings as part of money-saving plans proposed by North Somerset Council. The plans are out for public consultation until September 30 and although the council says it has not made firm decisions about possible closures or mergers, Congresbury Parish Council is already exploring the option of taking on the village library in Station Road.&#34;","2016/07/goodbye-ed-vaizey.html"],["Shropshire","Mon, 18 Jul 2016 20:30:59 +0000","Shropshire – Shropshire Council criticised for key services silence – Shropshire Star. &#34;It comes after Councillor Malcolm Pate, leader of Shropshire Council, announced there would be an extension of up to 12 months for councils and organisations to look into taking on closure-threatened services such as libraries and leisure centres. In an unexpected twist Councillor Pate said &#34;a little bit of money&#34; had been found in the local authority’s budgets to allow towns and parishes more time to plan.&#34; … &#34;Councillor Cooper said: &#34;We’ve had absolutely no notification from Shropshire Council. They just don’t communicate with us.&#34;","2016/07/goodbye-ed-vaizey.html"]]