[["Isle of Wight","Thu, 04 Jun 2015 20:15:26 +0000","Isle of Wight – Are Isle of Wight libraries in crisis again? – On the Wight. &#34;Proposals by the Isle of Wight council to fund just one librarian at Ventnor library for only 23 hours a week indicates major changes to the Island’s six council funded libraries could be afoot. &#34; … &#34;&#34;Ventnor’s Library will be changed to what the Isle of Wight Council calls a Community Supported Library later this year. When this happens the Isle of Wight will continue to fund one Librarian (23 hours per week), but only if the Town Council funds the running costs.&#34;&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["Lambeth","Thu, 04 Jun 2015 20:15:26 +0000","Lambeth – Lambeth Council opens Pop Up Library in Tulse Hill pointing way to future of service following Cultural Consultation – Brixton Buzz. &#34;Lambeth Council has opened a pop up library in Tulse Hill at the High Trees Community Development Trust. This is the first sign that one possible future for the service in Lambeth will involve informal locations for libraries to be used by residents.&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["Brent","Tue, 02 Jun 2015 19:13:18 +0000","Brent – Open Day in the Library – Save Kensal Rise Library. &#34;The Friends of Kensal Rise Library and the new owners of the library building, Uplift Properties Ltd,  invite everyone to an Open Day inside the Kensal Rise Library building. I don’t need to tell you all how significant this event is – it will be the first time in nearly five years that our community will once again have access to the library building.  The Open Day will be an opportunity for the community to meet the new owners and hear about their plans for the building, as well as seeing exactly where the new library and community space will be situated.&#34;","2015/06/scottish-national-library-strategy-north-yorks-deep-cuts-cambridge-central.html"],["North Yorkshire","Tue, 02 Jun 2015 19:13:18 +0000","North Yorkshire – Libraries to get help after thousands protest over cuts – Northern Echo. &#34;… bosses are pressing ahead with plans to axe staff at 21 libraries across North Yorkshire but are offering crucial support to help volunteers keep them open. More than 17,000 people have protested about North Yorkshire County Council’s plans to cut over £1.6 million from the libraries budget.&#34; … &#34;the council says the consultation revealed most people felt that the new community managed libraries would need some dedicated staff if they were to succeed. So now eight including Catterick, Colburn, Easingwold, Stokesley and Thirsk would get between 12 and 15 hours of support; others such as Bedale, Leyburn, Boroughbridge, Helmsley, Kirkbymoorside and Norton will have between five and seven hours support. The larger town libraries including Northallerton and Richmond will lose 40 per cent of their staff, with smaller centres including Ripon, Pickering, Knaresborough and Whitby cut by 60 per cent. Volunteers will also be encouraged to hel&#8230;","2015/06/scottish-national-library-strategy-north-yorks-deep-cuts-cambridge-central.html"],["Bristol","Tue, 02 Jun 2015 19:13:18 +0000","Bristol – Last month of Bristol’s library service consultation – Western Daily Press. &#34;There is just one month left of the second phase of consultation into the future of Bristol’s library service and the council wants to make sure everyone has their say. Unlike the first informal phase of consultation, this second phase is focussing on a set of specific proposals for the whole service.&#34;","2015/06/scottish-national-library-strategy-north-yorks-deep-cuts-cambridge-central.html"],["Edinburgh","Tue, 02 Jun 2015 19:13:18 +0000","Edinburgh – The story of Edinburgh Libraries. Part 1 of 3 – Tales of One City. Traces history from 1890.","2015/06/scottish-national-library-strategy-north-yorks-deep-cuts-cambridge-central.html"],["Cambridgeshire","Tue, 02 Jun 2015 19:13:18 +0000","Cambridgeshire – Enterprise centre at Cambridge Central Library is given the go-ahead - Cambridge News. &#34;The £600,000 project was voted through by just seven votes to six in front of a packed public gallery that greeted the decision with anger.&#34; … &#34;councillors from the city joined residents in condemning the consultation around the proposals, as well as urging officers to consider other options to generate much-needed income to keep the library service. However, these appeals proved worthless as seven members of the council’s highways and community infrastructure committee – six Tories and UKIP vice chairman Cllr Peter Reeve – voted in favour.&#34; … &#34;The enterprise centre is budgeted to provide around £200,000 a year of additional income, although only £80,000 of this is guaranteed. Kora will pay the council an annual service charge, repay the council’s initial £300,000 investment and give it a share of any profit.&#34;","2015/06/scottish-national-library-strategy-north-yorks-deep-cuts-cambridge-central.html"],["Newham","Tue, 02 Jun 2015 19:13:18 +0000","Newham – Improved Forest Gate community centre to open next month – Newham Recorder. &#34;Residents can look forward to a range of new facilities which have been added to The Gate Library, on Woodgrange Road. This includes a coffee shop, free Wi-Fi, and more community space which could be used for events and displays. The refurbished centre, which will open on Wednesday 10 June, is part of the council’s drive to bring local communities together through activities and events.&#34; … &#34;Local business, Coffee 7, will run the new coffee shop, and new display screens will showcase information about local events and council services.&#34;","2015/06/scottish-national-library-strategy-north-yorks-deep-cuts-cambridge-central.html"],["Staffordshire","Tue, 02 Jun 2015 19:13:18 +0000","Staffordshire – Stone and Eccleshall libraries’ future‏ – Stone Gazette. &#34;Stone and Eccleshall’s libraries are both safe – for now. Neither of them will be affected by County Council plans to transfer the management and staffing of 20 of its 43 libraries to local communities later this year.&#34; … &#34;Assessment of the applications will begin in August, with recommendations made in September and the first groups taking charge of their libraries soon after.&#34;","2015/06/scottish-national-library-strategy-north-yorks-deep-cuts-cambridge-central.html"],["Newport","Tue, 02 Jun 2015 19:13:18 +0000","Newport – Library fate to be decided by Newport councillors – South Wales Argus. &#34;Maindee and Carnegie libraries are to find out their fate as a final decision is made next week on Newport’s library service cuts. Newport City Council’s cabinet will make their decision on proposals to close both Maindee and Carnegie libraries and reduce services at Central Library with the loss of nine full time jobs at a meeting on Monday, June 8.&#34; … &#34;The council hopes the proposals will save £232,815 in 2015/16 with a net benefit of £61,340 after £171,475 is spent on implementing its plans. &#34;","2015/06/scottish-national-library-strategy-north-yorks-deep-cuts-cambridge-central.html"],["Bristol","Thu, 04 Jun 2015 20:15:26 +0000","Bristol – Last chance to save Bristol libraries – ITV. &#34;It’s the final month of a consultation into the possible closure of seven libraries in Bristol. The city’s council say they need to make changes to save money. They’re also looking at extending opening times at some other libraries. People across the city have been protesting against the closures. Final decisions will be made in August after the consultation ends on June 30th.&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["Bristol","Thu, 04 Jun 2015 20:15:26 +0000","Bristol – Peaceful protest on Saturday against Westbury-on-Trym Library closure threat - Bristol Post. &#34;People of all ages will queue up to withdraw books and then march peacefully around the village before returning them and rallying at Canford Park to demonstrate how well-used the library is and how passionately they feel about keeping it open.&#34; … &#34;Westbury-on-Trym library is the 4th busiest for borrowings out of the city’s 28 libraries, yet it is on the hit list for possible closure. In April, a packed public meeting challenged head of libraries Kate Murray to defend the proposal and hundreds of objections have already been submitted to the council.&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["Cambridgeshire","Thu, 04 Jun 2015 20:15:26 +0000","Cambridgeshire – Kora met Cambridgeshire County Council 37 times over controversial enterprise centre library plans -Cambridge News. &#34;It seems to be officers going off and doing their own thing, which is very worrying,&#34; she [Cllr Taylor] said. &#34;I think it’s symptomatic of the way the old Conservative cabinet used to operate. It seems they agree things very much in principle and then let officers do them without taking an active involvement.&#34; … &#34;The county council’s executive director for economy, transport and environment, Graham Hughes, said: &#34;The council is facing huge financial challenges, and the way the library service operates needs to change in order to survive.&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["North Yorkshire","Thu, 04 Jun 2015 20:15:26 +0000","North Yorkshire – Have Your Say: Support for libraries after public backlash – Ripon Gazette. &#34;following a major public backlash, council bosses have now agreed that community-managed libraries would need some dedicated staff input to succeed and more support would be needed in busier centres.&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["Cornwall","Thu, 04 Jun 2015 20:15:26 +0000","Cornwall – Camborne residents fight to save library at Trelawney Alliance meeting - West Briton. &#34;&#34;If the library service is moved to the One Stop Shop you can expect a for sale sign to be put up on the current site soon after.&#34; Mr Brown responded by guaranteeing the people of Camborne that there will still be a library service in the town, just that it might not necessarily be in the building where it is located now.&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["Lincolnshire","Thu, 04 Jun 2015 20:15:26 +0000","Lincolnshire – Shortlist announced for Lincolnshire libraries contract – Lincolnshire Echo. &#34;Nick Worth, executive member for Libraries, said: &#34;The successful bidder will be responsible for providing the new-look service approved by the council’s Executive earlier this year. &#34;In the meantime, we’ll continue to implement our plans to create that new-look library service, working with local groups to develop the network of community hubs over the next few months.&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["Dorset","Thu, 04 Jun 2015 20:15:26 +0000","Dorset – Police to set up contact point at Dorchester Library – Dorset Echo. New &#34;volunteer supported police contact point will open at the Dorchester Library and Learning Centre this week. The move comes after the decision was made earlier in the year to close the front desk at the county town’s police station.&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["Leicestershire","Thu, 04 Jun 2015 20:15:26 +0000","Leicestershire – Leicestershire County Council is giving people more time to volunteer to run their local library - Leicester Mercury. &#34;The county council is giving members of the community extra time to come forward and help run their local library. A total of 36 libraries across Leicestershire were under threat of closure due to cost cutting measures&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["Leicestershire","Thu, 04 Jun 2015 20:15:26 +0000","Leicestershire – Opening hours to reduce at Melton Library – Melton Times. &#34;Opening hours will reduce by 15 per cent, with the library being open for nine-and-a-half hours less during the week (Monday to Saturday) than at present. It will open half an hour later at 10am but will stay open for an extra hour (until 6pm) on Tuesdays and Fridays. The changes to library opening hours, agreed by Leicestershire County Council’s Cabinet last September, follow a consultation on the county council’s proposals to save £800,000 from libraries. More than half of the respondents agreed that closing larger libraries at less busy times would be one way to tackle the funding issue.&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["Northamptonshire","Thu, 04 Jun 2015 20:15:26 +0000","Northamptonshire – Wellbeing Community Interest Company (CIC) - Northamptonshire Council. &#34;Book onto one of the Wellbeing Community Interest Company Road shows being held across Northamptonshire during June. The road shows are an opportunity for residents, voluntary organisations, current service providers and other interested partners and public bodies in the county to: hear about the Wellbeing Community Interest Company concept / understand what will change / share your views on the ideas for the Wellbeing Company.&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["Shropshire","Thu, 04 Jun 2015 20:15:26 +0000","Shropshire – If you care about Shropshire libraries please get in touch… - Library Campaign. &#34;A campaign to support and defend Shropshire’s public libraries is being launched. Committed and active library supporters from all over the county are urgently needed.Please email shroplibyes@gmail.com to register your support and be added to the mailing list&#34;","2015/06/the-government-will-those-who-help-themselves.html"],["Blaenau Gwent","Sun, 07 Jun 2015 16:56:10 +0000","Blaenau Gwent – Town Council minutes - Blaenau Town Council, 22nd April, &#34; … regarding the relocation of the Brynmawr Library Service to the Adult Learning Centre on the Market Square. The Aneurin Leisure Trust has indicated its wish to relocate the Brynmawr Library from its present premises to the Adult Learning Action Centre. This will assist in its wish to reduce its own financial pressures. At the same time the relocation will release the present Library space to enable the Market Hall Cinema Trust to establish a second screen Auditorium, thereby assuring the long term provision of film screening in the Cinema. The County Borough Council supports this proposition while itself suffering financial restraints. The cost of the Library relocation is £20,000 of which the County Borough Council is offering a 50% contribution. The Market Hall Cinema Trust will contribute £2,000. The Town Council is therefore asked for financial assistance in the sum of £4,000. The remaining balance will be the subject of further discussion/negotiation&#8230;","2015/06/another-window-dressing-review-and-more-on-the-increasingly-disastrous-cambridge-enterprise-centre.html"],["Trafford","Tue, 09 Jun 2015 21:10:36 +0000","Trafford – Lostock Library - Trafford Council. &#34;Lostock Library will be transferring to Lostock College to be retained as a school library with community access. To support this community access Open+ technology will be installed in the library. Lostock Library will close on Tuesday 23 June for the installation of Open+ technology. The library will re-open on Monday 29 June and will be run and maintained by Lostock College staff.&#34;","2015/06/finding-a-warm-welcome-and-navigating-to-a-new-life.html"],["Bristol","Sun, 07 Jun 2015 16:56:10 +0000","Bristol – Protest held in Bristol against library closures – ITV. &#34;Demonstrations against closing libraries stepped-up a gear today with a mass book-borrow and rally. The protest in Westbury-on-Trym is the latest march against plans by Bristol City Council to cut costs, but families say it’ll rip the heart out of their community.&#34; see also Westbury-on-Trym library protesters borrow books in anti-closure rally - BBC. &#34;Residents in Westbury-on-Trym, Bristol, queued up outside the building as part of a demonstration. They claim the library is the fourth busiest out of the city’s 28, with 4,000 regular users.&#34; and Book lovers march in a campaign to save their library in Westbury-on-Trym - Bristol Pot.","2015/06/another-window-dressing-review-and-more-on-the-increasingly-disastrous-cambridge-enterprise-centre.html"],["Cambridgeshire","Sun, 07 Jun 2015 16:56:10 +0000","Cambridgeshire – Enterprise centre at Cambridge Central Library shelved over Kora director disqualification - Cambridge News. &#34;Roger Perrin has led negotiations with the county council for months about the fiercely contested plans. But Cambridge-based entrepreneur and architect Mr Perrin is banned from being a company director in the UK until 2019, according to Companies House records&#34;.   Council says &#34;&#34;In light of information that has come to our attention the council’s executive director for economy, transport and environment has following consultation with the committee chairman suspended further work on the project, pending consideration by the committee.&#34;","2015/06/another-window-dressing-review-and-more-on-the-increasingly-disastrous-cambridge-enterprise-centre.html"],["Coventry","Sun, 07 Jun 2015 16:56:10 +0000","Coventry – ‘How much does Coventry council does value libraries?’ - Coventry Telegraph / Lettter. &#34;I am sure that I am not alone in appreciating the excellent service that the library serves in my local area and that many people will share my views about the importance of their own local libraries in the city.  I recently wrote to Councillor David Kershaw about my concerns about proposed library closures in Coventry as part of the council cuts. This was part of his reply: &#34;I think you know I am a great believer and supporter of the Library Service.&#34; Publicly Councillor Kershaw has promised that no library will close over the next 12 months and no library staff will be made compulsorily redundant. However, rumours and worries persist …&#34;","2015/06/another-window-dressing-review-and-more-on-the-increasingly-disastrous-cambridge-enterprise-centre.html"],["Coventry","Sun, 07 Jun 2015 16:56:10 +0000","Coventry – Public meeting as Stoke Aldermoor residents continue bid to save community library – Coventry Telegraph. &#34;Stoke Aldermoor Residents Association has been asking for support for Aldermoor Community Library, in Acorn Street, and members are now calling on everyone concerned for the library’s future to join them on Monday. The meeting will take place at the library from 3.20pm. The residents association is also calling on local ward councillors to join them. The Telegraph reported in February how Coventry City Council planned to axe a number of libraries to save cash. But there was a stay of execution when it was later announced that every library in Coventry would remain open for at least another year.&#34;","2015/06/another-window-dressing-review-and-more-on-the-increasingly-disastrous-cambridge-enterprise-centre.html"],["Flintshire","Sun, 07 Jun 2015 16:56:10 +0000","Flintshire – Mancot campaigner won’t close book in fight for libraries – Leader. &#34;John Peters, 76, secretary of the Save the Village Library Committee, says he hopes &#34;democracy will prevail&#34; and Flintshire Council’s decision to shut libraries in Hawarden, Mancot and Queensferry and move provisions to a hub in Deeside Leisure Centre will be overturned. It comes days after it was announced the decision has been called in by Cllr Clive Carver, with Flintshire councillors Adele Davies-Cooke, Alison Halford, Davie Mackie and Glenys Diskin adding their support.&#34;\nHarrow – Culture Minister Ed Vaizey pledges to review library closures in Harrow - Harrow Times. &#34;Harrow East MP Bob Blackman raised the issue of Harrow Council’s plan to close four libraries during a meeting at the House of Commons yesterday&#34; … &#34;Speaking to the House, he asked culture, media and sport secretary minister whether he would intervene to ensure the council fulfils its &#34;statutory duties&#34;.","2015/06/another-window-dressing-review-and-more-on-the-increasingly-disastrous-cambridge-enterprise-centre.html"],["Flintshire","Sun, 07 Jun 2015 16:56:10 +0000","Flintshire – Library Closures? …a Gladstonian perspective - Youtube. &#34;Hawarden is home to Mr Gladstone’s prestigious, commemorative, residential library. It is quite separate from the local authority facility currently under threat of closure -but I was curious about the Gladstone aspiration perspective. During May 2015, I sought the views of Gladstone’s Library Principal, Dr Peter Francis …&#34;","2015/06/another-window-dressing-review-and-more-on-the-increasingly-disastrous-cambridge-enterprise-centre.html"],["North Yorkshire","Sun, 07 Jun 2015 16:56:10 +0000","North Yorkshire – Outome of library consultation not as good as claimed – Kirkbymoorside News. &#34;Hardly a rethink, more like a sop – the change since the original proposal represents about 3% more cash. NYCC completely ignored the majority in the consultation, who said that economies should be made elsewhere, not in the library service. And the devil is in the detail. The extra 5-7 hours of staff time is not necessarily actual time in Kirkbymoorside Library. Additional support staff will be based at &#34;core&#34; libraries – in our case, Malton. They will support a number of libraries. They will not be professional librarians. The plans include provision for a review after a year or two, with a view to removing the paid staff, thus taking us back to the original proposal. (NYCC noted that the consultation elicited cynicism about whether matters were already decided – cynicism that seems fully justified).&#34;","2015/06/another-window-dressing-review-and-more-on-the-increasingly-disastrous-cambridge-enterprise-centre.html"],["Powys","Sun, 07 Jun 2015 16:56:10 +0000","Powys – Le Carré backs fight to save Hay library – Times. &#34;Residents will have to raise £7,000 a year to subsidise the running costs and keep the library open after the local council cut funding by 30 per cent. Campaigners in the Welsh border town, which has 30 secondhand and antiquarian shops, have been backed by the novelist John le Carré. &#34;","2015/06/another-window-dressing-review-and-more-on-the-increasingly-disastrous-cambridge-enterprise-centre.html"],["Leicestershire","Sun, 07 Jun 2015 16:56:10 +0000","Leicestershire – Library redundancies and days axed – Loughborough Echo. &#34;Leicestershire County Council says it wants to claw back £135,000 over the next four years from the libraries it still manages. This comes on the heels of last year’s decision to see all village libraries run by community groups or face closure. In Loughborough, two part-time staff have taken voluntary redundancy, one has left, while two have been transferred to other libraries. Two full-time members of staff have lost their permanent contracts, reduced from 37 hours a week to 34.&#34;","2015/06/another-window-dressing-review-and-more-on-the-increasingly-disastrous-cambridge-enterprise-centre.html"],["North Yorkshire","Sun, 07 Jun 2015 16:56:10 +0000","North Yorkshire – Consultation prompts North Yorkshire library staff rethink – BBC. &#34;Libraries in North Yorkshire will not be run entirely by volunteers after a public consultation revealed people were against the move. Council plans were for 21 libraries to be community-run but the authority is now proposing that those libraries have some paid staff.&#34;","2015/06/another-window-dressing-review-and-more-on-the-increasingly-disastrous-cambridge-enterprise-centre.html"],["Leicestershire","Sun, 07 Jun 2015 16:56:10 +0000","Leicestershire – More community groups agree to run village libraries – Hinckley Times. &#34;Community bids from Barwell and Markfield to run the local library services have been accepted by Leicestershire County Council. They are among a total of 21 groups which are set to reach formal agreement to take over county council libraries, with the first community-managed venue expected to launch in July.&#34;","2015/06/another-window-dressing-review-and-more-on-the-increasingly-disastrous-cambridge-enterprise-centre.html"],["Birmingham","Tue, 09 Jun 2015 21:10:36 +0000","Birmingham – Friends of Library of Birmingham to march on Saturday to protest major cuts to opening hours – Twitter.","2015/06/finding-a-warm-welcome-and-navigating-to-a-new-life.html"],["Stoke on Trent","Tue, 09 Jun 2015 21:10:36 +0000","Stoke on Trent – New library rules set to see bans lifted – Stoke Sentinel. &#34;Stoke-on-Trent City Council is looking to update the by-laws governing behaviour at its libraries so they better reflect how people use the facilities n the 21st century. And the changes are set to bring an end to the traditional image of libraries as bastions of silent reading and study. Under the current by-laws, visitors are barred from engaging in ‘audible conversation’ in reference sections or areas set side for reading and study, if told not to do so by a member of staff.&#34;","2015/06/finding-a-warm-welcome-and-navigating-to-a-new-life.html"],["Edinburgh","Tue, 09 Jun 2015 21:10:36 +0000","Edinburgh – Party time as Edinburgh libraries celebrate landmark birthday – Edinburgh Council. &#34;A big birthday bash, readings by children’s authors, a rare glimpse of Japanese art, and a debate on the future of libraries are all examples of the fun-packed programme taking place this month. The Central Library was the first to open in the Capital to the public on June 9th, 1890, and now a total of 28 across the city welcome 3.4 million visitors each year.&#34;","2015/06/finding-a-warm-welcome-and-navigating-to-a-new-life.html"],["North Yorkshire","Tue, 09 Jun 2015 21:10:36 +0000","North Yorkshire – Cash to get libraries up and running – Malton Mercury.","2015/06/finding-a-warm-welcome-and-navigating-to-a-new-life.html"],["Lincolnshire","Tue, 09 Jun 2015 21:10:36 +0000","Lincolnshire –  Council leader throws weight behind Deepings Library campaign – Peterborough Telegraph. &#34;South Kesteven District Council leader Bob Adams vowed to use &#34;all the influence I can&#34; to keep the library in Market Deeping open in the face of plans to slash the number of local authority-run libraries from 47 to 15.&#34;","2015/06/finding-a-warm-welcome-and-navigating-to-a-new-life.html"],["Manchester","Tue, 09 Jun 2015 21:10:36 +0000","Manchester – Celebrate Manchester Day at Central Library with more than a dozen free events for all the family - Manchester Council. &#34;Manchester Day 2015 explodes onto the city centre very soon and as an extra bonus, Central Library will also be open for Sunday Funday: Game On! Come along and join in with a dozen different digital activities for all the family.&#34;","2015/06/finding-a-warm-welcome-and-navigating-to-a-new-life.html"],["Newport","Tue, 09 Jun 2015 21:10:36 +0000","Newport – Library fate to be decided by Newport councillors - South Wales Argus. &#34;Maindee and Carnegie libraries are to find out their fate as a final decision is made next week on Newport’s library service cuts. Newport City Council’s cabinet will make their decision on proposals to close both Maindee and Carnegie libraries and reduce services at Central Library with the loss of nine full time jobs at a meeting on Monday, June 8.&#34;","2015/06/finding-a-warm-welcome-and-navigating-to-a-new-life.html"],["Bromley","Thu, 11 Jun 2015 18:55:47 +0000","Bromley – Bromley residents urged to take a stand against ‘mass privatisation plans’ – Bromley Times. &#34;Bromley residents are being urged to take a stand against the mass privatisation of council services at the People and Services First march on Saturday (June 13) from 12 noon at Norman Park. Protesters including members of the union Unite, who are carrying out a third wave of strikes, claim the borough’s Conservative-run council intends to farm out most of its services to private companies and reduce the number of council employees from 4,000 to 300. With 14 of the council’s libraries among the services earmarked for privatisation, Bromley-based children’s author, Sam Gayton said: &#34;Libraries have given me so much – my imagination, my love of books, and my future career.&#34;","2015/06/wales-feels-the-pinch-scl-and-ascel-positivity.html"],["Flintshire","Thu, 11 Jun 2015 18:55:47 +0000","Flintshire – Closure is final word on libraries in Flintshire – News North Wales. &#34;A Flintshire Council committee voted yesterday not to try to block plans to close libraries in Hawarden, Mancot and Queensferry and move facilities to a hub at Deeside Leisure Centre.&#34; … &#34;The proposal had been ‘called in’ by opposition Conservative group leader Cllr Clive Carver, of Hawarden, with Flintshire Tory councillors Adele Davies-Cooke from Gwernaffield and Alison Halford from Ewloe, Independent councillor Dave Mackie from Ewloe and Mancot Labour councillor Glenys Diskin adding their support. The move to close the libraries was approved last month by Flintshire’s cabinet, despite more than 1,000 people petitioning against the proposal. They said then that their views were ignored and a decision had already been made.&#34;","2015/06/wales-feels-the-pinch-scl-and-ascel-positivity.html"],["Leicestershire","Thu, 11 Jun 2015 18:55:47 +0000","Leicestershire – Volunteer-run community group steps up plans to take over running of Bottesford Library – Grantham Journal. &#34;The Bottesford Community Library Association, which was formed last year, has asked Melton Council for a £1,000 contribution to help with the set-up costs of its library service. Its request will be considered by the council’s community and social affairs committee next Wednesday (June 17).&#34;","2015/06/wales-feels-the-pinch-scl-and-ascel-positivity.html"],["Newport","Thu, 11 Jun 2015 18:55:47 +0000","Newport – Maindee and Carnegie libraries to close – South Wales Argus. &#34;Maindee and Carnegie libraries are to close and services at Central Library are to be reduced after a vote by Newport City Council’s Cabinet. Nine full time jobs will be lost under the plans, which were approved at a meeting yesterday morning. The stock of the current reference library will be brought into the space where the lending library currently is. Cabinet member for leisure and culture, Cllr Mark Whitcutt said &#34;nobody relished&#34; having to make the changes but it was &#34;entirely necessary&#34;.","2015/06/wales-feels-the-pinch-scl-and-ascel-positivity.html"],["Gwynedd","Thu, 11 Jun 2015 18:55:47 +0000","Gwynedd – Outrage at plans to close library – Cambrian News. &#34;A consultation is being carried out unt il 17 July which asks residents for their views on the running of the county’s library services. Gwynedd Council has announced the libraries which could be at risk of closure are Bala, Criccieth, Harlech, Nefyn and Penrhyndeudraeth. The council claims the service at the lib raries is not sustainable as it looks to make huge savings over the next three years. Dr Robyn Lewis, of Nefyn, said there is strong opposition to the closure of the Nefyn Library.&#34;","2015/06/wales-feels-the-pinch-scl-and-ascel-positivity.html"],["Middlesbrough","Thu, 11 Jun 2015 18:55:47 +0000","Middlesbrough – Volunteers step up to help cash-strapped council save services – Northern Echo. &#34;council which has almost halved its workforce over the past four years. Middlesbrough Council is adamant that unpaid helpers are not being used instead of salaried staff, but say some services were reliant on volunteers to ensure facilities, like libraries, could stay open.&#34; … &#34;The majority of helpers offer their free time in community regeneration (205), archives (56), park friends’ groups (51) and libraries (45″ … &#34;A high proportion of council volunteers in libraries and museums are older or retired&#34;","2015/06/wales-feels-the-pinch-scl-and-ascel-positivity.html"],["Harrow","Thu, 11 Jun 2015 18:55:47 +0000","Harrow – Harrow Council criticised by MP Bob Blackman for ignoring library campaigners – Harrow Times. &#34;An MP criticised Harrow council in a Westminster speech for ‘rubber stamping’ the closure of four libraries. Four of Harrow’s ten libraries will close this Saturday – Bob Lawrence library and Hatch End, Rayners Lane and North Harrow libraries. In a speech at Westminster Hall yesterday, Harrow East MP Bob Blackman condemned the closures, supporting library campaigners in their attempts to run the libraries as community ventures … Speaking in response to Mr Blackman’s speech, Cllr Sue Anderson said: &#34;Central government has imposed £83m of cuts on Harrow Council and our residents over the next four years – over half of our controllable budget. &#34;The Conservative councillors and MP have refused to condemn these cuts and their effect on our community, and haven’t offered an alternative budget or solution to the funding crisis imposed on us by the Tory Government. &#34;","2015/06/wales-feels-the-pinch-scl-and-ascel-positivity.html"],["Brent","Sun, 14 Jun 2015 16:05:22 +0000","Brent – Kensal Rise Library holds an open day for the community – Kilburn Times. &#34;The doors to Kensal Rise Library, in Bathurst Gardens, were opened to the public for the first time in nearly five years, allowing residents to see the space, currently an empty shell, which will next year re-open as a reading room run by volunteers next year. The event marked a fresh start after years of campaigning that have made the much loved local library a rallying point in the national fight against library cuts&#34;","2015/06/library-stereotypes-in-the-national-media-the-volunteer-dilemma.html"],["Oxfordshire","Sun, 14 Jun 2015 16:05:22 +0000","Oxfordshire – Project invites young people to talk democracy and rights – Bicester Advertiser. &#34;Find Your Voice wants to promote debate among 13- to 21-year-olds to become active citizens in their communities and take more of an interest in libraries. Tomorrow at The Story Museum young people will be able to sign up to the scheme, which will get going in September. It will provide ways for young people to enter into debate, take part in the democratic process, engage in social change, talk about issues important to them and express themselves.&#34; … &#34;&#34;They will take part in something that is part of a national campaign called the LiberTeas where at 3pm on Sunday young people will sit down, have tea and debate.&#34; … The project comes after Oxfordshire County Council’s library service successfully bid for £96,000 from Arts Council England to help fund it. &#34;","2015/06/library-stereotypes-in-the-national-media-the-volunteer-dilemma.html"],["Kensington and Chelsea","Sun, 14 Jun 2015 16:05:22 +0000","Kensington and Chelsea – New chapter beckons for North Kensington Library  – Get West London. &#34;Plans to relocate what was once &#34;one of London’s finest public libraries&#34; to a new purpose built building have been given the green light by Kensington & Chelsea Council. It has approved plans which would see a new North Kensington Library leave its home of more than a 100 years on Ladbroke Grove and move 50m to Lancaster Road, in a move which would also breath new life into a council-run youth club. If its plans go-ahead, the new facility would open in 2019.&#34;","2015/06/library-stereotypes-in-the-national-media-the-volunteer-dilemma.html"],["Lincolnshire","Sun, 14 Jun 2015 16:05:22 +0000","Lincolnshire – Community hub prepares for its library takeover – Spalding Today. &#34;A community group is gearing up to take over the running of Crowland library in September – but it still needs your help. The group of volunteers has already started fundraising to ensure library services continue after Lincolnshire County Council relinquishes control.&#34; … &#34;Crowland Community Hub chairman Paul Bywater said: &#34;If anyone has a Co-op membership card we will get money from the Co-op for everyone who selects the Crowland Community Hub as their chosen group to receive a small amount every time they spend money in the Co-op. &#34;","2015/06/library-stereotypes-in-the-national-media-the-volunteer-dilemma.html"],["Worcestershire","Sun, 14 Jun 2015 16:05:22 +0000","Worcestershire – Catshill Library proposes to change opening times – Bromsgrove Standard. &#34;The plans propose to create an extra morning session in place of the existing Friday afternoon one. The amount of hours will remain exactly the same.&#34;","2015/06/library-stereotypes-in-the-national-media-the-volunteer-dilemma.html"],["Stoke","Sun, 14 Jun 2015 16:05:22 +0000","Stoke – Break the silence: Soon you can be as loud as you like in the library, new rules say - Express. &#34;Under current by-laws, people are banned from engaging in &#34;audible conversation&#34; in reference sections or areas set aside for reading and study if told not to do so by a member of staff. The rules also bar the use of mobile phones, portable computers or other noise-making electronic equipment within the library. These rules are set to be scrapped under updated by-laws which will be debated by councillors at Stoke-on-Trent. A report discussed this week by the council’s licensing and general purposes committee stated: &#34;Current by-laws are in need of updating to reflect modern times and take account of new services offered such as the internet.&#34;","2015/06/library-stereotypes-in-the-national-media-the-volunteer-dilemma.html"],["Warwickshire","Sun, 14 Jun 2015 16:05:22 +0000","Warwickshire – Library loans in Warwickshire down by 46% since 2011/12 – BBC. &#34;The number of loans has gone down at all 12 of Warwickshire’s community libraries since they were formed following council cuts. There were 112,832 loans in 2014/15 compared to 207,619 in 2011/12, a 46% fall. Opening hours reduced at seven of the libraries after volunteers took over, but total hours rose 6.8%. The county council said volunteers deserved credit for ensuring services remained. When the library service lost nearly a third of its budget, the 12 would have closed without community support, the authority said.&#34;","2015/06/library-stereotypes-in-the-national-media-the-volunteer-dilemma.html"],["Birmingham","Tue, 16 Jun 2015 22:22:04 +0000","Birmingham – Cheese-paring library cuts show a lack of ambition and are harming Birmingham – Chamberlain Files. &#34;Slashing the opening hours and staffing levels at the Library of Birmingham suggests a city seriously lacking in ambition. The library should be prioritised, not cast adrift to wither on the vine, argues Chamberlain Files chief blogger Paul Dale. There is probably slightly more chance of hell freezing over than the leader of Birmingham council, Sir Albert Bore, admitting he made a serious strategic mistake when drastically reducing opening hours at the city’s new library.&#34;","2015/06/legal-action-against-the-dcms-over-cuts-to-public-libraries-appeal-for-information.html"],["Dudley","Tue, 16 Jun 2015 22:22:04 +0000","Dudley – Stage to be built in Kingswinford Library as part of Arts Council grant – Stourbridge News. &#34;A section of Kingswinford Library will be transformed into a staged performance area after Dudley Council was given a share of a £15,000 pot. The four Black Country local authorities have been given a proportion of the funds by Arts Council England to spend on showcasing events for their ‘Books into Art’ project.&#34; … &#34;The library stage is currently being decorated by children and local groups with community artist Matt Lloyd under the theme The Secret Garden. &#34;","2015/06/legal-action-against-the-dcms-over-cuts-to-public-libraries-appeal-for-information.html"],["Birmingham","Tue, 16 Jun 2015 22:22:04 +0000","Birmingham – Dear, Library of Birmingham Favourites. &#34;The Library of Birmingham is a beautiful building, nonetheless, I had my doubts that it was going to be functional from the start …&#34;.  A long list of suggestions for what the Library is doing well and what it can do better. &#34;The days of libraries earning revenue from unpaid fines are gone – we can now renew books online or pop them into the external book deposit. There are plenty of other ways for the library to earn it’s living in order to retain its status as the must-see community building for all to access seven days a week.&#34;","2015/06/legal-action-against-the-dcms-over-cuts-to-public-libraries-appeal-for-information.html"],["Bristol","Tue, 16 Jun 2015 22:22:04 +0000","Bristol – Book lovers march in a campaign to save their library in Westbury-on-Trym - Bristol Post. &#34;A rousing chorus of &#34;Oh When the Books Go Marching In!&#34; was the battle cry for campaigners fighting to keep their library at Westbury-on-Trym.&#34; … &#34;Hundreds of people both young and old marched around the village to demonstrate how well-used the library is and how passionately they feel about keeping it open.&#34;","2015/06/legal-action-against-the-dcms-over-cuts-to-public-libraries-appeal-for-information.html"],["Harrow","Tue, 16 Jun 2015 22:22:04 +0000","Harrow – Libraries close their doors for the last time – Harrow Times. &#34;Lights were switched off and the shutters drawn for the last time as four libraries across the borough closed at the weekend. Bob Lawrence, Hatch End, Rayners Lane and North Harrow libraries checked out their last books on Saturday, June 13 as they closed their doors for good. The libraries were forced to close after Harrow Council voted through a budget setting out a total of £83 million of cuts to be made over the coming years, including thousands of pounds worth of cuts to library services.&#34;","2015/06/legal-action-against-the-dcms-over-cuts-to-public-libraries-appeal-for-information.html"],["Milton Keynes","Tue, 16 Jun 2015 22:22:04 +0000","Milton Keynes – Library review to take place - Milton Keynes Citizen. &#34;A review of libraries in Milton Keynes is taking place in a bid to save money over the next three years. Residents are being invited to give their views on the future of the service at a series of events in the borough’s nine libraries and hear some proposals.&#34;","2015/06/legal-action-against-the-dcms-over-cuts-to-public-libraries-appeal-for-information.html"],["Sheffield","Tue, 16 Jun 2015 22:22:04 +0000","Sheffield – Local Voice for the Walkley Carnegie Building – 38 Degrees. &#34;We want the sale of Walkley Carnegie Library Building to be put on hold until all options are considered. We are asking that: The people of Walkely have a say in the future of the building. The people of Sheffield retain the freehold of this historic building&#34;","2015/06/legal-action-against-the-dcms-over-cuts-to-public-libraries-appeal-for-information.html"],["Shropshire","Tue, 16 Jun 2015 22:22:04 +0000","Shropshire – Shropshire Council starting to offload its libraries – Shropshire Star. &#34;Libraries in Craven Arms and Highley are no longer run by Shropshire Council, while plans are being drawn up to transfer libraries in Bishop’s Castle, Broseley, Shifnal and Church Stretton to community groups.&#34; £670k cut over next two years, £500k cut last year. &#34;The libraries in Craven Arms and Highley have already been transferred to community management – the former to South Shropshire Furniture Scheme, the latter to Halo Leisure within the Severn Centre.&#34; … &#34;Michael Lewis, library services manager for Shropshire Council, said that there were plans for the future of five further libraries. They include the transfer of Bishop’s Castle Library to Enterprise South West Shropshire, Broseley Library to Broseley Town Council, Shifnal Library to Shifnal Town Council,  Cleobury Mortimer Library to the Cleobury Country organisation and  Church Stretton Library to a new location and management at South Shropshire Academy.&#34; … Communit&#8230;","2015/06/legal-action-against-the-dcms-over-cuts-to-public-libraries-appeal-for-information.html"],["Lincolnshire","Tue, 16 Jun 2015 22:22:04 +0000","Lincolnshire – Three children write to Michelle Obama about Lincolnshire Libraries – Save Lincolnshire Libraries. &#34;The children, all from the same family in The Deepings, were inspired by Mrs Obama’s recent speech where she stated libraries and museums aren’t luxuries or ‘extras’ that can be passed over while money goes toward other goals like creating jobs or teaching children, and explained that &#34;so often our libraries and museums are doing the critical work to help us achieve those goals in the first place.&#34; The children felt Mrs Obama’s words made a great deal of sense, and they hope she can influence what is happening to their local library and libraries across Lincolnshire. The letters have now been posted to The White House, and the children are hoping to be able to report back soon with their replies.&#34;","2015/06/legal-action-against-the-dcms-over-cuts-to-public-libraries-appeal-for-information.html"],["Warrington","Tue, 16 Jun 2015 22:22:04 +0000","Warrington – Livewire and council propose £16m neighbourhood hub for Warrington - Liverpool Echo. &#34;A £16m neighbourhood hub to include sports and fitness facilities, library, cafe retail outlets and a heritage trail is being planned for Warrington. The project, which is subject to planning approval, is being put forward by Warrington Council and Livewire, a community interest company that operates the boroughs leisure facilities and libraries. If the go-ahead is secured, construction on the phased development will start later this year for phase 1 completion and opening in autumn 2016 on the existing Great Sankey Leisure Centre site.&#34;","2015/06/legal-action-against-the-dcms-over-cuts-to-public-libraries-appeal-for-information.html"],["Barnet","Thu, 18 Jun 2015 21:35:02 +0000","Barnet – More registered – but loans fall at libraries – Times Series. &#34;The number of people borrowing books from libraries dipped dramatically in the past 12 years, a Freedom of Information request has revealed. But more people are registered at libraries in Barnet than ever before – and last year 187,759 people were members – a 14 per cent increase from 2002 when the figure was 164,190. The figures also revealed that 2,519,760 items were borrowed in 2002, falling to only 1,264,125 last year.&#34;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["York","Thu, 18 Jun 2015 21:35:02 +0000","York – Police called in after yobs target York library – Press. &#34;drug takers plagued York’s central library with intimidation, violence and antisocial behaviour for months when it reopened after a seven month long refit. The group caused such trouble that police had to be involved when the gang ignored a ban and continued to abuse the site and intimidate staff. The problems have come to light in Explore York’s report to the city council after its first year of operation as an independent mutual organisation.&#34; … &#34;The report, which will be debated by a learning and culture committee next week, includes praise for the hundreds of people who have got involved in the libraries since the mutual organisation was launched. More than 500 people have joined as Community Members, while 150 are active volunteers. In addition, the popular toy library has been relaunched, the libraries are to start loaning out music scores for York Music Hub, and are even considering a similar scheme for garden tools.&#34;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Bradford","Sun, 21 Jun 2015 19:21:46 +0000","Bradford – Library to shut for eight months for major £640,000 refurbishment – Telegraph and Argus. &#34;A library is to shut for around eight months while a major refurbishment takes place. Shipley Library will close on Friday, August 28, to undergo the £640,000 overhaul. The revamp will include new heating and lighting, improved meeting rooms, updated toilets and an exhibition area. New self-service kiosks will be installed so customers can access their accounts and issue and return books without queueing. Most of the existing stock will be kept, with some new books being bought.&#34;","2015/06/so-if-its-going-so-well-over-there.html"],["Devon","Thu, 18 Jun 2015 21:35:02 +0000","Devon – Axminster: Councillors call for ‘ignorant’ library officials to resign – View from Online. &#34;Axminster town councillors have passed a vote of no confidence in the the two people leading Devon County Council’s (DCC) Library Service – Councillor Roger Croad and head of libraries Ciara Eastell. The action followed a letter by the former, ruling out increased opening hours at Axminster Library for the time being. The motion was proposed by town councillor and former Axminster Mayor Jeremy Walden, who told Pulman’s View his main problem is not necessarily the lack of longer hours, but the &#34;unnecessarily dismissive and ignorant&#34; attitude of the library service chiefs. As a recent example, Councillor Walden pointed to County Councillor Croad’s written reply to Axminster Town Council. In his opening paragraph, Councillor Croad queried if town clerk Hilary Kirkcaldie wrote on behalf of the town council or as an individual – despite the letter being on headed town council paper, according to  Councillor Walden.  Councillor Cr&#8230;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Hampshire","Thu, 18 Jun 2015 21:35:02 +0000","Hampshire – Joy as plans to move library are dropped – News. &#34;More than 1,000 people signed a petition to stop Hampshire County Council switching Emsworth library from its own building in The Square to the back room of the centre. The council said it would have saved £30,000 a year with the move but further investigation proved work that needed to be done to the community centre to bring it up to scratch was too expensive.&#34;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Sandwell","Thu, 18 Jun 2015 21:35:02 +0000","Sandwell – Sandwell librarian gets Queen’s Honour – Sandwell Council. &#34;Julie McKirdy, who has worked at Thimblemill Library in Smethwick for 37 years, has been awarded the British Empire Medal (BEM).  The 53-year-old, who started work at the library straight from school aged 16, today said she was shocked and delighted at the news.&#34;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Devon","Thu, 18 Jun 2015 21:35:02 +0000","Devon – Axminster: Former mayor says sorry over library campaign web link storm – View from Online. &#34;Former Axminster mayor Jeremy Walden has apologised to a local couple seven months after getting embroiled in a social media war. It was in November last year the then Axminster mayor claimed that the wife of a library campaigner had suggested that a link to a pornographic website should be forwarded to all town councilors. Councillor Walden made a partial U-turn only days later, saying the ‘link’ was not a link as such.&#34;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Staffordshire","Thu, 18 Jun 2015 21:35:02 +0000","Staffordshire – News in brief from across the Staffordshire Moorlands – Leek News. £350k per year cut to mobiles. Nine week consultation from June 17.","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Wrexham","Thu, 18 Jun 2015 21:35:02 +0000","Wrexham – ‘Spend merger plans cash on frontline services’ – News North Wales. Proposed mergers of councils could protect frontline services like libraries.","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Fife","Thu, 18 Jun 2015 21:35:02 +0000","Fife – Sixteen libraries in Fife earmarked for closure – Courier. &#34;The cost-cutting proposals, put forward by Fife Cultural Trust, would mean the closure over three years of Abbeyview, Bowhill, Colinsburgh, Crail, Crossgates, East Wemyss, Falkland, Freuchie,, Glenwood, Kinghorn, Lundin Links, Markinch, Pittenweem, Pitteuchar, Thornton, and Townhill libraries. Footfall, access to alternative provision and the sustainability of buildings have all been used as criteria to identify the hit list. However, the trust says the proposals, if agreed by councillors, will &#34;transform&#34; Fife’s libraries.&#34; see also Fife Libraries Threatened with Closure - BookSeller. &#34;Fife currently has 51 libraries along with three mobile libraries and a housebound service. Under the proposals that will be considered by councillors next month, 16 libraries could be closed as the structure moves to a &#34;hub and spoke&#34; model&#34;, with larger hub libraries open for 40 hours or more each week, and smaller spoke libraries open for between 20 an&#8230;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Hampshire","Thu, 18 Jun 2015 21:35:02 +0000","Hampshire – Emsworth community divided after dramatic library u-turn – West Sussex Today. &#34;… the Emsworth Community Association (ECA) said the U-turn was a ‘shock’: &#34;Although there was initial reluctance on the part of ECA, we decided to fully support the move in the long term interests of the Emsworth community. This is a set back to our plans to make the centre a hub for advice, knowledge, culture and leisure. Along with most Emsworthians, we want a modern functioning library to remain in Emsworth and we will work with HCC to ensure this happens.&#34;&#34;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Stoke","Thu, 18 Jun 2015 21:35:02 +0000","Stoke – New library at community centre will replace scrapped council-run service - Stoke Sentinel. &#34;The facility will be based in Blurton Community Centre and will provide more than 500 books for loan.It comes after the Stoke-on-Trent City Council scrapped its mobile library in 2011. Now an appeal has been launched to find volunteers to run the new service.&#34;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Harrow","Thu, 18 Jun 2015 21:35:02 +0000","Harrow – Letter to council reveals government will review library closures – Harrow Times. &#34;The government is to look into claims a council has failed to carry out its duties after the shutters came down on four libraries for the last time. Last week, Harrow East MP Blackman led a debate in Parliament against the need for closures, asking the Secretary of State to intercede&#34;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Leicestershire","Thu, 18 Jun 2015 21:35:02 +0000","Leicestershire – Library hours are cut to help balance books – Hinckley Times. &#34;Opening hours are changing at Hinckley Library as Leicestershire County Council led cost-cutting changes begin to take affect. The library will be shut one full day a week and the opening time will drift back from 9.30am to 10am – but closing time will be extended to 6pm. Changes will also take place at Earl Shilton, Blaby and Broughton Astley libraries with longer opening times on Saturdays but an overall reduction in opening hours. The move, agreed by the county council cabinet last September, comes into effect on Monday July 6 and follows a consultation on proposals to save £800,000 from the libraries budget.&#34;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Staffordshire","Thu, 18 Jun 2015 21:35:02 +0000","Staffordshire – Consultation to start over plans to scale back mobile library service in Lichfield and Burntwood - Lichfield Live. &#34;The future of the mobile library service in Lichfield and Burntwood will be up for discussion after a consultation programme was approved. The proposals would see the service axed for places currently served such as Hammerwich, Burntwood, Chasetown, Streethay, Curborough, Weeford, Chase Terrace, Fazeley and a number of other areas in Lichfield. Staffordshire County Council’s Cabinet has now given the go-ahead for the consultation to go ahead next month.&#34;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Lincolnshire","Sun, 21 Jun 2015 19:21:46 +0000","Lincolnshire – Hearing into potential judicial review of Lincolnshire libraries’ decision set for July – Lincolnite. &#34;… the county council and library campaigners will travel to London on July 21 and 22 to outline their reasons for why a judicial review should or should not be granted. A judge will then rule on whether the case for a judicial review is legitimate. Councillor Nick Worth, Executive Member for Libraries, said: &#34;We’ve been notified that the decision on whether or not to grant permission for a judicial review will be taken in court at an oral hearing before a judge. &#34;If permission is not granted, the claim will fail. If permission is granted, the court will proceed immediately at the same hearing to decide whether the challenge has any merit.&#34;","2015/06/so-if-its-going-so-well-over-there.html"],["Shropshire","Sun, 21 Jun 2015 19:21:46 +0000","Shropshire – Church Stretton Library Support Group set to launch legal action over library relocation – Shropshire Live. &#34;Church Stretton Library Support Group is giving Shropshire Council one more opportunity to abandon its library relocation plan before launching legal action. The Church Stretton Library Support Group has now completed its detailed case against Shropshire Council and its decision to relocate the library to the edge of town and is ready to join with library users to go to court to challenge the relocation decision.&#34; … &#34;&#34;We have contacted the Chief Executive of Shropshire Council to request that the plan to relocate the library to the school be abandoned and that council officers sit down with the community they serve to put together a community run alternative. There is still time for common sense to prevail.&#34;&#34;","2015/06/so-if-its-going-so-well-over-there.html"],["Harrow","Thu, 18 Jun 2015 21:35:02 +0000","Harrow – Library closures a ‘bitter disappointment’ as books sold off and staff face redundancy – Harrow Times. &#34;Shutters fell for the last time at four libraries across Harrow – Bob Lawrence, Hatch End, Rayners Lane and North Harrow – on Saturday. Books published before 2014 were sold off to former library users at £1 for three, while the newer books were boxed up ready to be redistributed to the remaining libraries in the borough.&#34;","2015/06/strife-in-fife-library-cuts-go-further-than-expected.html"],["Dudley","Sun, 21 Jun 2015 19:21:46 +0000","Dudley – New chapter in store as plans unveiled for new Cradley library – Halesowen News. &#34;plans to redevelop &#34;eyesore&#34; derelict shops in Colley Gate could include a new library, it was revealed today. The proposal – which would see the demolition of the old Colley Lane library – has been drawn up by Hortons’ Estate and Antringham Developers Ltd who have agreed to take the shops’ site. The release of the names of the Birmingham-based developers today follows months of negotiations with Dudley Council, the owner of the Nisa store and the two owners of the parade of shops, most of which are derelict.&#34; … &#34;We believe this could increase library usage which is currently one of the lowest in the borough and it would make access to the library easier, particularly for anyone with restricted mobility or using a pushchair. &#34;","2015/06/so-if-its-going-so-well-over-there.html"],["North Yorkshire","Sun, 21 Jun 2015 19:21:46 +0000","North Yorkshire – Save North Yorkshire Libraries - Website. &#34;This site exists to campaign for all local libraries in North Yorkshire to be kept open. Maybe some changes will have to be accepted, but we urge North Yorkshire County Council to find ways to deliver library services throughout the county. We reject the easy option of closures.&#34;","2015/06/so-if-its-going-so-well-over-there.html"],["Staffordshire","Sun, 21 Jun 2015 19:21:46 +0000","Staffordshire – Plans on changes to mobile libraries in Burton Mail.","2015/06/so-if-its-going-so-well-over-there.html"],["Fife","Sun, 21 Jun 2015 19:21:46 +0000","Fife – Closing libraries could destroy ‘lifeline’ for local communities, trust warns – Courier. &#34;The case for closing libraries across Fife has to be closely scrutinised, according to a leading figure in the Carnegie UK Trust.&#34; … &#34;Douglas White, the head of advocacy at the Dunfermline-based trust which safeguards the legacy of famous philanthropist Andrew Carnegie, has stressed the need to look into the impact of a closure programme. &#34;Libraries provide more than books, they offer lifelines to jobs, education opportunities, literacy and public services,&#34; he said. &#34;It is essential that these proposals from Fife Cultural Trust are examined thoroughly and their impact considered so that we can ensure that all citizens in Fife have access to a high quality library service.&#34;&#34;","2015/06/so-if-its-going-so-well-over-there.html"],["Surrey","Sun, 21 Jun 2015 19:21:46 +0000","Surrey – Power to the people – as Lingfield Library is to be passed to trustees - East Grinstead Courier. &#34;From July, The Guest House on Vicarage Road, which contains Lingfield Library, will be run by Lingfield Guest House Trustee Limited, a trust made up of local people. The decision was made by the current trustee Surrey County Council on Tuesday last week to make the transfer to the Guest House Trust. The change has been in the works since 2012.&#34; … &#34;The new trust will lease the ground floor of the building to the county council, who will continue to run the library service there. Before the trust was set up there was talk that the library would lose its paid members of staff in a county-wide shake-up of how libraries are run. However, the new set up means that the library’s paid staff will remain for a year – until July 2016 – giving the trust time to negotiate with the county council about the library’s future set-up.&#34;","2015/06/so-if-its-going-so-well-over-there.html"],["Fife","Sun, 21 Jun 2015 19:21:46 +0000","Fife – Methods questioned on proposed closure of 16 Fife libraries – Courier. &#34;Conservative member Andy Heer said: &#34;I’m disappointed that Fife Cultural Trust didn’t see fit to consult or inform local communities first.&#34; Among those libraries earmarked for closure in his ward are Freuchie and Falkland. But Mr Heer said the first he knew of the proposals was when he read Wednesday’s Courier. He said: &#34;I’ll be interested to see how they expect to transform the service by closing nearly a third of all of Fife’s libraries, but they give no details of how this will be done apart from talking about a ‘hub and spoke’ model.&#34;","2015/06/so-if-its-going-so-well-over-there.html"],["Fife","Sun, 21 Jun 2015 19:21:46 +0000","Fife – SNP campaigns to save north east Fife libraries - Fife Today. &#34;Roderick Campbell MSP, Stephen Gethins MP, and SNP councillors John Docherty and David MacDiarmid have joined forces in a bid to save the libraries. Fife Cultural Trust has proposed closing 16 libraries across Fife as part of a move to modernise the library network and make savings.&#34;","2015/06/so-if-its-going-so-well-over-there.html"],["Shropshire","Sun, 21 Jun 2015 19:21:46 +0000","Shropshire – Top lawyer drafted in to help Church Stretton library fight – Shropshire Star. &#34;Church Stretton residents have come together and appointed a top legal team to take on their case, as they prepare to launch action against Shropshire Council over what they say were &#34;undemocratic&#34; decisions on the future of the library in the town centre.&#34; … &#34;The 140 members of the Church Stretton Library Support Group voted to take legal action at the end of April. The vote followed the failure of a formal request from Shropshire councillors Heather Kidd, Roger Evans and Charlotte Barnes to &#34;call in&#34; the Councillor Charmley’s decision, which was made behind closed doors, for scrutiny. Mrs Thomas added: &#34;This very much is our last resort. &#34;We do not want to pursue Shropshire Council in the courts but we have exhausted every other opportunity for taking part in a meaningful democratic process that takes local residents and library users seriously and recognises that they are equal partners in decision making&#8230;","2015/06/so-if-its-going-so-well-over-there.html"],["Harrow","Sun, 21 Jun 2015 19:21:46 +0000","Harrow – Harrow East MP fights library closures – Get West London. &#34;Mr Blackman staged a last-ditch attempt to argue against the need for closures by holding a debate in Parliament and asking the Secretary of State to intercede. Mr Blackman said: &#34;There has been an excellent campaign by local residents in Edgware, in my constituency, who have been fighting to save Bob Lawrence Library in particular. &#34;The Bob Lawrence Library Campaign team gathered a petition with more than 5,000 signatures from outraged local people and put together a sound business case for keeping the facility open too, but it was all to no avail.&#34;&#34;","2015/06/so-if-its-going-so-well-over-there.html"],["Lincolnshire","Sun, 21 Jun 2015 19:21:46 +0000","Lincolnshire – Lincolnshire library staff thrown farewell event after site closure - Lincolnshire Echo. &#34;The Friends of Deeping Library group presented workers with a special cake and farewell cards to the four librarians who have made been redundant or been forced to relocate elsewhere in the county. Deeping Library will shut down until work to improve the building is completed in September – however it is unclear if it will reopen or if the site will be used for other services.&#34; … &#34;Talks to save Deeping Library are on-going but users remain in the dark over its future.&#34;","2015/06/so-if-its-going-so-well-over-there.html"],["Scottish Borders","Sun, 21 Jun 2015 19:21:46 +0000","Scottish Borders – Councillors set to continue talks on plan to outsource cultural services – Southern Reporter. &#34;Councillors will next week be given an update on progress – or the lack of it – towards transferring museums, libraries, public halls, and arts and community centres to the organisation which runs sports facilities in the region. The report was ordered in February when, despite publicly-voiced misgivings, Scottish Borders Council agreed to open negotiations with the Borders Sport and Leisure Trust (BSLT) about taking over the non-statutory cultural services run by the local authority.&#34; … &#34;Last year a report warned that, if the transfer did not go ahead, then one large hall, one main library, one museum and one community centre could be forced to close.&#34;","2015/06/so-if-its-going-so-well-over-there.html"],["Birmingham","Wed, 24 Jun 2015 21:28:18 +0000","Birmingham – British Library joins Library of Birmingham for cultural partnership – Birmingham Post. &#34;The British Library is teaming up with the Library of Birmingham on a new cultural partnership which will include a special project to mark the 400th anniversary of the death of William Shakespeare. The ground-breaking initiative has arisen from talks designed to help support the cash-strapped Library of Birmingham as the city council struggles with budget cuts. A cultural partnership, the deal will allow both organisations to share expertise and work on joint projects around the Library of Birmingham’s world-class historic archives and collections.&#34;","2015/06/the-best-of-times-the-worst-of-times.html"],["Bristol","Wed, 24 Jun 2015 21:28:18 +0000","Bristol – Stephen, aged 8, collects 450 names for petition to save library under threat of closure – Bristol Post. &#34;His father, Graham said: &#34;He came home one day and said he was going to start a petition and we said, ‘OK, off you go, then’ and thought nothing more of it. &#34;But within a short space of time, he had got about 300 names.&#34; Stephen started by collecting names from family and friends before turning to class mates and staff at Sea Mills primary school. He now has names on the petition from as far afield as Australia and New Zealand. Tim Wallis, convenor of the Friends of Sea Mills Library, said: &#34;Stephen is very focused about his petition.&#34;","2015/06/the-best-of-times-the-worst-of-times.html"],["Coventry","Wed, 24 Jun 2015 21:28:18 +0000","Coventry – Protest at council against libraries and disabled jobs service cuts proposals – Coventry Observer.  &#34;Tile Hill has joined other areas including Finham, Earlsdon and Willenhall in starting a petition to protect their library from potential cuts in future years. Coventry council’s ruling Labour leaders earlier this year mooted the prospect of libraries closing in the face of ongoing government funding cuts under a policy called ‘City Centre First’, before announcing a full review of the service.&#34;","2015/06/the-best-of-times-the-worst-of-times.html"],["Coventry","Wed, 24 Jun 2015 21:28:18 +0000","Coventry – Anti-cuts protest before first full meeting of newly elected Coventry City Council today - Coventry Telegraph. &#34;Anti-cuts campaigners will protest ahead of the first full meeting of the newly elected Coventry City Council today (Tuesday). The group will arrive outside the Council House at 1pm an hour before the full council meeting is due to start. A combination of groups, including Save Coventry Libraries, are due to attend in a bid to put pressure on the council and fight budget reductions. Council leaders have warned of swingeing multi-million pound budget cuts amid a £65million reduction in central government funding.&#34;","2015/06/the-best-of-times-the-worst-of-times.html"],["Fife","Wed, 24 Jun 2015 21:28:18 +0000","Fife – Communities to be consulted on Fife’s proposed library closures - Fife Today. &#34;, after concerns were raised by Councillor Brian Goodall, SNP group leader, and following a brief meeting between councillors and cultural trust board members, it was decided that public consultations would be carried out before the executive committee makes a decision on the proposals at its meeting on September 29.&#34;","2015/06/the-best-of-times-the-worst-of-times.html"],["Fife","Wed, 24 Jun 2015 21:28:18 +0000","Fife – Public urged to fight ‘tooth and nail’ to save closure-threatened libraries in Fife – Courier. &#34;North-east Fife’s SNP MSP, MP and councillors have joined forces in a campaign to prevent up to six library closures across the constituency … Describing the proposals as &#34;disproportionate&#34; and &#34;unjustifiable&#34;, MSP Roderick Campbell has written to Fife Council’s chief executive to urge the council’s executive committee, which meets tomorrow, to reject the proposals. He has also asked the Scottish Government to intervene.&#34;","2015/06/the-best-of-times-the-worst-of-times.html"],["Lincolnshire","Wed, 24 Jun 2015 21:28:18 +0000","Lincolnshire – Lincolnshire County Council library plans to be challenged again in the High Court – Save Lincolnshire Libraries.  Looks at the grounds for the judicial review including (1) failure to consult about alternative proposals (2) council reduced the library service and (3) failure to consider alternatives under best value.","2015/06/the-best-of-times-the-worst-of-times.html"],["Redbridge","Wed, 24 Jun 2015 21:28:18 +0000","Redbridge – Redbridge’s libraries bringing communities together – Ilford Recorder. &#34;The most recent report by CIPFA (the Chartered Institute of Public Finance and Accountancy) reveals there were 282 million visits to UK branches between March 2013 and March 2014 – 12 per cent less than 2010, when there were 322 million. This picture is indeed bleak, but Redbridge is bucking the trend. The same report revealed Redbridge Central Library is the 14th busiest in England, with 634,675 visits during the last recorded year.&#34;","2015/06/the-best-of-times-the-worst-of-times.html"],["Staffordshire","Wed, 24 Jun 2015 21:28:18 +0000","Staffordshire – UKIP ready to fight alongside the Green Party over future of mobile library service – Lichfield Live. &#34;UKIP have offered to stand shoulder-to-shoulder with the Green Party, if Staffordshire County Council decides to completely scrap mobile library services across Lichfield and Burntwood&#34; … Greens say &#34;&#34;Our party firmly opposes Staffordshire County Council’s proposed cuts to the mobile library service,&#34; he said. &#34;We believe that the cuts under consideration directly contradict Staffordshire County Council’s statutory duty under the Public Libraries and Museums Act 1964 to provide ‘a comprehensive and efficient library service’.&#34;","2015/06/the-best-of-times-the-worst-of-times.html"],["Suffolk","Wed, 24 Jun 2015 21:28:18 +0000","Suffolk – Ipswich County Library launches new Enterprise and Innovation Hub – Suffolk Libraries. &#34;The new space has been named The Carnegie Room to mark the library’s connection with entrepreneur Andrew Carnegie and some of the funding to build the library in 1924 was donated by the UK Carnegie Trust. The hub was launched at an event attended by Brian Ashley, Head of Libraries at Arts Council England, Suffolk County Councillor Sarah Stamp, Portfolio Holder for Communities, plus guests from Suffolk Chamber of Commerce, Eastern Enterprise Hub, New Anglia Growth Hub, Suffolk Libraries Board and Friends of Ipswich Library. Suffolk Libraries has developed the Enterprise + Innovation Hub as a dedicated centre supporting local entrepreneurs, start-ups, business owners and creative minds. Located on the recently adapted second floor of the library, the hub provides three main services: hireable meeting space, business advice and information, and a communal ‘MakerSpace’ (named ‘The Lab’) which contains 3D printers, computer coding kits and&#8230;","2015/06/the-best-of-times-the-worst-of-times.html"],["Swindon","Wed, 24 Jun 2015 21:28:18 +0000","Swindon – Council hires new staff to ease pressure on library – Swindon Advertiser. &#34;In recent months, the library has suddenly closed because there have not been enough staff to run the facility. It was usually manned by only one person, meaning if they had a day off or were sick then no-one was available to take over. This has subsequently led to much frustration from local residents but it is now hoped the problem has been resolved.&#34; … &#34;Agreements have been reached with existing staff to increase their hours while a number of other staff have been hired. &#34;","2015/06/the-best-of-times-the-worst-of-times.html"],["York","Wed, 24 Jun 2015 21:28:18 +0000","York – No plans to close York libraries – York Press. &#34;Concerns had been raised that plans for the library in Huntington to develop a health and wellbeing hub in partnership with a GP surgery, could be an indication that the library may eventually close.&#34; … &#34;Fiona Williams, chief executive of Explore York Libraries and Archives, said more than 8,000 people had joined libraries in the city in the first five months of 2015, with more than 2,200 children attending under-fives story time, and more than 150 volunteers working at venues around the city. &#34;","2015/06/the-best-of-times-the-worst-of-times.html"],["Cambridgeshire","Sun, 28 Jun 2015 19:51:12 +0000","Cambridgeshire – Plans for enterprise centre at Cambridge Central Library thrown out by &#34;embarrassed&#34; councillors - Cambridge News. &#34;The fiercely contested plans were thrown out by the county council today less than a month after they were given the green light. But days after the decision was made it emerged that Roger Perrin – who had led the negotiations from Kora and billed himself as the company’s global managing director – was in fact banned from being a company director in the UK.&#34; … &#34;Officers maintained that the usual checks had been carried out as they usually only check-out companies rather than individuals involved. See also Cllr Steve Criswell Speech to Cambs CC on Cambridge Library, 26 June 2015 - Youtube. Conservative group angry and disappointed by how decision to provide Central Library space to private business company was reached and queries whether due diligence has been given.  Council therefore withdraws from agreement but will now see how to save money in other ways.","2015/06/sympathy-for-the-devil-why-even-chief-librarians-dont-have-it-easy.html"],["Leicestershire","Sun, 28 Jun 2015 19:51:12 +0000","Leicestershire – Brewery bids to run library – Hinckley Times. &#34;Elliswood Brewery in Hinckley has put forward a proposal to run Burbage Library in Church Street.The library was facing the axe due to cost cutting measures by Leicestershire County Council which is attempting to claw back a £110 million budget shortfall by 2018. The council asked for community groups across the county to run libraries in January but no plan was put forward for Burbage at that time. The library currently opens on Mondays, Tuesdays, Thursdays and Saturdays for a total of 14 hours. There had been rumours that the library would be replaced by a micro brewery which raised concerns for residents in retirement bungalows opposite. However, Councillor Richard Blunt, the county council’s lead member for libraries, said Elliswood Brewery had come forward with a bid to run the site as a library.&#34;","2015/06/sympathy-for-the-devil-why-even-chief-librarians-dont-have-it-easy.html"],["Trafford","Tue, 30 Jun 2015 21:39:11 +0000","Trafford – Friends of Coppice Library Neighbourhood Support - Aviva Community Fund. &#34;The Friends of Coppice Library group was established in October 2014 in response to the local Council’s consultation in relation to the future of library services in Trafford. Whilst some libraries will close, Coppice has been saved by a bid to turn it into a community hub. The Friends Group are working with blueSCI (a health and well-being social enterprise) and other residents to retain library and information services for our community, as the recent consultation revealed that many people in our area cannot afford to travel into nearby town centres.&#34;","2015/06/quiet-please-at-least-some-of-the-time.html"],["Carmarthenshire","Sun, 28 Jun 2015 19:51:12 +0000","Carmarthenshire – Council leader backs merging library with police station in Cross Hands - Carmarthen Journal. &#34;And while work is under way to make the police station building suitable for the new tenant, local residents could find a temporary base for library services at the back of Cross Hands Hall and Cinema as soon as the end of next month&#34;","2015/06/sympathy-for-the-devil-why-even-chief-librarians-dont-have-it-easy.html"],["South Gloucestershire","Tue, 30 Jun 2015 21:39:11 +0000","South Gloucestershire – South Gloucestershire Library users really rate the service – South Gloucestershire Council. &#34;99 per cent of South Gloucestershire library customers would recommend the service to someone else according to a recent survey of more than 3,800 users. The survey showed that 97 per cent of customers thought the service was either ‘very good’ or ‘good’, one of the best results from similar library authorities. The survey also asked users for comments on the service and the majority who commented mentioned the excellent quality of staff, as well as the range of services provided.&#34; … &#34;This year the survey has identified the low awareness of services such as the online e-magazines, the access to UWE which the South Gloucestershire Library card allows and some of the online services. These are areas the libraries will look to promote in the future.&#34;","2015/06/quiet-please-at-least-some-of-the-time.html"],["Cornwall","Sun, 28 Jun 2015 19:51:12 +0000","Cornwall – Doors locked at Falmouth library consultation meeting – West Briton. &#34;Falmouth Town Council member Patricia Minson, for Falmouth Boslowick, attempted to attend a library consultation in Falmouth on April 29th but found the doors were locked. The meeting had been scheduled for a Wednesday, a day when Falmouth Library is normally closed. Councillor Minson was late to the meeting, and Cornwall Council has said that a member of staff waited by the door for half an hour to allow latecomers into the consultation&#34;","2015/06/sympathy-for-the-devil-why-even-chief-librarians-dont-have-it-easy.html"],["Isle of Wight","Sun, 28 Jun 2015 19:51:12 +0000","Isle of Wight – Meet Miss Crocus: One of ten wonderful Mennyms created in Ryde - On the Wight. &#34;Various people undertook to create ten life-size fabric people, who all have their own names and stories and relationships, and who are going to be seen around Ryde during Festival week&#34;","2015/06/sympathy-for-the-devil-why-even-chief-librarians-dont-have-it-easy.html"],["St Helens","Sun, 28 Jun 2015 19:51:12 +0000","St Helens – Correction to St Helens council plans for £23m cuts to services in next two years – Liverpool Echo.  Email from Sue Williamson, Head of Library Services points out Liverpool Echo story is inaccurate. &#34;The presentation simply sought to explain the changing face of the council in the face of ongoing budget cuts from central government. Passing reference was made to libraries as an example of a statutory service provided by the council – and contrasted with a non-statutory provision – in this case the Councillor Improvement Fund. The reporter involved appears to have confused the two issues. At no stage in either the briefing or the cabinet meeting was the Library Service earmarked for any cuts whatsoever. In fact the cabinet was not voting on cuts at all – merely giving their approval to start the process of identifying options for the cabinet to consider. No decisions on any savings have been made at this stage. The Echo agreed to carry a full correction in today’s (26 June) edition.&#34;","2015/06/sympathy-for-the-devil-why-even-chief-librarians-dont-have-it-easy.html"],["Newham","Tue, 30 Jun 2015 21:39:11 +0000","Newham – Newham residents urged to help council save £50 million next year – Newham Recorder. &#34;Over the last five years, Newham Council has seen its government funding cut by £106m and according to a statement released by the council, the savings the borough needs to make next year is more than it currently spends on street cleaning, waste collection, keeping the roads lit and running libraries combined. &#34;","2015/06/quiet-please-at-least-some-of-the-time.html"],["Enfield","Sun, 28 Jun 2015 19:51:12 +0000","Enfield – Enfield library restructuring approved despite opposition – Enfield Independent. &#34;The council plans to keep all 17 libraries open, but will turn 11 of them into &#34;community libraries&#34; that will share premises with other services.&#34;.  Mobile library service will end.","2015/06/sympathy-for-the-devil-why-even-chief-librarians-dont-have-it-easy.html"],["Staffordshire","Sun, 28 Jun 2015 19:51:12 +0000","Staffordshire – Mobile library plans for Lichfield and Burntwood not set in stone, says councillor – Lichfield Live. Mobiles: &#34;Staffordshire County Council will begin a consultation over the service on July 1. The proposals would see stops in Hammerwich, Burntwood, Chasetown, Streethay, Curborough, Weeford, Chase Terrace, Fazeley and a number of other areas in Lichfield axed completely.&#34;","2015/06/sympathy-for-the-devil-why-even-chief-librarians-dont-have-it-easy.html"],["Falkirk","Sun, 28 Jun 2015 19:51:12 +0000","Falkirk – Falkirk’s library lovers to have a say – Falkirk Herald. &#34;The plan is to deliver a service that is valued by the local community, meets customers expectations and still affordable for the Trust to deliver. Lesley O’Hare, culture and libraries manager, said: &#34;The consultation is a ‘call to arms’ to staff, users and non-users to become involved. &#34;It is an opportunity for debate and discussion and to generate ideas and suggestions that will help give direction to the way ahead for library services across Falkirk district and ensure the they are valued, relevant, well-used and sustainable.&#34;&#34;","2015/06/sympathy-for-the-devil-why-even-chief-librarians-dont-have-it-easy.html"],["Gwynedd","Sun, 28 Jun 2015 19:51:12 +0000","Gwynedd – Campaigners slam ‘fiasco’ of library consultation – Cambrian News. &#34;A group of Criccieth councillors and community campaigners have slammed Gwynedd Council’s initial public consultation, which asks residents for their views on how to run library services.&#34; … &#34;Library campaigners say they have studied the consultation document and found several flaws, including a lack of relevant detail, no assessment o&#34;f the negative effect closure would have on the Welsh language and a severe misrepresentation of the library’s running costs.&#34; … &#34;&#34;Without that information, residents can only come to the conclusion that, at best, it was an arbitrary choice by the council or, at worst, an option based on prejudice against the smaller communities, such as Criccieth.&#34;&#34;","2015/06/sympathy-for-the-devil-why-even-chief-librarians-dont-have-it-easy.html"],["Leeds","Tue, 30 Jun 2015 21:39:11 +0000","Leeds – #Whatsyourstory: Leeds libraries campaign turns its first page – Yorkshire Evening Post. &#34;Leeds Libraries, a group of 36 learning hubs in the city, is  hoping the #Whatsyourstory campaign will get more people using its free services and workshops. Ma Maposa, who now runs his own production company and record label, has backed the campaign and said the libraries had &#34;changed his life&#34;.&#34; … &#34;The campaign is also urging people to come forward if library services have helped change their life. Coun Debra Coupar said: &#34;Our libraries play a very important part in the day-to-day lives of people of all ages in communities across Leeds, and this campaign is a great way to highlight the flexible and diverse range of services, activities and events that we have on offer.&#34;&#34;","2015/06/quiet-please-at-least-some-of-the-time.html"],["Leicestershire","Tue, 30 Jun 2015 21:39:11 +0000","Leicestershire – Library opening hours are changing – Loughborough Echo. &#34;Leicestershire County Council says it wants to claw back £135,000 over the next four years from the libraries it still manages. &#34;.  Changes to &#34;opening hours at Loughborough and other libraries in the area are due to take effect from July 6. As previously reported in the Echo, libraries at Loughborough and Shepshed, along with others in the county, will be shut every Wednesday, with Loughborough to close on Sundays as well.&#34;","2015/06/quiet-please-at-least-some-of-the-time.html"],["Thurrock","Tue, 30 Jun 2015 21:39:11 +0000","Thurrock – As Thurrock’s mobile library closes on Thursday, Homelink service expands – Your Thurrock. &#34;popular Homelink library service – aimed at those who have difficulties accessing the borough’s libraries – is being expanded. This is to ensure that people who use the Council’s current mobile library service, which closes on Monday 2 July, will not lose out … An earlier call for volunteers proved so successful that Homelink rounds are available at most libraries. All volunteers have received specialist training.&#34;","2015/06/quiet-please-at-least-some-of-the-time.html"],["Surrey","Tue, 30 Jun 2015 21:39:11 +0000","Surrey – Reigate and Merstham library opening times set to change - Surrey Mirror. &#34;Reigate Library will soon be open for an extra six and a half hours a week.&#34; Self-service to be installed. Other opening times to be changed. £227k staffing cut.","2015/06/quiet-please-at-least-some-of-the-time.html"],["Swindon","Tue, 30 Jun 2015 21:39:11 +0000","Swindon – West Swindon Library celebrates landmark with events day – Swindon Advertiser. &#34;… Gwyneth who has spent 12 years in the library industry said the library has evolved from the traditional quiet space. &#34;It’s exciting to see how much libraries have changed over the years; with the new modern technology they’re increasing their appeal to everyone. &#34;They’re real community spaces and something that people are seeing the appeal of every day of the week.&#34;&#34;","2015/06/quiet-please-at-least-some-of-the-time.html"],["Trafford","Tue, 30 Jun 2015 21:39:11 +0000","Trafford – Hale Library – an update on progress – 38 Degrees / Hale Community Trust. &#34;I am sure that everyone in and around Hale was delighted to hear recently that the village will not lose its public library. Trafford Council approved a joint bid by Hale Community Trust and Hillcrest Homes (Nikal Ltd) on 28 May. Library services will be transferred to a new purpose built community hub on the site of The Cottage – the current Hale Village Bowling Green pavilion. The present library will stay open until the new building is completed and the Leigh Rd. site will then be sold for redevelopment. The bid shows that a total of 6 houses, 2 flats and some commercial space are planned for the site.&#34;","2015/06/quiet-please-at-least-some-of-the-time.html"]]