[["Blackpool","Wed, 04 May 2016 19:39:38 +0000","Blackpool – Libraries ‘will shut without change’ – Gazette. &#34;This year, opening hours across Blackpool’s eight libraries have been reduced from 307 a week to 266-and-a-half to save almost £85,000. It is proposed to open a cafe at Anchorsholme Library in a bid to bring in extra revenue, and (Conservative, opposition) Coun Williams is calling for similar ideas to be considered at all the town’s libraries. It is proposed to open a cafe at Anchorsholme Library in a bid to bring in extra revenue, and Coun Williams is calling for similar ideas to be considered at all the town’s libraries. &#34;This is a huge ask for a service that basically provides books for free and hasn’t really changed since the 1960s so there has to be some lateral thinking into the way they currently operate. &#34;","2016/05/libraries-save-lives-says-stephen-fry.html"],["Darlington","Wed, 04 May 2016 19:39:38 +0000","Darlington – Plans to save Crown Street Library are progressing, say campaigners – Northern Echo. &#34;A steering group has been formed to save the town’s historic Crown Street Library, Cockerton Library and the mobile library from closure. The facilities could close their doors forever if Darlington Borough Council’s contentious programme of budget cuts is approved. Under the plans, the majority of resources from Crown Street would be moved to the Dolphin Centre and the other libraries closed completely.&#34;","2016/05/libraries-save-lives-says-stephen-fry.html"],["Lancashire","Sun, 08 May 2016 19:58:45 +0000","Lancashire – Stop Lancashire’s tragic library & museum closures by proper government funding – UK.gov Petitions. &#34;Lancashire County Council have had their government funding cut by a further £262million & are now only able to provide statutory services. As a result of funding cuts, 40 libraries & several important museums across Lancashire are to close. Lancashire’s (& Britain’s) history is being thrown away. &#34; [4,000 names on petition as of checking – Ed.]","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["Lambeth","Wed, 04 May 2016 19:39:38 +0000","Lambeth – Lambeth Green party confirm Carnegie library campaigner as candidate to contest Gipsy Hill by-election – Brixton Buzz. &#34;Elliott was one of the library campaigners that occupied the Carnegie in April in protest of the book-ish gyms by the Progress led Labour Cabinet.&#34;","2016/05/libraries-save-lives-says-stephen-fry.html"],["Lambeth","Wed, 04 May 2016 19:39:38 +0000","Lambeth – Lambeth protesters won’t take Labour’s library sops – Socialist Worker. &#34;Over 100 campaigners joined a protest against cuts outside Upper Norwood library in Lambeth, south London, last Saturday. A campaign to defend Lambeth’s libraries from cuts by the Labour-run council has seen strikes, protests and a ten-day occupation. The council is on the back foot. It offered money last week to keep one member of staff at Upper Norwood. But it is still set to lose four library staff from 1 July.&#34;","2016/05/libraries-save-lives-says-stephen-fry.html"],["Lancashire","Sun, 08 May 2016 19:58:45 +0000","Lancashire – Cabinet report outlines plans to transform services with fewer buildings needed – Lancashire County Council. &#34;Lancashire county councillors are to consider plans to change the way frontline services are delivered and save millions of pounds by reducing the number of buildings the council owns and rents. Lancashire County Council needs to save £200m by 2020/21 as a result of ongoing government cuts to its budget and rising demand for services. As part of implementing savings agreed by Full Council in February 2016, a report to the council’s cabinet proposes bringing services together to form a network of multi-functional buildings known as Neighbourhood Centres, which would provide a base for a range of different services in one place. &#34;","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["Sheffield","Sun, 08 May 2016 19:58:45 +0000","Sheffield – We need the librarians – Sheffield Star / Letters. &#34;Sheffield Council’s policy of creating volunteer-run libraries has clearly failed given the huge drop in usage at these that was revealed recently. Most people visited the libraries at least in part because of the wonderful service given by community librarians.&#34; … &#34;A solution in the short-term would be to trial a structure along the lines of other social enterprises, such as charity shops, with a full-time librarian backed up with a team of volunteers.&#34;","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["Merton","Wed, 04 May 2016 19:39:38 +0000","Merton – Merton shortlisted for coveted MJ award – Merton Council. &#34;The service has been shortlisted in the best council services team category along with seven other authorities across the country. The winners are set to be announced on Thursday 16 June. Going from strength to strength, the service had focused on accessibility, the community, building development and technology. It has also set up a pioneering volunteering scheme with over 560 residents working in libraries across the borough and its Schools and Libraries membership scheme has been nationally recognised. Merton’s libraries provide free WiFi and enjoy high customer satisfaction.&#34;","2016/05/libraries-save-lives-says-stephen-fry.html"],["Swindon","Wed, 04 May 2016 19:39:38 +0000","Swindon – Fund it Better – Swindon Advertiser / Letters. &#34;&#34;The other day, in Cambridge (a city, surprisingly, smaller than Swindon) I heard someone telling a young mother about the weekly ‘learn to read’ sessions at the local library.&#34; I thought it was a good illustration of the value libraries have, over and above the lending of books and the various online services they currently have. For my whole career as a local GP I have been acutely aware of how difficult it is for deprived families to access opportunities to learn and improve their lot. The above example is but one of many that I see being eroded, all in the name of &#34;necessity to save money&#34;. I am appalled that things have come to such a pass that services – public services which councils have always provided – are being withdrawn, to the particular disadvantage of the already disadvantaged.&#34;","2016/05/libraries-save-lives-says-stephen-fry.html"],["Somerset","Wed, 04 May 2016 19:39:38 +0000","Somerset – Shepton Mallet Library could move and go self service – Shepton Mallet Journal. &#34;Shepton Mallet Library could be closed and replaced by a new self service facility at Mendip’s Shape Hub. Proposals to close the library come following a consultation about the future of library services.&#34;","2016/05/libraries-save-lives-says-stephen-fry.html"],["Lancashire","Sun, 08 May 2016 19:58:45 +0000","Lancashire – Preston and South Ribble library and children’s centres closures revealed – Blog Preston. &#34;A library and two children’s centres in Preston are to be closed as part of a multi-million pound scaling back by the county council. Fulwood library, Preston East Children’s Centre and St Lawrence Children’s Centre may all be mothballed to save Lancashire County Council money. A consultation period will run for 12 weeks on the proposals, which would see the number of libraries in Lancashire cut from 73 to 44.&#34;","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["Bradford","Sun, 08 May 2016 19:58:45 +0000","Bradford – New look Shipley Library unveiled after eight-month refurbishment – Telegraph and Argus. &#34;Extensive works include roof repairs, new carpets, new heating and new lighting, including a re-designed exhibition area. Meeting and conference rooms have also been repositioned and redecorated with the aim of encouraging more community groups to use them. And the wide-ranging improvements also include new electrical and heating systems which will reduce future running costs and ensure more efficient maintenance of the building.&#34; … &#34;Additional social services provided by Bradford Council will also be moved into the town centre building on Well Croft in a move to centralise staff. &#34;","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["Herefordshire","Sun, 08 May 2016 19:58:45 +0000","Herefordshire – Closed book: Hereford Library unlikely to open again until 2017 – Herefordshire Live. &#34;It’s a pretty dire outlook for the Broad Street library and museum, which has been shut for eight months because of an asbestos scare, even with the campaigning Hereford Library Users Group (HLUG) working on plans to redevelop the site into a ‘cultural hub’. Herefordshire Council is expected to approve up to £500k of works towards the re-opening of the library next week – with the balance of the capital allocation being used as match funding for a redevelopment scheme, led by HLUG or another partner with an approved plan. The cabinet will also look at re-opening the library in the short term but, be warned book-lovers, that’s &#34;pending a decision on longer term options for sustainable delivery of the museum and archive service&#34;.","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["North Yorkshire","Sun, 08 May 2016 19:58:45 +0000","North Yorkshire – Libraries’ events help to raise awareness of dementia – NE Connected. &#34;North Yorkshire libraries will mark Dementia Awareness Week from 15 to 21 May with events in libraries across the county and displays of their Reading Well dementia books collection.&#34;","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["Westminster","Sun, 08 May 2016 19:58:45 +0000","Westminster – Artist secures ‘work in residence’ status at UK’s leading reference library – Journalism. &#34;Bristol based artist Elaine Robinson has secured a permanent residence for her artwork Turning ‘ages, at Westminster Reference Library, London.&#34; … &#34;&#34;Public libraries are trusted spaces, free to enter and open to all. In them, people can explore and share reading, information, knowledge and culture. And libraries play a broad role in their communities. It’s great to see that the exhibition has found a home in London’s West End where it can be shared on a more national platform&#34;","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["Lancashire","Sun, 08 May 2016 19:58:45 +0000","Lancashire – Anger as county reveals libraries and childrens centres hit list – Citizen. &#34;More than 50 key council building including libraries and children’s centres across East Lancashire are set to close, it was confirmed last night.  The announcement by County Labour leader Jenny Mein yesterday provoked shock and outrage from politicians of all parties.  In total 54 of the authority’s buildings in Hyndburn, Burnley, Pendle, Ribble Valley, Rossendale and Chorley are set to shut their doors within the next 12 months.&#34;","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["Lancashire","Sun, 08 May 2016 19:58:45 +0000","Lancashire – Lancashire libraries closure plan criticised by MP – BBC. &#34;An MP has criticised plans to shut 29 libraries as part of a multimillion-pound cost cutting exercise. The proposals will see the number of libraries in Lancashire reduced from 73 to 44. Paul Maynard, who represents Blackpool North and Cleveleys, said he is angry alternatives have not been considered. A 12-week consultation is due to begin on the proposals, which will help save £200m by 2021 from the council’s overall budget. Mr Maynard, who led the campaign to save Cleveleys Library, said the formation of social enterprises to run the libraries &#34;has proved successful&#34; in other parts of the country.&#34;","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["Lancashire","Sun, 08 May 2016 19:58:45 +0000","Lancashire – Library plans out this week – Lytham St Annes Express. &#34;Before anything happens in September there will be another public consultation, so we urge residents to make their feeling known while they have time. It is in the council’s interest to know how people feel in order for us to have all the information we need before we make a decision. No final decision will be made until September. The information being made available to the public tomorrow is the list of which county council-owned buildings, including libraries, being recommended to be retained. The council’s cabinet will look at these recommendations at its meeting on Thursday, May 12 and give its views on the proposals.&#34;","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["North Yorkshire","Sun, 08 May 2016 19:58:45 +0000","North Yorkshire – Craven libraries celebrate local history month – Craven Herald. &#34;Among the planned events is a heritage fair at Settle Library on Wednesday from 10.30am to 5pm, featuring exhibits from North Craven groups and talks by local experts, including Sita Brand, director of Settle Stories, who will speak about the WR Mitchell archive; Bob Swallow, author and local historian, who will talk on the building of the Settle Carlisle railway; and John Asher, local historian, who will speak on ‘Conscientious Objectors of Settle and North Craven’.&#34;","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["Lancashire","Sun, 08 May 2016 19:58:45 +0000","Lancashire – Revealed: Libraries and services proposed to shut by LCC – Clitheroe Advertiser and Times. Includes full list.","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["Shropshire","Sun, 08 May 2016 19:58:45 +0000","Shropshire – ‘Catastrophe’ warning on impact of losing services in Oswestry – Shropshire Star. &#34;Councillors heard a report on the beginning of discussions with the local authority and a redesign of services to match Shropshire Council’s budget. It comes after town and parish councils and community groups across the county were last month told they had five months to come up with suitable agreements to manage or fund at-risk services, as Shropshire Council is looking to save £61 million from its budget by 2018/19.&#34; Town council asked to help: &#34;&#34;This could be disastrous. Losing leisure centres and libraries would be a catastrophe. I’m one of the strongest critics of Shropshire Council but I do think the town council needs to step up to the plate for the interests of the community&#34;","2016/05/so-what-does-lancashire-and-newfoundland-have-in-common.html"],["East Riding of Yorkshire","Tue, 10 May 2016 20:49:32 +0000","East Riding of Yorkshire – Library hours to be cut – Hull Daily Mail. &#34;Plans have been revealed to cut library opening hours in the East Riding and reduce the frequency of the mobile library service across the region. The council says it is also considering merging two libraries in Bridlington as part of moves to save £1.2m a year. If given the go-ahead, weekly visits by the mobile library in 17 larger villages would change to fortnightly stops. In addition, nearly 100 smaller places where the mobile service currently visits every two weeks would see a change to a four-weekly cycle. Under the proposals, the library service at the current North Bridlington library in Martongate would be transferred to the King Street branch in the town centre.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Greenwich","Tue, 10 May 2016 20:49:32 +0000","Greenwich – Greenwich Centre Library – Designing Libraries. &#34;Thedesignconcept introduced stimulating and inspirational furniture, gadget bars and digital technology to this exciting library space … A bank of PC’s are readily available for public use to access the internet, a gadget bar provides charging facilities for phones and laptops in the ‘quiet’ study area in the library. Teenagers can enjoy an area fitted with games consoles, large screens and innovative furniture for ultimate comfort. &#34; … &#34;Following a maritime theme, to incorporate the rich history of Greenwich, the children’s area of the library has been fitted with boat shaped browsers and the shelving includes waves, anchors and port-holes for children to enjoy. The children’s library also has PC’s and tablets available for the younger visitors. &#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Somerset","Tue, 10 May 2016 20:49:32 +0000","Somerset – Coming soon to Taunton Library: The Glass Box – Somerset County Council. &#34;The Glass Box, so-called because it will be making its home in the window-walled former Tourist Information Centre in Paul Street, will be a free, community space designed to help business start-ups, innovators and digital makers come together.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["East Riding of Yorkshire","Tue, 10 May 2016 20:49:32 +0000","East Riding of Yorkshire – Proposal to Amalgamate Bridlington Libraries – Yorkshire Coast Radio. &#34;The proposal has been developed following detailed analysis of nearly 8000 responses to a public consultation on the library service, which concluded last December&#34; … &#34;Subject to approval by Cabinet on 17 May, the second phase of the public consultation, on the new proposals, will run from 25 May to 3 August 2016, and will be available online at www.eastriding.gov.uk&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Enfield","Tue, 10 May 2016 20:49:32 +0000","Enfield – Enfield libraries closed for refurbishment in preparation to share space with local groups – This is Local London. &#34;Ponders End Library is being remodelled to allow Age UK Enfield to have its headquarters in part of the College Court building in High Street, Ponders End. The building will be closed until May 23 while work to upgrade facilities for the charity take place. Enfield Highway Library will be also be closed until at least August 1, while a public health services department is put in. The changes are part of plans by the council to raise money by allowing other businesses and organisations to share library space and pay part of the leases, after facing government cuts.&#34; … &#34;The four biggest libraries – Enfield Town, Edmonton Green, Palmers Green and Ordnance Unity Library – will continue to provide regular library services along with community events. The other 13 Enfield libraries will be run by the council, but facilities will be shared with other organisations to help save money.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Lancashire","Tue, 10 May 2016 20:49:32 +0000","Lancashire – Library campaigners worry for the future of local services – 2BR. &#34;&#34;We found out that we’re going to be part of a new scheme called a ‘Satellite System’ and we’re not really sure how it’s going to work. We’re obviously really pleased that the campaign has made such a difference but we’re not quite sure how much money will have to be spent making the building fit for purpose.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Enfield","Tue, 10 May 2016 20:49:32 +0000","Enfield – Palmers Green Library, Enfield – Designing Libraries. &#34;After a year-long closure, the library opened its doors to a multitude of new features installed over the library’s two floors.&#34; … &#34;The library now includes interactive tables, a gadget bar with internet access, electronic noticeboards and digital end-panels as well as a children’s section, teenage area and a community room.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Lancashire","Tue, 10 May 2016 20:49:32 +0000","Lancashire – Campaigners disappointed at plans to close 29 Lancashire libraries – Lancashire Headline News\nLancashire – County Council boss accused of ‘dirty tricks’ after building closure plans announced – Lancashire Telegraph. &#34; Council leader Jenny Mein has defended the timing, consultation and content of her announcement of a shortlist of 108 council buildings due to close, including 54 in East Lancashire. Critics have accused her of ‘dirty tricks’ by revealing the proposals on the day local election results were being counted.&#34; … &#34;Cllr Mein said: &#34;We announced the list at the first opportunity after the local elections were over. &#34;This was a highly political decision that could not be revealed during the campaign. &#34;We do not want to close these premises but we are having to because of savage Tory government cuts&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Lancashire","Tue, 10 May 2016 20:49:32 +0000","Lancashire – MP’s campaign against Lancashire library closures – BookSeller. &#34;In a Facebook post, local Wyre MP Paul Maynard [Conservative] urged the council to look at converting the libraries into not-for-profit social enterprise companies which are often run by existing staff to invest back into their facilities and the wider community. Maynard said other councils – including those in York and Devon – have done this with &#34;great success&#34;,","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Lancashire","Tue, 10 May 2016 20:49:32 +0000","Lancashire – County Council staff wait for jobs news as cuts row grows – LEP. &#34;Public services union UNISON predicts that on Wednesday and Thursday some 50 library and museums staff will be told they are in line for redundancy, with another 200 plus jobs set to go from the county council’s Children’s Centres next year. Lancashire branch Secretary Elaine Cotterell, whose union represents 10,000 county council members said council workers are devastated. With so many jobs hanging by a thread and the future of so many buildings and services uncertain, she said staff were likely to be &#34;in shock&#34;.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Lancashire","Tue, 10 May 2016 20:49:32 +0000","Lancashire – Libraries and kids centres to close – Lancaster Guardian. &#34;Bolton-le-Sands, Carnforth and Silverdale libraries, and Lancaster and Morecambe’s Registration Offices, are also on a list of properties likely to be sold off under new proposals. &#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Lancashire","Tue, 10 May 2016 20:49:32 +0000","Lancashire – Shock as closure hit list is revealed – Chorley Guardian. &#34;Stuart Clewlow, who has been campaigning to save Adlington Library, said: &#34;Generally speaking, I am pleased for the borough that we are looking at the threat of closure to only one of our libraries. &#34;However, it is concerning that Adlington has been identified as surplus to requirement when it serves an ever growing population and continually evolves to meet the ever varying needs of the community.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Renfrewshire","Tue, 10 May 2016 20:49:32 +0000","Renfrewshire – Johnstone Public Library – Designing Libraries. &#34;This building, with its combination of a striking glass façade, deep public atrium and high quality stone finishes, stands out from the surrounding buildings in Ludovic Square where it has been designed as a catalyst for a wider regeneration programme for the town. It creates a new model for the delivery of community services as the public library, theatre, marriage suite, conference room and café sit alongside staff from the council’s housing and social work departments, AdviceWorks, Police Scotland and Macmillan Cancer Support.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Staffordshire","Tue, 10 May 2016 20:49:32 +0000","Staffordshire – Campaigners confident of forcing council to rethink plans for Lichfield Library – Lichfield Live. &#34;…  petition organised by the Lichfield and Burntwood branch of the Green Party has called for a public consultation on the proposals. The 5,562 verified signatures means that the council will now need to debate the issue at a meeting on May 19 … Robert Pass, chair of Lichfield and Burntwood Green Party, said: &#34;Quite simply, we believe that the council must agree to a new consultation on the future of Lichfield Library.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Lancashire","Tue, 10 May 2016 20:49:32 +0000","Lancashire – Libraries under threat in West Lancashire are named – Champion. &#34;The proposals for libraries are to reduce the number of fixed locations where people can access libraries from 73 to 44. It is proposed that 37 of these will offer a fully staffed service and seven will be ‘satellite’ libraries which are not staffed, but where people can use self-service counters to collect books which they have reserved and return books. This will be supported by the county council’s mobile library service (six vehicles operating 68 routes and 792 stops), home library service (which currently delivers books to 1,000 people at home) and virtual library services, which allows people to access e-books, e-audiobooks and online reference service.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Lancashire","Tue, 10 May 2016 20:49:32 +0000","Lancashire – MP’s anger at extent of cuts in South Fylde – Lytham St Anne’s Express. &#34;Fylde MP Mark Menzies [Conservative] has hit out at Labour-led Lancashire County Council’s plans to close libraries across Fylde…. Mr Menzies, who has attended a number of recent events in support of libraries and has written repeatedly to county hall to appeal for a reasoned approach, said: &#34;I have tried to do all I can to make it clear to the county council how important libraries are to the people of Fylde. &#34;I have also encouraged local people to speak up for their libraries and take part in the consultation process so the county council can make a decision knowing the strength of feeling in support of Fylde’s libraries.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Thurrock","Tue, 10 May 2016 20:49:32 +0000","Thurrock – Fibromyalgia awareness events in Thurrock – Your Thurrock. &#34;Thurrock Council’s libraries have teamed up with charities and c2c to promote awareness of fibromyalgia, a long-term condition that causes pain all over the body. Fibromyalgia Awareness Day is on Thursday, 12 May and Fibromyalgia Action UK (FMA UK) and FMSupport South East Essex will be holding information stalls between 10am and 2pm at Grays library on the day.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["West Dunbartonshire","Tue, 10 May 2016 20:49:32 +0000","West Dunbartonshire – Plenty more in store for West Dunbartonshire Booked! festival – Dunbarton Reporter. &#34;Councillor Michelle McGinty, the council’s Educational Services Convener, said: &#34;It is fantastic to see Booked! 2016 get underway. Our libraries see hundreds of thousands of visits each year so we know they’re popular, but Booked! is an opportunity to really celebrate what they have to offer as well as getting people in who might not already be library members. &#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Lancashire","Tue, 10 May 2016 20:49:32 +0000","Lancashire – ‘Shameful legacy of closures’ – LEP / Letters. &#34;What time is it best to bury bad news? Is it any wonder that the public-at-large have no respect for politicians of any side? They are completely devoid of vertebrae and deserve no respect whatsoever. I notice that the list consists of library, children’s centre, youth, library, children’s centre, youth, library, et cetera, et cetera.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["West Sussex","Tue, 10 May 2016 20:49:32 +0000","West Sussex – West Sussex libraries offer mental health help to teenagers – News. &#34;West Sussex County Council has launched Shelf Help – a collection of books, reviewed by clinicians, to help with a range of conditions&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Lancashire","Tue, 10 May 2016 20:49:32 +0000","Lancashire – Three Valley libraries set for axe and two saved under cuts plans – Rossendale Free Press. &#34;Eight community buildings across the Valley – including three libraries – are facing closure within a year under county hall cost-saving plans.&#34; … &#34;Rawtenstall and Haslingden libraries have been spared under the plans, which were first touted last November. Greensclough councillor Peter Steen said the closure of Bacup Library – which had been refurbished by the county council only last year – would ‘shut out’ the elderly and vulnerable.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Manchester","Tue, 10 May 2016 20:49:32 +0000","Manchester – Arcadia gets the ‘Manchester Look’ – Designing Libraries. &#34;The library, designed and furnished by Demco Interiors, is an integral part of the centre, with access to a wide range of library services and PCs with free Wifi, an exciting children’s library, comfy seating areas, study spaces and on and offline media, including books for all ages and interests. The library is managed by Manchester Libraries and will be staffed for 30 hours a week. Self-service lending will be available throughout the centre’s opening hours.","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["North Somerset","Tue, 10 May 2016 20:49:32 +0000","North Somerset – Petition launched to keep library open – Mercury. &#34;Raye Green has created the Worle Library Defence Group to try to persuade the council to keep the Worle library, which is based in The Maltings, open in its current format. She said: &#34;I have a particular interest in Worle Library, which is a key hub to the community, especially for the vulnerable. Our elderly population, young families and schools all rely upon this heart of the community facility.&#34;&#34;.  Councillor says &#34;&#34;There are likely to be additional co-located libraries and children’s centres and more closer working with partners such as the police and health colleagues.&#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Somerset","Tue, 10 May 2016 20:49:32 +0000","Somerset – Somerset libraries are Positive About Breastfeeding – County Gazette. &#34;Somerset County Council has signed up to the scheme, which means mothers are welcome to breastfeed in any public area, with staff also being informed of breastfeeding policies to promote the rights of mothers to choose how and where to feed their babies. &#34;","2016/05/fallout-in-lancashire-changes-in-enfield-and-yorkshire-and-some-refurbs-and-ideas.html"],["Bexley","Sun, 15 May 2016 20:06:08 +0000","Bexley – Community-led libraries see success across Bexley – Bexley Times. &#34;Libraries have been taken over by trusts, groups, and at Bostall Library, a team of local volunteers. The Bostall Library Community Group, which includes a member of staff from the library, started running the service in Bexleyheath last month. Based on King Harolds Way, the group are hoping to open the library up to local events outside of open hours. Among the other groups, Eco Communities has taken over management at Northumberland Heath and Upper Belvedere libraries, while New Generation Community Trust, which runs the Hope Community School open Blackfen Library last month. Cabinet Member for community safety, environment and leisure, Peter Craske said: &#34;This is another reason why Bexley is such a great place to live, and it is brilliant to see local communities taking control of their local libraries.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Enfield","Sun, 15 May 2016 20:06:08 +0000","Enfield – Enfield libraries in mental health book promotion – Londonist. &#34;Cllr Ayfer Orhan, cabinet member for education, children’s services and protection, said: &#34;Reading Well books offer high-quality information, support and advice on a wide-range of mental health issues&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Hampshire","Sun, 15 May 2016 20:06:08 +0000","Hampshire – Battle after Bursledon Parish Council barred from Lowford Community Centre  – Daily Echo. &#34;Bursledon Parish Council have been effectively evicted from their offices by the Bursledon and District Community Association (BDCA), which manages the building. The future of the village library is now in doubt as it is run by the parish council and its army of library volunteers who have also been barred from using it.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Lancashire","Sun, 15 May 2016 20:06:08 +0000","Lancashire – Campaign group launched to save Whitworth library from closure &#34;travesty&#34; – Rossendale Free Press.","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Lancashire","Sun, 15 May 2016 20:06:08 +0000","Lancashire – Campaigners pledge ‘tooth and nail’ fight against closure of our libraries –  Rossendale Free Press. &#34;Leading Valley politicians from every colour have vowed to fight the closures, which will now go out for a 12-week consultation. Labour’s Rossendale council leader Alyson Barnes said the proposals do not make sense. She said: &#34;We are devastated by these proposals and we will do what we can to ensure this allocation is looked at again. Some of our communities are far too isolated to lose those vital services.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["St Helens","Sun, 15 May 2016 20:06:08 +0000","St Helens – Libraries backing dementia awareness – St Helens Star. &#34;A range of events, from singing and dancing to art installations and films, will be held at St Helens libraries to mark Dementia Awareness Week, which starts on Sunday, May 15. Central Library will hold a day of events on Monday, May 16 including a Reminiscence Karaoke from 2 to 3pm, which is designed bring back music-linked memories.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Dorset","Tue, 17 May 2016 21:28:42 +0000","Dorset – Dorset residents borrowing books from a library in Bristol? No problem – Dorset Echo. Dorset now part of the LibrariesWest Consortium.","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Sunderland","Tue, 17 May 2016 21:28:42 +0000","Sunderland – Lets Talk About Dementia – NE Connected. &#34;Ian Donaghy’s book ‘Dear Dementia: The Laughter and the Tears’ is recognised by mental health practitioners as one of the best ever written on the subject. The author will be talking about his book at the City Library and Arts Centre …&#34;","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Birmingham","Sun, 15 May 2016 20:06:08 +0000","Birmingham – Tributes to architect who designed Central Library – Birmingham Mail. &#34;The iconic ‘inverted ziggurat’ of Birmingham’s old Central Library may famously have been attributed to the late great city architect John Madin. But the design of the Brutalist landmark was in fact led by a partner in Madin’s practice – John Ericsson – who has died aged 85 after a short illness. Though the design divided opinion, Central Library – currently being demolished despite a campaign to list it – was described in the Pevsner Architectural Guide as &#34;the first Birmingham building of European importance since the early 1900s&#34; and &#34;the finest example of the Brutalist aesthetic in Birmingham, and a civic project of European importance&#34;.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["East Riding of Yorkshire","Sun, 15 May 2016 20:06:08 +0000","East Riding of Yorkshire – East Riding Council libraries service – £1.2m cuts concern – HU12 Online. &#34;East Riding of Yorkshire Council unveiled the proposal this week for the future of its library service and multi service centres, following its analysis of nearly 8,000 responses to a public consultation which concluded last December. Subject to approval by the council’s Cabinet on Tuesday 17th May, the proposal which would save the council around £1.2 million, will be the subject of a further second round of public consultation.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Darlington","Sun, 15 May 2016 20:06:08 +0000","Darlington – Friends group launched to save Darlington’s libraries – Northern Echo. &#34;The Friends of Darlington Libraries was formed after hundreds of people attended recent public meetings about the future of the services. Darlington Borough Council is proposing to move the Crown Street Library to the Dolphin Centre. The authority also plans to close the Cockerton branch and end the mobile library service. The library in Crown Street, which opened in 1885, was given to the people of Darlington by the Pease family with a legally binding Covenant which stipulated that the building be used for educational and library purposes ‘in perpetuity’.","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Devon","Sun, 15 May 2016 20:06:08 +0000","Devon – Michael Morpurgo helps launch organisation to run Devon’s libraries – Times Gazette. &#34;Libraries Unlimited, a staff and community-owned social enterprise, took over the running of 50 libraries across Devon from April 1. Mr Morpurgo helped the launch of Libraries Unlimited on World Book Night. World Book Night is an annual celebration of reading and books. It sees passionate volunteers give hundreds of thousands of books away in their communities to share their love of reading with people who, for whatever reason, don’t read for pleasure or own books.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Lancashire","Sun, 15 May 2016 20:06:08 +0000","Lancashire – Video plea to save libraries – Fleetwood Weekly News. &#34;A library worker turned councillor has kick-started the battle to save threatened services.&#34; … &#34;I used to see people come in, read two books, go for lunch, come back and read two more. That is their life&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Dumfries and Galloway","Sun, 15 May 2016 20:06:08 +0000","Dumfries and Galloway – Bookbug at Libraries – Galloway Gazette. &#34;Dumfries and Galloway Libraries are preparing to travel the world with Bookbug. Bookbug Week will take place between the 16th and 22nd May and the theme this year is Around the World with Bookbug. There are 19 events taking place at libraries all over Dumfries and Galloway. There are special Around the World story times and Around the World Bookbug Sessions so come along and join in Bookbug’s travels&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Lancashire","Sun, 15 May 2016 20:06:08 +0000","Lancashire – Solutions for Lancashire Libraries? A note by Frances Hendrix – Library Campaign. &#34;There are alternatives to closures (with or without handing over branches to groups of volunteers) which will enable the service to continue (perhaps with closures of a relatively small number of non-viable branches) in a form which complies with the Act rather than adopting a fragmented and necessarily less cost-efficient solution. Unfortunately, it does not appear that the council is looking for such alternatives but rather seems to be wedded to proposals structured around a property-based assessment (a way of proceeding which violates the spirit of the Wirral report) and involving massive closures, an approach which will almost certainly lead to a challenge (by judicial review) to the decision on the grounds that the consultation has been a sham (because the issue has been predetermined) and/or a request to the DCMS for intervention (by the direction of a local inquiry).   Every reasonable effort should be made to avoid the resolutio&#8230;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Lancashire","Sun, 15 May 2016 20:06:08 +0000","Lancashire – Three communities rally to fight library closure proposals -Accrington Observer. &#34;Three Hyndburn communities are rallying in a bid to save their beloved libraries after they were named on a hitlist set for closure.&#34; … &#34;Teacher Emma Clark started a petition opposing the closure of Rishton library, which now has more than 250 signatures. She said: &#34;Since I started the petition it’s just been gaining momentum. We can’t allow this to happen. The library is the heart of our community&#34; … &#34;In Clayton-le-Moors non-profit social enterprise group Mercer House 1842 has begun talks to try and secure their library’s future. Director Nick Collingridge said: &#34;Everybody’s up in arms. The libraries have always been part of the community, to take them away and say you can go down to Accrington – that will never happen. People won’t be able to get there.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Thurrock","Sun, 15 May 2016 20:06:08 +0000","Thurrock – Fibromyalgia Awareness Day being held tomorrow at Grays Library – Braintree and Witham Times. &#34;The council’s libraries have teamed up with charities and c2c to promote awareness of fibromyalgia, a long-term condition that causes pain all over the body. Fibromyalgia is known as an incurable condition, which often causes disability and makes people unable to work with up to 2.7 million sufferers in the UK alone – but as charities say, with the right support it can be managed. &#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Warrington","Sun, 15 May 2016 20:06:08 +0000","Warrington – Library opening times cut following one-month trial  – Warrington Guardian. Nine libraries to have reduced hours, with library staff being forced to work in other libraries for the reduced hours. LiveWire manager blames reduction in library usage, rather than budget cuts, for reduction in hours. Some libraries seeing only two visitors in the first or last hour of opening. Internet downloads also blamed.","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Walsall","Tue, 17 May 2016 21:28:42 +0000","Walsall – Lib Dems and Labour on the verge of deal to take over Walsall Council – Express and Star. &#34;The coalition would mean the seven libraries in the borough facing the axe will be saved, while the Citizens Advice Bureau in Walsall could also get a reprieve. An agreement has been struck between Labour leader Councillor Sean Coughlan and Liberal Democrat leader Councillor Ian Shires, with the Walsall Labour party set to sign off on the coalition tonight. A formal announcement will be made tomorrow morning. Despite the reprieve for the libraries, council tax will still rise by 3.99 per cent and £29 million of savings still need to be found this financial year.&#34;","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Herefordshire","Sun, 15 May 2016 20:06:08 +0000","Herefordshire – Boost for Hereford Library as Cabinet backs re-opening plan – Hereford Times. &#34;Hereford’s  historic library building could re-open by the end of this year after plans to turn it into a cultural hub were backed by leading councillors. The Broad Street venue has been closed since last September when traces of asbestos were discovered during maintenance work. Library users have since had to either visit Belmont Library or a ‘pop-up’ facility at Hereford Town Hall. But Herefordshire Council‘s Cabinet this week gave the thumbs-up to Hereford Library Users Group (HLUG)’s idea to re-open the venue as a multi-use community hub, with the site &#34;reinstated&#34; in the interim.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Wirral","Sun, 15 May 2016 20:06:08 +0000","Wirral – Daleks invade Wirral libraries for special exhibition and film show – Wirral Globe. &#34;Wallasey Central Library welcomes life-sized, mobile, replica Daleks to coincide with a screening of a sci-fi movie classic. &#34; … &#34;The 1966 movie Daleks – Invasion Earth 2150 AD will be screened in the library after a talk about the history and development of the Daleks since their introduction to Dr Who in 1963. &#34; … &#34;The event is organised by the Friends of Wallasey Central Library and Wirral Council’s Libraries service and will take place next Saturday, May 21.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Lancashire","Sun, 15 May 2016 20:06:08 +0000","Lancashire – Could Lancashire’s cuts hit libraries still be saved? – Lancashire Evening Post. Conservatives complain money has not been taken from council reserves to save libraries.","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Lancashire","Sun, 15 May 2016 20:06:08 +0000","Lancashire – Morecambe Library to become ‘unstaffed’ under new plans – Visitor. &#34;Morecambe Library would become an unstaffed ‘satellite’ library under new proposals to cut library services in our district. A library insider also told us that Heysham Library could become the main library for Morecambe under the Lancashire County Council cost-saving plans. Last year Morecambe Library (200,988) had more than three times more visitors than Heysham Library (63,276).&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["North Lanarkshire","Sun, 15 May 2016 20:06:08 +0000","North Lanarkshire – North Lanarkshire libraries to close after council cuts – BBC. &#34;Seven community centres and four libraries are to close in North Lanarkshire after £400,000 of council budget cuts. The number of mobile libraries in the council will also be reduced from five to three. The authority said it was the result of &#34;necessary&#34; cuts to Culture NL – the arms-length body which manages arts and entertainment venues for the council. Funding for Culture NL has been reduced by a third to £1.072m. North Lanarkshire Council said &#34;detailed customer data&#34; showed the 11 facilities earmarked for closure – from a total of 98 – were &#34;little-used&#34;.","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Lewisham","Tue, 17 May 2016 21:28:42 +0000","Lewisham – Lewisham &#34;March for Libraries&#34; – Stop the privatisation of public libraries. &#34;…  Unison members in Lewisham Libraries who will be on strike this coming Saturday (21/5/16) in defence of the library service. They will be joining other library supporters on a march;&#34;","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Shropshire","Tue, 17 May 2016 21:28:42 +0000","Shropshire – Spotlight to fall on Shrewsbury’s threatened services – Shropshire Star. &#34;The future of under-threat public services in Shrewsbury such as museums, leisure centres and libraries, will be the focus of Shrewsbury’s annual town meeting.&#34; … &#34;The county authority is in discussions with Shrewsbury Town Council about the possibility of taking on the management and of the services, which include Shrewsbury Museum and Art Gallery, Shrewsbury Library, Coleham Pumping Station, Shrewsbury Sports Village, The Quarry Fitness and Swimming Centre, Meole Brace Golf Course, the Grange Youth Centre, and more,&#34;","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Lancashire","Sun, 15 May 2016 20:06:08 +0000","Lancashire – MP condemns closure hit-list – Lytham St Anne’s Express. &#34;Fylde MP Mark Menzies is ‘appalled’ at the extent of the cuts to libraries Lancashire County Council is threatening across Fylde – and claims party politics have played a part in the decision by the Labour-run authority. &#34;There can be no doubt that the Labour Party has sought to protect areas where it receives more support,&#34; he said&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Enfield","Tue, 17 May 2016 21:28:42 +0000","Enfield – ‘Patient’ tech types called on to volunteer at cash-strapped libraries – North London Today. Enfield council wants 20 volunteers to come forward and take a test before committing their time to help others. The Good Samaritans don’t need to be computer whizzes but they do need to have a &#34;good working knowledge of computers&#34; and be &#34;patient&#34; teachers. Organisers claim the pay back for volunteers is the feel good factor of &#34;making new friends and helping people&#34;.","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Lancashire","Tue, 17 May 2016 21:28:42 +0000","Lancashire – ‘Our library is not just about books, it is a social necessity’ – Visiter. &#34;Sylvia Lambert, of Mill Lane in Burscough, has penned an emotional letter calling for the library to be saved. She says: &#34;Once again Burscough is to lose out. This time the proposals is to close our much needed library. &#34;We have half a dozen schools in Burscough, the pupils of which make good use of the available facilities. &#34;It is a joy in the summer holidays to see the little ones collecting and returning the books they have read. &#34;Will they be so keen during the winter when Mum and Dad have to make a trip to Ormskirk either by car or public transport?&#34;","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Lancashire","Sun, 15 May 2016 20:06:08 +0000","Lancashire – Plea for library closures rethink – Lytham St Anne’s Express. &#34;In Lytham, Ansdell and Freckleton, petitions to save the libraries have already gathered thousands of signatures, while Kirkham Town Council is aiming to get together with parish councils around rural Fylde to present a ‘united front’ during the consultation period. Kirkham county councillor Liz Oades, who also serves on Fylde and Kirkham Town councils, said she had been told by County Hall officials that a switch of library service from the current building to Milbanke would not result in any reduction in service.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Lewisham","Sun, 15 May 2016 20:06:08 +0000","Lewisham – The Story Of London’s Smallest Library – Londonist. &#34;The box which stands near the corner of Loampit Hill and Tyrwhitt Road, just a stone’s throw from St John’s station, has operated since 2013 as a book exchange. The Lewisham Micro Library — as it’s become known, and as Google Maps now labels it — is touted as London’s smallest book repository. With no registration, and no fines, it’s a casual walk-in-and-browse setup. Anyone is free to take home a book, provided they bring it back or replace it with another. &#34;It’s definitely given people an excuse to stand around chatting,&#34; reflects Seb Handley, &#34;and in that sense, I suppose it’s really failed as a library.&#34;&#34; [Seb Handley seriously loses library credibility points there but then he brings it back with … – Ed.] … &#34;There is a problem with what I’ve done,&#34; he says, self-effacing once more. &#34;That phone box could be seen to undermine what proper librarians provide. Theirs is a job that deserves to be respected and professionalised.&#34;&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["North Lanarkshire","Sun, 15 May 2016 20:06:08 +0000","North Lanarkshire – Jobs to go as council announces closure of a dozen community facilities and libraries – Herald Scotland. &#34;The arms-length firm affected, Culture NL, manages entertainment venues, community arts, museums, libraries, play services and community facilities on behalf of the council and has seen its budget cuts by over £1million. It is also facing additional cost pressures of around £450,000. The move will see a number of job losses, with the organisation saying it hoped to avoid compulsory redundancies&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Stockton","Sun, 15 May 2016 20:06:08 +0000","Stockton – Rallying call to save under threat Stockton library – Gazette. &#34;Councillors are calling on people to campaign over the future of Fairfield Library – one of two under threat of closure in shake up &#34; … &#34;Cllrs Carol and Michael Clark, who represent Grangefield ward, are asking people to write to their local councillors calling on then to protect Fairfield library. Stockton Council is seeking a &#34;co-location partner&#34; to help with the running costs of the library, but will propose its closure if none are found. Councillor Michael Clark spoke out on the library cuts as many residents in his ward use the nearby library.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Swindon","Sun, 15 May 2016 20:06:08 +0000","Swindon – Councillor urged to back up her pre-election library promises – Swindon Advertiser. &#34;On a leaflet entitled ‘Highworth Library – The Facts’, Coun Maureen Penny (Con, Highworth), pledged that the library was not going to close, that it was not going to move and that it would still be staffed by qualified librarians. Speaking to the Adver last week, Coun Penny said: &#34;I stand by everything on the leaflet – I went in to see Coun Rennard and Coun Perkins regarding the difference in rural areas and we got a dispensation for Highworth.&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Bradford","Tue, 17 May 2016 21:28:42 +0000","Bradford – Vital public services now under one roof as new community hub opens in town’s library – Telegraph and Argus. The existing library services have now had services from the old One Stop Centre at Pudsey Town Hall added to what is on offer, including housing, benefits and registrars. Local councillors Josie Jarosz, Richard Lewis and Mick Coulson hope to have their advice surgeries there every first and third Thursday of the month from 5pm to 6pm. Pudsey Town Hall will now be used by integrated Health and Social Care teams, providing an essential local base for council staff and their working partners&#34;","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Suffolk","Tue, 17 May 2016 21:28:42 +0000","Suffolk – Suffolk Libraries relaunches Mental Health and Wellbeing Service – Suffolk Libraries. &#34;Suffolk Libraries are getting behind Mental Health Awareness Week next week with full force, hosting several different events across the county and celebrating a relaunch of their Mental Health and Wellbeing Information Service. The newly named ‘New Chapters’ service can help residents of Suffolk find out about mental health and wellbeing organisations, services, local projects, events and specialist books to help support a whole range of mental health and wellbeing issues.&#34; …. &#34;Suffolk Libraries are also supporting Dementia Awareness Week, which coincides with Mental Health Awareness Week, with dedicated displays and an event at Broomhill Library in Ipswich on Thursday 19 May at 2pm. &#34;","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Lincolnshire","Sun, 15 May 2016 20:06:08 +0000","Lincolnshire – New-look Alford Library offers homely atmosphere  – Skegness Standard. &#34;Alford Library – which re-opened as a volunteer-run operation earlier this year – has been transformed following a refurbishment. Now known as Alford Focal Point, the facility was one of the libraries earmarked for closure by Lincolnshire County Council until a group of volunteers took it on&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Liverpool","Sun, 15 May 2016 20:06:08 +0000","Liverpool – Liverpool’s Central Library turned into a silent disco for LightNight 2016 – Liverpool Echo. &#34;It was billed as one of the quietest events of LightNight 2016 – outwardly at least – but that didn’t stop the Shush Silent Disco at Liverpool’s Central Library being one of the biggest crowd-pullers of the night. Long queues snaked around the first floor of the library as hundreds waiting to join the fun in the stunning grade II Picton Reading Room&#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["North Lanarkshire","Sun, 15 May 2016 20:06:08 +0000","North Lanarkshire – Iconic American writer backs campaign to save library in North Lanarkshire – Herald Scotland. It has attracted the support of a number of writers, as well as members of the community, including Ian Rankin, Val McDermid, Sathnam Sanghera, M G Leonard and Amanda Craig, among others.&#34; … &#34;However the petition took a trans-Atlantic twist when Armistead Maupin, best known for his Tales of the City series of novels set in San Francisco, pledged his support to the campaign. &#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["Powys","Sun, 15 May 2016 20:06:08 +0000","Powys – Still time to submit views on the future of Powys libraries – Abergavenny Chronicle. &#34;With savings of over £27m to be found over the next three years, the library service has been tasked with reducing their costs by £250,000 by April 2019.&#34; … &#34;Some meetings have taken place with town and community councils and other organisations who could contribute towards library running costs, co-locate their service within the current library building or offer the library a home in theirs. &#34;","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["West Dunbartonshire","Sun, 15 May 2016 20:06:08 +0000","West Dunbartonshire – West Dunbartonshire literary festival proving a big hit – Daily Record. For the first time in 14 year’s of festival, all libraries will be hosting at least one event. Free, but ticketed.","2016/05/shes-moving-her-lips-plus-good-new-ideas-cuts-in-north-lanarkshire-and-warrington.html"],["East Riding of Yorkshire","Tue, 17 May 2016 21:28:42 +0000","East Riding of Yorkshire – Dozens of villages face losing mobile library under plans to make £1.2m savings – Yorkshire Post. &#34;Dozens of villages in the East Riding face losing their mobile library service while opening hours at some libraries could be drastically cut back under proposals to save £1.2m.&#34; … &#34;when asked whether they would prefer some branches to close and maintain the same opening hours at the ones left, the vast majority opted for keeping all branches open but with reduced opening hours.&#34;","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Northern Ireland","Tue, 17 May 2016 21:28:42 +0000","Northern Ireland – Libraries NI: Opening hours could be cut at 14 premises under plans – BBC. &#34;under plans revealed by Libraries NI. Under the proposals, some libraries will close for an extra day every week. Libraries NI said the move was needed to make savings due to reductions in their budget. Their budget has been reduced from £29.4m in 2015-16 to £27.7m in 2016-17, but Libraries NI said that is a cut of over £2m in real terms. All of the libraries affected would have their opening hours reduced to 45 hours per week.&#34;","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Lewisham","Tue, 17 May 2016 21:28:42 +0000","Lewisham – Poet to petition Sadiq Khan over library closures – BookSeller. &#34;South London poet Chrissie Gittins is to petition London Mayor Sadiq Khan (pictured) about the future of Lewisham’s library services. Gittins, who is Lewisham’s first honorary writer in residence, is calling on the mayor to pledge his support to campaigners fighting to keep Forest Hill, Manor House, Catford and Torridon libraries from being turned into community-run centres. She intends to hand Khan a copy of her latest book – Between Here And Knitwear – at City Hall next week as it contains a passage which highlights the importance of libraries.&#34;","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["St Helens","Tue, 17 May 2016 21:28:42 +0000","St Helens –  Libraries run out of dog bags amid plans to install self-serve stations – St Helens Star. &#34;authorities are hoping to have a number of self-serve stations supplying free bags for dog mess placed at key locations to help keep the borough’s parks and green spaces clean. Stocks of the dog mess disposal bags at libraries, where they have been supplied free until now, are &#34;running low&#34; according to a St Helens Council spokesperson. Dog walker Julie Ward contacted The Star after being unable to get dog bags from Peter Street Library.&#34; Stockton – Two libraries facing closure – Northern Echo. &#34;Stockton Borough Council is consulting on plans to close Egglescliffe Library, in Eaglescliffe, and Fairfield Library, in Stockton. Under the proposals, Egglescliffe would close once the refurbishment of Yarm Library is complete and Fairfield would close if a partner organisation, or alternative place to house the library, cannot be found.&#34;","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Worcestershire","Tue, 17 May 2016 21:28:42 +0000","Worcestershire – Concern grows over cuts to opening hours at 17 Worcestershire libraries – Worcester News. &#34;Concerns are growing about cuts to library opening hours across Worcestershire – with council chiefs urged to scrap the move. As the Worcester News revealed in April, opening hours at 17 different libraries face the chop as part of a county council proposal to save £1 million. Bosses want to lose a total of 78.5 opening hours a week as well as axe jobs, introduce &#34;unstaffed periods&#34; inside the buildings and increase library fees. The authority insists no decisions have been made, and has now announced a series of consultation events so people can have a say.&#34; … &#34;&#34;St John’s is an area with one of the lowest computer ownerships in the county – we should be expanding library hours, not reducing them.&#34; &#34;","2016/05/information-on-every-library-service-in-the-uk-since-2010.html"],["Bracknell Forest","Thu, 19 May 2016 20:56:28 +0000","Bracknell Forest – Tell Bracknell council how it should run your libraries – Get Reading. &#34;A public consultation about library usage begins on Monday, May 23, at a time when four of the nine borough libraries are believed to be under threat.&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Ceredigion","Thu, 19 May 2016 20:56:28 +0000","Ceredigion – Optimism over library’s future – Cambrian News. Volunteers may work alongside paid staff in order to keep Llandysul Library open.","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Devon","Tue, 24 May 2016 21:06:35 +0000","Devon – Tiverton Library celebrates Sam and Lottie’s reading feat – Exeter Express and Echo. &#34;Sam, 8, has completed his 100 Book Track Badge. He has enjoyed reading books that made him laugh out loud. His favourites include David Walliams, Geronimo Stilton and Wimpy Kid books.&#34; … &#34;Lottie gained her 10th certificate to complete the Bear Club challenge for under five year olds and win a mini blue Book Start bear.&#34;","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Vale of Glamorgan","Tue, 24 May 2016 21:06:35 +0000","Vale of Glamorgan – Save Rhoose Library – Facebook. &#34;This Wednesday morning the High Court will decide whether our application for a Judicial Review can proceed to a full High Court trial. If the answer is yes we should also find out whether the court will issue an injunction that would halt the transfer to a community library, pending a full court hearing. Watch this space on Wednesday afternoon and we will post the result as soon as we hear it.&#34;","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Glasgow","Thu, 19 May 2016 20:56:28 +0000","Glasgow – Meet Glasgow’s newest library members – tiny triplets Poppy, Caleb and Alyssia – Evening Times. &#34;Bringing triple the fun to Glasgow’s libraries, the tots are the first triplets to sign up to the city’s Every Child a Library Member scheme. And they have visited Drumchapel Library for the first time armed with their very own library cards&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Lancashire","Thu, 19 May 2016 20:56:28 +0000","Lancashire – Public inquiry threat over libraries – Blackpool Gazette. &#34;Conservative Paul Maynard, who represents Blackpool North and Cleveleys has urged County Hall bosses to get around the table and discuss proposals to keep all Wyre branches open. And he warned he may refer the authority to culture secretary John Whittingdale as a last resort. Mr Maynard believes Lancashire’s proposed closures impacting on libraries in Thornton and Cleveleys as well as centres in Ansdell, Fairhaven, Kirkham and Lytham, may constitute a breach of the 1964 Public Libraries Act.&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Staffordshire","Thu, 19 May 2016 20:56:28 +0000","Staffordshire – Lichfield Library and Friary debate at Staffordshire County Council today – Lichfield Mercury. &#34;…the Green Party branded the scheme &#34;scandalously undemocratic&#34;, claiming that the plan will be compromised because of size differences between the buildings, and that selling the Friary site to a private developer is not in the public interest. Party chair Robert Pass set up the Save Lichfield Library petition, which has now been formally verified as containing 5,562 Staffordshire signatures – enough to trigger a debate at the county council on May 19.&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["East Riding of Yorkshire","Tue, 24 May 2016 21:06:35 +0000","East Riding of Yorkshire – Share your views on plans for libraries – Pocklington Post. &#34;A public consultation is set to be launched on East Riding Council’s proposal for the future of its library service and multi-service centres, which could see opening hours drastically cut back at libraries across the region.&#34;","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Lambeth","Thu, 19 May 2016 20:56:28 +0000","Lambeth – Lambeth Full Council meeting ends in farce as residents are prevented from having say over library closures – Brixton Buzz. &#34;The May Lambeth Full Council meeting was abandoned on Wednesday evening after library campaigners were asked by Madam Mayor to leave the public meeting at Elm Green School in West Norwood. Residents trying to stop Lambeth Labour from converting public libraries into gyms were unhappy at being unable to make a presentation to Full Council. This followed a request from Cllr Saleha Jaffer, the Mayor of Lambeth, to receive petitions.&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Lancashire","Thu, 19 May 2016 20:56:28 +0000","Lancashire – 100 stand outside Whalley library to voice their anger at County Council’s plan – Lancashire Telegraph. &#34;Residents young and old were accompanied by several Ribble Valley councillors as well as Lancashire County councillors to try and save the service that was selected along with dozens of others across East Lancashire. &#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Lancashire","Thu, 19 May 2016 20:56:28 +0000","Lancashire – Rossendale council boss Alyson Barnes clashed with county hall leaders over library closures – Rossendale Free Press. &#34;Rossendale council chief Alyson Barnes clashed with her county hall colleagues in a row over proposed closures to libraries and community buildings.&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Northern Ireland","Thu, 19 May 2016 20:56:28 +0000","Northern Ireland – Derry Central Library cuts branded ‘mean and counter-productive’ – Derry Journal. &#34;People Before Profit has denounced the proposed cuts, stating that this follows on from the slashing of the budget for buying new books, a stop to the filling of vacancies and a halt to most maintenance work in 2014. Foyle MLA Eamonn McCann said a programme of cuts two years ago also involved the withdrawal of cover for sickness, annual leave and attendance at training courses.&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["West Berkshire","Thu, 19 May 2016 20:56:28 +0000","West Berkshire – New funding fear over Hungerford library – Newbury Today. The &#34;immediate survival of Hungerford Library has been plunged back into doubt. Transitional funding was hoped to have secured its future for the next two years. But now it is claimed that much of the cash could be eaten up by red tape instead. West Berkshire Council was proposing to close eight of the district’s nine libraries – leaving just Newbury open – due to a £17.5m cut to its funding by the Government. Then, in March, it announced it was using £475,000 of ‘transitional funding’ to give six of them, including Hungerford’s, a temporary stay of execution after the Department for Culture, Media and Sport (DCMS) told the council it had a statutory duty to provide a &#34;comprehensive and efficient library service&#34;. The DCMS further told the council it would have to complete a detailed needs assessment before approving its proposals. It was widely understood that the transitional funding would help to keep Hungerford Library open for two years while a&#8230;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Lancashire","Thu, 19 May 2016 20:56:28 +0000","Lancashire – Changes to where we provide your services – Lancashire Council. Complete list of proposed cuts to libraries and other services.","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Lancashire","Thu, 19 May 2016 20:56:28 +0000","Lancashire – Politically Correct by Howard Ballard – Gazette. Conservative blames Labour for spending money before 2010, wishes for council to spend reserves to keep libraries open now, looks at alternatives such as in York so &#34;These libraries are now thriving, offer additional services, with more staff and a secure future. This is what we want to replicate in Wyre, it is just a shame the grand political statement of Lancashire County Council is to say NO outright putting politics before people&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Lancashire","Thu, 19 May 2016 20:56:28 +0000","Lancashire – Consultation launched on county council property plans – Lancashire Council. &#34;Lancashire County Council is asking people for their views on plans to change the way frontline services are delivered and save millions of pounds by reducing the number of buildings the council owns and rents. A 12-week consultation starts today (Wednesday 18 May) on plans to bring services together to form a network of multi-functional buildings known as Neighbourhood Centres, which would provide a base for a range of different services in one place&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Northern Ireland","Thu, 19 May 2016 20:56:28 +0000","Northern Ireland – Opening hours set to be cut at city library – Lisburn Today. &#34;Lagan Valley MP Jeffrey Donaldson has reacted angrily to proposals by Libraries NI to reduce opening hours at Lisburn City Library. Lisburn City Library at Linenhall Street only opened ten years ago but could have its hours cut for the second time in a year.&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Norfolk","Thu, 19 May 2016 20:56:28 +0000","Norfolk – Millennium Library will close earlier and introduce automated system following budget cuts – EDP. &#34;People will need to sign up for a new automated security system, Open +, to access the first floor of the library between 8am to 9am in May, and between 8am to 10am in June, using their library card and a unique personal identification number. Margaret Dewsbury, chairman of Norfolk County Council’s Communities Committee, said: &#34;This new arrangement is a solution to the decision taken by the county council in February, when we set the authority’s budget, to make savings at the Norfolk and Norwich Millennium Library.&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["North Lanarkshire","Thu, 19 May 2016 20:56:28 +0000","North Lanarkshire – Axe falls on libraries and community centres in Airdrie and Coatbridge – Daily Record. &#34;Users of four Monklands community facilities which are earmarked to shut following Culture NL budget cuts have hit out over the impending closures.&#34; … &#34;One of the groups based at Bargeddie hall is the area’s Ringcraft group, who hold weekly dog-training classes as well as hosting an annual show plus special and charity events.&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Northern Ireland","Thu, 19 May 2016 20:56:28 +0000","Northern Ireland – Anger over plans to cut NI library hours – UTV. &#34;Libraries NI has proposed a reduction from 54 and 50 hours to 45 hours accordingly, in order to make savings. A consultation on the matter will be held from 17 May to 17 July. The public services union Unison has called on the government to &#34;think again&#34; about implementing the cuts. Brian Ferguson said: &#34;This is the third round of cuts to library opening hours since the inception of the Northern Ireland Library Authority.&#34;","2016/05/cameron-can-come-to-ours-and-assist-those-trying-to-get-online.html"],["Brighton and Hove","Sun, 22 May 2016 20:13:17 +0000","Brighton and Hove – The next chapter of Hove Library saga – Brighton and Hove Independent. &#34;The estimated cost of repairs to Hove Library is being scrutinised by independent surveyors, after opposition to the council’s controversial plans. A senior Labour councillor has since criticised the ‘unholy alliance’ between the Greens and Conservatives over Hove Library – and said it had cost the taxpayer £10,000.&#34; … &#34;Now, independent surveyors have been called in to re-evaluate the cost of repairing the building (Labour says this could cost £750,000 over five years), costing thousands of pounds.&#34; … &#34;If the Libraries Plan is approved, the 1908 Carnegie building is set to be sold off by the council.&#34;","2016/05/traffic-delays-due-to-library-campaigners.html"],["Coventry","Sun, 22 May 2016 20:13:17 +0000","Coventry – The libraries that offer sexual health services and cancer support – Guardian. &#34;Coventry’s Central Library runs health-related events and a mental health drop-in service, reaching people that the NHS can’t&#34; .. &#34;You expect to see books in a library. You might not expect free sperm keyrings – available in classic white or translucent with red sparkles – along with the offer of sexual health advice and 60-second HIV tests. That is why staff from the Coventry and Warwickshire partnership NHS trust’s integrated sexual health service set up a stand in Coventry’s Central Library every Thursday. &#34;Being here, we get to the people who can’t get to us,&#34; says Steven Clay, a senior sexual health nurse. People who don’t want to visit a sexual health clinic after work can visit the library on their lunch break, where staff can carry out tests and provide advice in a private meeting room. &#34;Some people say I’ve seen the sign but I don’t want to come over because I’m embarrassed. So I text back and say come straight t&#8230;","2016/05/traffic-delays-due-to-library-campaigners.html"],["Cheshire West and Cheshire","Sun, 22 May 2016 20:13:17 +0000","Cheshire West and Cheshire – Chester libraries launch Summer Reading Challenge – Chester Today. &#34;Cheshire West and Chester Council’s libraries say  that the Summer Reading Challenge theme for 2016 is the Roald Dahl-inspired &#34;Big Friendly Read&#34;. The challenge encourages children aged 4 to 11 to read six books during the long summer holiday.  There is a different theme each year and children can read any library books they like – fact books, joke books, picture books, e-books or even audio download books. There will be rewards including stickers and &#34;rainbow glasses&#34; when they visit the library after reading a couple of titles.  There’s a certificate and medal for everyone who reads at least six books.&#34;","2016/05/traffic-delays-due-to-library-campaigners.html"],["Kent","Sun, 22 May 2016 20:13:17 +0000","Kent – Sevenoaks mobile library stop-offs halved – is your area affected? – Sevenoaks Chronicle. £150k cut will see all stops with average of two or fewer visitors ended. 64% of people in consultation agreed to this.","2016/05/traffic-delays-due-to-library-campaigners.html"],["Lancashire","Sun, 22 May 2016 20:13:17 +0000","Lancashire – Council denies filming ban on protest videos at under-threat libraries– Fleetwood Today. &#34;County Coun Andrea Kay is now claiming those opposed to the closure plans are being barred from filming inside or outside County property. It’s a claim which has been denied by County Hall who say no such order has been issued to library staff. Coun Kay, who represents Cleveleys, said campaigners had complained to her about being banned from filming. She said: &#34;All we want to do is show the powers-that-be just what they are proposing will mean.&#34;","2016/05/traffic-delays-due-to-library-campaigners.html"],["Lewisham","Sun, 22 May 2016 20:13:17 +0000","Lewisham – Hundreds protest against Lewisham library cuts – BBC. &#34;Hundreds of people took to the streets of south-east London to protest against planned cuts to library services. The march from Lewisham Library to the Town Hall even stopped traffic as Transport for London warned of delays in the area. The march was also in support of striking Unison members who work at libraries in the borough. Lewisham Council said changes to the service would ensure a &#34;sustainable library provision&#34;.&#34;","2016/05/traffic-delays-due-to-library-campaigners.html"],["Lambeth","Sun, 22 May 2016 20:13:17 +0000","Lambeth – Council closed libraries to cut costs, then spent more to guard them – Guardian. &#34;Details of the security costs at the libraries, run by targeted, the money paid for private security was almost twice the usual running costs. The two sites – the Carnegie library in Herne Hill, south-east London, and the Minet library nearby – closed their doors on 31 March before planned works to turn each one into a &#34;community hub&#34;, a combination of a largely unstaffed library and a private gym. The Labour-run council said this was the only option to keep both libraries open amid massive central government cuts to local authority budgets.&#34;","2016/05/traffic-delays-due-to-library-campaigners.html"],["Lancashire","Sun, 22 May 2016 20:13:17 +0000","Lancashire – Morecambe Library self-service plans are ‘bum deal’ for town – Visitor. Self-service machines criticised. Cuts are &#34;A kick in the teeth for staff&#34;.","2016/05/traffic-delays-due-to-library-campaigners.html"],["Suffolk","Sun, 22 May 2016 20:13:17 +0000","Suffolk – Library’s combined help desk to provide ‘better customer service’ – East Anglian Daily Times. &#34;A new ‘one stop shop’ for council customer services has been officially opened in a Suffolk library.&#34; … &#34; £60,000 project is part of Suffolk Coastal’s move from headquarters in Melton Hill to Riduna Park, near Melton railway station, later this year. Woodbridge Library staff will share a new help desk with members of the district council’s customer service team. A private interview room and quieter area for accessing computers, reading or studying are also part of the refurbishment project – work on which began in February and continued while the library remained open.&#34;","2016/05/traffic-delays-due-to-library-campaigners.html"],["West Berkshire","Sun, 22 May 2016 20:13:17 +0000","West Berkshire – Council refuses to release library closure legal advice – Newbury Today. &#34;West Berkshire Council has refused to disclose what legal advice it was given regarding the proposed closure of eight libraries. Many have questioned whether the council’s original plan to close all but one of the district’s libraries was legal. Under the 1964 Public Libraries and Museums Act, local authorities have a statutory duty to provide a ‘comprehensive and efficient’ library service. Campaigners have argued that keeping one library open could not be considered comprehensive or efficient. The council has admitted that it had to take advice from the Department for Culture, Media and Sport (DCMS)  and its own legal team , given the &#34;vague nature&#34; of the Act, but said it ‘challenged’ claims that its original proposals were illegal.&#34;","2016/05/traffic-delays-due-to-library-campaigners.html"],["Barnet","Tue, 24 May 2016 21:06:35 +0000","Barnet – Babies to benefit from play activities in Barnet libraries – North London Today. &#34;‘Baby Bounce and Play’ sessions are for pre-walking babies and involve songs, rhymes, stories and a themed sensory play experience. Sessions take place at Hendon, Edgware, Osidge, North Finchley and East Barnet libraries and cost £3.50.&#34;","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Cheshire West and Chester","Tue, 24 May 2016 21:06:35 +0000","Cheshire West and Chester – Dementia care book donated to Frodsham and Helsby libraries – Chester Chronicle. &#34;As dementia becomes an increasing problem in the UK and across the world, a book providing advice about to support loved ones with the disease has been donated to libraries in Frodsham and Helsby. Confidence to Care hopes to provide just that, confidence to care, to those caring for a loved one with Alzheimer’s or other forms of dementia. The book has been published by Home Instead and provided to the libraries by their Frodsham, Runcorn and Widnes branch.&#34;","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Shropshire","Tue, 24 May 2016 21:06:35 +0000","Shropshire – Comedian Jo Brand wades into fight for Ludlow Library – Shropshire Star. &#34;The 58-year-old is a regular visitor to the library because her mother Joyce lives in the town. And she today called for Shropshire Council to ensure its future, saying asking volunteers to staff the library was running it &#34;on the cheap&#34;. She said: &#34;Every civilised town should have a library. It will be a sad day if Ludlow’s disappears.&#34; Her comments come as no agreement has yet been struck over who might take on the running of the venue if Shropshire Council withdraw all funding from April 2017 as planned.&#34;","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Enfield","Tue, 24 May 2016 21:06:35 +0000","Enfield – Library revamp set to go ahead despite council cut-backs – North London Today. &#34;In the midst of a furore over all but four libraries in the borough being turned over to volunteers and community groups, The Council are preparing a £4.2m cash injection into Edmonton Green library to transform it into a flagship library.&#34;","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Lambeth","Tue, 24 May 2016 21:06:35 +0000","Lambeth – London library closures cost local council three times more than keeping them open – Independent. &#34;Lambeth council paid private security guards £2,212 a day to secure the two sites, when previously the running costs – according to the council’s budget – was just £874.&#34; [However, this security operation is short term presumably – Ed.]","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Vale of Glamorgan","Tue, 24 May 2016 21:06:35 +0000","Vale of Glamorgan – Cabinet – Vale of Glamorgan Council. Confirmed five libraries (Dinas Powys, Sully, Wenvoe, St. Athan and Rhoose) to become volunteer. The Council will provide peripatetic librarian support for 50% of the community library opening hours. The Council will transfer bookstock (+ provide on-going replenishment), fixtures and fittings, ICT equipment and community asset transfer of the buildings (if council owned). The £97,310 Council funding required for the establishment of the community libraries would be met from the current Library Fund.          Judicial Review – &#34;The Council had incurred £72,640 to date (excluding the cost of the recent hearing referred to in paragraph 31 of the report) in respect of legal fees for defending the claim for Judicial Review. These costs had been met from the Library Fund.&#34; The impact of the two above costs on the Library Fund is likely to be significant.&#34; … &#34;The reshaping of the library service was estimated to deliver savings of £525,000 over 2015/16 and 2016/17.&#34;&#8230;","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Lancashire","Tue, 24 May 2016 21:06:35 +0000","Lancashire – Petition &#34;fuels rumours&#34; of library closure – 2BR. &#34;The ‘Save Padiham Library’ petition already has several hundred signatures in just a few days, after the facility appeared on a list of ‘at risk’ buildings which face cuts under Lancashire County Council. But local councillors are against the campaign- saying Padiham library is sure to remain open. Brendan Morris (pictured left) is behind the petition – he tells us he doesn’t understand why the library was on the list is there’s no risk to its future&#34;","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Moray","Tue, 24 May 2016 21:06:35 +0000","Moray – Swimming pools and libraries could go as Moray Council looks to slash £10million of services – Press and Journal. Six out of eleven libraries to be cut in order to reduce budget by £93k.","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Oxfordshire","Tue, 24 May 2016 21:06:35 +0000","Oxfordshire – School mobile library closed – Henley Standard. The &#34;mobile library that visits Kidmore End Primary School will stop at the end of the summer term.   It is one of five mobile libraries across Â Oxfordshire being scrapped by the county council as it tries to make £69 million of savings over the next four years.  Headteacher Linda Hull said: &#34;It’s disappointing because the children really enjoy the mobile library. &#34;They get a great deal out of choosing books themselves, chatting with the librarians and then enjoying the books with their families.&#34;","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Lewisham","Tue, 24 May 2016 21:06:35 +0000","Lewisham – Protesters march to save Lewisham libraries – East London Lines. &#34;Lewisham locals are taking a stand to save their libraries after the borough council cut £1 million from its library budget. On Saturday (May 21), hundreds of demonstrators marched from Lewisham Library to Catford in protest against the cuts to the library budget. Lewisham Council wants to remove staff from four libraries in Lewisham: Catford, Forest Hill, Manor House and Torridon Road.&#34;","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Rutland","Tue, 24 May 2016 21:06:35 +0000","Rutland – Rutland libraries welcome donation of books on the history of Lyddington Manor – Rutland and Stamford Mercury. &#34;A grant from the Heritage Lottery Fund has allowed the Lyddington Manor History Society to produce the book, with six copies donated to Rutland Libraries for members of the public to read and enjoy. &#34;","2016/05/new-library-fund-and-stephen-fry-poster.html"],["Brent","Mon, 30 May 2016 20:30:52 +0000","Brent – Kensal Rise Library Fundraising Appeal: Fit Out – My Donate. £43,000 donated in forty days. &#34;After five years of campaigning we have secured two thirds of the ground floor to operate a community library and public space. We need your support to transform this empty shell into a library that the community can be proud of and which they deserve after fighting for so long. We need to raise £80,000 to cover the basic fit out, including flooring, plumbing… &#34;","2016/05/wales-standards-and-library-drones.html"],["Hull","Mon, 30 May 2016 20:30:52 +0000","Hull – Hull wins £3m funding towards City of Culture 2017 – Business Quarter. &#34;The funding will also enable the city’s museums, archives, libraries and heritage learning service to host an ambitious programme of events for 2017 and create long-term benefits for residents.&#34;","2016/05/wales-standards-and-library-drones.html"],["Cambridgeshire","Mon, 30 May 2016 20:30:52 +0000","Cambridgeshire – New self-service access to be trialled at library in St Ives – Hunts Post. &#34;Cambridgeshire County Council will trial a new system – known as Open+ – which will enable self-service access to library resources, including borrowing or returning books, use of free Wi-Fi, PCs and pre-booked meeting rooms, outside of staffed hours. &#34;. Council says &#34;Your feedback will help us decide how modern technology can help shape the delivery of the service in future. This could be the first of our Open+ libraries and we hope that it will help create a more flexible and efficient service.&#34; &#34;","2016/05/wales-standards-and-library-drones.html"],["Gloucestershire","Mon, 30 May 2016 20:30:52 +0000","Gloucestershire – Inventive Cheltenham theatre play goes on tour of Gloucestershire libraries – Gloucester Citizen. &#34;TwoCan Theatre Company have been working in the Everyman Studio Theatre this week rehearsing their adaptation of ‘Two Can Toucan’ by David McKee, the author of Elmer the Elephant), which is going out to Gloucestershire libraries from today.&#34;","2016/05/wales-standards-and-library-drones.html"],["Lancashire","Mon, 30 May 2016 20:30:52 +0000","Lancashire – ‘This is a ridiculous stunt’ – disabled Burnley fan and protester chains himself to railings in vigil against county cuts – Lancashire Telegraph. In protest against cuts to libraries and youth services.","2016/05/wales-standards-and-library-drones.html"],["North Yorkshire","Mon, 30 May 2016 20:30:52 +0000","North Yorkshire – Craven libraries take part in Festival of Learning – Craven Herald and Pioneer. &#34;The event – previously known as Adult Learners’ Week – is bringing together organisations across the county, offering people opportunities to learn something new.&#34;","2016/05/wales-standards-and-library-drones.html"],["Cornwall","Mon, 30 May 2016 20:30:52 +0000","Cornwall – Cornwall libraries plan fun and games ahead of National Bookstart week – Cornishman. &#34;Under the Sea&#34; events and giveaways will take place across county.","2016/05/wales-standards-and-library-drones.html"],["Lancashire","Mon, 30 May 2016 20:30:52 +0000","Lancashire – Councillors hit back in fight to save Garstang Library – Garstang Courier. &#34;Three Garstang councillors have hit back after it was hinted they weren’t pulling their weight in the fight for the town’s library. Councillors Lady Dulcie Atkins, Tom Balmain and Alice Collinson say they supported the ‘Save Our Library’ campaign &#34;right from the beginning&#34; after it was claimed they had not even contacted the library.&#34;","2016/05/wales-standards-and-library-drones.html"],["Shropshire","Mon, 30 May 2016 20:30:52 +0000","Shropshire – Shropshire library hours to be slashed – Shropshire Star. &#34;Libraries across Shropshire face more reductions in opening hours as part of cost-cutting measures, with one councillor warning the service is facing &#34;dangerous territory&#34;. … &#34;A consultation on the proposals, which include blanket changes to close all 12 affected libraries at 5pm, and from 1pm on Saturdays, was launched yesterday, and will run for six weeks.&#34;","2016/05/wales-standards-and-library-drones.html"],["Darlington","Mon, 30 May 2016 20:30:52 +0000","Darlington – Campaigners reveal fully costed plan to save Darlington libraries without need for major cutbacks – Northern Echo. &#34;Darlington for Culture, which formed a community steering group to draw up the proposal, says an independent Charitable Incorporated Organisation (CIO) should be created to run both buildings in conjunction with the community. &#34; … &#34;Under the plans sent to Darlington Borough Council, the local authority would continue to run the library service with professional library staff and some volunteer support where necessary. The CIO would offer additional services within the libraries with the aim of turning them into community hubs. The extra income generated by the new uses would be put towards the upkeep of the buildings, volunteers say.&#34;","2016/05/wales-standards-and-library-drones.html"],["North Yorkshire","Mon, 30 May 2016 20:30:52 +0000","North Yorkshire – Volunteers set to staff many libraries – Darlington and Stockton Times. &#34;Controversial moves to hand over 21 libraries across North Yorkshire to volunteers are on target, councillors have been told. The scheme is designed to help save £1.5 million towards the County Council’s target of cutting budgets by £167 million by 2020. The aim is to make the majority of smaller libraries community managed, with many existing library staff facing losing their jobs by April 2017.&#34; … &#34;In the autumn the council is set to launch a countywide marketing campaign appealing for volunteers. &#34;","2016/05/wales-standards-and-library-drones.html"],["Edinburgh","Mon, 30 May 2016 20:30:52 +0000","Edinburgh – &#34;Let there be light&#34; in Edinburgh’s Old Town – 38 Degrees.  &#34;The land in question has been left undeveloped for 40 years specifically for the purposes of an extension to the library. If planning permission were now granted for the proposed hotel this would fundamentally compromise the library, significantly blocking out natural light to this important category B listed building, regarded as the finest example of a Carnegie endowed library in Scotland, whose motto above the main entrance is &#34;Let There Be Light&#34;&#34;","2016/05/wales-standards-and-library-drones.html"],["Staffordshire","Mon, 30 May 2016 20:30:52 +0000","Staffordshire – Political sparks fly as Lichfield Library petition is labelled ‘misleading’ – Lichfield Mercury. &#34;Councillor Ian Parry claimed the campaign had been so named as to &#34;gain public attention prior to an election&#34; in a piece of &#34;cynical manipulation&#34;. Calling the petition ‘Save Lichfield Library’ when the proposal is to move the facility elsewhere in the city rather than take it away was a &#34;despicable trick&#34; which &#34;misled&#34; those who signed it, he said.&#34; … &#34;In Stafford the new main library is deliberately smaller than its predecessor. As well as the books it’s also got wifi, touchscreen tables, large computer tablets and two state-of-the-art 3D printers. Membership there has risen by 80 per cent in six months and we see that as a template for the service’s future …&#34;","2016/05/wales-standards-and-library-drones.html"],["Halton","Mon, 30 May 2016 20:30:52 +0000","Halton – CodeBug microcomputer to call into Halton libraries – Liverpool Echo. &#34;The CodeBug is a programmable, wearable computer that has 25 LED lights and two buttons to interact with. It has six legs which can be used to connect croc-clips or even sewn on to clothing. The technology will be at Halton Lea Library at Tuesday, May 31 from 10.30am to 12pm, and during the same times at Widnes Library on Thursday, June 2. Librarian Lorna Hulme said: &#34;Try the CodeBug and get a taste of how a microcomputer works.&#34;","2016/05/wales-standards-and-library-drones.html"],["Lancashire","Mon, 30 May 2016 20:30:52 +0000","Lancashire – MP takes his library battle to Commons – Blackpool Gazette. Conservative MP criticises Labour Council. &#34;During his nine-minute speech, Mr Maynard described the plan to close the libraries to chamber of the House of Commons and slammed Lancashire’s refusal to ‘sit down and listen’ to the not-for-profit proposal.&#34;","2016/05/wales-standards-and-library-drones.html"],["North Lanarkshire","Mon, 30 May 2016 20:30:52 +0000","North Lanarkshire – Working For You: Neil Gray MP – Daily Record. &#34;The Airdrie and Shotts MP believes it makes no sense to close local libraries and community centres.&#34; [SNP MP – Ed.] … &#34;With North Lanarkshire being an area of high deprivation, ill-health and unemployment it makes very little sense for the council, and its arms-length organisation CultureNL, to be closing four libraries and seven community centres, two of each in Airdrie and Shotts.&#34;","2016/05/wales-standards-and-library-drones.html"],["Lambeth","Mon, 30 May 2016 20:30:52 +0000","Lambeth – Council leader Peck hits back at library claims – Brixton Buzz. &#34;Lambeth council leader Lib Peck has hit back at library campaigners who accused the council of wasting thousands of pounds on security for the closed Carnegie (Herne Hill) and Minet (Myatt’s Fields) libraries&#34; … &#34;Peck accused protesters who brought a full council meeting to a halt last week of having no intention of allowing the meeting to go ahead and interrupting &#34;quite shamefully&#34; tributes to Cllr Niranjan Francis, a council member who died in April.&#34; … &#34;Peck laid out again the reasoning behind the council’s library plans and accused the campaigners of making claims that are &#34;simply not correct&#34;. In particular, Peck said, the campaigners had made errors in their calculations – claiming in the letter to councillors that 369,000 minus 89,000 was 189,000, when it is actually 280,000.&#34;","2016/05/wales-standards-and-library-drones.html"],["Lancashire","Mon, 30 May 2016 20:30:52 +0000","Lancashire – Longridge jobs by no means safe – Longridge News. &#34;Audrey retires today from a job she has loved in a library where membership and community activities have increased over the years – but her chief concern now is for her staff. The LCC consultation on the future of all its service buildings started on May 18, and Audrey said: &#34;The reprieve was positive news for the community but it was only a proposal so I wouldn’t say we are ‘safe’.&#34;&#34;","2016/05/wales-standards-and-library-drones.html"],["Lancashire","Mon, 30 May 2016 20:30:52 +0000","Lancashire – Pen-power pupils in battle to save library in Rishton – Lancashire Telegraph. Handwritten letters of protest from junior school.","2016/05/wales-standards-and-library-drones.html"],["Leeds","Mon, 30 May 2016 20:30:52 +0000","Leeds – Read: A postcard from Alan Bennett to Armley Library – West Leeds Dispatch. &#34;The 82-year-old playwright, actor and author sent library staff a ‘thank you’ postcard – of the Ribblehead viaduct – after he popped in for a cup of tea and to carry out some research on a future project.&#34;","2016/05/wales-standards-and-library-drones.html"],["Sheffield","Mon, 30 May 2016 20:30:52 +0000","Sheffield – City should spend money on libraries – Yorkshire Post.","2016/05/wales-standards-and-library-drones.html"],["South Gloucestershire","Mon, 30 May 2016 20:30:52 +0000","South Gloucestershire – Campaigners hand in petitions and letters as South Gloucestershire Council looks to save £650,000 from library budget – Gazette Series. &#34;A consultation into shutting and reducing opening hours at libraries across South Gloucestershire has closed, culminating in a protest and a flurry of petitions. More than 3,000 responses were filled in during the three-month consultation, which has earmarked Chipping Sodbury Library for closure in all three options and proposes closing Hanham Library and axing the district’s home library service as South Gloucestershire Council looks to save £650,000 from its annual budget.&#34;","2016/05/wales-standards-and-library-drones.html"],["Sheffield","Mon, 30 May 2016 20:30:52 +0000","Sheffield – Libraries were Lifelines – Star /Letters. &#34;Despite what our politicians are claiming, library usage at the staffed libraries in Sheffield is not declining to the extent that it is at the volunteer libraries. Up until 2014 community libraries were providing one of the most efficient, cost-effective social services the council provided.&#34;","2016/05/wales-standards-and-library-drones.html"],["Sheffield","Mon, 30 May 2016 20:30:52 +0000","Sheffield – Volunteers step in when cuts hit our libraries – Yorkshire Post / Letters. Council says &#34;I would like thank the volunteers and community groups who have willingly stepped up to help run 15 libraries in Sheffield (shortly to be 16 with Tinsley). &#34;","2016/05/wales-standards-and-library-drones.html"],["Worcestershire","Mon, 30 May 2016 20:30:52 +0000","Worcestershire – Late-evening opening hours at some Worcestershire libraries could survive the chop, admits council – Worcester News. Council &#34;have pledged to &#34;listen very carefully&#34; to concerns after proposals to reduce hours at 17 different libraries came under sustained attack by two Labour politicians today. &#34;","2016/05/wales-standards-and-library-drones.html"]]